[
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "47SI",
        "title": "Why Go To Space?",
        "description": "Why do we spend billions of dollars exploring space? What can modern policymakers, entrepreneurs, and industrialists do to help us achieve our goals beyond planet Earth? Whether it is the object of exploration, science, civilization, or conquest, few domains have captured the imagination of a species like space. This course is an introduction to space policy issues, with an emphasis on the modern United States. We will present a historical overview of space programs from all around the world, and then spend the last five weeks discussing present policy issues, through lectures and guest speakers from NASA, the Department of Defense, new and legacy space industry companies, and more. Students will present on one issue that piques their interest, selecting from various domains including commercial concerns, military questions, and geopolitical considerations.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "217539",
        "number": "AA 47SI",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "93",
        "title": "Building Trust in Autonomy",
        "description": "Preparatory course for Bing Overseas Studies summer course in Edinburgh. Prerequisite: Requires instructor consent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "217689",
        "number": "AA 93",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "100",
        "title": "Introduction to Aeronautics and Astronautics",
        "description": "This class introduces the basics of aeronautics and astronautics through applied physics, hands-on activities, and real world examples. The principles of fluid flow, flight, and propulsion for aircraft will be illustrated, including the creation of lift and drag, aerodynamic performance including takeoff, climb, range, and landing. The principles of orbits, maneuvers, space environment, and propulsion for spacecraft will be illustrated. Students will be exposed to the history and challenges of aeronautics and astronautics.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "33038",
                "currentClassSize": "0",
                "maxClassSize": "70",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Arya, M.",
                                "sunet": "manan0"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-EngrAppSci",
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "103093",
        "number": "AA 100",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "102",
        "title": "Introduction to Applied Aerodynamics",
        "description": "This course explores the fundamentals of the behavior of aerodynamic surfaces (airfoils, wings, bodies) immersed in a fluid across all speed regimes (from subsonic to supersonic/hypersonic).  We will cover airfoil theory (subsonic and supersonic), wing theory, and introduction to viscous flows and both laminar and turbulent boundary layers, and the topic of flow transition.  At the completion of this course, students will be able to understand and predict the forces and movements generated by aerodynamic configurations of interest.  Assignments require a basic introductory knowledge of MATLAB or another suitable programming language.  Prerequisites:  CME 100 and CME 102 (or equivalent), PHYS 41, AA 100, and ME 70.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "220404",
        "number": "AA 102",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "103",
        "title": "Air and Space Propulsion",
        "description": "This course is designed to introduce the student to fundamental concepts of air-breathing and rocket propulsion including advanced concepts for space propulsion. Topics: the physical mechanisms of thrust creation and the parameters used to characterize propulsion system performance; comparison of airbreathing engine cycles; introduction to chemical rockets; multistage launch systems; plasmas and electric propulsion; solar sails and laser assisted propulsion. Prerequisites: AA 100, ME 30, and ME 70 (or equivalent).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "220320",
        "number": "AA 103",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "107N",
        "title": "How to Shoot for the Moon (DESIGN 187N)",
        "description": "The new space industry has the potential to impact and sustain life on Earth and beyond. For example, emerging space technology can shape the way we design habitats, food, and spacecraft for low-Earth orbit or the Lunar surface, as well as the products we use here on Earth. However, this requires us to take a deeper look at the potential influence on humanity and pushes us to declare our life mission as a lens for what we engineer. The aim of this IntroSem is to help undergraduate students &quot;shoot for the moon&quot; and &quot;declare their mission&quot; via an integration of curriculum from aerospace engineering and human-centered design. In this 10-week course, students will engage with some of life's hardest questions: Who are you?; Why are you here (i.e., on Earth and at Stanford)?; What do you want?; and How will you get there (i.e., Mars or your dream job after Stanford)? In addition, students will pitch new space-related, human-centered technology to potential stakeholders. To give students exposure to actual careers in aerospace design and engineering, mentors from industry will be invited to engage with students throughout the course and provide feedback on design projects.  Are you go for launch?",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "32436",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Senesky, D.",
                                "sunet": "dsenesky"
                            },
                            {
                                "name": "Harte, S.",
                                "sunet": "sharte"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225019",
        "number": "AA 107N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "108N",
        "title": "Surviving Space",
        "description": "Space is dangerous. Anything we put into orbit has to survive the intense forces experienced during launch, extreme temperature changes, impacts by cosmic rays and energetic protons and electrons, as well as hits by human-made orbital debris and meteoroids. If we venture beyond Earth's sphere of influence, we must also then endure the extreme plasma environment without the protection of our magnetic field. With all of these potential hazards, it is remarkable that our space program has experienced so few catastrophic failures. In this seminar, students will learn how engineers design and test spacecraft to ensure survivability in this harsh space environment. We will explore three different space environment scenarios, including a small satellite that must survive in Low Earth Orbit (LEO), a large spacecraft headed to rendezvous with an asteroid, and a human spaceflight mission to Mars.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-AQR"
        ],
        "objectID": "219612",
        "number": "AA 108N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "109Q",
        "title": "Aerodynamics of Race Cars",
        "description": "Almost as soon as cars had been invented, races of various kinds were organized. In all its forms (open-wheel, touring car, sports car, production-car, one-make, stock car, etc.), car racing is today a very popular sport with a huge media coverage and significant commercial sponsorships. More importantly, it is a proving ground for new technologies and a battlefield for the giants of the automotive industry. While race car performance depends on elements such as engine power, chassis design, tire adhesion and of course, the driver, aerodynamics probably plays the most vital role in determining the performance and efficiency of a race car. Front and/or rear wings are visible on many of them. During this seminar, you will learn about many other critical components of a race car including diffusers and add-ons such as vortex generators and spoilers. You will also discover that due to the competitive nature of this sport and its associated short design cycles, engineering decisions about a race car must rely on combined information from track, wind tunnel, and numerical computations. It is clear that airplanes fly on wings. However, when you have completed this seminar, you will be able to understand that cars fly on their tires. You will also be able to appreciate that aerodynamics is important not only for drag reduction, but also for increasing cornering speeds and lateral stability. You will be able to correlate between a race car shape and the aerodynamics effects intended for influencing performance. And if you have been a fan of the Ferrari 458 Italia, you will be able to figure out what that black moustache in the front of the car was for.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-AQR"
        ],
        "objectID": "219623",
        "number": "AA 109Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "113",
        "title": "Aerospace Computational Science",
        "description": "Computational methods are pervasive in analysis, design and optimization of aerospace systems. This course introduces the fundamental concepts underlying aerospace computational science. Starting from the concepts of meshes, elements and point clouds, interpolation, quadrature and time integration, the techniques of finite difference, finite volume and finite element discretization of general PDE problems, and analysis of the accuracy, consistency and stability of discretized problems including treatment of boundary conditions are developed.  In depth applications to computations of ideal subsonic, transonic and supersonic flows, and viscous internal and external flow with a turbulence model are introduced. Through the use of commercial and research software (ANSYS Fluent, SU2 and AERO Suite) the student is exposed to the use of computational tools for solving practical aerospace engineering problems. The course culminates with the treatment of multidisciplinary aerospace problems involving coupling across more than one discipline, such as aero-thermal analysis (for hypersonic vehicle performance analysis or gas turbine blade cooling), fluid-structure interaction problems (such as flutter or flapping wing aeroelastic performance), and aeroacoustics (such as jet noise for next generation commercial supersonic transport or noise radiation from multi-rotor urban air mobility platform). Students are expected to pursue significant computational projects in two-person teams.  nPrerequisites: CME102, CME104 (multivariable calculus, linear algebra, ODEs and some PDEs), ENGR 14, ME 30, ME70, and Recommended courses: AA102, AA103.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222638",
        "number": "AA 113",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "114Q",
        "title": "Large Spacecraft Structures",
        "description": "In space, large structures are often advantageous - large solar arrays are required for collecting solar power and allowing spacecraft to operate in deep space, large diameter telescopes allow us to explore the origins of our universe, and large antennas allow us to track climate change and get large amounts of data back down to Earth. However, our ability to get large structures into space is limited by the size of modern rocket fairings, causing large space structures to be designed very differently from those on Earth. This seminar focuses on the design principles used by aerospace engineers to realize large space structures. Over the quarter, we will discuss techniques for deployable space structures folded on the ground and unfolded in orbit including origami, foldable thin structures, and inflatables. The seminar will also introduce students to current developments in space structures such as on-orbit assembly, in-space manufacturing, and reconfigurable space structures. We will examine the materials used in these structures, overview mathematical principles used for their design, and learn from past failures of deployable structures. The seminar will allow students to delve deeper into the concepts with hands-on experimentation, analysis of existing space structures (ex. James Webb, the ISS solar arrays, and CubeSat missions), and will allow students to practice written and oral communication skills.By the end of the course students will be able to:Explain the need for large space structures.Identify and compare the engineering approaches for the realization of large space structures.Analyze the challenges associated with large space structures.Design space structures using simple numerical models.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "6912",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "200-219",
                        "instructors": [
                            {
                                "name": "Sakovsky, M.",
                                "sunet": "sakovsky"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR"
        ],
        "objectID": "223995",
        "number": "AA 114Q",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "115Q",
        "title": "The Global Positioning System: Where on Earth are We, and What Time is It?",
        "description": "Preference to freshmen. Why people want to know where they are: answers include cross-Pacific trips of Polynesians, missile guidance, and distraught callers. How people determine where they are: navigation technology from dead-reckoning, sextants, and satellite navigation (GPS). Hands-on experience. How GPS works; when it does not work; possibilities for improving performance.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "6219",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lo, S.",
                                "sunet": "daedalus"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-EngrAppSci",
            "WAY-AQR"
        ],
        "objectID": "204295",
        "number": "AA 115Q",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "116Q",
        "title": "Electric Automobiles and Aircraft",
        "description": "Transportation accounts for nearly one-third of American energy use and greenhouse gas emissions and three-quarters of American oil consumption. It has crucial impacts on climate change, air pollution, resource depletion, and national security. Students wishing to address these issues reconsider how we move, finding sustainable transportation solutions. An introduction to the issue, covering the past and present  of transportation and its impacts; examining alternative fuel proposals; and digging deeper into the most promising option:  battery electric vehicles.  Energy requirements of air, ground, and maritime transportation; design of electric motors, power control systems, drive trains, and batteries; and technologies for generating renewable energy. Two opportunities for hands-on experiences with electric cars. Prerequisites: Introduction to calculus and Physics AP or elementary mechanics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "GER:DB-EngrAppSci",
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "211087",
        "number": "AA 116Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "118N",
        "title": "How to Design a Space Mission: from Concept to Execution",
        "description": "Space exploration is truly fascinating. From the space race led by governments as an outgrowth of the Cold War to the new era of space commercialization led by private companies and startups, more than 50 years have passed, characterized by great leaps forward and discoveries. We will learn how space missions are designed, from concept to execution, based on the professional experience of the lecturer and numerous examples of spacecraft, including unique hardware demonstrations by startups of the Silicon Valley. We will study the essentials of systems engineering as applicable to a variety of mission types, for communication, navigation, science, commercial, and military applications. We will explore the various elements of a space mission, including the spacecraft, ground, and launch segments with their functionalities. Special emphasis will be given to the design cycle, to understand how spacecraft are born, from the stakeholders' needs, through analysis, synthesis, all the way to their integration and validation. We will compare the current designs with those employed in the early days of the space age, and show the importance of economics in the development of spacecraft. Finally, we will brainstorm startup ideas and apply the concepts learned to a notional space mission design as a team.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "218156",
        "number": "AA 118N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "119N",
        "title": "3D Printed Aerospace Structures",
        "description": "The demand for rapid prototyping of lightweight, complex, and low-cost structures has led the aerospace industry to leverage three-dimensional (3D) printing as a manufacturing technology.  For example, the manufacture of aircraft engine components, unmanned aerial vehicle (UAV) wings, CubeSat parts, and satellite sub-systems have recently been realized with 3D printing and other additive manufacturing techniques.  In this freshman seminar, a survey of state-of-the-art 3D printing processes will be reviewed and the process-dependent properties of 3D-printed materials and structures will be analyzed in detail. In addition, the advantages and disadvantages of this manufacturing approach will be debated during class! To give students exposure to 3D printing systems in action, tours of actual 3D printing facilities on campus (Stanford's Product Realization Laboratory), as well as in Silicon Valley (e.g., Made in Space) will be conducted.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-AQR"
        ],
        "objectID": "218157",
        "number": "AA 119N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "120Q",
        "title": "Building Trust in Autonomy",
        "description": "Major advances in both hardware and software have accelerated the development of autonomous systems that have the potential to bring significant benefits to society. Google, Tesla, and a host of other companies are building autonomous vehicles that can improve safety and provide flexible mobility options for those who cannot drive themselves. On the aviation side, the past few years have seen the proliferation of unmanned aircraft that have the potential to deliver medicine and monitor agricultural crops autonomously. In the financial domain, a significant portion of stock trades are performed using automated trading algorithms at a frequency not possible by human traders. How do we build these systems that drive our cars, fly our planes, and invest our money? How do we develop trust in these systems? What is the societal impact on increased levels of autonomy?",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "218158",
        "number": "AA 120Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "121Q",
        "title": "It IS Rocket Science!",
        "description": "It's an exciting time for space exploration. Companies like SpaceX and Blue Origin are launching rockets into space and bringing them back for reuse. NASA is developing the world's most powerful rocket. Startups are deploying constellations of hundreds of cubesats for communications, navigation, and earth monitoring. The human race has recently gotten a close look at Pluto, soft landed on a comet, and orbited two asteroids. The upcoming launch of the James Webb Space Telescope will allow astronomers to look closer to the beginning of time than ever before. The workings of space systems remain mysterious to most people, but in this seminar we'll pull back the curtain for a look at the basics of &quot;rocket science.&quot; How does a SpaceX rocket get into space? How do Skybox satellites capture images for Google Earth? How did the New Horizons probe find its way to Pluto? How do we communicate with spacecraft that are so distant? We'll explore these topics and a range of others during the quarter. We'll cover just enough physics and math to determine where to look in the sky for a spacecraft, planet, or star. Then we'll check our math by going outside for an evening pizza party observing these objects in the night sky. We'll also visit a spacecraft production facility or Mission Operations Center to see theory put into practice.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "218148",
        "number": "AA 121Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "122N",
        "title": "Dawn of the Drones: How Will Unmanned Aerial Systems Change Our World?",
        "description": "Unmanned aerial systems (UASs) have exploded on the scene in recent years, igniting a national debate about how to use them, how to regulate them, and how to make them safe. This seminar will dive into the many engineering challenges behind the headlines: in the future, how will we engineer UASs ranging in size from simple RC toys to highly-sophisticated autonomous scientific and military data gathering systems? This seminar will examine the key elements required to conceive, implement, deploy, and operate state-of-the-art of drone systems: What variety of problems can they help us solve? How autonomous are they and how autonomous do they need to be? What are the key technical bottlenecks preventing widespread deployment? How are they different from commercial aircraft? What kinds of companies will serve the market for UAV-related products and services? What business models will be successful and why? We will emphasize aspects of design, autonomy, reliability, navigation, sensing, and perception, as well as coordination/collaboration through a series of case studies drawn from our recent experience. Examples include imaging efforts to map the changing coral reefs in the South Pacific, using and controlling swarms of unmanned systems to perform search and rescue missions over large areas, and package delivery systems over large metropolitan areas. Hands-on experience with Stanford-developed UASs will be part of the seminar.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "218159",
        "number": "AA 122N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "131",
        "title": "Space Flight",
        "description": "This class is all about how to build a spacecraft. It is designed to introduce undergraduate engineering students to the engineering fundamentals of conceiving, designing, implementing, and operating satellites and other space systems. Topics include orbital dynamics, attitude dynamics, mission design, and subsystem technologies. The space environment and the seven classic spacecraft subsystems - propulsion, attitude control and navigation, structure, thermal, power, telemetry and command, and payload - will be explored in detail. Prerequisites: Freshman-level physics, basic calculus and differential equations, AA 100 (Introduction to Aeronautics and Astronautics).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6399",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Hewlett Teaching Center 103",
                        "instructors": [
                            {
                                "name": "D'Amico, S.",
                                "sunet": "damicos"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR"
        ],
        "objectID": "220480",
        "number": "AA 131",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "135",
        "title": "Introduction to Space Policy (PUBLPOL 131)",
        "description": "The last decade has seen dramatic developments and a rekindling of interest in space efforts.  Silicon Valley has invested in a range of activities, including reusable launch services, constellations of communication and observation satellites, off-planet resource development, and even space tourism.  Governments are restructuring their space-oriented military and regulatory agencies.  Scientific missions continue to benefit from advances in technology, extending the reach and capabilities of robotic missions.  Human missions will finally revisit deep space after decades spent solely in low earth orbit. nnThis course investigates the economic, policy, and engineering challenges to building a thriving private and public space industry.  We begin with a review of historical space efforts, both public and private.  We will investigate current efforts in detail, including budgeting, regulatory frameworks, and the key drivers of the renewed space activity.  Externalities provide a core rationale for governmental policy action, including such topics as conflicts over spectrum used by space assets, stimulating innovation, orbital debris challenges, dual-use space technologies, and unclear or conflicting rights to develop space-based resources.  Leaders from government and new space companies will occasionally participate in the class.nnStudents will be expected to participate in policy and case discussions, contribute several papers including a final project paper, and complete problem and policy analyses.  Readings will include articles, policy papers, HBS cases, regulatory filings, and mission reviews.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221064",
        "number": "AA 135",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "136A",
        "title": "Spacecraft Design",
        "description": "Space Capstone I.  This course is focused on the design and implementation of uncrewed spacecraft with an emphasis on nano-satellites.  Practical laboratory exercises will introduce students to the fundamentals of flight software, electronics, and mechanical design while building on a flight-proven spacecraft architecture.  Students will work in teams to develop and present their design of a spacecraft subsystem.  Required for Aero/Astro majors. For all other majors consent of instructor is required. Prerequisite: AA 131",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224815",
        "number": "AA 136A",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "136B",
        "title": "Spacecraft Design Laboratory",
        "description": "Space Capstone II.  Continuation of AA136A.  Students will work in teams to implement, test, and demonstrate their design of a spacecraft subsystem.  Emphasis on manufacturing, system testing, and operations to complete a full design cycle.  Prerequisite: AA136A or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "32688",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lee, N.",
                                "sunet": "nnlee"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224800",
        "number": "AA 136B",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "146A",
        "title": "Aircraft Design",
        "description": "Air Capstone I. Required for Aero/Astro majors. This capstone design class allows students to apply knowledge from prior classes in a way that emphasizes the interactions between disciplines, and demonstrates how theoretical topics are synthesized in the practical design of an aircraft concept. Prerequisites are Math 20, 21 or 41, 42 or equivalents. Elementary physics, and AA100 or equivalent classes. Additional required AA courses dealing with aero, structures, and controls",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "30137",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221549",
        "number": "AA 146A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "146B",
        "title": "Aircraft Design Laboratory",
        "description": "Air Capstone II. Required for Aero/Astro majors. This capstone design class brings together the material from prior classes in a way that emphasizes the interactions between disciplines and demonstrates how some of the more theoretical topics are synthesized in practical design of an aircraft concept. The class will address a single problem developed by the faculty and staff. Students will spend two quarters designing a system that addresses the objectives and requirements posed at the beginning of the course sequence. They will work individually and in teams, focusing on some aspect of the problem but exposed to many different disciplines and challenges. The second quarter will focus on the demonstration of a physical system incorporating features of the design solution. This may be accomplished with a set of experiments or a flight demonstration involving data gathering and synthesis of work in a final report authored by the team.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "29905",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221550",
        "number": "AA 146B",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "149",
        "title": "Operation of Aerospace Systems",
        "description": "This course (intended primarily for AeroAstro undergraduate students) provides a connection with the products of aerospace design through the use of tours, guest speakers, flight simulation, and hands-on exposure to systems used by pilots and space mission operators. The class will meet in-person on the first day and for multiple tours at local facilities. For some of the days with guest speakers, we will meet via Zoom. We discuss real-world experiences with operators of spacecraft and launch vehicles, and we hear from pilots of manned and unmanned aircraft.  Skills required to operate systems in the past, present, and future are addressed.  Students will also develop an appreciation of the effects of human factors on aviation safety and the importance of space situational awareness.  Anticipated tours include an air traffic control facility and a spacecraft operations center. Some class sessions will be off campus tours at local facilities; these will require some scheduling flexibility outside of normal class hours.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6361",
                "currentClassSize": "0",
                "maxClassSize": "14",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Barrows, A.",
                                "sunet": "abarrows"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220421",
        "number": "AA 149",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "151",
        "title": "Lightweight Structures",
        "description": "The development of lightweight structures aids in enhancing the robustness, efficiency, and cost of aerospace systems. In this course, the theoretical principles used to analyze stress-strain behavior, beam bending, torsion, and thin-walled structures will be reviewed and exercised. In addition, students will study structures under various loading conditions found in real-world applications such as the design of airframes, high-altitude balloons, and solar sails. Students from various disciplines of engineering can benefit from this course. ENGR 14 (Introduction to Solid Mechanics) is a highly recommended prerequisite.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31985",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "200-107",
                        "instructors": [
                            {
                                "name": "Senesky, D.",
                                "sunet": "dsenesky"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR"
        ],
        "objectID": "220486",
        "number": "AA 151",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "156",
        "title": "Introduction to Mechanics of Composite Materials",
        "description": "This course covers topics related to fiber reinforced composites focusing on the prediction of elastic properties and failure. Students will learn about the microstructure of fiber composites, how it influences material properties, and how the design of composite materials differs from isotropic materials like metals. Students will practice these topics through several hands-on design tasks. Pre-requisite: AA151",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32689",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sakovsky, M.",
                                "sunet": "sakovsky"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220445",
        "number": "AA 156",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "160",
        "title": "Flying: Private Pilot Ground School",
        "description": "This course is designed to prepare the student pilot to meet the Federal Aviation Administration (FAA) requirements (14 FAR 61.105) to take and pass (70% or greater score) the FAA Private Pilot Knowledge (written) exam. Topics include aerodynamics, airplane systems, performance and limitations, federal aviation regulations, navigation, aviation weather theory, flight planning, and risk management. Upon successful competition of this course, the instructor will endorse the appropriate section of your logbook to sit for the FAA Private Pilot Knowledge exam. Additionally, this course seeks to introduce the joys and opportunities that aviation can provide whether personal/pleasure flying, commercial flying or beyond.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "33043",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Watson, J.",
                                "sunet": "watsonj"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224579",
        "number": "AA 160",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "172",
        "title": "Guidance & Navigation",
        "description": "Position, Navigation and Timing (PNT) is an increasingly critical element of aerospace and autonomous systems from autonomous cars to commercial jets to deep space probes. Analyze how modern navigation systems work including dead reckoning (speed, direction), radio navigation systems (ground based and satellite) and inertial navigation. Examine the safety and secure use of these systems for guiding commercial aviation and autonomous navigation applications. Explore emerging technologies that may affect the capability and design of future aerospace systems including pulsar navigation for deep space missions and cellular and other signals to aid urban navigation of UAVs, self-driving cars and rail. Prerequisites: E15 and familiarity with Matlab and Linear Algebra.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223453",
        "number": "AA 172",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "173",
        "title": "Flight Mechanics & Controls",
        "description": "Aircraft flight dynamics, stability, and their control system design; frame transformations, non-linear equations of motion for aircraft; linearization of longitudinal and lateral-directional dynamics; aircraft static longitudinal and lateral/directional stability and control; observability and controllability; PID feedback control; Prerequisites: E15, E105, AA100 and familiarity with MATLAB.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29904",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gao, G.",
                                "sunet": "gracegao"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221546",
        "number": "AA 173",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "174A",
        "title": "Principles of Robot Autonomy I (CS 137A, EE 160A)",
        "description": "Basic principles for endowing mobile autonomous robots with perception, planning, and decision-making capabilities. Algorithmic approaches for robot perception, localization, and simultaneous localization and mapping; control of non-linear systems, learning-based control, and robot motion planning; introduction to methodologies for reasoning under uncertainty, e.g., (partially observable) Markov decision processes. Extensive use of the Robot Operating System (ROS) for demonstrations and hands-on activities. Prerequisites: CS 106A or equivalent, CME 100 or equivalent (for linear algebra), and CME 106 or equivalent (for probability theory).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31228",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Shriram 104",
                        "instructors": [
                            {
                                "name": "Pavone, M.",
                                "sunet": "pavone"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225566",
        "number": "AA 174A",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "174B",
        "title": "Principles of Robot Autonomy II (AA 274B, CS 237B, EE 260B)",
        "description": "This course teaches advanced principles for endowing mobile autonomous robots with capabilities to autonomously learn new skills and to physically interact with the environment and with humans. It also provides an overview of different robot system architectures. Concepts that will be covered in the course are: Reinforcement Learning and its relationship to optimal control, contact and dynamics models for prehensile and non-prehensile robot manipulation, imitation learning and human intent inference, as well as different system architectures and their verification. Students will earn the theoretical foundations for these concepts and implement them on mobile manipulation platforms. In homeworks, the Robot Operating System (ROS) will be used extensively for demonstrations and hands-on activities. Prerequisites: CS106A or equivalent, CME 100 or equivalent (for linear algebra), CME 106 or equivalent (for probability theory), and AA 171/274.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6234",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sadigh, D.",
                                "sunet": "dorsa"
                            },
                            {
                                "name": "Pavone, M.",
                                "sunet": "pavone"
                            },
                            {
                                "name": "Bohg, J.",
                                "sunet": "bohg"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221536",
        "number": "AA 174B",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "190",
        "title": "Directed Research and Writing in Aero/Astro",
        "description": "For undergraduates. Experimental or theoretical work under faculty direction, and emphasizing development of research and communication skills. Written report(s) and letter grade required; if this is not appropriate, enroll in 199. Consult faculty in area of interest for appropriate topics, involving one of the graduate research groups or other special projects. May be repeated for credit. Prerequisite: consent of instructor.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28257",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27898",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "2258",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "2358",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "2296",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "2259",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "2359",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "2297",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "27",
                "component": "INS",
                "notes": null,
                "classId": "2260",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "27",
                "component": "INS",
                "notes": null,
                "classId": "2360",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "27",
                "component": "INS",
                "notes": null,
                "classId": "2298",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "30",
                "component": "INS",
                "notes": null,
                "classId": "2261",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "30",
                "component": "INS",
                "notes": null,
                "classId": "2361",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "30",
                "component": "INS",
                "notes": null,
                "classId": "2299",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "39",
                "component": "INS",
                "notes": null,
                "classId": "2262",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "39",
                "component": "INS",
                "notes": null,
                "classId": "2362",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "39",
                "component": "INS",
                "notes": null,
                "classId": "2300",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "51",
                "component": "INS",
                "notes": null,
                "classId": "4413",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "52",
                "component": "INS",
                "notes": null,
                "classId": "4683",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "53",
                "component": "INS",
                "notes": null,
                "classId": "4590",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103109",
        "number": "AA 190",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 54
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "191",
        "title": "Practical Training",
        "description": "For undergraduate students. Educational opportunities in high technology research and development labs in industry. Students engage in internship work and integrate that work into their academic program. Following internship work, students complete a research report outlining work activity, problems investigated, key results, and follow-up projects they expect to perform. Meets the requirements for curricular practical training for students on F-1 visas. Student is responsible for arranging own internship/employment and faculty sponsorship. Register under faculty sponsor's section number. All paperwork must be completed by student and faculty sponsor, as the Student Services Office does not sponsor CPT. Students are allowed only two quarters of CPT per degree program. Course may be repeated twice.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28414",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30487",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30310",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224052",
        "number": "AA 191",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "199",
        "title": "Independent Study in Aero/Astro",
        "description": "Directed reading, lab, or theoretical work for undergraduate students. Consult faculty in area of interest for appropriate topics involving one of the graduate research groups or other special projects. May be repeated for credit. Prerequisite: consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28258",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27899",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "2263",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "3997",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "2301",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "2264",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "3998",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "2302",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "16",
                "component": "INS",
                "notes": null,
                "classId": "3999",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hara, K.",
                                "sunet": "kenhara"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "27",
                "component": "INS",
                "notes": null,
                "classId": "2265",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "27",
                "component": "INS",
                "notes": null,
                "classId": "4000",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "27",
                "component": "INS",
                "notes": null,
                "classId": "2303",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "30",
                "component": "INS",
                "notes": null,
                "classId": "2266",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "30",
                "component": "INS",
                "notes": null,
                "classId": "4001",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "30",
                "component": "INS",
                "notes": null,
                "classId": "2304",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "39",
                "component": "INS",
                "notes": null,
                "classId": "2267",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "39",
                "component": "INS",
                "notes": null,
                "classId": "4002",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "39",
                "component": "INS",
                "notes": null,
                "classId": "2305",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "51",
                "component": "INS",
                "notes": null,
                "classId": "4414",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "51",
                "component": "INS",
                "notes": null,
                "classId": "4684",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103112",
        "number": "AA 199",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 53
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "200",
        "title": "Applied Aerodynamics",
        "description": "Analytical and numerical techniques for the aerodynamic analysis of aircraft, focusing on airfoil theory, finite wing theory, far-field and Trefftz-plane analysis, two-dimensional laminar and turbulent boundary layers in airfoil analysis, laminar-to-turbulent transition, compressibility effects, and similarity rules.  Biweekly assignments require MATLAB or a suitable programming language.  Prerequisite: undergraduate courses in basic fluid mechanics and applied aerodynamics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30728",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Thornton 102",
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210419",
        "number": "AA 200",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "201A",
        "title": "Fundamentals of Acoustics",
        "description": "Acoustic equations for a stationary homogeneous fluid; wave equation; plane, spherical, and cylindrical waves; harmonic (monochromatic) waves; simple sound radiators; reflection and transmission of sound at interfaces between different media; multipole analysis of sound radiation; Kirchoff integral representation; scattering and diffraction of sound; propagation through ducts (dispersion, attenuation, group velocity); sound in enclosed regions (reverberation, absorption, and dispersion); radiation from moving sources; propagation in the atmosphere and underwater. Prerequisite: first-year graduate standing in engineering, mathematics, sciences; or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "27900",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103118",
        "number": "AA 201A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "201B",
        "title": "Topics in Aeroacoustics",
        "description": "Acoustic equations for moving medium, simple sources, Kirchhoff formula, and multipole representation; radiation from moving sources; acoustic analogy approach to sound generation in compact flows; theories of Lighthill, Powell, and Mohring; acoustic radiation from moving surfaces; theories of Curl, Ffowcs Williams, and Hawkings; application of acoustic theories to the noise from propulsive jets, and airframe and rotor noise; computational methods for acoustics. Prerequisite: 201A or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "103119",
        "number": "AA 201B",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "203",
        "title": "Optimal and Learning-based Control",
        "description": "Optimal control solution techniques for systems with known and unknown dynamics.  Dynamic programming, Hamilton-Jacobi reachability, and direct and indirect methods for trajectory optimization.  Introduction to model predictive control.  Model-based reinforcement learning, and connections between modern reinforcement learning in continuous spaces and fundamental optimal control ideas.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "5157",
                "currentClassSize": "0",
                "maxClassSize": "120",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pavone, M.",
                                "sunet": "pavone"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213662",
        "number": "AA 203",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "204",
        "title": "Spacecraft Electric Propulsion",
        "description": "The fundamentals of electric propulsion for spacecraft, which exists at the junction of traditional fluid dynamics, plasma physics, and aerospace engineering. The design and physics of electrothermal, electrostatic, and electromagnetic propulsion devices. Prerequisites: prior familiarity and experience with electromagnetism (Maxwell's equations, Ohm's law); fluid dynamics (fluid equations, choked flow, nozzles, Mach number); chemistry (stoichiometry, heat of formation, heat of reaction); and orbital dynamics (rocket equation, thrust, specific impulse, delta-v).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29979",
                "currentClassSize": "0",
                "maxClassSize": "70",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hara, K.",
                                "sunet": "kenhara"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222078",
        "number": "AA 204",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "205",
        "title": "Rarefied and Ionized Gases (ME 362C)",
        "description": "Compressible, viscous, rarefied, and ionized gas flow models derived from kinetic theory, quantum mechanics, and statistical mechanics. Equilibrium properties and non-equilibrium processes via collisions and radiation. Monte Carlo collision models for non-equilibrium gas dynamics and partially ionized plasmas. Prerequisite: undergraduate courses in fluid mechanics and thermodynamics, ME 362A recommended but not required.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222794",
        "number": "AA 205",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "210A",
        "title": "Fundamentals of Compressible Flow",
        "description": "Topics: development of the three-dimensional, non-steady, field equations for describing the motion of a viscous, compressible fluid; differential and integral forms of the equations; constitutive equations for a compressible fluid; the entropy equation; compressible boundary layers; area-averaged equations for one-dimensional steady flow; shock waves; channel flow with heat addition and friction; flow in nozzles and inlets; oblique shock waves; Prandtl-Meyer expansion; unsteady one-dimensional flow; the shock tube; small disturbance theory; acoustics in one-dimension; steady flow in two-dimensions; potential flow; linearized potential flow; lift and drag of thin airfoils. Prerequisites: undergraduate background in fluid mechanics and thermodynamics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "33041",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hara, K.",
                                "sunet": "kenhara"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103131",
        "number": "AA 210A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "212",
        "title": "Advanced Feedback Control Design",
        "description": "Analysis and design techniques for multivariable feedback systems. State-space concepts, observability, controllability, eigenvalues, eigenvectors, stability, and canonical representations. Approaches for robust feedback control design, chiefly H2, H-infinity, and mu-synthesis. System identification and adaptive control design. Use of computer-aided design with MATLAB. Prerequisite: ENGR 105, ENGR 205. Recommended: Linear algebra (EE 263 or equivalent).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "33049",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schwager, M.",
                                "sunet": "schwager"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213888",
        "number": "AA 212",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "214",
        "title": "Numerical Methods for Compressible Flows",
        "description": "For M.S.-level graduate students. Covers the hierarchy of mathematical models for compressible flows. Introduction to finite difference, finite volume, and finite element methods for their computation. Ideal potential flow; transonic potential flow; Euler equations; Navier-Stokes equations; representative model problems; shocks, expansions, and contact discontinuities; treatment of boundary conditions; time and pseudo-time integration schemes. Prerequisites: basic knowledge of linear algebra and ODEs (CME 206 or equivalent).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30729",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "McCullough 126",
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103141",
        "number": "AA 214",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "216",
        "title": "Model Reduction (CME 345)",
        "description": "Model reduction is an indispensable tool for computational-based design and optimization, statistical analysis, embedded computing, and real-time optimal control. It is also essential for scenarios where real-time simulation responses are desired. This course presents the basic mathematical theory for projection-based model reduction. It is intended primarily for graduate students interested in computational sciences and engineering. The course material described below is complemented by a balanced set of theoretical, algorithmic, and Matlab computer programming homework assignments. Prerequisites: Solid foundations in numerical linear algebra (CME 200 or equivalent). Basic numerical methods for ODEs (CME 206 or equivalent).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "211927",
        "number": "AA 216",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "218",
        "title": "Introduction to Symmetry Analysis",
        "description": "Methods of symmetry analysis and their use in the reduction and simplification of physical problems. Topics: dimensional analysis, phase-space analysis of autonomous systems of ordinary differential equations, use of Lie groups to reduce the order of nonlinear ODEs and to generate integrating factors, use of Lie groups to reduce the dimension of partial differential equations and to generate similarity variables, exact solutions of nonlinear PDEs generated from groups. Mathematica-based software developed by the instructor is used for finding invariant groups of ODEs and PDEs.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "103151",
        "number": "AA 218",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "222",
        "title": "Engineering Design Optimization (CS 361)",
        "description": "Design of engineering systems within a formal optimization framework. This course covers the mathematical and algorithmic fundamentals of optimization, including derivative and derivative-free approaches for both linear and non-linear problems, with an emphasis on multidisciplinary design optimization. Topics will also include quantitative methodologies for addressing various challenges, such as accommodating multiple objectives, automating differentiation, handling uncertainty in evaluations, selecting design points for experimentation, and principled methods for optimization when evaluations are expensive. Applications range from the design of aircraft to automated vehicles. Prerequisites: some familiarity with probability, programming, and multivariable calculus.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "5362",
                "currentClassSize": "0",
                "maxClassSize": "200",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kochenderfer, M.",
                                "sunet": "mykel"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103156",
        "number": "AA 222",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "228",
        "title": "Decision Making under Uncertainty (CS 238)",
        "description": "This course is designed to increase awareness and appreciation for why uncertainty matters, particularly for aerospace applications. Introduces decision making under uncertainty from a computational perspective and provides an overview of the necessary tools for building autonomous and decision-support systems. Following an introduction to probabilistic models and decision theory, the course will cover computational methods for solving decision problems with stochastic dynamics, model uncertainty, and imperfect state information. Topics include: Bayesian networks, influence diagrams, dynamic programming, reinforcement learning, and partially observable Markov decision processes. Applications cover: air traffic control, aviation surveillance systems, autonomous vehicles, and robotic planetary exploration. Prerequisites: basic probability and fluency in a high-level programming language.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "27735",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "NVIDIA Auditorium",
                        "instructors": [
                            {
                                "name": "Kochenderfer, M.",
                                "sunet": "mykel"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215840",
        "number": "AA 228",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "229",
        "title": "Advanced Topics in Sequential Decision Making (CS 239)",
        "description": "Survey of recent research advances in intelligent decision making for dynamic environments from a computational perspective. Efficient algorithms for single and multiagent planning in situations where a model of the environment may or may not be known. Partially observable Markov decision processes, approximate dynamic programming, and reinforcement learning. New approaches for overcoming challenges in generalization from experience, exploration of the environment, and model representation so that these methods can scale to real problems in a variety of domains including aerospace, air traffic control, and robotics. Students are expected to produce an original research paper on a relevant topic. Prerequisites: AA 228/CS 238 or CS 221.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29764",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kochenderfer, M.",
                                "sunet": "mykel"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215991",
        "number": "AA 229",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "236A",
        "title": "Spacecraft Design",
        "description": "This course focuses on the design and implementation of spacecraft deployable structure systems. Students are introduced to the requirements driving the design of large spacecraft structures, various design approaches to realize deployable structures, and modeling and analysis tools for the design of deployable structures. Students will design a concept for a deployable spacecraft structure that meets functional, mechanical, and environmental requirements. AA 151 Lightweight Structures (or similar) is a strongly recommended pre-requisite.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "30730",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Littlefield 103",
                        "instructors": [
                            {
                                "name": "Arya, M.",
                                "sunet": "manan0"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103173",
        "number": "AA 236A",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "236B",
        "title": "Spacecraft Design Laboratory",
        "description": "Continuation of AA 236A. This course focuses on the design and implementation of spacecraft deployable structure systems. Students will work in teams to propose a solution for a large deployable structure for small satellites. Students will demonstrate that their design meets functional, mechanical, and environmental requirements using analysis, prototyping, and testing. Prerequisite: AA 236A or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "33053",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "2:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sakovsky, M.",
                                "sunet": "sakovsky"
                            }
                        ],
                        "startTimestamp": 52200.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103174",
        "number": "AA 236B",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "240",
        "title": "Analysis of Structures",
        "description": "Analyses of solid and thin walled section beams, trusses, frames, rings, monocoque and semimonocoque structures. Determination of stresses, strains, and deformations, and failure in structures; structural stability and buckling; material behavior: plasticity and fracture. Emphasis on energy methods and introduction of finite element methods. Prerequisite: ENGR 14 or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "33058",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103181",
        "number": "AA 240",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "240C",
        "title": "Advanced Analysis of Structures",
        "description": null,
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "103183",
        "number": "AA 240C",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "242A",
        "title": "Classical Dynamics",
        "description": "Accelerating and rotating reference frames. Kinematics of rigid body motion; Euler angles, direction cosines. D'Alembert's principle, equations of motion. Inertia properties of rigid bodies. Dynamics of coupled rigid bodies. Lagrange's equations and their use. Dynamic behavior, stability, and small departures from equilibrium. Prerequisite: ENGR 15 or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "5144",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Skilling Auditorium",
                        "instructors": [
                            {
                                "name": "Elschot, S.",
                                "sunet": "sigridc"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "104933",
        "number": "AA 242A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "242B",
        "title": "Mechanical Vibrations (ME 242B)",
        "description": "For M.S.-level graduate students.  Covers the vibrations of discrete systems and continuous structures.  Introduction to the computational dynamics of linear engineering systems.  Review of analytical dynamics of discrete systems; undamped and damped vibrations of N-degree-of-freedom systems; continuous systems; approximation of continuous systems by displacement methods; solution methods for the Eigenvalue problem; direct time-integration methods.  Prerequisites: AA 242A or equivalent (recommended but not required); basic knowledge of linear algebra and ODEs; no prior knowledge of structural dynamics is assumed.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "210623",
        "number": "AA 242B",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "244A",
        "title": "Introduction to Plasma Physics and Engineering",
        "description": "Physics and engineering of plasmas, including space and laboratory plasmas.  Debye length and distribution functions.  Single-particle motion and drifts.  Plasmas as fluids and fluid drifts.  Waves in plasmas, including electrostatic and electromagnetic.  Diffusion and resistivity.  Magnetohydrodynamics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6718",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elschot, S.",
                                "sunet": "sigridc"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213685",
        "number": "AA 244A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "244B",
        "title": "Advanced Plasma Physics and Engineering",
        "description": "Plasma waves and instabilities. Kinetic theory and the Vlasov equation. Nonlinear effects and solutions. Plasma diagnostics in ground- and space-based experiments. Computational plasma simulation techniques, including particle-in-cell methods, boundary conditions, and field solvers. Prerequisites: AA 244A or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "213686",
        "number": "AA 244B",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "245",
        "title": "Stability of Structures",
        "description": "This course covers the fundamentals of buckling and stability of structures, using potential energy and direct equilibrium approaches. Structural stability theory has applications in civil, mechanical, and aerospace engineering. Topics include: buckling of columns; imperfection sensitivity; classification of instabilities into snap-through and bifurcations; elasto-plastic buckling; buckling of plates and shells; localization and wrinkling; post-buckling behavior. Pre-requisites: AA 151 or AA 240 or similar.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32690",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Arya, M.",
                                "sunet": "manan0"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "201411",
        "number": "AA 245",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "251",
        "title": "Introduction to the Space Environment",
        "description": "The environment through which space probes and vehicles travel and orbit. Survey of physical phenomena in the sun, solar wind, magnetospheres, ionospheres, and upper atmospheres of objects in the solar system. Introduction to the physical processes governing space plasmas, solar-terrestrial interactions, and ionized and neutral media surrounding the Earth and other solar system bodies.  Prerequisite:  AA 244A.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "211268",
        "number": "AA 251",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "252",
        "title": "Techniques of Failure Analysis",
        "description": "Introduction to the field of failure analysis, including fire and explosion analysis, large scale catastrophe projects, traffic accident reconstruction, aircraft accident investigation, human factors, biomechanics and accidents, design defect cases, materials failures and metallurgical procedures, and structural failures. Product liability, failure modes and effects analysis, failure prevention, engineering ethics, and the engineer as expert witness.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "4704",
                "currentClassSize": "0",
                "maxClassSize": "70",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kemal, A.",
                                "sunet": "kemal"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103204",
        "number": "AA 252",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "256",
        "title": "Mechanics of Composites",
        "description": "Fiber reinforced composites. Stress, strain, and strength of composite laminates and honeycomb structures. Failure modes and failure criteria. Environmental effects. Manufacturing processes. Design of composite structures. Individual design project required of each student, resulting in a usable computer software. Prerequisite: ME 80 and AA 156 or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31213",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "540-108",
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103206",
        "number": "AA 256",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "257",
        "title": "Structural Health Monitoring",
        "description": "Structural health monitoring (SHM) is an emerging technology that provides high-resolution real-time state-sensing, awareness, and self-diagnostic capabilities of structures in service enabled by different types of sensors. SHM is a technology that is designed to interface with the industrial internet of things (IIoT) environment (a) to extend the duration of the service life; (b) to increase the reliability; (c) to reduce the maintenance cost and operational cost. The course will provide in-depth knowledge of two basic damage detection methods for SHM, (a) active sensing and (b) passive sensing. This course will also discuss different kinds of smart materials and sensors, including piezoelectric materials as sensing and actuating elements to interrogate the structures. Advanced signal processing techniques and different types of diagnostics techniques will be discussed and applied to various damage scenarios for qualitative and quantitative measurements. The class will involve structural dynamics, wave propagation, signal processing, finite element methods, and study test cases.  Prerequisite: 240 or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32692",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103208",
        "number": "AA 257",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "260",
        "title": "Sustainable Aviation",
        "description": "Quantitative assessment of the impact of aviation on the environment including noise, local, and global emissions, and models used to predict it. Current and future technologies that may allow the air transportation system to meet anticipated growth while reducing or minimizing environmental problems. Atmospheric effects of NOx, CO2, particulates, unburned hydrocarbons, and water vapor deposition at high altitudes and metrics for assessing global climate effects. Noise sources, measurement, and mitigation strategies. Fundamentals of aircraft and engine performance needed to assess current and future concepts. Major national and international policy implications of existing and future technology choices.  Recommended: AA 241B.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "208723",
        "number": "AA 260",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "261",
        "title": "Building an Aerospace Startup from the Ground Up",
        "description": "Silicon Valley has experienced a dramatic increase in aerospace-focused, venture capital-backed companies over the last decade. This course will examine what drives success and failure in these ventures, with applicability to prospective founders, employees, investors, or those with a general interest in understanding how real companies operate on a day-to-day basis. The course will cover the entire life cycle of aerospace startups, from idea to product, first financing to exit. Half of the class sessions will be lectures focused on the nuts and bolts of building an aerospace startup. The other sessions will explore critical decision making of recent aerospace startups, through case studies. Often, the protagonists from the case studies will join the class to provide their thinking as they navigated these bet-the-company decisions. Grading will be determined by a combination of hands-on projects and class participation. The instructors are former aerospace entrepreneurs who have raised more than $100 million in capital, launched satellites and derived products from those satellites, and who successfully exited their venture which returned 10x to initial investors.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221139",
        "number": "AA 261",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "271A",
        "title": "Dynamics and Control of Aircraft",
        "description": "The dynamic behavior of aircraft and spacecraft, and the design of automatic control systems for them. For aircraft: non-linear and linearized longitudinal and lateral dynamics; linearized aerodynamics; natural modes of motion; autopilot design to enhance stability, control the flight path, and perform automatic landings. For spacecraft in orbit: natural longitudinal and lateral dynamic behavior and the design of attitude control systems. Prerequisites: AA242A, ENGR 105.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "103211",
        "number": "AA 271A",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "272",
        "title": "Global Positioning Systems",
        "description": "The principles of satellite navigation using Global Positioning Systems (GPS). Positioning techniques using code tracking, single and dual frequency, carrier aiding, and use of differential and assisted GPS/GNSS for improved accuracy and integrity. Students will learn the building blocks to go from raw received satellite time in nanoseconds all the way to a sophisticated position solution. Using provided Android smartphones, students will collect data and implement an open-ended course project where the goal is to get creative and solve an interesting problem using the tools developed in this course. Prerequisites: familiarity with matrix algebra and MatLab (or another mathematical programming language).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31214",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "160-315",
                        "instructors": [
                            {
                                "name": "Gao, G.",
                                "sunet": "gracegao"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103217",
        "number": "AA 272",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "273",
        "title": "State Estimation and Filtering for Robotic Perception",
        "description": "Kalman filtering, recursive Bayesian filtering, and nonlinear filter architectures including the extended Kalman filter, particle filter, and unscented Kalman filter.  Observer-based state estimation for linear and non-linear systems.  Examples from aerospace, including state estimation for fixed-wing aircraft, rotorcraft, spacecraft, and planetary rovers, with applications to control, navigation, and autonomy.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "5636",
                "currentClassSize": "0",
                "maxClassSize": "83",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schwager, M.",
                                "sunet": "schwager"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217926",
        "number": "AA 273",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "274A",
        "title": "Principles of Robot Autonomy I (CS 237A, EE 260A)",
        "description": "Basic principles for endowing mobile autonomous robots with perception, planning, and decision-making capabilities. Algorithmic approaches for robot perception, localization, and simultaneous localization and mapping; control of non-linear systems, learning-based control, and robot motion planning; introduction to methodologies for reasoning under uncertainty, e.g., (partially observable) Markov decision processes. Extensive use of the Robot Operating System (ROS) for demonstrations and hands-on activities. Prerequisites: CS 106A or equivalent, CME 100 or equivalent (for linear algebra), and CME 106 or equivalent (for probability theory).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30973",
                "currentClassSize": "0",
                "maxClassSize": "180",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Gates B1",
                        "instructors": [
                            {
                                "name": "Schwager, M.",
                                "sunet": "schwager"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218545",
        "number": "AA 274A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "274B",
        "title": "Principles of Robot Autonomy II (AA 174B, CS 237B, EE 260B)",
        "description": "This course teaches advanced principles for endowing mobile autonomous robots with capabilities to autonomously learn new skills and to physically interact with the environment and with humans. It also provides an overview of different robot system architectures. Concepts that will be covered in the course are: Reinforcement Learning and its relationship to optimal control, contact and dynamics models for prehensile and non-prehensile robot manipulation, imitation learning and human intent inference, as well as different system architectures and their verification. Students will earn the theoretical foundations for these concepts and implement them on mobile manipulation platforms. In homeworks, the Robot Operating System (ROS) will be used extensively for demonstrations and hands-on activities. Prerequisites: CS106A or equivalent, CME 100 or equivalent (for linear algebra), CME 106 or equivalent (for probability theory), and AA 171/274.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6235",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sadigh, D.",
                                "sunet": "dorsa"
                            },
                            {
                                "name": "Pavone, M.",
                                "sunet": "pavone"
                            },
                            {
                                "name": "Bohg, J.",
                                "sunet": "bohg"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221536",
        "number": "AA 274B",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "275",
        "title": "Navigation for Autonomous Systems",
        "description": "Navigation is a key element in many autonomous systems, from self-driving cars to flying robots. In this course you will learn about the technologies that enable autonomous navigation. Topics: navigational system design using GPS as an example; data-driven approach using machine learning and deep learning; model-based approach using probabilistic graph model; theory-based approach using formal verification; intelligent navigational sensor fusion; cyber security and integrity monitoring for localization and navigation. Prerequisites: AA 228 or EE 278; and EE 263 or AA 212. Recommended: AA 272, EE 261, AA 273.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "33064",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gao, G.",
                                "sunet": "gracegao"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222698",
        "number": "AA 275",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "277",
        "title": "Multi-Robot Control and Distributed Optimization",
        "description": "Survey of current research topics in multi-robot systems including multi-agent consensus, formation control, coverage control and sensor deployment, collision avoidance, cooperative mapping, and distributed Bayesian filtering.  Students will develop skills in evaluating and critiquing research papers, and will conduct a final research project.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "5417",
                "currentClassSize": "0",
                "maxClassSize": "49",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schwager, M.",
                                "sunet": "schwager"
                            },
                            {
                                "name": "Halsted, T.",
                                "sunet": "halsted"
                            },
                            {
                                "name": "Vincent, J.",
                                "sunet": "josephav"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217669",
        "number": "AA 277",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "279A",
        "title": "Space Mechanics",
        "description": "Orbits of near-earth satellites and interplanetary probes; relative motion in orbit;  transfer and rendezvous; orbit determination; influence of earth's oblateness; sun and moon effects on earth satellites; decay of satellite orbits; invited lectures from industry. Prerequisite: ENGR 15 and familiarity with MatLab.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "5274",
                "currentClassSize": "0",
                "maxClassSize": "70",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "D'Amico, S.",
                                "sunet": "damicos"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103231",
        "number": "AA 279A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "279B",
        "title": "Advanced Space Mechanics",
        "description": "Restricted 3-body problem. Relative motion, Hill's and Clohessy-Wiltshire equations. Lambert's problem. Satellite constellations and optimization. Communications and link budgets. Space debris. High fidelity simulation. Interplanetary mission planning, launch windows and gravity assists. Basic trajectory optimization. Several guest lectures from practitioners in the field. Individual final project chosen in consultation with instructor. Prerequisites: 279A or equivalent with permission of instructor. Fluency with MATLAB (or another mathematical programming language with 2D and 3D plotting capabilities).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31215",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "200-107",
                        "instructors": [
                            {
                                "name": "Barrows, A.",
                                "sunet": "abarrows"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214989",
        "number": "AA 279B",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "279C",
        "title": "Spacecraft Attitude Determination and Control",
        "description": "Attitude representation and parametrization; unperturbed and perturbed attitude dynamics and stability; attitude sensors and actuators; linear and nonlinear attitude control; optimal attitude maneuvers; dynamics of flexible spacecraft and space tethers; invited lectures from industry. Prerequisites:  AA 242A, ENGR 105, AA 279A, and familiarity with MatLab.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32693",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "2:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "D'Amico, S.",
                                "sunet": "damicos"
                            }
                        ],
                        "startTimestamp": 52200.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216245",
        "number": "AA 279C",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "279D",
        "title": "Dynamics, Navigation, and Control of  Distributed Space Systems",
        "description": "Keplerian orbital mechanics and orbital perturbations; the general relative motion problem; linear formation flying dynamics and control; impulsive station-keeping and reconfiguration; high order relative motion equations; formulation of relative motion using orbital elements; perturbation-invariant formations; nonlinear formation control; low-thrust propulsion for formation flying; relative navigation using GNSS and optical navigation; applications: sparse-aperture imaging, remote sensing, on-orbit servicing, rendezvous, and docking. Prerequisite: AA 242A, ENGR 105, AA 279A, and familiarity with MatLab.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "216240",
        "number": "AA 279D",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "280",
        "title": "Smart Structures",
        "description": "Mechanics of smart materials and current approaches for engineering smart structures to monitor health, self heal, and adapt to environment.  Definition of smart structures; constitutive models for smart materials; piezoelectric ceramics; electro-active polymers; shape memory alloys; bio-inspired materials and structures; self-healing materials; sensors and sensor networks; structural health monitoring; and energy harvesting. Prerequisite: AA 240 or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "213987",
        "number": "AA 280",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "283",
        "title": "Aircraft and Rocket Propulsion",
        "description": "Introduction to the design and performance of airbreathing and rocket engines. Topics: the physical parameters used to characterize propulsion system performance; gas dynamics of nozzles and inlets; cycle analysis of ramjets, turbojets, turbofans, and turboprops; component matching and the compressor map; introduction to liquid and solid propellant rockets; multistage rockets; hybrid rockets; thermodynamics of reacting gases. Prerequisites: undergraduate background in fluid mechanics and thermodynamics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32694",
                "currentClassSize": "0",
                "maxClassSize": "70",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cantwell, B.",
                                "sunet": "cantwell"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103238",
        "number": "AA 283",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "284A",
        "title": "Advanced Rocket Propulsion",
        "description": "The principles of rocket propulsion system design and analysis. Fundamental aspects of the physics and chemistry of rocket propulsion. Focus is on the design and analysis of chemical propulsion systems including liquids, solids, and hybrids. Nonchemical propulsion concepts such as electric and nuclear rockets. Launch vehicle design and optimization issues including trajectory calculations. Limited enrollment. Prerequisites: 283 or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "203841",
        "number": "AA 284A",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "284B",
        "title": "Propulsion System Design Laboratory",
        "description": "Propulsion systems engineering through the design and operation of a sounding rocket. Students work in small teams through a full project cycle including requirements definition, performance analysis, system design, fabrication, ground and flight testing, and evaluation. Prerequisite: 284A and consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "204280",
        "number": "AA 284B",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "284C",
        "title": "Propulsion System Design Laboratory",
        "description": "Continuation of 284A,B. Prerequisite: 284B, and consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "204533",
        "number": "AA 284C",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "289",
        "title": "Robotics and Autonomous Systems Seminar (CS 529)",
        "description": "Seminar talks by researchers and industry professionals on topics related to modern robotics and autonomous systems. Broadly, talks will cover robotic design, perception and navigation, planning and control, and learning for complex robotic systems. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "5834",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pavone, M.",
                                "sunet": "pavone"
                            }
                        ],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 48000.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "6061",
                "currentClassSize": "0",
                "maxClassSize": "150",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pavone, M.",
                                "sunet": "pavone"
                            },
                            {
                                "name": "Cutkosky, M.",
                                "sunet": "cutkosky"
                            }
                        ],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 48000.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220012",
        "number": "AA 289",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "290",
        "title": "Problems in Aero/Astro",
        "description": "(Undergraduates register for 190 or 199.) Experimental, theoretical, or computational investigation. Students may work in any field of special interest. This course is designed to develop students' understanding of what a research problem is and the skills needed to successfully approach and conduct research. Register in Axess for section belonging to your research supervisor once the faculty member agrees to supervise your independent study. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28261",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27902",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "4047",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "5806",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "5782",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "5807",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "5783",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "5808",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elschot, S.",
                                "sunet": "sigridc"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "5784",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elschot, S.",
                                "sunet": "sigridc"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "5809",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "D'Amico, S.",
                                "sunet": "damicos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "5785",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "D'Amico, S.",
                                "sunet": "damicos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "5810",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "5786",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "4048",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "5787",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kochenderfer, M.",
                                "sunet": "mykel"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "13",
                "component": "INS",
                "notes": null,
                "classId": "5811",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kochenderfer, M.",
                                "sunet": "mykel"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "13",
                "component": "INS",
                "notes": null,
                "classId": "5788",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "14",
                "component": "INS",
                "notes": null,
                "classId": "5812",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "15",
                "component": "INS",
                "notes": null,
                "classId": "5789",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "16",
                "component": "INS",
                "notes": null,
                "classId": "5813",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103244",
        "number": "AA 290",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 60
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "290S",
        "title": "Problems in Aero/Astro",
        "description": "(Undergraduates register for 190 or 199.) Experimental, theoretical, or computational investigation. Students may work in any field of special interest. This course is designed to develop students' understanding of what a research problem is and the skills needed to successfully approach and conduct research. Register in Axess for section belonging to your research supervisor once the faculty member agrees to supervise your independent study. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [],
        "gers": [],
        "objectID": "222356",
        "number": "AA 290S",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "291",
        "title": "Practical Training",
        "description": "Educational opportunities in high-technology research and development labs in aerospace and related industries. Internship integrated into a student's academic program. Research report outlining work activity, problems investigated, key results, and any follow-on projects. Meets the requirements for Curricular Practical Training for students on F-1 visas. Student is responsible for arranging own employment and should see department student services manager before enrolling. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28262",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27903",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "4340",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "4850",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "5209",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "5359",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elschot, S.",
                                "sunet": "sigridc"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "4966",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elschot, S.",
                                "sunet": "sigridc"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "5210",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elschot, S.",
                                "sunet": "sigridc"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "5645",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kochenderfer, M.",
                                "sunet": "mykel"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "4985",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "5211",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "5828",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "5569",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "5971",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Senesky, D.",
                                "sunet": "dsenesky"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "11",
                "component": "INS",
                "notes": null,
                "classId": "5794",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "11",
                "component": "INS",
                "notes": null,
                "classId": "5986",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "D'Amico, S.",
                                "sunet": "damicos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "5796",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "D'Amico, S.",
                                "sunet": "damicos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "5795",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Senesky, D.",
                                "sunet": "dsenesky"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "6827",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pavone, M.",
                                "sunet": "pavone"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "13",
                "component": "INS",
                "notes": null,
                "classId": "5836",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Senesky, D.",
                                "sunet": "dsenesky"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103245",
        "number": "AA 291",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 35
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "294",
        "title": "Case Studies in Aircraft Design",
        "description": "Presentations by researchers and industry professionals. Registration for credit optional. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "203681",
        "number": "AA 294",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "296",
        "title": "Plasma Science and Technology Seminar (ME 350)",
        "description": "Guest speakers present research related to plasma science and engineering, ranging from fundamental plasma physics to industrial applications of plasma.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "RES",
                "notes": null,
                "classId": "32421",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edwards, M.",
                                "sunet": "edwards5"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 62400.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "RES",
                "notes": "Class will be held in Building 520, Room 131.",
                "classId": "30981",
                "currentClassSize": "0",
                "maxClassSize": "75",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Edwards, M.",
                                "sunet": "edwards5"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 62400.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "RES",
                "notes": null,
                "classId": "32784",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hara, K.",
                                "sunet": "kenhara"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 62400.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224974",
        "number": "AA 296",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "300",
        "title": "Engineer Thesis",
        "description": "Thesis for degree of Engineer. Students register for section belonging to their thesis adviser.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28263",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "27904",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2252",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2353",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2291",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "2253",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cantwell, B.",
                                "sunet": "cantwell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2254",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2354",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2292",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "27",
                "component": "T/D",
                "notes": null,
                "classId": "2255",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "27",
                "component": "T/D",
                "notes": null,
                "classId": "2355",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "27",
                "component": "T/D",
                "notes": null,
                "classId": "2293",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "30",
                "component": "T/D",
                "notes": null,
                "classId": "2256",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "30",
                "component": "T/D",
                "notes": null,
                "classId": "2356",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "30",
                "component": "T/D",
                "notes": null,
                "classId": "2294",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "39",
                "component": "T/D",
                "notes": null,
                "classId": "2257",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "39",
                "component": "T/D",
                "notes": null,
                "classId": "2357",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "39",
                "component": "T/D",
                "notes": null,
                "classId": "2295",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "54",
                "component": "T/D",
                "notes": null,
                "classId": "4415",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "54",
                "component": "T/D",
                "notes": null,
                "classId": "4592",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Farhat, C.",
                                "sunet": "cfarhat"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103259",
        "number": "AA 300",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ],
        "totalSections": 48
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "301",
        "title": "Ph.D. Dissertation",
        "description": "Prerequisite: completion of Ph.D qualifying exams. Students register for section belonging to their thesis adviser. (Staff)",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28264",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "27905",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2919",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2363",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2306",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "2920",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cantwell, B.",
                                "sunet": "cantwell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "2364",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cantwell, B.",
                                "sunet": "cantwell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "6602",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cantwell, B.",
                                "sunet": "cantwell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2921",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2365",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2307",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "27",
                "component": "T/D",
                "notes": null,
                "classId": "2922",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "27",
                "component": "T/D",
                "notes": null,
                "classId": "2366",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "27",
                "component": "T/D",
                "notes": null,
                "classId": "2308",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kroo, I.",
                                "sunet": "kroo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "30",
                "component": "T/D",
                "notes": null,
                "classId": "2923",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "30",
                "component": "T/D",
                "notes": null,
                "classId": "2367",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "30",
                "component": "T/D",
                "notes": null,
                "classId": "2309",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lele, S.",
                                "sunet": "lele"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "39",
                "component": "T/D",
                "notes": null,
                "classId": "2924",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "39",
                "component": "T/D",
                "notes": null,
                "classId": "2368",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "39",
                "component": "T/D",
                "notes": null,
                "classId": "2310",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rock, S.",
                                "sunet": "rock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103260",
        "number": "AA 301",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ],
        "totalSections": 73
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "801",
        "title": "TGR Engineer Thesis",
        "description": "Engineer's thesis or non-doctoral work for a TGR student.",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28265",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "27906",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2268",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2369",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2311",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "2370",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bradshaw, P.",
                                "sunet": "bradshaw"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "2371",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bryson, A.",
                                "sunet": "brysonae"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "2269",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cantwell, B.",
                                "sunet": "cantwell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "2372",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cantwell, B.",
                                "sunet": "cantwell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "2373",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cappelli, M.",
                                "sunet": "cap"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2270",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2374",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2312",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "11",
                "component": "T/D",
                "notes": null,
                "classId": "2375",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Christensen, R.",
                                "sunet": "rmchris"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "12",
                "component": "T/D",
                "notes": null,
                "classId": "2376",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dauskardt, R.",
                                "sunet": "rhd"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "13",
                "component": "T/D",
                "notes": null,
                "classId": "2377",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeBra, D.",
                                "sunet": "qhyd"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "14",
                "component": "T/D",
                "notes": null,
                "classId": "2378",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Durbin, P.",
                                "sunet": "pdurbin"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "15",
                "component": "T/D",
                "notes": null,
                "classId": "2379",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Eaton, J.",
                                "sunet": "eatonj"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "18",
                "component": "T/D",
                "notes": null,
                "classId": "2380",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fraser-Smith, A.",
                                "sunet": "acfs"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "19",
                "component": "T/D",
                "notes": null,
                "classId": "2381",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hanson, R.",
                                "sunet": "rkhanson"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103262",
        "number": "AA 801",
        "units": [
            0
        ],
        "totalSections": 88
    },
    {
        "year": "2023-2024",
        "subject": "AA",
        "code": "802",
        "title": "TGR Ph.D. Dissertation",
        "description": "Doctoral dissertation for a TGR student in PhD program.",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28266",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "27907",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2246",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2309",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2286",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alonso, J.",
                                "sunet": "jjalonso"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "2310",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bloom, E.",
                                "sunet": "elliottb"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "2311",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Boyd, S.",
                                "sunet": "boyd"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "2312",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bradshaw, P.",
                                "sunet": "bradshaw"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "2313",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bryson, A.",
                                "sunet": "brysonae"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "2314",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "2247",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cantwell, B.",
                                "sunet": "cantwell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "2315",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cantwell, B.",
                                "sunet": "cantwell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "6603",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cantwell, B.",
                                "sunet": "cantwell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "2316",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cappelli, M.",
                                "sunet": "cap"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2248",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2317",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "2287",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, F.",
                                "sunet": "fkchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "11",
                "component": "T/D",
                "notes": null,
                "classId": "2318",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Christensen, R.",
                                "sunet": "rmchris"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "12",
                "component": "T/D",
                "notes": null,
                "classId": "2319",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dauskardt, R.",
                                "sunet": "rhd"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "13",
                "component": "T/D",
                "notes": null,
                "classId": "2320",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeBra, D.",
                                "sunet": "qhyd"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103263",
        "number": "AA 802",
        "units": [
            0
        ],
        "totalSections": 102
    }
]