[
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "46N",
        "title": "Show and Tell: Creating Provenance Histories of African Art (AFRICAAM 46N, HISTORY 46N)",
        "description": "Provenance refers to the chain of custody of a particular art object during its lifetime. Put another way, provenance refers to all the individuals, communities, and institutions who have owned (both legally and illegally), kept, stored, exhibited, displayed, managed, and sold an art object. Knowledge of provenance can both inflate and deflate the value of an art object and it can also shed light upon legal and ethical questions including assessing repatriation and restitution claims for African art objects. Furthermore, by telling the story of how a particular object moved through multiple pairs of hands, often over the course of centuries and across several continents, we gain nuanced appreciation of the social currency of artwork as well as of changing perceptions of aesthetic and monetary value, and insight into the extractive dynamics of colonialism and postcolonial global economies. For this class, you will have the unique opportunity to work first hand with an important African art collection in North America: the Richard H. Scheller Collection at Stanford University. You will select one object from the collection and create a detailed provenance history, documenting and detailing its origins, its movement across space and time, and its arrival to the Scheller collection in Silicon Valley. You will use archival materials from Scheller&iquest;s collection, online databases and archives, and secondary literature. Your final project for the class will be to create a visual StoryMap that allows you to display your provenance history with narrative text and multimedia content. In this way, you will not only have completed a class assignment: you will also have constructed for posterity a remarkable hitherto unknown history of an important African art object.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "224188",
        "number": "AFRICAST 46N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "51N",
        "title": "Visible Bodies: Black Female Authors and the Politics of Publishing in Africa (AFRICAAM 140N, ENGLISH 54N, HISTORY 41N)",
        "description": "Where are the African female writers of the twentieth century and the present day? This Introductory Seminar addresses the critical problem of the marginalization of black female authors within established canons of modern African literature. We will explore, analyse and interrogate the reasons why, and the ways in which, women-authored bodies of work from this period continue to be lost, misplaced, forgotten, and ignored by a male-dominated and largely European/white publishing industry in the context of colonialism, apartheid and globalization. nnYou will be introduced to key twentieth-century and more contemporary female authors from Africa, some of them published but many more unpublished or out-of-print. The class will look at the challenges these female authors faced in publishing, including how they navigated a hostile publishing industry and a lack of funding and intellectual support for black writers, especially female writers. nnWe will also examine the strategies these writers used to mitigate their apparent marginality, including looking at how women self-published, how they used newspapers as publication venues, how they have increasingly turned to digital platforms, and how many sought international publishing networks outside of the African continent. As one of the primary assessments for the seminar, you will be asked to conceptualize and design an in-depth and imaginative pitch for a new publishing platform that specializes in African female authors. nnYou will also have the opportunity for in-depth engagement (both in class and in one-on-one mentor sessions) with a range of leading pioneers in the field of publishing and literature in Africa. Figures like Ainehi Edoro (founder of Brittle Paper) and Zukiswa Wanner (prize-winning author of The Madams and Men of the South), amongst others, will be guests to our Zoom classroom. One of our industry specialists will meet with you to offer detailed feedback on your proposal for your imagined publishing platform. nnYou can expect a roughly 50/50 division between synchronous and asynchronous learning, as well as plenty of opportunity to collaborate with peers in smaller settings.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222867",
        "number": "AFRICAST 51N",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "58",
        "title": "Egypt in the Age of Heresy (AFRICAAM 58A, ARCHLGY 58, CLASSICS 58)",
        "description": "Perhaps the most controversial era in ancient Egyptian history, the Amarna period (c.1350-1334 BCE) was marked by great sociocultural transformation, notably the introduction of a new 'religion' (often considered the world's first form of monotheism), the construction of a new royal city, and radical departures in artistic and architectural styles.  This course will introduce archaeological and textual sources of ancient Egypt, investigating topics such as theological promotion, projections of power, social structure, urban design, interregional diplomacy, and historical legacy during the inception, height, and aftermath of this highly enigmatic period.  Students with or without prior background are equally encouraged.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220417",
        "number": "AFRICAST 58",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "90",
        "title": "Black Earth Rising: Law and Society in Postcolonial Africa (AFRICAAM 47S, HISTORY 47S)",
        "description": "Is the International Criminal Court a neocolonial institution? Should African art in Western museums be returned? Why have anti-homosexuality laws emerged in many African countries? This course engages these questions, and more, to explore how Africans have grappled with the legacies of colonialism through law since independence. Reading court documents, listening to witness testimonies, analyzing legal codes, and watching cultural commentaries&iquest;including hit TV series Black Earth Rising&iquest;students will examine the histories of legal conflict in Africa and their implications for the present and future of African societies. This course fulfills the Social Inquiry and Engaging Diversity Ways requirements.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222872",
        "number": "AFRICAST 90",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "112",
        "title": "AIDS, Literacy, and Land: Foreign Aid and Development in Africa (AFRICAAM 111, AFRICAST 212)",
        "description": "Foreign aid can help Africa, say the advocates. Certainly not, say the critics. Is foreign aid a solution? or a problem? Should there be more aid, less aid, or none at all? Africa has developed imaginative and innovative approaches in many sectors. At the same time, many African countries have become increasingly dependent on foreign aid. How do foreign aid and local initiatives intersect? We will examine several contentious issues in contemporary Africa, exploring roots, contested analyses, and proposed solutions, examining foreign aid and the aid relationship. As African communities and countries work to shape their future, what are the foreign roles, and what are their consequences?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:EC-GlobalCom",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "140867",
        "number": "AFRICAST 112",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "114N",
        "title": "Desert Biogeography of Namibia Prefield Seminar (EARTHSYS 115N)",
        "description": "Desert environments make up a third of the land areas on Earth, ranging from the hottest to the coldest environments.  Aridity leads to the development of unique adaptations among the organisms that inhabit them.  Climate change and other processes of desertification as well as increasing human demand for habitable and cultivatable areas have resulting in increasing need to better understand these systems.  Namibia is a model system for studying these processes and includes the Sossuvlei (Sand Sea) World Heritable Site.  This seminar will prepare students for their overseas field experience in Namibia.  The seminar will provide an introduction to desert biogeography and culture, using Namibia as a case study.  During the seminar, students will each give two presentations on aspects of desert biogeography and ecology, specific organisms and their adaptations to arid environments, cultural adaptations of indigenous peoples and immigrants, ecological threats and conservation efforts, and/or national and international policy towards deserts. Additional assignments include a comprehensive dossier and a final exam.  Students will also carry out background research for the presentations they will be giving during the field seminar where access to the internet and to other scholarly resources will be limited. In addition, we will cover logistics, health and safety, cultural sensitivity, geography, and politics.  We will deal with post-field issues such as reverse culture shock, and ways in which participants can consolidate and build up their abroad experiences after they return to campus.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "220046",
        "number": "AFRICAST 114N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "115",
        "title": "Excavating Enslavement (AFRICAST 215)",
        "description": "This is a project-based course, intended to scaffold a joint initiative, Aftermaths of Enslavement: curating legacies publicly. Both course and project seek to better understand enslaved pasts by (a) curating materials that advance scholarly research, using technologies that maximize access and utility; and (b) by developing learning materials for schools and popular audiences by working with heritage professionals and teachers. The focus is on the Indian Ocean World, particularly the Cape (South Africa) and Mauritius, within global and comparative frameworks. Readings for each week will juxtapose Cape and other slave systems. Project partners and other guests will join individual sessions. Students unable to attend the sessions should contact the instructor to discuss asynchronous alternatives.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13622",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223210",
        "number": "AFRICAST 115",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "117",
        "title": "African Archive Beyond Colonization (AFRICAAM 187, ARCHLGY 166, CLASSICS 186, CLASSICS 286, CSRE 166)",
        "description": "From street names to monuments, the material sediments of colonial time can be seen, heard, and felt in the diverse cultural archives of ancient and contemporary Africa. This seminar aims to examine the role of ethnographic practice in the political agendas of past and present African nations. In the quest to reconstruct an imaginary of Africa in space and time, students will explore these social constructs in light of the rise of archaeology during the height of European empire and colonization. Particularly in the last 50 years, revived interest in African cultural heritage and preservation raises complex questions about the problematic tensions between European, American, and African theories of archaeological and ethnographic practice.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14129",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "50-52H",
                        "instructors": [
                            {
                                "name": "Derbew, S.",
                                "sunet": "sderbew"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "223454",
        "number": "AFRICAST 117",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "132",
        "title": "Literature and Society in Africa and the Caribbean (AFRICAAM 133, COMPLIT 133, COMPLIT 233A, CSRE 133E, FRENCH 133, JEWISHST 143)",
        "description": "This course provides students with an introductory survey of literature and cinema from Francophone Africa and the Caribbean in the 20th and 21st centuries. Students will be encouraged to consider the geographical, historical, and political connections between the Maghreb, the Caribbean, and Sub-Saharan Africa. This course will help students improve their ability to speak and write in French by introducing students to linguistic and conceptual tools to conduct literary and visual analysis. While analyzing novels and films, students will be exposed to a diverse number of topics such as national and cultural identity, race and class, gender and sexuality, orality and textuality, transnationalism and migration, colonialism and decolonization, history and memory, and the politics of language. Readings include the works of writers and filmmakers such as Aim&eacute; C&eacute;saire, Albert Memmi, Ousmane Semb&egrave;ne, Le&iuml;la Sebbar, Mariama B&acirc;, Maryse Cond&eacute;, Dany Laferri&egrave;re, Mati Diop, and special guest L&eacute;onora Miano. Taught in French. Students are encouraged to complete FRENLANG 124 or successfully test above this level through the Language Center.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13951",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "213802",
        "number": "AFRICAST 132",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "134",
        "title": "Museum Cultures: Exhibiting the African Imaginary (AFRICAST 234, ARCHLGY 134, ARCHLGY 234, ARTHIST 284B)",
        "description": "Museums are dynamic spaces with the potential to reinvent, rehabilitate, and recenter marginalized people and collections. This year, our seminar examines and enacts museum stewardship of material cultures of diverse African communities across space, time, and context. Legacies of colonialism inspire debates on restitution, reparation, and reconciliation, alongside actions to 'decolonize' museum practice. In engaging the politics of representation and human-object relationships, our class will challenge problematic imaginaries of Africa and recenter the complexities of cultures in the Horn of Africa spanning Ethiopia, Nubian Egypt, and Sudan. Students will acquire skills in researching, curating, and installing an exhibition based on Stanford's African archeological and ethnographic materials held at the Stanford University Archeology Collections (SUAC). This course will culminate in a student-curated exhibition that opens on Friday May 27, 2022 at the Stanford Archeology Center (Bldg 500) and is planned to feature renowned Somali-Swedish archeologist, Dr. Sada Mire, as the keynote speaker.nnBecause of limited spacing you will need to fill out this form  https://forms.gle/h8F46iv5iSwiX3PY7 and receive consent to enroll in the course from the instructor.  nn3 credits (no final project) or 5 credits (final project). May be repeat for credit",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29483",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "216552",
        "number": "AFRICAST 134",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "135",
        "title": "Designing Research-Based Interventions to Solve Global Health Problems (AFRICAST 235, EDUC 135, EDUC 335, EPI 235, HUMBIO 26, MED 235)",
        "description": "The excitement around social innovation and entrepreneurship has spawned numerous startups focused on tackling world problems, particularly in the fields of education and health. The best social ventures are launched with careful consideration paid to research, design, and efficacy. This course offers students insights into understanding how to effectively develop, evaluate, and scale social ventures. Using TeachAids (an award-winning nonprofit educational technology social venture used in 82 countries) as a primary case study, students will be given an in-depth look into how the entity was founded and scaled globally. Guest speakers will include world-class experts and entrepreneurs in Philanthropy, Medicine, Communications, Education, and Technology. Open to both undergraduate and graduate students.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29693",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214117",
        "number": "AFRICAST 135",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "142",
        "title": "Challenging the Status Quo: Social Entrepreneurs Advancing Democracy, Development and Justice (AFRICAST 242, CSRE 142C, INTNLREL 142, URBANST 135)",
        "description": "This community-engaged learning class is part of a broader Program on Social Entrepreneurship at the Haas Center for Public Service. It will use practice to better inform theory about how innovation can help address societies biggest challenges. Working with the instructor and three visiting nonprofit social entrepreneurs in residence, students will use case studies of successful and failed social change strategies to explore relationships between social entrepreneurship, race, democracy and justice. This course interrogates approaches like design theory, measuring impact, fundraising, leadership, storytelling and policy advocacy and explores how they can address issues like ending homelessness, fighting the COVID-19 pandemic and achieving racial justice, with a particular focus on California. This is a community-engaged learning class in which students will learn by working on projects that support the social entrepreneurs' efforts to promote social change. Students should register for either 3 OR 5 units only. Students enrolled in the full 5 units will have a service-learning component along with the course. Students enrolled for 3 units will not complete the service-learning component. Limited enrollment. Attendance at the first class is mandatory in order to participate in service learning.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class will take place in the DK room at the Haas Center.",
                "classId": "14081",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Janus, K.",
                                "sunet": "kakelly"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "212837",
        "number": "AFRICAST 142",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "199",
        "title": "Independent Study or Directed Reading",
        "description": "Course can be taken for a letter grade only if student is a Global Studies minor with a specialization in African Studies.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27469",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "9999",
                "currentClassSize": "0",
                "maxClassSize": "3",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hubbard, L.",
                                "sunet": "lhubbard"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10001",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Samoff, J.",
                                "sunet": "jsamoff"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "207209",
        "number": "AFRICAST 199",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "200",
        "title": "Doing Religious History (AFRICAAM 200P, HISTORY 200P, RELIGST 210X)",
        "description": "What is religion, and how do we write its history? This undergraduate colloquium uses case studies from a variety of regions and periods - but with a specific focus on the African continent - to consider how historians have dealt with the challenge of writing accounts of the realm of religious and spiritual experience. We will explore the utility of oral history alongside written documentary sources as well as explore issues of objectivity and affiliation in writing religious histories. (This course has been submitted for WAY-SI and WAY-ED certification.)",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223612",
        "number": "AFRICAST 200",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "202",
        "title": "Moving the Message: Reading and embodying the works of bell hooks (CSRE 202, DANCE 122, ENGLISH 287, FEMGEN 201)",
        "description": "In this course, we will spend time reading, discussing and embodying the work of Black feminist theorist and teacher bell hooks. hook's work focuses on practices rooted in Black feminism, the role of love in revolutionary politics, rescuing ourselves and each other from hegemonic forces, and building the components necessary for a life of liberatory politics. Through a process grounded in movement improvisation, creative writing and expression we will explore how the words and theories of bell hooks can literally move us towards freedom and self recovery. This course is presented by the Institute for Diversity in the Arts, IDA.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30303",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224030",
        "number": "AFRICAST 202",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "212",
        "title": "AIDS, Literacy, and Land: Foreign Aid and Development in Africa (AFRICAAM 111, AFRICAST 112)",
        "description": "Foreign aid can help Africa, say the advocates. Certainly not, say the critics. Is foreign aid a solution? or a problem? Should there be more aid, less aid, or none at all? Africa has developed imaginative and innovative approaches in many sectors. At the same time, many African countries have become increasingly dependent on foreign aid. How do foreign aid and local initiatives intersect? We will examine several contentious issues in contemporary Africa, exploring roots, contested analyses, and proposed solutions, examining foreign aid and the aid relationship. As African communities and countries work to shape their future, what are the foreign roles, and what are their consequences?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "140867",
        "number": "AFRICAST 212",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "215",
        "title": "Excavating Enslavement (AFRICAST 115)",
        "description": "This is a project-based course, intended to scaffold a joint initiative, Aftermaths of Enslavement: curating legacies publicly. Both course and project seek to better understand enslaved pasts by (a) curating materials that advance scholarly research, using technologies that maximize access and utility; and (b) by developing learning materials for schools and popular audiences by working with heritage professionals and teachers. The focus is on the Indian Ocean World, particularly the Cape (South Africa) and Mauritius, within global and comparative frameworks. Readings for each week will juxtapose Cape and other slave systems. Project partners and other guests will join individual sessions. Students unable to attend the sessions should contact the instructor to discuss asynchronous alternatives.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13655",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223210",
        "number": "AFRICAST 215",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "220E",
        "title": "Renaissance Africa (COMPLIT 220, ILAC 220E, ILAC 320E)",
        "description": "Literature, art, and culture in Central/Southern Africa during the sixteenth and seventeenth centuries. Emphasis on forms of exchange between Europeans and Africans in the Kingdom of Kongo and Angola. Readings in Portuguese and English. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "218137",
        "number": "AFRICAST 220E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "234",
        "title": "Museum Cultures: Exhibiting the African Imaginary (AFRICAST 134, ARCHLGY 134, ARCHLGY 234, ARTHIST 284B)",
        "description": "Museums are dynamic spaces with the potential to reinvent, rehabilitate, and recenter marginalized people and collections. This year, our seminar examines and enacts museum stewardship of material cultures of diverse African communities across space, time, and context. Legacies of colonialism inspire debates on restitution, reparation, and reconciliation, alongside actions to 'decolonize' museum practice. In engaging the politics of representation and human-object relationships, our class will challenge problematic imaginaries of Africa and recenter the complexities of cultures in the Horn of Africa spanning Ethiopia, Nubian Egypt, and Sudan. Students will acquire skills in researching, curating, and installing an exhibition based on Stanford's African archeological and ethnographic materials held at the Stanford University Archeology Collections (SUAC). This course will culminate in a student-curated exhibition that opens on Friday May 27, 2022 at the Stanford Archeology Center (Bldg 500) and is planned to feature renowned Somali-Swedish archeologist, Dr. Sada Mire, as the keynote speaker.nnBecause of limited spacing you will need to fill out this form  https://forms.gle/h8F46iv5iSwiX3PY7 and receive consent to enroll in the course from the instructor.  nn3 credits (no final project) or 5 credits (final project). May be repeat for credit",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29484",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216552",
        "number": "AFRICAST 234",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "235",
        "title": "Designing Research-Based Interventions to Solve Global Health Problems (AFRICAST 135, EDUC 135, EDUC 335, EPI 235, HUMBIO 26, MED 235)",
        "description": "The excitement around social innovation and entrepreneurship has spawned numerous startups focused on tackling world problems, particularly in the fields of education and health. The best social ventures are launched with careful consideration paid to research, design, and efficacy. This course offers students insights into understanding how to effectively develop, evaluate, and scale social ventures. Using TeachAids (an award-winning nonprofit educational technology social venture used in 82 countries) as a primary case study, students will be given an in-depth look into how the entity was founded and scaled globally. Guest speakers will include world-class experts and entrepreneurs in Philanthropy, Medicine, Communications, Education, and Technology. Open to both undergraduate and graduate students.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29694",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214117",
        "number": "AFRICAST 235",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "242",
        "title": "Challenging the Status Quo: Social Entrepreneurs Advancing Democracy, Development and Justice (AFRICAST 142, CSRE 142C, INTNLREL 142, URBANST 135)",
        "description": "This community-engaged learning class is part of a broader Program on Social Entrepreneurship at the Haas Center for Public Service. It will use practice to better inform theory about how innovation can help address societies biggest challenges. Working with the instructor and three visiting nonprofit social entrepreneurs in residence, students will use case studies of successful and failed social change strategies to explore relationships between social entrepreneurship, race, democracy and justice. This course interrogates approaches like design theory, measuring impact, fundraising, leadership, storytelling and policy advocacy and explores how they can address issues like ending homelessness, fighting the COVID-19 pandemic and achieving racial justice, with a particular focus on California. This is a community-engaged learning class in which students will learn by working on projects that support the social entrepreneurs' efforts to promote social change. Students should register for either 3 OR 5 units only. Students enrolled in the full 5 units will have a service-learning component along with the course. Students enrolled for 3 units will not complete the service-learning component. Limited enrollment. Attendance at the first class is mandatory in order to participate in service learning.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class will take place in the DK room at the Haas Center.",
                "classId": "14082",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Janus, K.",
                                "sunet": "kakelly"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "212837",
        "number": "AFRICAST 242",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "248",
        "title": "Religion, Radicalization and Media in Africa since 1945 (AFRICAST 348, HISTORY 248, HISTORY 348, RELIGST 230X, RELIGST 330X)",
        "description": "What are the paths to religious radicalization, and what role have media- new and old- played in these conversion journeys? We examine how Pentecostal Christians and Reformist Muslims in countries such as South Africa, Nigeria, Sudan, and Ethiopia have used multiple media forms- newspapers, cell phones, TV, radio, and the internet- to gain new converts, contest the authority of colonial and post-colonial states, construct transnational communities, and position themselves as key political players.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "220991",
        "number": "AFRICAST 248",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "249",
        "title": "Bodies, Technologies, and Natures in Africa (ANTHRO 348B, HISTORY 349)",
        "description": "This interdisciplinary course explores how modern African histories, bodies, and natures have been entangled with technological activities. Viewing Africans as experts and innovators, we consider how technologies have mediated, represented, or performed power in African societies. Topics include infrastructure, extraction, medicine, weapons, communications, sanitation, and more. Themes woven through the course include citizenship, mobility, labor, bricolage, in/formal economies, and technopolitical geographies, among others. Readings draw from history, anthropology, geography, and social/cultural theory.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219282",
        "number": "AFRICAST 249",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "262",
        "title": "Doing the History of Gender and Sexuality: African Perspectives (FEMGEN 200, HISTORY 200T)",
        "description": "What are gender and sexuality, and how do understandings of these concepts shape human experience across time and space? This course explores major topics in the history of gender and sexuality, with a focus on Africa. Course materials examine a range of themes in African history, including politics and power, marriage and motherhood, fashion and the body, and love and same-sex intimacies. This course forms part of the &quot;Doing History&quot; series: rigorous undergraduate colloquia that introduce the practice of history within a particular field or thematic area.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223357",
        "number": "AFRICAST 262",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "303E",
        "title": "Infrastructure & Power in the Global South (ANTHRO 303E, HISTORY 303E)",
        "description": "In the last decade, the field of infrastructure studies has entered into conversation with area studies, post/colonial studies, and other scholarship on the &quot;Global South.&quot; These intersections have produced dramatic new understandings of what &quot;infrastructures&quot; are, and how to analyze them as conduits of social and political power. This course offers a graduate-level introduction to this recent scholarship, drawing primarily on works from history, anthropology, geography, and architecture.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220228",
        "number": "AFRICAST 303E",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "348",
        "title": "Religion, Radicalization and Media in Africa since 1945 (AFRICAST 248, HISTORY 248, HISTORY 348, RELIGST 230X, RELIGST 330X)",
        "description": "What are the paths to religious radicalization, and what role have media- new and old- played in these conversion journeys? We examine how Pentecostal Christians and Reformist Muslims in countries such as South Africa, Nigeria, Sudan, and Ethiopia have used multiple media forms- newspapers, cell phones, TV, radio, and the internet- to gain new converts, contest the authority of colonial and post-colonial states, construct transnational communities, and position themselves as key political players.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220991",
        "number": "AFRICAST 348",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "AFRICAST",
        "code": "801",
        "title": "TGR Project",
        "description": null,
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29977",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29701",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219625",
        "number": "AFRICAST 801",
        "units": [
            0
        ],
        "totalSections": 2
    }
]