[
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "200",
        "title": "Foundations in Experimental Biology",
        "description": "This course is divided into two 3-week cycles. During the first cycle, students will be developing a 2-page original research proposal, which may be used for NSF or other fellowship applications.  In the second cycle, students will work in small teams and will be mentored by faculty to develop an original research project for oral presentation.  Skills emphasized include: 1) reading for breadth and depth; 2) developing compelling, creative arguments; 3) communicating with the spoken and written word; 4) working in teams. Important features of the course include peer assessment, interactive joint classes, and substantial face-to-face discussion with faculty drawn from across the Biosciences programs. Shortened autumn quarter class; class meets during weeks 1 through 8 of the quarter.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Course runs MWF 10:30a-12:20p. Locations will vary and are listed on course syllabus. On Mondays, lunch will be offered. Shortened course, ends on Wednesday 11/8/2023.",
                "classId": "23981",
                "currentClassSize": "0",
                "maxClassSize": "110",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Li Ka Shing Center,rms101/102",
                        "instructors": [
                            {
                                "name": "Jarosz, D.",
                                "sunet": "jarosz"
                            },
                            {
                                "name": "O'Brien, L.",
                                "sunet": "lucye"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213297",
        "number": "BIOS 200",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "201",
        "title": "Next Generation Sequencing and Applications",
        "description": "Usher in the golden age of biological discovery with next generation sequencing (NGS) through its wide spectrum of applications.  Modules include general introduction of Next Generation Sequencing (NGS) technologies, applications of these sequencing technologies, caveats and comparisons with previous approaches, analysis and interpretation of sequencing data, principles of tools and resources and practical ways to utilize them, and features and pitfalls. Prerequisite: background in molecular biology.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "213638",
        "number": "BIOS 201",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "202",
        "title": "Understanding Kinetics for Biologists and Biology",
        "description": "Students in the biological and chemical sciences are typically exposed to the kinetic and thermodynamic formalisms that describe rate and equilibrium processes, but rarely develop an intuition that allows them to use the material creatively in their own research. This Mini-course is designed to help each student begin to develop this intuition and an ability to evaluate the literature and their own data in terms of kinetic and thermodynamic models. This will be achieved through a combination of interactive lectures, in-class problem-solving, and a tutorial problem set that can be completed individually or in groups.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223452",
        "number": "BIOS 202",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "203",
        "title": "Market Design and Field Experiments for Health Policy and Medicine",
        "description": "This course will provide the student with the necessary tools to be an avid consumer and user, and potentially a producer, of the market design and field experimental literature (recognized by 4 recent Nobel Prizes in Economics: 2007/2012/2019/2020). In the first part, we introduce use of economic theory and analysis to design allocation mechanisms and market institutions, examples include medical resident matching and kidney exchanges. In the second part, it will provide a summary of recent experimental techniques deployed for both research and practice in economics, health/public policy and tech, and detail how to practically gather and analyze data using experimental methods. Emphasis on connecting to practical applications.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "223769",
        "number": "BIOS 203",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "204",
        "title": "Modeling Cell Signaling",
        "description": "Basics of ordinary differential equation modeling of signal transduction motifs, small circuits of regulatory proteins and genes that serve as building blocks of complex regulatory circuits.  Morning session covers numerical modeling experiments.  Afternoon session explores theory underpinning that day's modeling session.  Modeling done using Mathematica, Standard Edition provided to enrolled students.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "27653",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:00:00 PM",
                        "location": "Li Ka Shing Center, rms203/204",
                        "instructors": [
                            {
                                "name": "Ferrell, J.",
                                "sunet": "britta2"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 61200.0,
                        "days": "Sunday"
                    },
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:30:00 AM",
                        "location": "Alway Building, Room M015A",
                        "instructors": [
                            {
                                "name": "Ferrell, J.",
                                "sunet": "britta2"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 41400.0,
                        "days": "Monday Tuesday Wednesday Thursday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": "Class meets in ALWAY M015A all dates except on Friday, 12/8 when class meets in ALWAY M218/218A.",
                "classId": "32344",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:30:00 AM",
                        "location": "Alway Building, Room M015A",
                        "instructors": [
                            {
                                "name": "Ferrell, J.",
                                "sunet": "britta2"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 41400.0,
                        "days": "Monday Tuesday Wednesday Thursday Friday"
                    },
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:00:00 PM",
                        "location": "Li Ka Shing Center, rms203/204",
                        "instructors": [
                            {
                                "name": "Ferrell, J.",
                                "sunet": "britta2"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 61200.0,
                        "days": "Monday Tuesday Wednesday Thursday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "PRA",
                "notes": null,
                "classId": "29499",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:00:00 PM",
                        "location": "Li Ka Shing Center, rms203/204",
                        "instructors": [
                            {
                                "name": "Ferrell, J.",
                                "sunet": "britta2"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 61200.0,
                        "days": "Monday Tuesday Wednesday Thursday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213582",
        "number": "BIOS 204",
        "units": [
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "207",
        "title": "Just Enough Software Engineering",
        "description": "This two week mini-course teaches the software engineering skills relevant to scientific analysis. Students will learn essential skills to promote collaboration, reproducibility, and reliability. Topics: reproducible research compendia. Modular architecture. Documenting data, code, and tools. Debugging, defensive programming, and unit tests. Prerequisites: familiarity with R.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "223773",
        "number": "BIOS 207",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "208",
        "title": "Geometry for biologists",
        "description": "This 3-week mini-course offers a short series of lectures and lab workshops to enable researchers working with biological systems to build and play with geometric models of living processes. Lectures will be aimed at getting participants acquainted with fundamentals of differential geometry through examples of biological structures including filaments, membranes, and tissues. We will introduce the framework of discrete differential geometry with focus on numerically simulating differential equations describing curved geometries. Lab workshops will be aimed at playing with toy problems that utilize available open-source tools. Basic understanding of calculus, and differential equations, and some coding experience would be useful.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224884",
        "number": "BIOS 208",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "209",
        "title": "CTS200-Statistical Design of Experiments for Bioscience",
        "description": "Design of experiment (DOE) techniques are used in a variety of experimental situations to collect and analyze data. In this course, principles of DOE, analytical tools, as well as experimental strategies such as screening designs, full and fractional- factorial designs such as Response surface methods (RSM) will be covered. The applications of these methodologies for optimizing responses and analyzing experimental parameters will be discussed in case studies, specifically for bioscience-related systems. Related statistical software tools such as JMPs will be introduced.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "223772",
        "number": "BIOS 209",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "210",
        "title": "Cell, Gene, and Immune Therapies",
        "description": "The emerging therapeutic landscape has a new cast of characters' engineered cells, programmable nucleic acids, and multi-valent antibodies' to name a few. This lecture-based course will provide an overview of these new therapeutic modalities, the basic science guiding their development, and a discussion of new regulatory and safety challenges that emerge in these modalities. As a final project, students will produce a report spanning the preclinical and clinical development of a new therapy. Examples include CRISPR-edited cell therapies, bispecific T cell engagers, in vivo CRISPR base editors, and antisense oligo therapies.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224878",
        "number": "BIOS 210",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "211",
        "title": "No Pride in Stigma: Exploring viral outbreaks and the stigmas perpetuated against LGBTQ+ communities",
        "description": "This three week mini-course explores virology, emergent outbreaks, and related stigma that has historically and perpetually impacted LGBTQ+ communities. Using lectures and open discussions, students will explore how significant viruses and related stigmas have shaped LGBTQ+ communities from a historical/academic perspective and the generational perspective through lived experiences. Join us on a queer journey through the past and present, and look forward with discussions on how we as LGBTQ+ scientists, practitioners, and allies can shape the future.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224879",
        "number": "BIOS 211",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "213",
        "title": "Ecology and Evolution of Altruism",
        "description": "Altruism is the phenomenon in which one organism helps another organism at a cost to itself. Most of the existing body of research on the evolution of altruism does not account for the ecological context and impacts of the evolution of altruistic traits. In this course we will examine experiments, field studies, and mathematical models on the ecology and evolution of altruism. Students will learn the foundational theories for why altruism evolves, learn how to assess existing models based on whether they are testable and generalizable, and predict how altruistic behaviors shape and are shaped by ecological interactions. This course is open to theoreticians and empiricists.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224880",
        "number": "BIOS 213",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "214",
        "title": "The Art of Science Communication for Graduate Students and Postdocs",
        "description": "How can you communicate science in an impactful way? Over three weeks, learn the art of scientific storytelling from experienced science communicators and influencers through various media like writing, visual illustrations, podcasts, and art performances. Through tailored lectures, panel discussions, and hands-on activities, you will tweak your creativity and explore fun and engaging ways to explain your favorite science topics. You will interact with peers and instructors from various backgrounds to explore the where and how of making science accessible to your audience. Whether you have some or no experience at all, this course is for you.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "223767",
        "number": "BIOS 214",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "215",
        "title": "Stanford SKY Campus Happiness Retreat",
        "description": "Discover the power of the breath to reach a meditative state of mind. Combine meditation with activities that inspire connection and purpose through community building and mindful leadership. Learn through breathwork, meditation, lecture, class discussion, experiential learning, and yoga. The cornerstone of the course is evidence-based SKY Meditation technique that uses the breath to quiet the mind, supporting a deep experience of meditation and a practical approach to happiness.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "Course meets 5/26 from 6pm-9pm and 5/27-5/28 from 10am-1pm in ALWAYM112.",
                "classId": "27133",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "Class meets FSSu 11/10/23 - 11/12/23; 6:30pm - 9:30pm (F), 10am-2pm (SSu) in ALWAY M112.",
                "classId": "25930",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "2:00:00 PM",
                        "location": "Alway Building, Room M112",
                        "instructors": [
                            {
                                "name": "Snyder, M.",
                                "sunet": "mpsnyder"
                            },
                            {
                                "name": "Erwin, G.",
                                "sunet": "gerwin"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 50400.0,
                        "days": "Sunday Saturday"
                    },
                    {
                        "startTime": "6:30:00 PM",
                        "endTime": "9:30:00 PM",
                        "location": "Alway Building, Room M112",
                        "instructors": [
                            {
                                "name": "Snyder, M.",
                                "sunet": "mpsnyder"
                            },
                            {
                                "name": "Erwin, G.",
                                "sunet": "gerwin"
                            }
                        ],
                        "startTimestamp": 66600.0,
                        "endTimestamp": 77400.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223770",
        "number": "BIOS 215",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "216",
        "title": "The Practice of Reproducible Research",
        "description": "This course will cover the basic principles and practices underlying rigorous and reproducible biomedical research, both in the clinic and the lab. Approximately 40% of the course will cover the basic scientific and statistical principles, with an emphasis on elements of design and analysis that pose threats to reproducibility; e.g. multiplicity, selective reporting, design effects, non-random assignment, pseudo-replication and handling of outliers. The remainder of the course will focus on computational approaches to ensure that all data, code, and analyses can be captured in a reproducible workflow, to be confirmed and replicated by you in the future, by other members of your team, and by reviewers and other researchers. We will cover how to satisfy FAIR principles, version control, how to create a git repository, utilize Github and how to create a reproducible dataset. Prerequisites: Basic knowledge of R. Recommended (not required): EPI 202 or 261/262, STATS 60, or MS&amp;E 125",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class meets 2/27/23 - 3/17/23 MWF 10:30am-12:00pm in LK304/305 from 2/27/23 - 3/3/23 and LK306 from 3/6/23 - 3/17/23.",
                "classId": "27773",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "CCSR 4205",
                        "instructors": [
                            {
                                "name": "Goodman, S.",
                                "sunet": "goodmans"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223343",
        "number": "BIOS 216",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "217",
        "title": "Foundations of statistics and reproducible research",
        "description": "Introduction to foundations of rigorous, reproducible research in experimental biology and clinical research. Provides conceptual framework for linking hypotheses to experimental design, quantitative measurement, statistical analysis and assessment of uncertainty. Course combines lecture presentation and discussion of core concepts from statistics and reproducibility with hands-on exposure to best practices for reproducible workflows spanning design, data collection, annotation, analysis and presentation of results. Brief discussion of social, legal, and ethical issues with reproducibility in scientific practice, along with NIH grant requirements. Course provides foundations for future learning in these areas. Examples drawn from multiple areas of experimental biology and clinical research. Target audience: Students in BIOS 200 (Foundations in Experimental Biology), in Biosciences graduate programs or T32 training programs. Prerequisites: None",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class meets MWF 10:30am-12:20pm 11/13/23 - 12/8/23.",
                "classId": "25367",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Alway Building, Room M112",
                        "instructors": [
                            {
                                "name": "Goodman, S.",
                                "sunet": "goodmans"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222806",
        "number": "BIOS 217",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "218",
        "title": "The Evolution of Evolvability",
        "description": "In evolutionary theory, the standard 'fitness' considers the operation of selection over a single generation. Some researchers use a poorly-quantified term, 'evolvability', to describe the latent ability of organisms to evolve over multiple generations. Does evolvability itself evolve? Can we tease apart the concepts of short-term fitness and long-term evolvability? Can we quantitatively define a 'long-term fitness' that is as general and practical as the standard fitness? What entities (individuals? genotypes? species?) can be said to possess evolvability? This seminar will debate these questions as we study papers ranging from theoretical biology, to concepts in &quot;evo-devo&quot;, to recent experimental work in microbiology and in silico models.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224881",
        "number": "BIOS 218",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "219",
        "title": "Early Development Strategies for Neutralizing Antibodies and Brain Permeable Small Molecules",
        "description": "This course will provide students with an overview of current technologies related to the development of small molecules and neutralizing antibodies. Delivered via classroom instruction and a workshop, these modules will aim to increase the fundamental understanding of drug development terminology and processes, combined with real-world examples of discovery therapeutics and technologies developed for translation to clinic. Emphasis will be made on the development of small molecules that can cross the blood-brain barrier and show potential for translation in clinic. Focus will also be put on the screening of antibody targets followed by target validation, target profile development and preclinical evaluation. The workshop will focus on computational molecular docking which is an excellent tool that will help reduce the attrition rate during the drug development process and lead identification studies. Active engagement of the students during the workshop is expected based on the need to install specific software and completion of assigned tasks (computational docking). Students are expected to bring personal laptops to class on day 1 and 2 to perform docking exercises.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class will be held in ALWAYM114, except on Monday, Nov 27 (LK102) and Tuesday, Nov 28 (LK308).",
                "classId": "30693",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "6:00:00 PM",
                        "location": "Alway Building, Room M114",
                        "instructors": [
                            {
                                "name": "Santoro, M.",
                                "sunet": "santoro2"
                            },
                            {
                                "name": "De Souza, C.",
                                "sunet": "cdesouza"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64800.0,
                        "days": "Thursday"
                    },
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "6:00:00 PM",
                        "location": "Li Ka Shing Center, room 308",
                        "instructors": [
                            {
                                "name": "Santoro, M.",
                                "sunet": "santoro2"
                            },
                            {
                                "name": "De Souza, C.",
                                "sunet": "cdesouza"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64800.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32408",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "6:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Santoro, M.",
                                "sunet": "santoro2"
                            },
                            {
                                "name": "De Souza, C.",
                                "sunet": "cdesouza"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "32429",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "30731",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225502",
        "number": "BIOS 219",
        "units": [
            1
        ],
        "totalSections": 4
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "220",
        "title": "Fantastical Pathogenesis: Real-world pathogenesis in fictional media",
        "description": "This mini-course will explore fictional representations of pathogenesis. Students will learn about viruses, parasites, bacteria, fungi, and prions, including specific pathogen lifecycles, methods of transmission, and disease states. Students will view examples of pathogenesis in films, stories, and other media examples, and will discuss the representations of real infectious diseases. Classes will consist of film and media viewings and discussions. Additional materials may be distributed to students as appropriate. No prerequisites are required for this course, but students should note that some films and media feature horror themes and may include some scenes that some may find disturbing.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224882",
        "number": "BIOS 220",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "221",
        "title": "Modern Statistics for Modern Biology (STATS 256, STATS 366)",
        "description": "Application based course in nonparametric statistics. Modern toolbox of visualization and statistical methods for the analysis of data, examples drawn from immunology, microbiology, cancer research and ecology. Methods covered include multivariate methods (PCA and extensions), sparse representations (trees, networks, contingency tables) as well as nonparametric testing (Bootstrap, permutation and Monte Carlo methods). Hands on, use R and cover many Bioconductor packages. Prerequisite: Working knowledge of R and two core Biology courses. Note that the 155 offering is a writing intensive course for undergraduates only and requires instructor consent. (WIM). See https://web.stanford.edu/class/bios221/index.html",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "27656",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "200-203",
                        "instructors": [
                            {
                                "name": "Holmes, S.",
                                "sunet": "sph"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213641",
        "number": "BIOS 221",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "222",
        "title": "Mini-course on big cells",
        "description": "Across taxa, cell size varies 400,000-fold from the tiniest bacterial cells, 0.2 &micro;m in diameter, to the ostrich egg, which spans 8 cm. Why does such diversity exist? How is size regulated? And how do cells of different sizes scale their contents as they grow and divide? Through seminar-style lectures, students will learn about current and historic models of why cell size matters for physiology and function and how the amounts of cellular components are regulated in concert with one another. Drawing from readings, students will design and carry out tractable experiments on diverse, unicellular eukaryotes.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224883",
        "number": "BIOS 222",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "223",
        "title": "Development and reporting of robust and reproducible LC-MS/MS assays",
        "description": "This mini-course offers a series of lectures and hands-on labs to discuss the development and reporting of reproducible quantitative LC-MS/MS molecular assays using a triple quadrupole. We will discuss chromatography and mobile phase selection,  mass spectrometry parameters and selection of fragment ions, and the reporting and interpretation of published methods. Additionally we will cover the use of internal standards and sample preparation, and normalization methods for reproducible data analysis. Students will have the opportunity to work with a mass spectrometer and will design a cohesive plan for a targeted assay of an example molecule in their research.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32409",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "CCSR 4107",
                        "instructors": [],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Enrollment in both sections is required. Section 1 on Tue/Thur is the lecture and section 2 on Wednesdays is the lab portion.",
                "classId": "30694",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "CCSR 4107",
                        "instructors": [
                            {
                                "name": "Chien, A.",
                                "sunet": "allis"
                            },
                            {
                                "name": "Leib, R.",
                                "sunet": "rdleib"
                            },
                            {
                                "name": "Caffrey, E.",
                                "sunet": "ecaffrey"
                            },
                            {
                                "name": "Guiberson, E.",
                                "sunet": "eguiber"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "32430",
                "currentClassSize": "0",
                "maxClassSize": "0",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": "Enrollment in both sections is required. Section 1 on Tue/Thur is the lecture and section 2 on Wednesdays is the lab portion.",
                "classId": "30732",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": "Li Ka Shing Center, room 308",
                        "instructors": [
                            {
                                "name": "Chien, A.",
                                "sunet": "allis"
                            },
                            {
                                "name": "Leib, R.",
                                "sunet": "rdleib"
                            },
                            {
                                "name": "Caffrey, E.",
                                "sunet": "ecaffrey"
                            },
                            {
                                "name": "Guiberson, E.",
                                "sunet": "eguiber"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225508",
        "number": "BIOS 223",
        "units": [
            1
        ],
        "totalSections": 4
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "224",
        "title": "Stem Cell Biology and Applications",
        "description": "A variety of stem cells harbor different properties appropriate for various types of research. We will cover the molecular characteristics of totipotent, pluripotent, multipotent, and unipotent stem cells. This knowledge will form the foundation for us to explore the use of stem cells in developmental biology and translation research. As an application, we will focus on genome editing technologies and in vitro models of cardiovascular disease.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class meets in LK 120 all dates except Friday, 3/1 when class meets in LK 130.",
                "classId": "32432",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "2:00:00 PM",
                        "endTime": "4:00:00 PM",
                        "location": "School of Medicine Room",
                        "instructors": [],
                        "startTimestamp": 50400.0,
                        "endTimestamp": 57600.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225503",
        "number": "BIOS 224",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "225",
        "title": "Diversity and Inclusion in STEMM",
        "description": "Introduction to the social science literature on factors contributing to gender disparities in the scientific workplace (e.g. implicit bias and stereotype threat). Discussions focus on steps that individuals and institutions can take to promote the advancement of women and other underrepresented groups in science, and thus promote the advancement of science.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Course meets 5/23-6/9 TThF from 10:30am-11:50am in MSOBX303.",
                "classId": "27711",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215000",
        "number": "BIOS 225",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "226",
        "title": "Web3, AI, and Digital Health",
        "description": "This interdisciplinary course explores the convergence of Web3 technologies, artificial intelligence (AI), and their transformative impact on the field of digital health. Students will examine the potential of decentralized systems, blockchain, and smart contracts to enhance health data privacy, security, and interoperability. Through case studies and hands-on projects, they will gain insights into AI-driven solutions for personalized healthcare, remote patient monitoring, medical image analysis, and clinical decision support. Additionally, students will critically analyze ethical and regulatory considerations in the context of Web3 and AI applications, fostering a deeper understanding of the future of digital health innovation.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32415",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Li Ka Shing Center, rms205/206",
                        "instructors": [],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225484",
        "number": "BIOS 226",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "227",
        "title": "Mass Spectrometry and Proteomics: Opening the Black Box",
        "description": "Focus on designing and analyzing effective proteomics experiments using mass spectrometry and critically evaluating published mass spectrometry-based studies and datasets. Introduces students to the instrumentation, experimental strategies, and computational methods used for identifying and quantifying proteins and protein post-translational modifications using mass spectrometry. Topics include comparative evaluation of mass spectrometer instrument configurations, tandem mass spectrum interpretation, relative and absolute quantitation, and proteome-scale data set analysis. Laboratory time will focus on sample preparation methods, real-time data acquisition, and data analysis software and techniques.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Course meets 3/13-3/24 MWF for lecture in AlwayM114 from 9:30am-10:30am and 3/13-3/17 MWF for lab in AlwayM208/208A/AlwayM212/212A from 1:30pm-4:20pm (with the exception of 3/15 that is only reserved in M208/208A) and then 3/20-3/24 MWF in AlwayM112 from 1:30pm-4:20pm.",
                "classId": "27760",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Alway Building, Room M108",
                        "instructors": [
                            {
                                "name": "Pitteri, S.",
                                "sunet": "spitteri"
                            },
                            {
                                "name": "Mallick, P.",
                                "sunet": "paragm"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "32427",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "2:20:00 PM",
                        "location": "Li Ka Shing Center, rms304/305",
                        "instructors": [
                            {
                                "name": "Pitteri, S.",
                                "sunet": "spitteri"
                            },
                            {
                                "name": "Mallick, P.",
                                "sunet": "paragm"
                            }
                        ],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 51600.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "LBS",
                "notes": null,
                "classId": "32428",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "2:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Alway Building, Room M218/218A",
                        "instructors": [
                            {
                                "name": "Pitteri, S.",
                                "sunet": "spitteri"
                            },
                            {
                                "name": "Mallick, P.",
                                "sunet": "paragm"
                            }
                        ],
                        "startTimestamp": 52200.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215001",
        "number": "BIOS 227",
        "units": [
            2
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "228",
        "title": "Understanding Chemistry in Biology and Biological Experiments",
        "description": "Chemical transformations are central to biology and function and chemical methods provide some of the most powerful tools for everyday experimental biology. Focuses on the concepts and principles underlying biological chemical transformations, allowing students to generalize and understand cell metabolism and regulation. Topics include basic principles and procedures to evaluate and utilize in practice chemical approaches in biological experiments. In-class problems and evaluation of literature. Three-week mini-course.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "215139",
        "number": "BIOS 228",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "229",
        "title": "Open Source Prototyping: Translating Ideas to Reality using Rapid Prototyping Methods",
        "description": "&quot;Open Source Prototyping&quot; is a hands-on course that equips students with the skills and knowledge to use open-source design tools and rapid prototyping technologies, such as 3D printing and CNC. Students will learn how to translate their ideas into real-world objects, understanding the full process from ideation to realization. Key topics include navigation of leading design software, 3D printing technologies, and in-depth understanding of materials science. The course emphasizes open-source principles, and their applications in additive manufacturing. It features a wide range of applications, including medical devices, lab equipment, and experimental apparatuses, providing a comprehensive look at prototyping potential.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30688",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "CCSR 4107",
                        "instructors": [],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 48000.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "30733",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Alway Building, Room M206",
                        "instructors": [],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 53400.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225486",
        "number": "BIOS 229",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "230",
        "title": "Successful Fieldwork in Global Health Research",
        "description": "This two-day workshop focuses on how to successfully implement fieldwork in global health research. After this class, students will have a detailed plan for their fieldwork, including entering and exiting the field, ethical concerns, impact, safety, equitable partnerships, and preparing for the unexpected. The course builds on student-led active learning techniques, with invited guest speakers who share their fieldwork experiences. The course is open to advanced graduate students and postdocs who have developed a research question and design for global health research. Students are recommended but not required to take the course &iquest;Practical Approaches to Global Health Research&iquest; (MED226/INTLPOL290/EPI237) beforehand.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30685",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "4:20:00 PM",
                        "location": "Li Ka Shing Center, room 306",
                        "instructors": [
                            {
                                "name": "Hannebelle, M.",
                                "sunet": "hannebel"
                            },
                            {
                                "name": "Shaker, K.",
                                "sunet": "kians"
                            },
                            {
                                "name": "Svallfors, S.",
                                "sunet": "signes"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "4:20:00 PM",
                        "location": "Alway Building, Room M212/212A",
                        "instructors": [
                            {
                                "name": "Hannebelle, M.",
                                "sunet": "hannebel"
                            },
                            {
                                "name": "Shaker, K.",
                                "sunet": "kians"
                            },
                            {
                                "name": "Svallfors, S.",
                                "sunet": "signes"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 58800.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225505",
        "number": "BIOS 230",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "231",
        "title": "Public Speaking Bootcamp: How to Give a Stronger Presentation",
        "description": "Everyone has fears presenting in front of a crowd. But with practice, self-awareness and preparation you can put those fears aside and make a real impact with your message. Utilizing professional theater practices and tricks, this course is a deep dive into what makes a presentation work. Get a chance to explore your own presentation style and address your questions and challenges with public speaking in a safe and fun space. The course is taught by Michileen Marie Oberst, a Professional director and actor in the Bay Area whose background includes teaching at the Tony Award winning TheatreWorks Silicon Valley.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "Class meets TTh 4:30pm-6:30pm 3/6/23 - 3/10/23 in MSOB140 and 3/13/23 - 3/24/23 in LK306.",
                "classId": "27514",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "Alway Building, Room M218/218A",
                        "instructors": [
                            {
                                "name": "Jarosz, D.",
                                "sunet": "jarosz"
                            },
                            {
                                "name": "Oberst, M.",
                                "sunet": "mmoberst"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223768",
        "number": "BIOS 231",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "233",
        "title": "Experimental Metagenomics: Nectar Microbes as a Model System",
        "description": "Preference to graduate students and post-docs; open to upper-level undergraduates with instructor consent. Emphasis on developing a practical understanding of how to conduct metagenomic research by combining cutting-edge molecular sequencing with experimental ecological approaches. Focuses on the community ecology of the bacterial and yeast species that colonize floral nectar via pollinators and the implications for plant-pollinator interactions within an agriculturally relevant framework. Ecological, evolutionary, and phylogenetic principles and microbiological and molecular techniques that will be taught are broadly applicable in many biological fields, including the medical ecology of hte human microbiome. Inquiry-based  with individual student-led projects.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "215963",
        "number": "BIOS 233",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "234",
        "title": "21st Century Approaches to Neglected Tropical Diseases",
        "description": "The World Health Organization defines Neglected Tropical Diseases as &quot;a diverse group of conditions that are mainly prevalent in tropical areas, where they mostly affect impoverished communities and disproportionately affect women and children.&quot; Notably, the vast majority of NTDs are infectious diseases. While the average American never is plagued by these diseases, COVID-19 has opened our eyes to taking a more global approach to health,  and emphasized the importance of investing in infectious disease research. Through this course, students will discuss and understand how and why infectious diseases have become &quot;neglected&quot; and the modern approaches currently being taken at Stanford and beyond to combat NTDs.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30346",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224363",
        "number": "BIOS 234",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "235",
        "title": "Foundations of Computer Science: What the Tutorial Didn't Tell You",
        "description": "The course provides non-computer-science students with a comprehensive understanding of computer science and software engineering principles for efficient code in modern scientific computing. Students gain theoretical knowledge and practical skills to advance programming proficiency and develop robust software systems. Upon completion, students have foundational knowledge in computer science, capable of writing better code for scientific computing. They gain expertise in selecting tools, designing modular software systems, and following best coding practices. They understand the importance of testing and version control in software development, ready to tackle advanced programming challenges in scientific applications. Prerequisites: Familiarity with a high-level programming language.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class meets in LK 306 on Mondays and Fridays, ALWAY M208/208A on Wednesdays and Thursdays, and LK 209 on Tuesdays.",
                "classId": "30682",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Li Ka Shing Center, room 209",
                        "instructors": [
                            {
                                "name": "Bellagio, T.",
                                "sunet": "tbellg"
                            },
                            {
                                "name": "Exposito-Alonso, M.",
                                "sunet": "moiea"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Li Ka Shing Center, room 306",
                        "instructors": [
                            {
                                "name": "Bellagio, T.",
                                "sunet": "tbellg"
                            },
                            {
                                "name": "Exposito-Alonso, M.",
                                "sunet": "moiea"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Friday"
                    },
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Alway Building, Room M208/208A",
                        "instructors": [
                            {
                                "name": "Bellagio, T.",
                                "sunet": "tbellg"
                            },
                            {
                                "name": "Exposito-Alonso, M.",
                                "sunet": "moiea"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Wednesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225504",
        "number": "BIOS 235",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "236",
        "title": "Developmental Biology in the Ocean: Comparative Embryology and Larval Development",
        "description": "Three-week course at Hopkins Marine Station. Focuses on the embryology and larval development of a broad range of marine invertebrate phyla. The goal of the course is to give students an appreciation of the range of developmental strategies and larval forms in the ocean and why this is critical for constructing hypotheses of EvoDevo and animal evolution. Includes observation and documentation of the development of embryos and larvae by scientific illustration and photo/video microscopy. Pre-requisite: Developmental Biology coursework and instructor consent.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "29451",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215977",
        "number": "BIOS 236",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "237",
        "title": "Engineering Wellness",
        "description": "This 3-week course will help students understand how lifestyle and wellness choices impact physiology using a data-driven approach powered by wearable technology. Each student will be given an Oura ring to use during the course. On Mondays and Wednesdays, we will learn evidence-based practices for mental health and well-being, and on Fridays engineers from Oura, Apple, and Fitbit will teach the students about wearable data sensors and analysis. Students will assess their own smartwatch data to look at real-time physiological responses to wellness interventions such as exercise, awareness meditation, laughter yoga, and inquiry-based stress reduction. This course will bring in academic experts and popular wellness leaders. Last year's teachers included Byron Katie, Deepak Chopra, MD, Madan Kataria, MD the founder of Laughter Yoga, Michael Snyder, PhD, James Doty, PhD, Lindsay Briner, and George Slavich, PhD, to learn about cutting edge research and innovation in mental health, and to experience these practices firsthand through immersive workshops. The capstone project of the course will involve analyzing your own personal wearable device data to quantify the physiological impact of BIOS 237. Due to the high demand for this unique three-week course, we are accepting students on a first-come, first-served basis. Complete and confirm the form promptly to secure your spot: https://docs.google.com/forms/d/e/1FAIpQLSfoIR6-VLvLQKvFGWrrCv2StSQYN2qgsqp-AcTMhBjadby7MQ/viewform?usp=sf_link",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32404",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Alway Building, Room M112",
                        "instructors": [],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class meets in LK 120 on Monday and in ALWAY M114 on Wednesday/Friday (Monday, Dec. 4 we are in LK 101).",
                "classId": "28453",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Alway Building, Room M114",
                        "instructors": [
                            {
                                "name": "Snyder, M.",
                                "sunet": "mpsnyder"
                            },
                            {
                                "name": "Ganz, A.",
                                "sunet": "abganz"
                            },
                            {
                                "name": "Lautman, Z.",
                                "sunet": "lautman"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Wednesday Friday"
                    },
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Li Ka Shing Center, room 120",
                        "instructors": [
                            {
                                "name": "Snyder, M.",
                                "sunet": "mpsnyder"
                            },
                            {
                                "name": "Ganz, A.",
                                "sunet": "abganz"
                            },
                            {
                                "name": "Lautman, Z.",
                                "sunet": "lautman"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224362",
        "number": "BIOS 237",
        "units": [
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "238",
        "title": "Principles and Techniques for Data Visualization",
        "description": "This course offers students the tools to build graphs and other visualizations that clearly and effectively communicate complex data or concepts, via a series of lectures and hands-on workshops. Students will build both an understanding of the theory behind designing elegant data visualizations, and a set of tools to apply these concepts to their own data. Topics include: choosing effective visualization formats, designing for accessibility, organizing figures to tell a story, building data visualizations in R (no prior R experience necessary).",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30267",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223859",
        "number": "BIOS 238",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "239",
        "title": "Science Ethics: More Than Just Experiments",
        "description": "We will cover the philosophical framework of bio(medical)ethics and good scientific practice in daily modules. The itinerary includes the History of Bioethics, Formal Logic, Moral Philosophy (Virtue Ethics, Utilitarianism, Deontology, Feminist Ethics), Medical &amp; Bioethics, Animal Welfare, Good Scientific Practice, and Science Ethics.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Class meets MTWThF 3/6/23 - 3/24/23 from 6:00pm-7:20pm in LK308.",
                "classId": "27776",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Thome, C.",
                                "sunet": "cthome"
                            },
                            {
                                "name": "Sudhof, T.",
                                "sunet": "tcs1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30345",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224354",
        "number": "BIOS 239",
        "units": [
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "240",
        "title": "A Comprehensive Practical Guide to RNA Sequencing",
        "description": "RNA sequencing (RNAseq) is a powerful and increasingly popular tool that is used to investigate a variety of biological questions across the tree of life.  However, while commercially available solutions have made the bench work associated with RNAseq easier than ever, the planning and analysis of an RNAseq experiment require considerable bioinformatics knowledge.  In this course,  students will learn how to design and analyze both single cell and bulk RNAseq experiments with topics including: quality control, mapping, read counting, identification of differentially expressed genes, gene set enrichment analysis, clustering and annotation, pseudotime, and advanced topics. Computer lab workshops will be incorporated to supplement lecture material and allow students to work on their own data.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Course meets M/Th 5/22-6/8 (no meeting 5/29 due to Labor Day) for lecture from 5pm-6:30pm in LK120 (Mondays) and ALWAYM106 (Thursdays), and Fridays 5/26-6/9 for lab from 1pm-2pm in LK120.",
                "classId": "27430",
                "currentClassSize": "0",
                "maxClassSize": "65",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": "Course meets M/Th 5/22-6/8 (no meeting 5/29 due to Labor Day) for lecture from 5pm-6:30pm in LK120 (Mondays) and ALWAYM106 (Thursdays), and Fridays 5/26-6/9 for lab from 1pm-2pm in LK120.",
                "classId": "27429",
                "currentClassSize": "0",
                "maxClassSize": "65",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224355",
        "number": "BIOS 240",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "241",
        "title": "Data Wrangling with Bash",
        "description": "This one week course workshops writing bash scripts to reproducibly clean-up and transform raw data for analysis. Topics include introduction to bash, command-line tools for data manipulation, and best practices for scripting. Students will automate conversion of their own raw data to an input format for analysis. No prerequisites.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "One of the more tedious yet critical steps in the research pipeline is cleaning and preprocessing raw data for analysis. This one-week course workshops writing bash scripts to reproducibly clean-up and transform raw data for analysis. Topics include introduction to bash, command-line tools for data manipulation, and best practices for scripting. Students will automate converting their own raw data to an input format for analysis. No prerequisites. Class meets MTWThF 12/5/22 - 12/9/22 10:00am-12:00pm in LK205/206.",
                "classId": "26138",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Payne, C.",
                                "sunet": "cypayne"
                            },
                            {
                                "name": "Schumer, M.",
                                "sunet": "schumer"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224356",
        "number": "BIOS 241",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "242",
        "title": "Writing Compelling Fellowships and Career Development Awards",
        "description": "An overview of principles and fundamentals for writing competitive fellowships (e.g. NIH F31, F32) and career development awards (e.g. NIH K Awards). Topics include: developing specific aims and career development plans; using the review criteria to inform writing; timelines and resources. Participants develop proposals through guided exercises with an emphasis on in-class peer review and focused faculty feedback.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "24005",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:30:00 PM",
                        "location": "Li Ka Shing Center, room 306",
                        "instructors": [
                            {
                                "name": "Gullberg, R.",
                                "sunet": "rgullber"
                            },
                            {
                                "name": "Quinn, M.",
                                "sunet": "mkquinn"
                            },
                            {
                                "name": "Botham, C.",
                                "sunet": "cbotham"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 59400.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216249",
        "number": "BIOS 242",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "243",
        "title": "An Excuse to Sleep: The Science of Sleep and Health",
        "description": "This mini-course will explore the &iquest;What&iquest; and &iquest;Why&iquest; of sleep, with emphasis on the role of sleep in human health and wellbeing. Sleep is universal in Nature, but there is still no consensus on its function. Over 3 weeks, students will study the foundations of sleep science through a combination of lecture and discussion of published research articles. The course will approach the topic of sleep and health from multiple levels&iquest; brain, body, mind, and society. Topics will include: sleep and circadian physiology, sleep science methodologies, functions of sleep, and the impact of social factors on sleep health.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32410",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Alway Building, Room M108",
                        "instructors": [],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225487",
        "number": "BIOS 243",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "244",
        "title": "Applied Artificial Intelligence in Health Care",
        "description": "Artificial Intelligence (AI) platforms are now widely available, and often require little training or technical expertise. This mini-course focuses on responsible development and use of AI in healthcare. Focus is on the critical analysis of AI systems, and the evolving policy and regulatory landscape. Week one covers modern AI capabilities, including computer vision, natural language processing, and reinforcement learning. Weeks two and three focus on assessing AI systems (including robustness, bias, privacy, and interpretability) and applications (including radiology, suicide prevention, and end-of-life care). Throughout this course students will develop and evaluate a hypothetical AI system. No programming experience is required.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class meets: May 22nd-June 9th, 2023 (no class May 29 due to Memorial Day) MTWThF from  12:30-1:20pm in LK308 unless otherwise noted below:n- 5/22: CCSR4205n- 5/23: LK203/204n- 5/30: LK203/204n- 6/6: LK203/204.",
                "classId": "27431",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McElfresh, D.",
                                "sunet": "dmcelfre"
                            },
                            {
                                "name": "Tamang, S.",
                                "sunet": "stamang"
                            },
                            {
                                "name": "Periyakoil, V.",
                                "sunet": "vyju1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30506",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "2:00:00 PM",
                        "endTime": "4:00:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 50400.0,
                        "endTimestamp": 57600.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224357",
        "number": "BIOS 244",
        "units": [
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "245",
        "title": "Bioscience Classroom Design Workshop",
        "description": "This course is intended for graduate students and postdocs who are interested in learning how to effectively build course curriculums, manage classrooms, and engage with students. Participants will develop and practice skills for effective course organization through mini-lectures, peer workshops, and development of a lecture plan for a one-off session on a topic of their choice. Workshop topics will include course design principles, effective student engagement, and creative classroom approaches. Participants who complete the course will have the option to lead session for undergrad audience in Spring session of BIO114C with priority over other applicants.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "Class meets 3/6/23 - 3/24/23 MW 3:00pm-5:00pm in CCSR4205.",
                "classId": "27777",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hammond, T.",
                                "sunet": "taylar"
                            },
                            {
                                "name": "Nichols, E.",
                                "sunet": "enichol3"
                            },
                            {
                                "name": "Schumer, M.",
                                "sunet": "schumer"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224358",
        "number": "BIOS 245",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "246",
        "title": "A Practical Guide to Success in Science",
        "description": "Science is hard, in part because it is a search of the unknown, and in part because there is no handbook. This short workshop provides tips and strategies, collected over years from mentors, students and colleagues. These strategies will help your science and also help you, for example learning to identify and respect boundaries between work and vacation and how to bring (a bit of) joy to your everyday life as a scientist.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "Class meets MWF 3/6/23 - 3/10/23 from 2:00pm-5:00pm on 3/6/23 & 3/10/23 in Alway M106 and 3/8/23 in Beckman Center B402.",
                "classId": "27778",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Herschlag, D.",
                                "sunet": "herschla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224359",
        "number": "BIOS 246",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "247",
        "title": "Whole-genome sequencing and applications: from yeast to fruit flies",
        "description": "Analyzing Illumina whole-genome sequencing data is an integral part of many fields of biology research, but finding and implementing a computational pipeline can be difficult for newcomers. We will provide experimental evolution data generated from our studies of yeast and fruit flies. Students will learn to process raw sequencing data, determine mutations, and plot results, including Manhattan plots. Prerequisite: some experience/background in molecular biology.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "32411",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225488",
        "number": "BIOS 247",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "248",
        "title": "From ensembles to allostery: A new view of allosteric control",
        "description": "This course will present foundational energetic principles and then have a series of case studies, presented by student groups, that aim to learn what's known about allostery and transform our understanding of these systems from descriptive to understanding based on energy landscapes and thermodynamic principles. In addition to learning about allosteric systems, course participants will learn how to build and evaluate models based on physical, molecular properties.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224360",
        "number": "BIOS 248",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "249",
        "title": "Single-cell Spatial-omics: with Applications to Stem Cell Engineering and Cancer Immunotherapy",
        "description": "With many technological breakthroughs in the past decade, single-cell biology has blossomed in many fields, enabling us to ask questions that were not possible before. However, many of the single-cell biology technologies include a dissociation step, which destroys the crucial spatial information. Therefore, a new wave of technology focusing on single-cell spatial-omics emerges to overcome this challenge. This course will explore seminal and new experimental and computational strategies employed in both the conventional single-cell omics and the new single-cell spatial-omics, emphasizing applications to stem cell engineering and cancer biology. We will teach you how to design and analyze single cell-omics data, using questions and data from stem cell biology and cancer biology to provide the motivational background. Basic stem cell and cancer biology will be covered. Pivotal studies regarding cell identity and single-cell biology will drive discussion on the fidelity of engineered cell populations and the challenges of understanding cell fate decisions.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class meetings are as follows - Lectures: Wednesday, 11/30 from 10:30a-11:25a in LK308, Thursday, 12/1 from 10:30a-11:30a in LK205/206, Tuesday, 12/6 from 10:30a-11:30a in LK308, and Thursday, 12/8 from 10:30a-11:30a in LK304/305| Labs: Thursday, 12/1 from 1:30p-2:35p in M214/214A and Thursday, 12/8 from 1:30p-2:35p in M214/214A.  This class section has been cancelled!",
                "classId": "26140",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": "This class section has been cancelled!",
                "classId": "26139",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224361",
        "number": "BIOS 249",
        "units": [
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "250",
        "title": "An Introduction to Mathematical Modeling for Ecology",
        "description": "This course provides an introduction to understanding, creating and analyzing mathematical models in ecology. We will cover different types of mathematical models, as well as their components, with a focus on foundational models in ecology, such as the Leslie population model, the Lotka-Volterra predator-prey model and SIR disease models. By the end of the course, you will be able to formulate and modify equations, and create diagrams to describe well-defined ecological processes. Finally, you will be able to use simple algebra and R to explore model results. No prior experience is required.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30689",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "CCSR 4107",
                        "instructors": [
                            {
                                "name": "Pourtois, J.",
                                "sunet": "jp22"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225489",
        "number": "BIOS 250",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "251",
        "title": "Explorations on the Culture of Science, Science Identity, and Society",
        "description": "This course will examine the historical and contemporary roles that the cultural norms and practices across STEM domains (&iquest;Culture of Science&iquest;) have played in advancing persistent gender and racial/ethnic STEM inequities in the postsecondary context and beyond.  By doing so this course will allow students to employ an interdisciplinary lens to begin to critically explore the impact that &quot;Culture of Science&quot; may have on the development and expression an individual's &quot;Science Identity&quot;.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32412",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:50:00 PM",
                        "location": "ALWAYM015C",
                        "instructors": [],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 60600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225490",
        "number": "BIOS 251",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "252",
        "title": "Data Visualization and Publishing",
        "description": "Publishing research findings is a vital part of the scientist skill set. With the advent of big data and machine learning, understanding the key principles of analyzing, visualizing, and publishing data is becoming increasingly important. This course covers practical skills which are typically only learned in practice or specialized workshops. Topics include the importance, ethics, and pitfalls of data cleaning, analysis, visualization, reporting, and publishing.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32413",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:50:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 82200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "32431",
                "currentClassSize": "0",
                "maxClassSize": "0",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Alway Building, Room M206",
                        "instructors": [],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225491",
        "number": "BIOS 252",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "253",
        "title": "Primary concepts in Bioinformatics- To Make Sense Of large scale  Biological and Biomedical Data",
        "description": "Every biological problem to be nowadays in cancer biology, stem cell research, biological drug discovery or predictive disease modeling requires a large-scale bioinformatics analysis to make deeper insights leading to therapeutics and drug development.  This course will start with a brief introduction in bioinformatics and then focus on key computational techniques and algorithms used to studying different areas like Genome Wide Association studies in psychiatric disorders, supervised and unsupervised machine learning approaches to make sense of biological image, single-cell perturbation data to biomarker discovery in cancer.  The course will have some hands-on analysis components with both bulk and single cell RNA sequencing data with context to some disease models and organismal systems.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30687",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:30:00 PM",
                        "location": "Alway Building, Room M206",
                        "instructors": [
                            {
                                "name": "Mam, B.",
                                "sunet": "bhavika7"
                            },
                            {
                                "name": "Goswami, A.",
                                "sunet": "ag111"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 45000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225492",
        "number": "BIOS 253",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "254",
        "title": "DataLucence::Images",
        "description": "Increasingly, research in the biosciences involves data in digital formats and scientists spend a significant fraction of their time building and using software to harvest insight from digital data. A central goal of this course is to expose students to concepts adopted from computer science and data science regarding data management, data curation, and analytical workflows for analyzing digital data. We will focus on digital images since this image type is used in diverse sub-fields in the biosciences. The course will consist of a two-day workshop/lab&iquest;SoftwareCarpentry&iquest;and six DataLucence::Images+Hackathon class meetings.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class will be held in LK203/204, except for Wednesday, Nov 29 (LK304/305) and Wednesday, Nov 6 (LK306).",
                "classId": "31066",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:30:00 AM",
                        "location": "Li Ka Shing Center, rms203/204",
                        "instructors": [
                            {
                                "name": "Goodman, M.",
                                "sunet": "mbgoodmn"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 41400.0,
                        "days": "Monday Tuesday Thursday"
                    },
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:30:00 AM",
                        "location": "Li Ka Shing Center, rms304/305",
                        "instructors": [
                            {
                                "name": "Goodman, M.",
                                "sunet": "mbgoodmn"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 41400.0,
                        "days": "Wednesday"
                    },
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:30:00 AM",
                        "location": "Li Ka Shing Center, room 306",
                        "instructors": [
                            {
                                "name": "Goodman, M.",
                                "sunet": "mbgoodmn"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 41400.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": "Optional Open Coding Studio.",
                "classId": "31487",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218514",
        "number": "BIOS 254",
        "units": [
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "255",
        "title": "Solar energy conversion and storage",
        "description": "This course introduces different technologies for harvesting and storing solar energy, the most abundant source of renewable energy on earth. This course will cover ways to generate electricity (solar cells) and molecular fuels (biofuels and solar fuels) and the key solutions for short and long-term solar energy storage, including batteries, supercapacitors, electrolyzers, and fuel cells. For each topic, we will cover the existing and emerging technologies, how they work, what role they fill in the energy transition, and how they need to be improved. Students will give a final presentation where they cover a technology or proposed technology of their choosing.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30678",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "8:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Alway Building, Room M106",
                        "instructors": [
                            {
                                "name": "Sachs, M.",
                                "sunet": "sachsm"
                            },
                            {
                                "name": "Al Zubeidi, A.",
                                "sunet": "alex8"
                            }
                        ],
                        "startTimestamp": 30600.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225493",
        "number": "BIOS 255",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "256",
        "title": "Sculptural Data Illustrations",
        "description": "Mini-course. Students will use learn make and print 3D models of their data to use as a focal point when describing their project. We will teach the students how to use Autocad and Blender to process existing data sets and students are encouraged to bring their own data.  We strive to make wearable models to enable instant mini-lectures any place and anytime.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "218427",
        "number": "BIOS 256",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "257",
        "title": "HIV: The Virus, the Disease, the Research",
        "description": "Mini-Course. Medical students, graduate students in biological sciences, undergraduate students with strong biological background. Topics: Immunopathogenesis, immune deficits, opportunistic infections including TB, and malignancies; Genomics viral genetic analyses that have traced the origin of HIV-1 and HIV-2 to primates, dated the spread of infection in humans, and characterized theevolution of virus within infected individuals; Antiretroviral drug development identification of drug targets, structure-based drug design, overcoming drug resistance; Challenges of vaccine development; Public health strategies.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "218430",
        "number": "BIOS 257",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "258",
        "title": "Reproducibility through effective coding and data management",
        "description": "This course introduces science reproducibility through effective coding and data management. Students will complete team projects on a statistical or simulation topic of their choosing and publish them on GitHub. Instructors will guide students in learning to use R, R markdown, and GitHub to collaborate with peers as they advance their project. By the end of the course, students will learn effective coding practices, data management, version control and collaboration, and sharing analytical results. The course aims to provide students with the tools and knowledge to help make their research reproducible and easily accessible. No prerequisites required.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "30675",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": "Alway Building, Room M108",
                        "instructors": [
                            {
                                "name": "Nell, L.",
                                "sunet": "lnell"
                            },
                            {
                                "name": "Warren, M.",
                                "sunet": "mlwarren"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225494",
        "number": "BIOS 258",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "259",
        "title": "The Art of Reproducible Science: A Hands-on Approach",
        "description": "This mini-course is designed to equip graduate students and postdocs with essential skills for ensuring reproducibility in computational research. Through practical exercises and interactive sessions, participants will learn best practices, tools, and techniques for doing open and reproducible research. Topics covered include version control, containerization, data management, workflows, and documentation strategies. This course empowers students to overcome challenges associated with reproducibility, fostering rigorous scientific inquiry, and enhancing the credibility and impact of their computational work, while also exploring the primary causes and consequences of irreproducibility in research. Participants will gain valuable insights and practical experience in achieving computational reproducibility across various domains, including biology.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32414",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "2:00:00 PM",
                        "location": "Alway Building, Room M218/218A",
                        "instructors": [
                            {
                                "name": "Adimoelja, A.",
                                "sunet": "alvinaa"
                            },
                            {
                                "name": "Khan, A.",
                                "sunet": "azizk"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 50400.0,
                        "days": "Monday Tuesday Wednesday Thursday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225495",
        "number": "BIOS 259",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "260",
        "title": "Peds Endo Journal Club Course",
        "description": "The Pediatrics Endocrinology Journal Club Course aims to provide a platform for trainees in the division to discuss key literature discoveries in the general field of endocrinology and diabetes. Each student will discuss with the primary instructors to determine a topic or a specific research article to present. In each class, one student will present an introduction of their topic of choice in the first half. In the second half, the primary instructors will serve as facilitators to engage the group and discuss details and future directions of the topic.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28372",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223718",
        "number": "BIOS 260",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "261",
        "title": "Rigor and reproducibility in biological research: collection, analysis and use of biological data",
        "description": "The deluge of data common in modern biological research poses new challenges for ensuring reproducibility and collaboration at many levels. High-powered computational and statistical tools are becoming as indispensable as pipettes and flasks,  demanding a rethinking of what it means to be rigorous and reproducible in the generation, visualization, and interpretation of results. In this mini-course, we will explore key concepts in how data should be stored, analyzed, manipulated, and presented using computational tools such as the Python programming language and GitHub version control software at a hands-on level, guiding students through a mini research project. This is an introductory course that assumes no previous knowledge of programming or statistics, and is especially relevant for students or postdocs interested in developing a skill set for quantitative biology.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30677",
                "currentClassSize": "0",
                "maxClassSize": "21",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "Li Ka Shing Center, room 209",
                        "instructors": [
                            {
                                "name": "Chure, G.",
                                "sunet": "gchure"
                            },
                            {
                                "name": "Mathur, S.",
                                "sunet": "shailim"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225496",
        "number": "BIOS 261",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "262",
        "title": "Fantastic beasts and where to find them: Biology with non-model organisms",
        "description": "This 3-week mini-course will dive into the biology of non-model organisms, and the approaches we can use to study them. Traditionally in Biology, model organisms have been used to answer new questions. Yet, studying a more diverse array of organisms can lead to new discoveries. We will explore the world of non-model Biology through a series of short lectures, primary literature discussions, talks from experts working on non-model organisms, and some practical sessions including a field sampling. No prerequisites required.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32405",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Li Ka Shing Center, rms205/206",
                        "instructors": [],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225497",
        "number": "BIOS 262",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "263",
        "title": "Applied Grant-Writing Skills for Fellowships",
        "description": "Graduate students in the Biosciences PhD Programs develop a fellowship proposal (e.g. NIH F31) focusing on required documents: 1-page specific aims as well as research and career development plans. Students establish a writing practice and learn fundamental grant writing skills through guided exercises, including in-class review and focused faculty feedback.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "25922",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gullberg, R.",
                                "sunet": "rgullber"
                            },
                            {
                                "name": "Quinn, M.",
                                "sunet": "mkquinn"
                            },
                            {
                                "name": "Botham, C.",
                                "sunet": "cbotham"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 54000.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218958",
        "number": "BIOS 263",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "264",
        "title": "Answering biological questions with Metagenomic Data",
        "description": "Metagenomic datasets capture the full genomic complement of microbial communities within a sample and thus have broad applications in environmental microbiology, human health, and evolutionary biology. In this three-week minicourse, students will learn both the principles and practice of metagenomics, implementing a standard computational workflow that begins with sequencing reads and concludes with basic genome analysis. Students will also gain hands-on experience with the command line, high-performance computing, and common bioinformatic tools/data types. Overall, the course will teach students how to interrogate metagenomic data to answer questions about microbial diversity, abundance, and gene content. It is open to those with any level of programming experience.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30681",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "4:00:00 PM",
                        "endTime": "5:30:00 PM",
                        "location": "Alway Building, Room M015A",
                        "instructors": [
                            {
                                "name": "Jaffe, A.",
                                "sunet": "ajaffe"
                            }
                        ],
                        "startTimestamp": 57600.0,
                        "endTimestamp": 63000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "30736",
                "currentClassSize": "0",
                "maxClassSize": "0",
                "schedules": [
                    {
                        "startTime": "11:00:00 AM",
                        "endTime": "12:00:00 PM",
                        "location": "CCSR 4205",
                        "instructors": [
                            {
                                "name": "Jaffe, A.",
                                "sunet": "ajaffe"
                            }
                        ],
                        "startTimestamp": 39600.0,
                        "endTimestamp": 43200.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225498",
        "number": "BIOS 264",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "265",
        "title": "Introduction to Quantitative Reasoning in Biology",
        "description": "Mini-course. Focus on development of basic skills for quantitative reasoning in biology, including order-of-magnitude estimation and use of the broad spectrum of time scales to enable understanding. Primary examples include going from molecular size and energy scales to functions of single cells and going from mutational and selective processes acting on organisms to evolution of populations on laboratory and global scales.  Examples will include processes relevant to the COVID-19 pandemic.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "214999",
        "number": "BIOS 265",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "266",
        "title": "Mini Proposal Bootcamp",
        "description": "In an intensive 1-day format, students learn the fundamentals for writing competitive fellowships, i.e. NIH NRSA fellowships (F30, F31, F32). Topics include developing specific aims; outlining research and career development plans; and using the review criteria to inform writing.  Students develop early drafts of the 1-page specific aims, NIH biosketch, and training plan, and receive feedback from instructor. Students are expected to be in the early stages of writing a fellowship proposal.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "29984",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219819",
        "number": "BIOS 266",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "267",
        "title": "Proteomics, Protein Interaction Maps, and Systems Biology",
        "description": "This course will teach principles underlying the biochemistry and biophysics of protein-protein interaction, protein purification, proteomics and mass spectrometry and state-of-the-art tools for assembling protein-protein interaction (PPI) networks including Cytoscape.  PPI networks provide a broad tool to build maps for modeling and hypothesis generation for biological systems.  Adding curated, public and computed metadata to PPI maps will be included in labs. Statistical, logical Boolean, Bayesian, and graph theoretic methods for network analysis will be discussed and used in lab.  Experimental methods in high throughput biology and the strengths/limitations of public data to test multiplexed hypotheses from networks will be emphasized.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "219821",
        "number": "BIOS 267",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "268",
        "title": "Biology and Applications of CRISPR/Cas9: Genome Editing and Epigenome Modifications (GENE 268)",
        "description": "This course is designed to provide a broad overview of the biology and applications of the revolutionary CRISPR/Cas9 system, with detailed exploration of several areas: /  / --Basic biology of the CRISPR/Cas9 system / --High-throughput screening using CRISPR/Cas9 / --Epigenetic modifications and transcriptional regulation using dCas9 / --Therapeutic applications of gene editing with CRISPR / --Disease modeling with CRISPR / --Ethical considerations of the use of CRISPR/Cas9  /  / The course will be geared toward advanced undergraduates and graduate students, and will assume a basic background in molecular biology and genetics. The course will be lecture-based, with frequent opportunities for discussion and questions.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "26003",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Greely, H.",
                                "sunet": "hgreely"
                            },
                            {
                                "name": "Cho, M.",
                                "sunet": "micho"
                            },
                            {
                                "name": "Porteus, M.",
                                "sunet": "mporteus"
                            },
                            {
                                "name": "Steinmetz, L.",
                                "sunet": "larsms"
                            },
                            {
                                "name": "Winslow, M.",
                                "sunet": "mwinslow"
                            },
                            {
                                "name": "Engreitz, J.",
                                "sunet": "engreitz"
                            },
                            {
                                "name": "Qi, S.",
                                "sunet": "slqi"
                            },
                            {
                                "name": "Ormond, K.",
                                "sunet": "kormond"
                            },
                            {
                                "name": "Carette, J.",
                                "sunet": "carette"
                            },
                            {
                                "name": "Bassik, M.",
                                "sunet": "bassik"
                            },
                            {
                                "name": "Jerby, L.",
                                "sunet": "ljerby"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219818",
        "number": "BIOS 268",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "270",
        "title": "Planetary Health: Socioeconomic & Ecological Links Between Human Health & Earth's Natural Ecosystems",
        "description": "Two of the biggest challenges humanity has to face - promoting human health and halting environmental degradation are are strongly connected and too big to be addressed in an incremental, sector-specific way. Breakthroughs can be achieved through a creative, interdisciplinary approach that fully recognizes the complex nature of links between human health and healthy, functioning ecosystems.  Through a series of lectures and case-study discussions with experts from multiple Schools and Departments, students will develop an in-depth understanding of the &quot;Planetary Health&quot; concept, its foundation, goals, priority areas of action and methods of investigation, and the most relevant immediate and long-term challenges.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "219820",
        "number": "BIOS 270",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "271",
        "title": "Writing Graduate Research Fellowships",
        "description": "Initial sessions focus on the basics of grantsmanship, review criteria (i.e. intellectual merit and broader impact), and required materials, with particular focus on the National Science Foundation (NSF) Graduate Research Fellowship Program (GRFP). Students draft a 2-page research proposal and 3-page personal, relevant background and future goals statement. During small group peer review sessions, students receive detailed feedback to improve the clarity of their writing.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "219576",
        "number": "BIOS 271",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "272",
        "title": "Science and Art",
        "description": "This 3-week mini-course will cover a variety of topics related to science and art including scientific illustration, the visual sensory perception of art, how art impacts the brain, and the similarities and differences between science and art. The class will be a combination of lectures, discussions, and art labs. No previous art experience is necessary.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32406",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "CCSR 4107",
                        "instructors": [],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30691",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "CCSR 0245",
                        "instructors": [
                            {
                                "name": "Smart, A.",
                                "sunet": "asmart"
                            },
                            {
                                "name": "Theisen, E.",
                                "sunet": "theisen"
                            },
                            {
                                "name": "Annamaneni, N.",
                                "sunet": "nannaman"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225499",
        "number": "BIOS 272",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "273",
        "title": "Ethics and Justice at the Frontiers of Conservation Biology",
        "description": "This weekend-long retreat-style mini-course introduces students to four distinct types of cross-disciplinary ethical challenges that will face the next generation of conservation biologists and biotech entrepreneurs. Taught over the course of a single long weekend, students will wrestle with vexing questions of scientific ethics, interspecies justice, environmental justice, and policy. We will employ structured debates, stakeholder role-play, site visits to conservation-tech companies, and outings to local conservation areas. This course will be co-taught by guest instructor Ben Wilcox from World Wildlife Fund.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30686",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "8:00:00 PM",
                        "location": "Li Ka Shing Center, room 208",
                        "instructors": [
                            {
                                "name": "Dirzo, R.",
                                "sunet": "rdirzo"
                            },
                            {
                                "name": "McCoy, D.",
                                "sunet": "mccoy6"
                            },
                            {
                                "name": "Sonawane, C.",
                                "sunet": "sonawane"
                            },
                            {
                                "name": "kaholoaa, K.",
                                "sunet": "kaiku"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 72000.0,
                        "days": "Sunday Monday Saturday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225500",
        "number": "BIOS 273",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "276",
        "title": "Drug Discovery in Neuroscience",
        "description": "Disorders of the nervous system are some of the most common and devastating conditions. Our biological understanding of neurodevelopmental and neurodegenerative diseases has been slow, and the development of drugs has been lagging behind other therapeutic areas. This mini course will provide students with an overview of the principles of drug discovery and the specific issues associated with developing medicines for diseases of the nervous system with a particular focus on recent translational advances. The course will be lecture-based. Several of the lectures will be given by industry experts and leaders. Topics will include an overview of drug discovery and emergent human cellular models of disease, medicinal chemistry approaches, antisense oligonucleotide therapeutics, gene therapies, therapeutic antibodies, cell therapies, and running a drug discovery organization.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "223126",
        "number": "BIOS 276",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "277",
        "title": "Prions in Health & Disease",
        "description": "Prions consist of misfolded, polymerized proteins and are agents of transmissible neurodegenerative diseases such as bovine spongiform encephalopathy and Creutzfeldt-Jakob disease of man. However, &quot;prion-like&quot; polymerization of proteins is a more general phenomenon involved in a long-term memory, innate immunity and most likely other important functions. In microbes, prions are non0Mendelian genetic elements. The course will emphasize that &quot;prion-like&quot; polymerization is part of a more general allosteric regulation of gene expression that can sometimes go wrong, as in Alzheimer's and Parkinson's diseases, and only exceptionally may cause transmissible infectious disease that spread in the population.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class meets MWF 11/27/23 - 12/8/23 10:00am-12:00pm.",
                "classId": "26130",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "12:00:00 PM",
                        "location": "MSOBX303",
                        "instructors": [
                            {
                                "name": "Gitler, A.",
                                "sunet": "agitler"
                            },
                            {
                                "name": "Brahic, M.",
                                "sunet": "mbrahic"
                            },
                            {
                                "name": "Jarosz, D.",
                                "sunet": "jarosz"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 43200.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220625",
        "number": "BIOS 277",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "279",
        "title": "Applied Grant-Writing Skills for Science and Engineering Students",
        "description": "Participants develop proposals in the non-medical fields of science and engineering (e.g. for the National Science Foundation) focusing on required documents such as the 1-page Project Summary, Broader Impacts, Intellectual Merit, and Research Plan. Students establish a writing practice and learn fundamental grant writing skills through guided exercises, including in-class review and focused faculty feedback.",
        "repeatable": "true",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "221301",
        "number": "BIOS 279",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "280",
        "title": "Apico-basolateral Epithelial Cell Polarity",
        "description": "Cells must polarize, localizing unique macromolecules along distinct axes, to function correctly. This lecture/lab mini-course will provide students with a broad overview of cell polarity, using recent literature to guide understanding of the shared and divergent mechanisms underlying polarity establishment in different tissues and organisms. Additionally, students will engage in hands-on research using C. elegans and a large particle flow cytometer (BIOSORTER) to perform high throughput forward genetic screens to discover novel pathways involved in epithelial polarity establishment. This course is geared toward STEM graduate students, postdocs, and advanced undergraduates interested in topics and applications in cell and developmental biology.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "221737",
        "number": "BIOS 280",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "282",
        "title": "Clarifying Career Choices: Your Self-Reflective Research Project",
        "description": "Using the ADAPT Integrated Development Model, this course will focus on the areas of Development and Awareness. It is designed for students who aspire to gain clarity and insights about themselves their career choices and options. It is designed to encourage self-knowledge and increased awareness of roles and job opportunities inside and outside of academia, where an in-depth Science background is desired. The course requires students to complete up to 3 assessments, short writing assignments, and participate in small group discussions. All students will have the opportunity to have a 1:1 follow-up session with the Instructor to discuss the insights gained from the course as well as opportunities to network with alumni and future employers from various fields.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "222002",
        "number": "BIOS 282",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "283",
        "title": "Dendritic Cells and Other Myeloid Cells: function and analytical tools",
        "description": "Dendritic cells and other myeloid cells are capable of activating and modulating a broad range of immune responses. This course focuses on understanding myeloid cell diversity, plasticity and functions in host physiology, disease states  (i.e., cancer, inflammatory and infectious diseases) and during therapeutic interventions. Students are exposed to a combination of lectures (including field-expert talks) and dry lab workshops with the goal of acquiring tools for dissecting human and mouse myeloid cell function experimentally. This course is intended for biosciences graduate students and postdocs with basic immunology knowledge (enrollment limited to 20).",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "221731",
        "number": "BIOS 283",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "285",
        "title": "Rodent Animal Models: Selection, Detection, Dissection, Inspection",
        "description": "This 2-week mini-course will discuss pragmatic approaches to rodent utilization with the aim of empowering graduate students across multiple disciplines to maximize rodent-derived data and minimize the redundant use of animals in biomedical research. Topics will include an introduction to clinical models, practical aspects of rodent blood collection and interpretation, algorithmic approaches to tissue collection for research applications, and an introduction to rodent histopathology, immunohistochemistry, and immunofluorescence. Course instructors include board-certified laboratory animal medicine clinicians and comparative pathologists that are expert h these topics. This course is open to graduate students with or without prior rodent experience.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29937",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221723",
        "number": "BIOS 285",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "286",
        "title": "Single Cell Immunogenomics",
        "description": "Preference is for graduate students and undergraduates with background in biology and genetics. The emphasis of the course will be on learning the essential principles of single cell genomics as applied to research questions in immunology. The topics will include understanding the fundamental principles of the technology, experimental methods, types of single cell sequencing assays available and data analysis. The emphasis will be on how these methods are used to delineate immunologic cell types, their interactions with other cells in the local microenvironment and determining differential gene expression patterns and signatures. Specialized topics will include the analysis of single cell T-cell and B-cell receptor characteristics as well as joining antibody staining information at single cell resolution. Guest speakers will include thought leaders in the field who are demonstrating how single cell immunogenomics are being applied to immunotherapy development. Enrollment is limited.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29957",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221776",
        "number": "BIOS 286",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "287",
        "title": "Proteostatis: guarding the proteome in health and disease",
        "description": "The control of cellular protein homeostasis, also called Proteostasis, is emerging as the central cellular process controlling the stability, function and quality control of the proteome and central to our understanding of a vast range of diseases. The proteostasis machinery maintains the function of destabilized and mutant proteins; assists the degradation of damaged and aggregated proteins and monitors the health of the proteome, adjusting it in response to environmental or metabolic stresses. This class will introduce students to the exciting cutting edge discoveries in this field, and will relate them to medical and biotechnology applications, as well as how a better understanding of proteostasis can be leveraged to understand fundamental biological processes, such as evolution and aging and to ameliorate a wide range of diseases. Given the increasingly close links between aging, protein misfolding, and neurodegenerative disease, understanding proteostasis networksis of critical fundamental and practical importance. These insights are particularly relevant in view of the increased prevalence of late-onset neurodegenerative aggregation diseases caused by an increasingly elderly population.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28072",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30152",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221758",
        "number": "BIOS 287",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "289",
        "title": "Preparation & Practice: Finance of Biotechnology",
        "description": "Tailored lectures and case studies lead to a practical final project. Leaders from local firms and companies will help you gain insight into the biotechnology industry, the skills and experiences necessary to succeed, and the various roles and responsibilities within the industry. Coursework is divided into 4 sections: Introductory Material: The first segment consists of two lectures and introduces the biotechnology company life cycle along with introductory concepts in finance. Venture Capital and Private Equity:  The second segment consists of three lectures devoted to venture capital finance and private equity where students will learn the basic mechanics of raising capital. nPublic Finance: The third segment consists of the interpretation of financial statements, construction of company forecasts, and evaluating business value from such projections. Final Project: The final lecture will conclude with student presentations on their final projects.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Class meets in LK 209 all dates except 2/28 and 3/7 when class is held in ALWAY M015A..",
                "classId": "28105",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Eberle, S.",
                                "sunet": "seberle"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 61200.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221753",
        "number": "BIOS 289",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "290",
        "title": "Preparation & Practice: Law",
        "description": "Through tailored lecture, case study and a practical final project, Biosciences and interdisciplinary sciences students and trainees will learn how to apply the skills they acquired in their academic training to a career in Patent Prosecution and related fields. Taught by field and faculty experts, this is your opportunity to network with IP law representatives and to gain hands-on experience in a new career of choice option. Topics include: applying for positions, the importance of IP protection, licensing, overview of the patent process, drafting applications and litigation.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28078",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:30:00 PM",
                        "location": "Alway Building, Room M214/214A",
                        "instructors": [],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 59400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221778",
        "number": "BIOS 290",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "291",
        "title": "Preparation & Practice: Management Consulting",
        "description": "This course is designed for students who are interested in learning about consulting including tools and techniques to gain a consulting mindset. The course requires students to complete short assignments, participate in classroom discussions, and a team project. Students will have the opportunity to understand the consulting process right from sourcing and starting engagements to closure and follow up engagements. Further, with the help of some practical execution in the classroom, students will also learn how to manage client needs and situations, articulating client needs in a succinct proposal, planning and executing consulting assignments, managing client interactions and in the process, learn to leverage some common frameworks for consulting.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Course meets 5/19, 6/2 & 6/9 only from 3pm-7pm in ALWAYM315.",
                "classId": "27715",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221780",
        "number": "BIOS 291",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "292",
        "title": "Preparation & Practice: Science Communication & Media",
        "description": "Through tailored lecture, case study, and a practical final project, academic and professional leaders will help you gain insight into the science communications and media industry. This course assists students in developing the communication skills necessary for post-training and internship success in a science communications/media field and it provides an understanding of the scope of career opportunities within the science communications sector, focusing on the development, organization, and management issues specific to it. Through connections with alumni, faculty, and other practitioners from a variety of fields and organizations, as well as hands-on experience with the techniques and methodologies most useful on the job market, students will define their own professional goals, increase their awareness of industry terminology and theories, and hone expertise in the areas of: publishing, editing, workflow, ethics, trends, principles of effective scholarly/news writing, interviewing techniques, and media/website management.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221779",
        "number": "BIOS 292",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "293",
        "title": "Preparation & Practice: Science Policy",
        "description": "Through tailored lecture, case study, and a practical final project, academic and professional leaders will help you gain insight into the science policy industry and the skills necessary to succeed within the various positions and levels available within it. This course aims to demystify the U.S. science policy process and teach both how policy affects scientific funding and administration, and how science is used to create and influence the creation of law and policy in the U.S. This course will be taught in two parts. The first part outlines the basic structure of the US government, and fundamental issues in US political system, and refreshes students who haven't encountered basic civics since high school, this introductory material will cover the structure of the US government, the governance of key agencies, broad concepts of federalism and shared federal and power, the political party system, and a brief and general modern history of the role of science in policy making. The second part will review four key concepts: 1) who's who and how they work. 2) The policy making process and the role of science in creating policy. 3) Government funding science. 4) Issues, theories and trends in science and policy. This final section will review a variety of cross-cutting issues in science policy development, including innovation theory, the role of uncertainty, and a discussion of the government's role as a developer and repository of science data, and other current topics in the relationship between science and government.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "221752",
        "number": "BIOS 293",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "294",
        "title": "Chemistry for Biologists and Others (BIOC 294)",
        "description": "Chemical transformations are central to biology and function, and chemical methods provide some of the most powerful tools for everyday experimental biology. Yet, most practitioners of biology have learned chemistry through memorization and do not use chemical principles or intuition in their research, even though chemistry underlies most processes and experiments carried out in biology and by biologists. Fortunately, a basic understanding and working knowledge can be gained in a short time, through a small set of simple concepts and limited number of memorized facts. These concepts and facts will be introduced and then mastered through use in highly interactive, in-class problems and evaluation of selected literature. At the end of the three-week course students will have an ability to understand the chemistry underlying cellular processes and to better discuss and evaluate chemical tools and approaches. Prerequisites: High school or college introductory chemistry recommended but not required.nnCourse runs 11/15-12/10 MWF 10-11:45am",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28122",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222056",
        "number": "BIOS 294",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "295",
        "title": "Statistical Methods and Data analysis for Clinical Research",
        "description": "This mini-course will introduce students to the basic concepts and methods of biostatistics and how they are applied to analysis and interpretation of data in clinical research. Topics will include: Study designs: Observational studies and Clinical trials, Bias and confounding during study design and analysis phases, Hypothesis formulation and Power analysis, Data collection and management, Descriptive and Inferential statistics, Hypothesis testing: Data analysis, interpretation, and presentation, Role of Research Rigor and reproducibility. Students will learn how to use statistical software to analyze data and draw conclusions from their analyses. They will also learn how to communicate their findings to others in a clear and concise way.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32407",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30692",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": "Li Ka Shing Center, rms205/206",
                        "instructors": [
                            {
                                "name": "Kamtam, D.",
                                "sunet": "devanish"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Tuesday Wednesday Thursday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225501",
        "number": "BIOS 295",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "296",
        "title": "Preparation & Practice: Biotechnology Business",
        "description": "This course combines guest lectures with case study and hands-on projects to examine the necessary skills and practical steps necessary to create a business from biotechnology invention. Students will interface with current C-level executives and expert practitioners to gain practical insight into the business mechanics and practices of the biotechnology industry, and the variety of roles and responsibilities available to them.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30043",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222577",
        "number": "BIOS 296",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "297",
        "title": "COVID-19 Pandemic: Lessons Learned",
        "description": "The Covid-19 pandemic has created unprecedented challenges for individuals, society, medicine and science. The SARS-Cov-2 virus rapidly disseminated since first reports from China on December 31, 2019 and by March 11, 2020 it was declared a global pandemicby the World Health Organization. This course will cover various aspects of Covid-19 including clinical perspectives, public health response, impact of disease modeling, and results of clinical trials and research efforts. As the pandemic evolves the course will discuss the most current data and reflect on successes and ongoing challenges as the world grapples with a pandemic of unmatched proportions.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "222576",
        "number": "BIOS 297",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "298",
        "title": "Cinematic Discoveries: A movie-based exploration of research rigor, communication and diversity",
        "description": "Through movie depictions of the vaccine discoveries leading to the first Nobel prizes in medicine, the infamous Tuskegee Study, the first heart surgery for Tetralogy of Fallot, the encephalitis lethargica pandemic, and modern oncology trials, the course will explore interdisciplinary work in biomedical sciences, research rigor, consent, stigma and discrimination, researchers&iquest; and health professionals&iquest; communication skills, and fundamentals of cinematography. The course will include a lecture, a movie projection and discussion each day for 5 days.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28180",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "28179",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222573",
        "number": "BIOS 298",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "299",
        "title": "Online Proposal Bootcamp",
        "description": "This 9-week Proposal Bootcamp guides grant writers through the process of developing a compelling fellowship (e.g., NIH F31, F32) or career development award (e.g., NIH K99/R00, K01, K08, etc.). Participants gain new grant writing skills through synchronous, including Mini Lectures and Grant Coach Office Hours, and asynchronous, including recorded videos and readings, activities. Students and postdocs join our award-winning peer review program for feedback on key proposal documents. This Bootcamp is 100% remote and open to all Stanford affiliates.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27772",
                "currentClassSize": "0",
                "maxClassSize": "35",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Botham, C.",
                                "sunet": "cbotham"
                            },
                            {
                                "name": "Sakurai Kimura, C.",
                                "sunet": "cskimura"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": "No class meetings or assignments November 20-24, 2023.",
                "classId": "28418",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Botham, C.",
                                "sunet": "cbotham"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224159",
        "number": "BIOS 299",
        "units": [
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "300",
        "title": "Advance 1",
        "description": "The goal of the course is to develop the graduate student&iquest;s skills in science communication, active reading skills, and general career and professional development in skillsets that are vital for the success of Biosciences PhD students. Meeting will focus general Tools of Success, Laboratory Rotation expectations and developing a mentor/mentee relationship with advisors. Students will also actively participate in NSF Grant writing, Scientific Journal Article analysis, and Applied Quantitative Reasoning workshops. Lastly, students will engage with representees from on-campus resources such as the BioSci Careers office and Industry partners for post-graduate career options.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "221663",
        "number": "BIOS 300",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "301",
        "title": "Graduate Environment of Support",
        "description": "Psychosocial, financial, and career issues in adapting graduate students to Stanford; how these issues relate to diversity, resources, policies, and procedures. Discussions among faculty, advanced graduate students, campus resource people, and the dean's office. (Thomas)",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "24932",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "320-109",
                        "instructors": [
                            {
                                "name": "Thomas, A.",
                                "sunet": "embrya"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "205492",
        "number": "BIOS 301",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BIOS",
        "code": "302",
        "title": "Designing Your Life: Empowering Emerging Scientists",
        "description": "Design a fulfilling and impactful vision for your career and life as a whole. The primary purpose of the class is to develop a perspective and align your attitudes, actions and experiences with your values, priorities, and your own ultimate definition of victory for living an extraordinary life. A practical guide for career development, this class will provide training through conversations, self-analysis, and writing exercises on career direction, communication, and the development and leveraging of relationships skills that are central to success in any career as a scientist. We will examine what it means (and what it takes) to succeed in a variety of life domains, including money, health, career, relationships, and physical fitness as well as personal growth. We will dig into the darker side of being human, exploring phenomena like negative character traits, fears, hauntings, and regrets. Ultimately, we want you to gain insight  into who you are, what you want most, and how you might inadvertently and unwittingly get in your own way. We want you to learn how to confront the most vexing issues in your life, learn from them, and eventually transform your relationship to them. Course Structure: The course consists of ten intensive, flipped-classroom sessions designed to help you develop the skills and knowledge--and, more importantly, the insight and capacity--to be more strategic and effective in how you lead your life. It requires a willingness to be introspective and to consider personal feedback and constructive confrontation. Enrollment is capped at 30 learners, all of whom will be provided subscriptions to Inner.U which will serve as an electronic textbook and supported by a team of three faculty facilitators.",
        "repeatable": "false",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32728",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223639",
        "number": "BIOS 302",
        "units": [
            1
        ],
        "totalSections": 1
    }
]