[
    {
        "year": "2023-2024",
        "subject": "BUSGEN",
        "code": "100",
        "title": "Triple Bottom Line: Managing Sustainable Value Creation",
        "description": "This course introduces and operationalizes the Triple Bottom Line framework for measuring and managing sustainable value creation. The framework highlights the balance that needs to be achieved by an organization across three dimensions of sustainability-related performance - environmental stewardship, social impact, and value creation - and provides a powerful lens for both evaluating the firm's current activities and designing a business strategy with sustainability at the core of its value proposition. The first half of the course focuses on developing skills to use financial statement disclosures, sustainability-related reports, and other publicly available and private sources of information to critically evaluate a company's economic performance and financial condition (i.e., the value creation dimension of the Triple Bottom line) and to measure and assess how a company's operations interacts with the environment and society (i.e., the environmental stewardship and social responsibility dimensions of the Triple Bottom Line). The second half of the course will focus on applying the Triple Bottom Line analyses to specific decision contexts, and will examine the measurement issues, trade-offs, and implementation challenges associated with identifying and executing a sustainability-oriented business strategy. The course is structured to develop students&iquest; ability to critically assess the sustainability-related performance of an organization and to ultimately translate that understanding into specific recommendations to improve that company along each dimension of sustainability. The perspective taken is that of an executive relying on available financial and non-financial information for performance evaluation, investment analyses, and strategic decision making purposes, yet the concepts and tools can also be applied by investors who need to understand whether or not the organization's activities are sustainable. The capstone to the course is the completion of a comprehensive, real-time analysis of a publicly-traded company using the Triple Bottom Line framework and the development of a set of recommendations for how the organization can improve its sustainability-related performance. This course may not be audited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": null,
                "classId": "33207",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Piotroski, J.",
                                "sunet": "jpiotros"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225750",
        "number": "BUSGEN 100",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BUSGEN",
        "code": "101",
        "title": "The AI-powered Org: Evolution, Rebirth or Death?",
        "description": "What does the AI revolution mean for the future of work, careers and organizations? The course will start with an overview of leading theories of organizations, all of which were effectively modeled on the 20th century firm. We will then turn to understanding recent developments in machine learning and AI, from the point of view of an informed user (rather than a technical developer), ranging from foundation language models to Decentralized Autonomous Organizations (DAO) implemented using blockchain technology. These will form the basis for an ongoing discussion about the future of organizations in the age of AI. Is this merely another phase in the modern organization's evolution, is this a paradigmatic redefinition of its structure and function, or is this a cataclysmic moment heralding the end of organizations as the central building blocks of economic activity? We will (speculatively) discuss these issues from a broad perspective, investigating how AI is already impacting work and organizational structures, as well as these changes' broader social implications (such as their effect on work/life balance, the gendered division of labor in the household, and the structure of community). The implications for business and management are clear: AI is already impacting organizational life, and will continue to do so as technologies mature and their business models are refined. This course may not be audited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": null,
                "classId": "32844",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldberg, A.",
                                "sunet": "amirgo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225752",
        "number": "BUSGEN 101",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BUSGEN",
        "code": "102",
        "title": "The Future of Money and Payments",
        "description": "In its exploration of the future of money and payments, this course focuses on technology, market competition, and public policy. Money and payments have long been dominated by physical cash and by transfers between deposit accounts of correspondent banks, including central banks. After a grounding in conventional payment systems, the course investigates ongoing improvements and disruptions of conventional approaches with new technologies, including instant payment systems, narrow banking, central bank digital currencies, and cryptographic applications such as blockchain-based digital ledgers, stablecoins, zero-knowledge proofs, smart-contract settlement, and automated market making. Policy concerns include financial inclusion, efficiency, disruption of banking, privacy, anti-money-laundering, financial stability, and monetary policy transmission. Grading is based on frequent short homework assignments and quizzes. This class may not be audited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": null,
                "classId": "33208",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Duffie, D.",
                                "sunet": "duffie"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225751",
        "number": "BUSGEN 102",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BUSGEN",
        "code": "103",
        "title": "Introduction to Accounting, Performance Measurement & Managerial Decision-Making",
        "description": "This course introduces the fundamental principles of financial and managerial accounting, cost accounting, managerial decision-making, interpreting financial statements and ratios, cost data, budget information. The course will conclude by introducing select topics in corporate governance and managerial economics that are relevant for decision-making. Highlights include learning: -- The definition and measurement of assets, liabilities, owners' equity, revenues, and expenses. -- The accrual accounting process and the difference between earnings and cash flows. -- The format, purpose, and preparation of the four financial statements and footnotes. -- The distinction between financial and managerial accounting. -- How different decisions affect cash flows, revenues, expenses, and profits. -- Different types of cost that are relevant for decision-making and break-even analysis (e.g., fixed costs and variable costs, direct and allocated costs, and sunk and future costs). -- The concept of the time value of money and the discounted cash flow (DCF) framework for evaluating investment projects and valuation, which entails (i) estimating expected future cash flows, and (ii) assessing risk. -- The difference between diversifiable (or idiosyncratic) and non-diversifiable (or systematic) risk, and the concept of &quot;Beta,&quot; which is a common measure of stock price risk. -- How hedging can be used to reduce exposure to risk. -- How to apply the present value framework to decisions involving choices among projects, personal finance decisions, and valuing of common liabilities (e.g., mortgages and bonds). -- Key principles of corporate governance and ethical decision-making.  This course may not be audited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "225648",
        "number": "BUSGEN 103",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "BUSGEN",
        "code": "104",
        "title": "Measurement, Analysis and Disclosure of Corporate Environmental and Social Impacts",
        "description": "The course will overview various frameworks for measurement, evaluation, risk assessment and disclosure of the environmental and social impacts of corporate activities. The course will discuss the motivations for corporations and other organizations to engage in these activities, as well as managers' and directors' responsibilities for them. We will examine the strengths and limitations of current measurement and management of environmental and social performance by firms, investors and other stakeholders and the variety of ways stakeholders can use this information. The course will also overview the issues related to disclosure of environmental and social measures and the organizations influencing corporate disclosure decisions, including institutional investors and standard-setters such as the SEC, ISSB and EU. The course will draw on relevant research on impact measurement to assess the state of current practice there and as a lens for the state of corporate sustainability measurement and disclosure. Students will carry out a project that allows them to apply course concepts to assess an organization's social and environmental footprint. Possible project topics include evaluating a corporation's sustainability or impact-related disclosures, critically analyzing a standard-setting approach, or generating a business model idea to tackle risks or exploit opportunities in furtherance of environmental and social impacts.  This course may not be audited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": null,
                "classId": "32843",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McNichols, M.",
                                "sunet": "fmcnich"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225753",
        "number": "BUSGEN 104",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BUSGEN",
        "code": "105",
        "title": "From Founder to CEO: The Strategic Management of Start-Ups and Established Firms",
        "description": "This course will begin by examining strategy in established companies. What is strategy? What are the components of good strategies? How is internal and external strategic consistency achieved? Who sets strategy, and how? With answers to these questions in hand, we will turn to how strategy is different in start-ups. How do founders set strategy when the future direction of the company is still uncertain? Finally we will look briefly at the strategic management of not-for-profit organizations. The course will be taught mainly by the case method, with active class participation. Often the protagonist of the case will join as a guest. Preparation for each class is essential and students should expect to be &quot;cold called.&quot; Every class will require a short write-up of the preparation assignment questions.  Two of those will receive a numerical grade. The class grade will be based on class participation, completion of the assignments, the two assignment grades, and an in-class final. This course may not be audited",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": null,
                "classId": "31412",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saloner, G.",
                                "sunet": "saloner"
                            },
                            {
                                "name": "Bagalso, R.",
                                "sunet": "rbagalso"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225649",
        "number": "BUSGEN 105",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BUSGEN",
        "code": "115",
        "title": "Games, Decisions and Negotiations",
        "description": "Human thinking is geared toward understanding and mastering social interactions. GSBUG115 explores cognitive, affective, behavioral, social and organizational processes that shape how we manage strategic interactions. The course builds on concepts and research findings from decision theory, behavioral game theory, negotiation research, and other relevant streams of investigation in the social sciences. By the end of this course, you should have a better understanding of the structural and psychological factors that underlie competition and cooperation, bargaining, contracting, social influence, dispute resolution, and other types of social and organizational interactions. To understand how decisions happen, we will use a combination of experiential exercises in class, in-depth discussions of research findings, and student presentations. We will play interactive games in our meetings to understand how various conditions, such as power and uncertainty, influence our decisions. These simulated interactions will provide you with opportunities to develop your behavioral skills, get constructive feedback from other participants, and learn how you come across. So, if you enjoy in-class exercises, you will enjoy our simulations. At the same time, if you enjoy analyzing human behavior and social interactions, you will like the readings and our discussions. After taking this course, you will be better able to identify and avoid common traps in strategic decision making and have a deeper understanding of other people's thinking and decision making processes in interactive contexts. This course may not be audited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": null,
                "classId": "32842",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Halevy, N.",
                                "sunet": "nhalevy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225754",
        "number": "BUSGEN 115",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "BUSGEN",
        "code": "143",
        "title": "Finance, Corporations, and Society",
        "description": "As society faces major challenges, democracies and &quot;free-market&quot; capitalism appear to be in crisis. This interdisciplinary course will explore the complex interactions between corporations, governments, and individuals, drawing on insights from the social sciences, business, and law to understand how institutions and collective actions translate to a set of rules and to outcomes for people and nature. The course aims to help students become savvier in their interactions with our economic and political systems and understand the governance issues that are critical to whether and how well institutions in the private and public sectors serve us. Topics include financial decisions, financial markets, banks and institutional investors; corporations and corporate governance; political economy and the rule of law as it applies to people and to organizations, and the role and functioning of the media. We will connect the material to specific issues such as climate change and justice, and discuss current events regularly throughout the course. Students will have the opportunity to explore a situation of their choosing in more depth through group final projects. Visitors with relevant experiences will regularly enrich our class discussion. This course may not be audited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": null,
                "classId": "31410",
                "currentClassSize": "0",
                "maxClassSize": "72",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Econ 140",
                        "instructors": [
                            {
                                "name": "Lion-Transler, C.",
                                "sunet": "clion"
                            },
                            {
                                "name": "Admati, A.",
                                "sunet": "admati"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "CAS",
                "notes": null,
                "classId": "31411",
                "currentClassSize": "0",
                "maxClassSize": "72",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "200-205",
                        "instructors": [
                            {
                                "name": "Lion-Transler, C.",
                                "sunet": "clion"
                            },
                            {
                                "name": "Admati, A.",
                                "sunet": "admati"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225650",
        "number": "BUSGEN 143",
        "units": [
            3
        ],
        "totalSections": 2
    }
]