[
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "1SI",
        "title": "English Language Learner Coaching and Curriculum Development",
        "description": "The principal purpose of this course is to support Habla tutors language coaches in developing lesson plans and strategies to implement during theircoaching sessions with English language learners. The course equips students with a foundational understanding of English as a second language, practical experience with developing educational materials for language learning, and a collaborative space to reflect on their experiences as English language coaches.Cardinal Course certified by the Haas Center for Public Service",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "219893",
        "number": "CHILATST 1SI",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "12D",
        "title": "Intro to English III: Latinx Literature (COMPLIT 165, ENGLISH 12D, FEMGEN 12D)",
        "description": "Emerging from the demographic, political, and cultural shifts of the late twentieth century, LatinX Literature flourishes in the twenty-first century as a hemispherically American corpus of texts. Like both ChicanX and Puerto Rican literatures before it, LatinX Literature emerges from various movements for social justice to challenge both the Anglo and the Hispanic established literary traditions of the Americas. As a transnational, pluralistic, heterogeneous, and dynamic category that considers the writings of diverse peoples with cultural ties to Latin America residing in the U.S., it complicates and transgresses the linguistic, geopolitical and cultural borders of the Americas, including those of the Afro-Caribbean, Luso-Brazilian, and the Native First Nations. Aligning itself with the issues, styles, and topics of the Global South, LatinX Literature is a product of the kind of 'border thinking' that critic Walter Mignolo has described as a 'pluriversal epistemology that interconnects the plurality and diversity of decolonial projects.' Acknowledging its emergence from literal and theoretical border spaces and decolonizing epistemologies, the 'X' of LatinX intentionally inflects the link to an origin in LGBTQI discourses signifying 'a more inclusive, non-gender-binary designation for LatinX peoples' and as a border literature that articulates heterogeneous ways of making meaning. Authors may include Jesus Col&oacute;n, Sandra Cisneros, Helena Maria Viramontes, Christina Garcia, Junot Diaz, Ire&acute;ne Lara Silva, Julia Alvarez, Am&eacute;rico Paredes, Daniel Alarc&oacute;n, Francisco Goldman, Gloria Anzald&uacute;a, Cherr&iacute;e Moraga, Tato Laviera, Ernesto Quinonez, Erika Sanchez, Elizabeth Acevedo, Luis Valdez, Lorna Dee Cervantes, Silvia Moreno-Garcia, Fernando Flores, or Oscar C&aacute;sares. NOTE: English majors must take this class for 5 units.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32973",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Moya, P.",
                                "sunet": "pmoya"
                            },
                            {
                                "name": "Saldivar, R.",
                                "sunet": "saldivar"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224223",
        "number": "CHILATST 12D",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "19N",
        "title": "The Immigrant Experience in Everyday Life (SOC 19N)",
        "description": "The seminar introduces students to major themes connected to the immigrant experience, including identity, education, assimilation, transnationalism, political membership, and intergroup relations. There will also be some attention given to research methodology. The seminar addresses these themes through reading ethnographies that document the everyday experience of immigrants and immigrant communities, broadly defined, in the United States. The course readings primarily come from more contemporary ethnographic research, but it will also include a sampling of ethnographies that examine the experience of previous waves of immigrants. Student participation will include in-class discussions of readings, short written responses to readings, and a final paper in which students draw on original ethnographic research that they conduct during the quarter. By the end of the quarter, students will be able to identify the social, political, and economic forces that shape the immigrant experience. More importantly, students will understand HOW these forces enter the immigrant experience in everyday life.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "32397",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jimenez, T.",
                                "sunet": "tjimenez"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "222583",
        "number": "CHILATST 19N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "21",
        "title": "Visual Storytelling in Community: The Casa Zapata Mural Archive & History Project",
        "description": "An extensive but critically unexplored collection of murals is housed at Stanford in the undergraduate Chicano/Latino-theme residence Casa Zapata. Painted by professional artists, many with student involvement, some twenty total works exist in this public, community focused collection. These works, created in rapid succession over a 15-year period, coincided with the height of the Chicano movement, a cultural and political mobilization determined to advance equality, civil rights, and educational access for Mexican-American and Latinos in the United States.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30904",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "540-103",
                        "instructors": [
                            {
                                "name": "Hernandez, G.",
                                "sunet": "ghclarke"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220943",
        "number": "CHILATST 21",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "90",
        "title": "Latine Stories (ENGLISH 90L)",
        "description": "This is a course on the craft of fiction writing. We will read published literary short stories by contemporary Latine writers writing in the United States and begin to explore the vast range of fictional techniques employed by these writers. In discussing these published works, we will analyze how the formal elements of story - structure, plot, character, point of view, etc. - function in these pieces, so that students can apply these principles of craft to their own work. Students will write two complete short stories, which will be discussed in a traditional workshop format.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225430",
        "number": "CHILATST 90",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "100",
        "title": "Introduction to Latinx Studies",
        "description": "This course introduces students to Latinx studies drawing on both the distinct and intra-ethnic experiences of the diasporic Latinx population in the United States. Introduction to Latinx studies examines the international processes (e.g., wars of imperialism, colonialism, immigration, migration, legislative policies) as central forces in the formation of U.S. Latinx communities, including the historical influences of Caribbean, Central and South American cultures in American society. This global perspective will accompany a more specific focus on the relationship between Latinx culture and American society, the dynamic role of women in the shaping of Latinx communities, and origins and place of Latin American-diasporic communities in U.S. society. Through an interdisciplinary scholarly lens and archival research, we analyze the history of Latinx migration, immigration, and the social justice and civil rights leaders and organizations who advocated for full citizenship rights. We study artists and the spaces where Latinx art has been transformative across cultures, the nation, and international spaces. We analyze the Latinx diasporic communities and trace their journeys across borders and advocacy for civil rights. Our discussions will include a history and analysis of language, art, music, folktales, and tools that shape the Latinx community. Including Latinx ingenuity, innovation, and major contributions in the sciences, humanities among other fields. Students will read an assortment of foundational humanities and social science literature on the U.S. Latinx experience as well as strengthen writing abilities, sharpen critical thinking skills, and develop archival research proficiencies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30898",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "160-317",
                        "instructors": [
                            {
                                "name": "Ornelas Rodriguez, I.",
                                "sunet": "iornelas"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224656",
        "number": "CHILATST 100",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "106",
        "title": "From Disney to Telenovelas: Latin America in Popular Film and TV (ILAC 106)",
        "description": "Popular film and media have represented Latin America in various ways, including as a geographical region, a homogeneous culture, and a form of racialization. In this course, we will investigate these representations to understand how Latin America, its people, and its diaspora imagine themselves and how others have conceptualized the region. We will pay particular attention to the myths and stereotypes that cinema and television have sustained as well as Latin America's history of colonization to examine the prevalence of anti-blackness, anti-indigeneity, and other forms of erasure and social exclusion. Sources include Disney's Saludos Amigos and Encanto, Pixar's Coco, and the telenovela Yo soy Betty la fea, among others.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31567",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "STLC 119",
                        "instructors": [],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225285",
        "number": "CHILATST 106",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "116",
        "title": "Latinx Social Movements",
        "description": "Latinx advocates, often through grassroots community organizing around social movement participation and electoral politics, have fought to ensure citizenship, civil rights, labor rights, environmental justice, immigrant rights, gender rights, sexuality rights, reproductive rights, and many more causes in the United States and across borders for decades. In this course, we will analyze the literature of Latinx social movements and various legal and political institutions impacting the U.S. Latinx community, such as electoral representation, labor, education, healthcare, housing, and recreation, as we examine the theories and methods that scholars incorporate to publish their conclusions. We will look at the Latinx community's historical challenges and their journeys to overcome economic disparities, as well as the role of race and racism, prejudice and discrimination, and anti-immigration policies directed at Latinx ethnic groups in the United States. This course will prepare students to conduct archival research on Latinx social movements in the Department of Special Collections and University Archives at Stanford.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32372",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ornelas Rodriguez, I.",
                                "sunet": "iornelas"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224746",
        "number": "CHILATST 116",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "126",
        "title": "Intersectional In(equalities): Latina/o(x) Families in the U.S.",
        "description": "This course will critically examine the social, cultural, political, economic, educational and health experiences of the multiplicity of Latina/o(x) families in the United States. Thorough examinations of readings, podcasts, and films students will discuss the family experience among Latina/o(x) groups in the U.S. and as they maintain transnational ties. With an emphasis on Mexican and Central American undocumented and mixed-status families, we will discuss the roles of immigration law, citizenship, structures, institutions and norms in shaping family life. We will interlay questions of power and resistance among Latina/o(x) individuals and families as they navigate intersectional in(equalities) that stem from the saliency of race, ethnicity, gender, sexuality, immigration status, labor, socioeconomic status, education and health in their daily lives.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224085",
        "number": "CHILATST 126",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "128",
        "title": "Spanish through Comics (ILAC 128)",
        "description": "The course, an exploration of the graphic narrative medium in Spanish, is open to intermediate and advanced Spanish speakers. We'll analyze vignettes, sections, or chapters from both auteur and pop-culture series. These may include Arrugas and Lola Vendetta (Spain), Mafalda, Macanudo, Naftalina, and El eternauta (Argentina), Los once and Caminos condenados (Colombia), Nos vamos (Ecuador/ Colombia), Vivos se los llevaron (Mexico), as well as Spy vs. Spy and My Favorite Thing is Monsters (ChicanX/LatinX). Secondary sources include McCloud, Mbembe, Chute, and Aldama. The through line will be representations and instantiations of power struggles in this deceivingly naive form. Visual narratological aspects and the specificity of the medium will also be discussed at length. Language learners and everyone who wants detailed feedback on their Spanish must enroll in the cognate course SPANLANG 121 &quot;Concurrent Writing Support.&quot;",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "222846",
        "number": "CHILATST 128",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "129",
        "title": "Race, Indigeneity, and Cultural Heritage in Latin America (ANTHRO 29A, ARCHLGY 29A, CSRE 129A)",
        "description": "This course introduces students to the anthropological study of social difference and inequality in contemporary Latin America. It focuses on the intersections of race, Indigeneity, and cultural heritage. Since European contact, race has been a key category for governing heterogenous populations across the region. In recent decades, institutions have established cultural heritage formation - particularly the cultural heritages of Black and Indigenous peoples - as central to the development of the modern nation-state. At the same time, Black and Indigenous peoples have mobilized around civil and human rights to decolonize racial hierarchies and transform colonial structures of power. Students will first engage current approaches to race, Indigeneity, and cultural heritage. Students will then explore how racial and Indigenous formations converge with the following cultural heritage forms: museums, tourism, archaeological sites, and language.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224233",
        "number": "CHILATST 129",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "131",
        "title": "Raza Youth in Urban Schools: Mis-educating Chicana/o/x and Latina/o/x Communities (EDUC 131)",
        "description": "This course focuses on the experiences of Chicana/o/x and Latina/o/x youth in U.S. public schools. We will connect historical patterns with contemporary issues in some of this nations largest urban school districts in order to uncover the ways in which urban schools both reflect and reproduce structural inequalities that marginalize Chicana/o/x and Latina/o/x youth. As we consider the origins and persistence of educational inequalities in relation to longstanding forms of violence, domination, and subordination, we will also highlight histories of activism and resistance, including organized struggles for educational justice in Chicana/o/x and Latina/o/x communities. Issues to be addressed include school (de)segregation, standardized testing, educational tracking, unequal opportunities to learn, deficit perspectives, bilingualism and bilingual education, immigration and undocumented students, ethnic studies curricula, and culturally relevant/responsive/sustaining approaches to pedagogy.  This course will invite students to visit and observe in urban school settings, interview key stakeholders (students, parents, teachers, and/or policy makers), and reflect on their own K-12 schooling experiences in relation to course themes.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220739",
        "number": "CHILATST 131",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "139",
        "title": "Trans Latinx Studies (FEMGEN 139)",
        "description": "This course introduces students to the study of gender from a decolonial feminist perspective. We will study the dynamic and rapidly growing field of Trans* Latinx Studies, an interdisciplinary field whose goal is the study Latina/o/x/ Chicana/o/x gender and sexuality as complex cultural, political, and intersectional formations in present-day settler-colonial societies. We will focus on trans* embodiments, people, and cultural production (the thinking, doing, relating, &amp; re-organizing as a process of resisting coloniality).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30469",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223942",
        "number": "CHILATST 139",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "140",
        "title": "Migration in 21st Century Latin American Film (ILAC 140)",
        "description": "Focus on how images and narratives of migration are depicted in recent Latin American film. It compares migration as it takes place within Latin America to migration from Latin America to Europe and to the U.S. We will analyze these films, and their making, in the global context of an ever-growing tension between &quot;inside&quot; and &quot;outside&quot;; we consider how these films represent or explore precariousness and exclusion; visibility and invisibility; racial and gender dynamics; national and social boundaries; new subjectivities and cultural practices. Films include: Bolivia, Copacabana, La teta asustada, Norteado, Sin nombre, Migraci&oacute;n, Ulises, among others. Films in Spanish, with English subtitles. Discussions and assignments in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29633",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "213352",
        "number": "CHILATST 140",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "148",
        "title": "Inglés Personal: Coaching Everyday Community English (CSRE 148D, EDUC 148)",
        "description": "This course is a 1 to 5 unit service learning course that prepares students to provide direct one-on-one service to adult English language learners in East Palo Alto and other surrounding communities. Students meet with and &quot;coach&quot; an adult learner on a weekly basis.  Can be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "203674",
        "number": "CHILATST 148",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "157",
        "title": "Time Travel in Abya Yala: Decolonising Time (COMPLIT 157)",
        "description": "What if we saw time as malleable? In this course, we will examine how indigenous, latinx, and black artists manipulate experiences of time through music, visual art, and storytelling to reclaim their worlds. Understandings of time have been used to control the populations of Abya Yala (the Americas) since the beginning of the colonial period. But through different cultural understandings of time, experimental bookmaking, and other modes of creative expression, time can be experienced anew. We will pay attention to how different formats for storytelling and art alter our experience of the present. We will also identify how different ways of arranging events, visuals, and words reconfigure the relationships between the past, present, and future. The class will include fictional and theoretical works by Gloria Anzald&uacute;a (Chicana), Manuel Tzoc (K'iche'), Patrick Chamoiseau (Martinique), Kency Cornejo (El Salvador/USA), and Dylan Robinson (Xw&eacute;lmexw), amongst others.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32373",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225406",
        "number": "CHILATST 157",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "173",
        "title": "Mexican Migration to the United States (AMSTUD 73, HISTORY 73, HISTORY 173)",
        "description": "(History 73 is 3 units; History 173 is 5 units.) This course is an introduction to the history of Mexican migration to the United States. Barraged with anti-immigrant rhetoric and calls for bigger walls and more restrictive laws, few people in the United States truly understand the historical trends that shape migratory processes, or the multifaceted role played by both US officials and employers in encouraging Mexicans to migrate north. Moreover, few have actually heard the voices and perspectives of migrants themselves. This course seeks to provide students with the opportunity to place migrants' experiences in dialogue with migratory laws as well as the knowledge to embed current understandings of Latin American migration in their meaningful historical context.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "216903",
        "number": "CHILATST 173",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "177A",
        "title": "Well-Being in Immigrant Children & Youth: A Service Learning Course (CSRE 177E, EDUC 177A, HUMBIO 29A)",
        "description": "This is an interdisciplinary course that will examine the dramatic demographic changes in American society that are challenging the institutions of our country, from health care and education to business and politics. This demographic transformation is occurring first in children and youth, and understanding how social institutions are responding to the needs of immigrant children and youth to support their well-being is the goal of this course. Cardinal Course certified by the Haas Center.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "215818",
        "number": "CHILATST 177A",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "177B",
        "title": "Well-Being in Immigrant Children & Youth: A Service Learning Course (CSRE 177F, EDUC 177B)",
        "description": "This is an interdisciplinary course that will examine the dramatic demographic changes in American society that are challenging the institutions of our country, from health care and education to business and politics. This demographic transformation is occurring first in children and youth, and understanding how social institutions are responding to the needs of immigrant children and youth to support their well-being is the goal of this course. Cardinal Course certified by the Haas Center.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "215905",
        "number": "CHILATST 177B",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "180E",
        "title": "Introduction to Chicanx/Latinx Studies (CSRE 180E, EDUC 179E)",
        "description": "This course draws on intersectional and interdisciplinary approaches to introduce students to the range of issues, experiences, and methodologies that form the foundation of Latina/o/x studies. By considering the relationship between the creation of &quot;Latinx&quot; and &quot;American&quot; identities, students will critically reconsider the borders that constitute the U.S. as a political and cultural formation. The course balances depth and breadth in its study of the variety of perspectives and experiences that come to be associated with U.S. Latinxs.  Thus, we will analyze the histories of predominant U.S. Latinx sub-groups, such as Mexicans/Chicanxs and Puerto Ricans, while also incorporating considerations of the ways in which broader populations with ties to Central America, South America, and the Caribbean play crucial roles in constituting U.S. Latinx identities. Topics include the U.S./Mexico border and the borderlands; (im)migration and diaspora; literary and cultural traditions; music and expressive practices; labor and structural inequality; social movements; Latinx urbanism; gender and sexuality; political and economic shifts; and inter- and intra-group relations. Sources include a range of social science and humanities scholarship. This course will meet at Sequoia High School. Transportation will be provided.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-AmerCul"
        ],
        "objectID": "206846",
        "number": "CHILATST 180E",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "193B",
        "title": "Peer Counseling in the Chicano/Latino Community (EDUC 193B)",
        "description": "Topics: verbal and non-verbal attending and communication skills, open and closed questions, working with feelings, summarization, and integration. Salient counseling issues including Spanish-English code switching in communication, the role of ethnic identity in self-understanding, the relationship of culture to personal development, and Chicana/o student experience in University settings. Individual training, group exercises, role play, and videotape practice.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "11977",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Martinez, A.",
                                "sunet": "alejo"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 62400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "101551",
        "number": "CHILATST 193B",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "195",
        "title": "U.S. Latinx Art (ARTHIST 194, CSRE 195)",
        "description": "This course surveys art made by Latinas/os/xs who have lived and worked in the United States since the 1700s, including Chicanos, Nuyoricans, and other Black, Brown, and Indigenous artists. While exploring the diversity of Latinx art, students will consider artists' relationships to identity, race, ethnicity, gender, and sexuality. Students will also study how artists have responded to and challenged discrimination, institutional exclusion, and national debates through their work. Attendance on the first day of class is a requirement for enrollment.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "221407",
        "number": "CHILATST 195",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "200R",
        "title": "Directed Research",
        "description": null,
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29145",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "201069",
        "number": "CHILATST 200R",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "200W",
        "title": "Directed Reading",
        "description": "(Staff)",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29146",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11069",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, J.",
                                "sunet": "jds1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "13103",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rosa, J.",
                                "sunet": "jdrosa"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "13272",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Prieto, L.",
                                "sunet": "leenda"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "201070",
        "number": "CHILATST 200W",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 4
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "201B",
        "title": "The Undocumented Migration Project Exhibition at Stanford (CSRE 201B)",
        "description": "Are you an artist seeking a greater purpose for you art? Would you like to gain a sense of history and best practices for engaging your community in creative work? nnHuman Rights policy experts and activists, artists and scholars will participate in this (online via Zoom.us) student &amp; community course on contemporary immigration policy and human rights issues.The course is structured around the ideas of art, activism and scholarship as they intersect with the subject of migration. Often considered distinct fields, we will explore the ways they merge together, and engage in dialogue with an array of guests from a multitude of backgrounds.nn In addition to learning about the Hostile Terrain94 project through tagging the identities of lives of those lost along the Sonoran desert and considering the U.S. policy of prevention through deterrence to crossing the U.S. Mexican Border, this class will explore art making with paper as the primary media. Paper with its material qualities can provide diverse and accessible entryways into the processes of inclusion, recordation, and mass participation. Through the interconnecting of the practical task of filling information onto toe tags to create the exhibition at the Anderson Collection, which documents the human remains of migrants identified for the exhibition (Fall 2020) with creating new objects in paper, the projects in this course will discover and recover identity through articulations of identity in paper.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "207806",
        "number": "CHILATST 201B",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "212",
        "title": "Biology, Culture and Social Justice in Latin America: Perspectives from Forensic Anthropology (ANTHRO 212B, CSRE 212)",
        "description": "This course will only take place in the first 5 weeks of the quarter.As forensic anthropologists, we are routinely asked to make identifications of unknown human remains and provide courtroom testimony. Latin America has become a nexus for social justice work, as we respond to the humanitarian crisis along the U.S.-M&eacute;xico Border. To improve identification methods of the undocumented dead, we must understand the diversity in Latinx people and adopt best scientific practices. This course provides a cross-disciplinary, bio-cultural approach to Latin American variation and training in applied methods of forensic anthropology. Explore how tools of biological and cultural anthropology are used jointly in human rights investigation and social justice advancement. Discover the breadth of Latinx diversity and how historical, geographic, and socio-cultural factors shape this variation. Gain hands-on experience in case analysis, using skeletal, genetic, and recovery context information to estimate key parameters of identity. Use case studies to contextualize this work through an intersectional lens that attends to the living families and the applicable historical, geo-political and socio-cultural conditions.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221297",
        "number": "CHILATST 212",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "271B",
        "title": "US Latinx History (HISTORY 271B, HISTORY 371B)",
        "description": "This course introduces scholarship on Latinx history, a field of critical importance to U.S. History, American studies, Latinx studies, ethnic studies, Latin American studies, and African American history. In order to cover a plethora of Latinx experiences, it will focus on Mexican, Puerto Rican, Dominican, Central American, and other Latinx communities from the 1840s into present, though it does not adhere to a strict chronological time frame. This course attempts to show the hemispheric nature of Latinx history. It also emphasizes a notion of Latinidad as a contingent historical process. Key themes which survey its complexity include the nature and legacies of imperialism; the politics of peoplehood and citizenship; trans-border connections; the importance of race, class, and gender in defining politics and culture; the emergence of ethnic nationalisms; and the development of urban enclaves. In particular, our class will focus on linking these dynamics to present-day issues and debates.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "32648",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223296",
        "number": "CHILATST 271B",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "274",
        "title": "Mexican American History (HISTORY 274C, HISTORY 374C)",
        "description": "This course will explore the history of Mexican migrants and Mexican Americans from 1848 to the present.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221664",
        "number": "CHILATST 274",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "277",
        "title": "Refugees and Asylum (HISTORY 277, HISTORY 377)",
        "description": "This course explores the histories of refugees and asylum seekers to the United States and helps students learn how people seek asylum by working on the legal cases of current asylum seekers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224631",
        "number": "CHILATST 277",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHILATST",
        "code": "293",
        "title": "Black and Brown: American Artists of Color (AFRICAAM 193, ARTHIST 293, CSRE 293)",
        "description": "This course explores the art history of African American and Latina/o/x artists in the United States, Latin America &amp; the Caribbean. Focused on particular exhibition and collection histories, students will consider the artistic, social and political conditions that led Black and Brown artists to learn from each other, work together, and unite around issues of race, civil rights, immigration, and justice.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223193",
        "number": "CHILATST 293",
        "units": [
            4,
            5
        ]
    }
]