[
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "19SI",
        "title": "Philosophy of the Covid-19 Pandemic",
        "description": "The coronavirus pandemic has brought philosophical questions about morality, politics, and bioethics into sharp relief. These include questions about how to balance personal freedom and collective interests, how to allocate medical resources, and issues of justice in the treatment of &iquest;essential workers,&iquest; among other topics. This class provides a setting for in-depth, group discussion of these questions and more. It will bring together 10-20 students to read articles, hear from guest lecturers, and deliberate about these issues. The goal is to engage students in philosophy as an accessible, interpersonal practice of questioning concepts and refining our beliefs about the world around us. Prior study of philosophy is not needed. Although rooted in philosophy, this class will examine topics through the lens of economics, public policy, law, psychology, and more. Readings are drawn from both formal texts and thought-pieces/op-eds from mainstream publications. To apply for the class, please fill out this form by Friday September 4th, 2020 at 11:59pm PST https://forms.gle/iqtuQLLRuUv6V5cK7.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "222957",
        "number": "ETHICSOC 19SI",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "20",
        "title": "Introduction to Moral Philosophy (PHIL 2)",
        "description": "What should I do with my life? What kind of person should I be? How should we treat others? What makes actions right or wrong? What is good and what is bad? What should we value? How should we organize society? Is there any reason to be moral? Is morality relative or subjective? How, if at all, can such questions be answered? Intensive introduction to theories and techniques in contemporary moral philosophy.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30808",
                "currentClassSize": "0",
                "maxClassSize": "95",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "260-113",
                        "instructors": [
                            {
                                "name": "Madigan, T.",
                                "sunet": "tmadigan"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-EthicReas",
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "211383",
        "number": "ETHICSOC 20",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "22A",
        "title": "Searching Together after the Common Good: An Introduction to Ethics in the Western Tradition (SLE 22A)",
        "description": "Important works from the Western tradition will be used to construct and explore some basic frameworks for ethical thinking. Students will gain a familiarity with some canonical texts and develop skills of close-reading and group discussion when it comes to ethical inquiry. Course texts can vary by quarter and year but will include a mix of canonical philosophical, religious, and literary texts. NOTE: Former SLE students should sign up for the ETHICSOC 22A/ ETHICSOC 22B listings.  SLE 22A/SLE 22B are courses in ethics for high school students, taught primarily through an history based humanities curriculum.  Stanford Student's participation in this course will include classroom experience with the high school students, as well as time with the course instructors to discuss, evaluate, and reflect on the course design.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14723",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Watkins, G.",
                                "sunet": "gwatkins"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223957",
        "number": "ETHICSOC 22A",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "22B",
        "title": "Searching Together after the Common Good: An Introduction to Ethics in the Western Tradition (SLE 22B)",
        "description": "Important works from the Western tradition will be used to construct and explore some basic frameworks for ethical thinking. Students will gain a familiarity with some canonical texts and develop skills of close-reading and group discussion when it comes to ethical inquiry. Course texts can vary by quarter and year but will include a mix of canonical philosophical, religious, and literary texts. NOTE: Former SLE students should sign up for the ETHICSOC 22A/ ETHICSOC 22B listings.  SLE 22A/SLE 22B are courses in ethics for high school students, taught primarily through an history based humanities curriculum.  Stanford Student's participation in this course will include classroom experience with the high school students, as well as time with the course instructors to discuss, evaluate, and reflect on the course design.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14777",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224887",
        "number": "ETHICSOC 22B",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "24SI",
        "title": "Deliberative Discussions",
        "description": "Deliberative Discussions arose out of an initiative of the ASSU Undergraduate Senate and offers the opportunity for students with different political beliefs and backgrounds to share food with one another and discuss controversial issues that are important to them.  After some initial framing and norm setting by the instructor, students select their own topics and identify readings for each other to discuss.  Students will practice active listening and build trust through the process of civil dialogue and mutual exchange.  Enrollment is by application only, which you can learn about here:  https://docs.google.com/document/d/1LI19m7rg90Bdf81xIIMK1cdNsrCBnGjRIW2s7V15MLo/edit. Please contact Collin Anthony Chen (canthony@stanford.edu) with any questions.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ACT",
                "notes": null,
                "classId": "32087",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chen, C.",
                                "sunet": "canthony"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221353",
        "number": "ETHICSOC 24SI",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "25SI",
        "title": "Effective Altruism - How can we have the biggest positive impact?",
        "description": "This course will introduce students to Effective Altruism - a social movement and philosophy attempting to maximize positive social impact, along with critiques and questions raised by the philosophy. The course will feature lectures, discussions and workshops to think through how we can increase our impact with our careers, time, donations and other resources.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "222332",
        "number": "ETHICSOC 25SI",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "36X",
        "title": "Dangerous Ideas (ARTHIST 36, COMPLIT 36A, EALC 36, ENGLISH 71, FRENCH 36, HISTORY 3D, MUSIC 36H, PHIL 36, POLISCI 70, RELIGST 36X, SLAVIC 36, TAPS 36)",
        "description": "Ideas matter. Concepts such as equality, tradition, and Hell have inspired social movements, shaped political systems, and dramatically influenced the lives of individuals. Others, like race and urban renewal, play an important role in contemporary debates in the United States. All of these ideas are contested, and they have a real power to change lives, for better and for worse. In this one-unit class we will examine these &quot;dangerous&quot; ideas. Each week, a faculty member from a different department in the humanities and arts will explore a concept that has shaped human experience across time and space.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "219068",
        "number": "ETHICSOC 36X",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "75",
        "title": "Bioethics Fellowship",
        "description": "Students admitted to the Bioethics Fellowship hosted by the McCoy Family Center for Ethics in Society should enroll in this course.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "225480",
        "number": "ETHICSOC 75",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "79",
        "title": "Ethics and Leadership in Public Service (CSRE 126C, EDUC 126A, URBANST 126A)",
        "description": "This course explores ethical questions that arise in public service work, as well as leadership theory and skills relevant to public service work. Through readings, discussions, in-class activities, assignments, and guest lectures, students will develop a foundation and vision for a future of ethical and effective service leadership. This course serves as a gateway for interested students to participate in the Haas Center's Public Service Leadership Program.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29467",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lobo, K.",
                                "sunet": "klobo"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "208204",
        "number": "ETHICSOC 79",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "79Y",
        "title": "On Condoned Violence: from Punishment to Pleasure (PHIL 79Y)",
        "description": "This course offers students an introduction to issues surrounding the ways in which punishment and violence have been justified in the Western tradition. The readings address condoned violence broadly understood, covering a wide array of practices that produce suffering, but are considered justifiable to one degree or another by states or societies: judicial punishment, incarceration, the death penalty, pornography, and industrial farming practices, among others. We shall not discuss war, but will focus instead on domestic phenomena. By considering how such forms of violence are justified, the course aims to critically approach the notion that human societies are generally moving towards greater kindness and empathy. This seminar will bring together texts from political theory and political philosophy, legal theory, comparative politics, alongside several other cultural attach&eacute;s.  This class is on the Pre-Approved Courses list for the Political Science department.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "222652",
        "number": "ETHICSOC 79Y",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "85",
        "title": "Introduction to Tech Ethics and Policy Career Pathways (ETHICSOC 285)",
        "description": "Focuses on equipping students with critical thinking, analysis, and independent learning skills on topics within tech ethics and policy to prepare them for summer internship placements. Other tech industry, government, and civil society leaders will participate as appropriate. All students requesting admission to this course must be previously selected Tech Ethics and Policy Fellows. Visit https://solo.stanford.edu/apply/F2Q4 for more about this work/study program.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224954",
        "number": "ETHICSOC 85",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "95",
        "title": "Leadership Challenges in Public Service (PUBLPOL 111)",
        "description": "This course will examine the responsibilities and challenges for those who occupy leadership roles in public service, broadly defined to include work in government, non-profit organizations, academia, and philanthropy, whether as a full- time career or part &iquest;time volunteer. Topics will include characteristics and styles of leadership, organizational dynamics, forms of influence, decision making, diversity, social change, and ethical responsibilities. Class sessions will include visitors who have occupied prominent leadership roles. Readings will include excerpts of relevant research, problems, exercises, and case studies. This course serves as a gateway for students participating in the Public Service Leadership Program, coordinated through the Haas Center. The class will be capped at 40 students.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217859",
        "number": "ETHICSOC 95",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "106",
        "title": "Human Rights in Comparative and Historical Perspective (CLASSICS 116, CLASSICS 216, HUMRTS 106)",
        "description": "The course examines core human rights concepts and issues as they arise in a variety of contexts ranging from the ancient world to today. These issues include slavery, human trafficking, gender based violence, discrimination against marginalized groups, and how these and other issues are linked to war, internal conflict, and imperialism. We will consider the ways in which such issues emerge, are explicitly treated, or are ignored in a variety of historical and contemporary settings with a particular emphasis on the impact that war and conflict have on laws and norms that in principle aim to protect individuals from violence and exploitation. This inquiry also entails consideration of the modern notion of the universality of human rights based on a conception of a common humanity and how alien that concept is in states and communities that define or embody hierarchies that systematically exclude groups or populations from the protections and respect that other groups and individuals are afforded. Nowhere do the devastating consequences of such exclusions become clearer than in times of crisis and conflict. The course draws upon a variety of case studies from the Greco-Roman world and other temporal and geographical contexts to explore the political and social dynamics that shape and inform the violence inherent in such events.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15020",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "219927",
        "number": "ETHICSOC 106",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "107",
        "title": "Rethinking Meat: An Introduction to Alternative Proteins (EARTHSYS 109, EARTHSYS 209, ESS 103, ESS 203)",
        "description": "How do we feed a growing population in the face of climate change? Will Impossible Burgers become the new norm? Are you curious to learn about a frontier in bio- and chemical-engineering? Are you passionate about animal rights, human health, and sustainable agriculture? Learn about the environmental, ethical, and economic drivers behind the market for meat replacements. We'll take a deep dive into the science and technology used to develop emerging plant, fermentation and cell-based meat alternatives and explore the political challenges and behavioral adaptation needed to decrease meat consumption. Hear from entrepreneurs, researchers, and innovative startups developing sustainable and marketable alternative proteins through weekly guest lectures from industry leaders.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13718",
                "currentClassSize": "0",
                "maxClassSize": "200",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lobell, D.",
                                "sunet": "dlobell"
                            },
                            {
                                "name": "Press, E.",
                                "sunet": "epress"
                            },
                            {
                                "name": "Fajer, E.",
                                "sunet": "efajer"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223235",
        "number": "ETHICSOC 107",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "121N",
        "title": "Ethics of Sports (PHIL 21N)",
        "description": "This seminar will be focused on the ethical challenges that are encountered in sport. We will focus on the moral and political issues that affect the world of sport and which athletes, coaches, sports commentators and fans are faced with. For instance, we will ask questions such as: what is a fair game (the ethics of effort, merit, success)? Is it ethical to train people to use violence (the ethics of martial arts)? Are divisions by gender categories justified and what should we think of gender testing? Is the use of animals in sport ever justified? Which forms of performance enhancements are acceptable in sport (the ethics of drug use and enhancements through technologies)? Should we ban sports that damage the players&iquest; health? Does society owe social support to people who hurt themselves while practicing extreme sports? nnThe class will be structured around small group discussions and exercises as well as brief lectures to introduce key moral and political concepts (such as fairness, equality, freedom, justice, exploitation, etc.). I will also bring guests speakers who are involved in a sport activity at Stanford or who have worked on sports as part of their academic careers. By the end of the seminar, students will have a good understanding of the various ethical challenges that surround the world of sport. They will be able to critically discuss sport activities, norms, modes of assessments and policies (on campus and beyond). They will also be prepared to apply the critical ethical thinking that they will have deployed onto other topics than sports. They will have been introduced to the normative approach to social issues, which consists in asking how things should be rather than describing how things are. They will be prepared to take more advanced classes in ethics, political theory, as well as moral and political philosophy.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "218171",
        "number": "ETHICSOC 121N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "127B",
        "title": "Leadership, Organizing and Action: Intensive (CSRE 127B, LEAD 127B, URBANST 127B)",
        "description": "Two Consecutive Weekend Course: Community Organizing makes a difference in addressing major public challenges that demand full engagement of the citizenry, especially those whose voices are marginalized. In this course you will learn and practice the leadership skills needed to mobilize your communities for positive social change. We identify leadership as accepting responsibility to enable others to achieve shared purpose in the face of uncertainty. As organizers you will learn how to develop capacity within your community and analyze power dynamics to develop a strategic plan. By the end of this course, you will create an organizing campaign that builds power rooted in the resources of your community. The class will be an intensive held the first two weekends of winter quarter, Jan 12-14 and Jan 19-21, 2024. Class begins on Friday in the afternoon and runs through early Sunday evening. In weeks 3-10 there will be team meetings schedule TBD along with one final all class gathering Week 7 or 10.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "15476",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hahn Tapper, L.",
                                "sunet": "lhahn"
                            },
                            {
                                "name": "Kokenis, T.",
                                "sunet": "tkokenis"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224851",
        "number": "ETHICSOC 127B",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "127C",
        "title": "Leadership, Organizing and Action: Campaign Coaching (URBANST 127C)",
        "description": "Community Organizing makes a difference in addressing major public challenges that demand full engagement of the citizenry, especially those whose voices are marginalized. In this course you will learn and practice the leadership skills of campaign coaching in order to facilitate others to mobilize their communities for positive social change. Enrollment by consent of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15477",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hahn Tapper, L.",
                                "sunet": "lhahn"
                            },
                            {
                                "name": "Kokenis, T.",
                                "sunet": "tkokenis"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224868",
        "number": "ETHICSOC 127C",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "130",
        "title": "Liberalism and its Critics (PHIL 171P, POLISCI 130)",
        "description": "In this course, students will learn and engage with the core debates that have animated political theory in modern times. What is the proper relationship between the individual, the community, and the state? Are liberty and equality in conflict, and, if so, which should take priority? What does justice mean in a large and diverse modern society? The title of the course, borrowed from a book by Michael Sandel, is 'Liberalism and its Critics' because the questions we discuss in this class center on the meaning of, and alternatives to, the liberal ideas that the basic goal of society should be the protection of individual rights and that some form of an egalitarian democracy is the best way to achieve this goal. The course is structured around two historical phenomena: one the one hand, liberal answers to these key questions have at times seemed politically and socially triumphant, but on the other hand, this ascendency has always been challenged and contested. At least one prior class in political theory, such as Justice (PS 103), Citizenship in the 21st Century (College 102), or Democratic Theory (PS 234) is recommended but not required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32813",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "219301",
        "number": "ETHICSOC 130",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "130A",
        "title": "Classical Seminar: Origins of Political Thought (CLASSICS 181, CLASSICS 381, PHIL 176A, PHIL 276A, POLISCI 230A, POLISCI 330A)",
        "description": "Political philosophy in classical antiquity, centered on reading canonical works of Thucydides, Plato, Aristotle against other texts and against the political and historical background. Topics include: interdependence, legitimacy, justice; political obligation, citizenship, and leadership; origins and development of democracy; law, civic strife, and constitutional change.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13112",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schwartz, A.",
                                "sunet": "avshalom"
                            },
                            {
                                "name": "Ober, J.",
                                "sunet": "jober"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "123165",
        "number": "ETHICSOC 130A",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "131S",
        "title": "Modern Political Thought: Machiavelli to Marx and Mill (POLISCI 131L)",
        "description": "This course is an introduction to the history of Western political thought from the late fifteenth century through the nineteenth century. We will consider the secularization of politics, the changing relationship between the individual and society, the rise of consent-based forms of political authority, and the development and critiques of liberal conceptions of property. We will cover the following thinkers: Machiavelli, Hobbes, Locke, Rousseau, Wollstonecraft, Mill, and Marx.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32814",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:EC-EthicReas",
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "212032",
        "number": "ETHICSOC 131S",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "131X",
        "title": "Ethics in Bioengineering (BIOE 131)",
        "description": "Bioengineering focuses on the development and application of new technologies in the biology and medicine. These technologies often have powerful effects on living systems at the microscopic and macroscopic level. They can provide great benefit to society, but they also can be used in dangerous or damaging ways. These effects may be positive or negative, and so it is critical that bioengineers understand the basic principles of ethics when thinking about how the technologies they develop can and should be applied. On a personal level, every bioengineer should understand the basic principles of ethical behavior in the professional setting. This course will involve substantial writing, and will use case-study methodology to introduce both societal and personal ethical principles, with a focus on practical applications",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "12350",
                "currentClassSize": "0",
                "maxClassSize": "500",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Altman, R.",
                                "sunet": "rbaltman"
                            },
                            {
                                "name": "Magnus, D.",
                                "sunet": "dmagnus"
                            },
                            {
                                "name": "Jiang, B.",
                                "sunet": "bwjiang"
                            },
                            {
                                "name": "Weed, L.",
                                "sunet": "laraweed"
                            },
                            {
                                "name": "Klich, J.",
                                "sunet": "jhklich"
                            },
                            {
                                "name": "McRae, K.",
                                "sunet": "kcmcrae"
                            },
                            {
                                "name": "Mishra, V.",
                                "sunet": "vartikam"
                            },
                            {
                                "name": "Bhise, R.",
                                "sunet": "rbhise"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:EC-EthicReas",
            "WAY-ER"
        ],
        "objectID": "212099",
        "number": "ETHICSOC 131X",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "134",
        "title": "Ethics for Activists (POLISCI 134)",
        "description": "Activists devote sustained effort and attention toward achieving particular goals of social and political change. Do we have an ethical obligation to be activists? And how should those who do choose to be activists (for whatever reason) understand the ethics of that role? Questions discussed in this course may include: When is civil disobedience appropriate, and what does it entail? Should activists feel constrained by obligations of fairness, honesty, or civility toward those with whom we disagree? Are there special ethical considerations in activism on behalf of those who cannot advocate for themselves? What is solidarity and what does it require of us? Students in this course will develop skills in analyzing, evaluating, and constructing logical arguments about ethical concerns related to activism, but class discussions will also address the potential limitations of logical argument in ethical and political reasoning.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "33192",
                "currentClassSize": "0",
                "maxClassSize": "35",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "221462",
        "number": "ETHICSOC 134",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "134R",
        "title": "The Ethics of Elections (POLISCI 132A)",
        "description": "Do you have a duty to vote? Should immigrants be allowed to vote? Should we make voting mandatory? How (if at all) should we regulate campaign finance? Should we even have elections at all? In this course, we will explore these and other ethical questions related to electoral participation and the design of electoral institutions. We will evaluate arguments from political philosophers, political scientists, and politicians to better understand how electoral systems promote important democratic values and how this affects citizens' and political leaders' ethical obligations. We will focus, in particular, on issues in electoral design that have been relevant in recent US elections (e.g. gerrymandering), though many of the ethical issues we will discuss in this course will be relevant in any electoral democracy.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "218113",
        "number": "ETHICSOC 134R",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "135",
        "title": "Citizenship (PHIL 135X, POLISCI 135)",
        "description": "This class begins from the core definition of citizenship as membership in a political community and explores the many debates about what that membership means. Who is (or ought to be) a citizen? Who gets to decide? What responsibilities come with citizenship? Is being a citizen analogous to being a friend, a family member, a business partner? How can citizenship be gained, and can it ever be lost? These debates figure in the earliest recorded political philosophy but also animate contemporary political debates. This class uses ancient, medieval, and modern texts to examine these questions and different answers given over time. We&iquest;&Auml;&ocirc;ll pay particular attention to understandings of democratic citizenship but look at non-democratic citizenship as well. Students will develop and defend their own views on these questions, using the class texts as foundations. No experience with political philosophy is required or expected, and students can expect to learn or hone the skills (writing / reading / analysis) of political philosophy.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "220609",
        "number": "ETHICSOC 135",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "135F",
        "title": "Deliberative Democracy and its Critics (AMSTUD 135, COMM 135W, COMM 235, COMM 335, POLISCI 234P, POLISCI 334P)",
        "description": "This course examines the theory and practice of deliberative democracy and engages both in a dialogue with critics. Can a democracy which emphasizes people thinking and talking together on the basis of good information be made practical in the modern age? What kinds of distortions arise when people try to discuss politics or policy together? The course draws on ideas of deliberation from Madison and Mill to Rawls and Habermas as well as criticisms from the jury literature, from the psychology of group processes and from the most recent normative and empirical literature on deliberative forums. Deliberative Polling, its applications, defenders and critics, both normative and empirical, will provide a key case for discussion.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15397",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": "120-S40",
                        "instructors": [
                            {
                                "name": "Fishkin, J.",
                                "sunet": "jfishkin"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 69600.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "212937",
        "number": "ETHICSOC 135F",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "136R",
        "title": "Introduction to Global Justice (INTNLREL 136R, PHIL 76, POLISCI 136R, POLISCI 336)",
        "description": "As we live in a globalized world, our lives are interconnected with many other people within and beyond the state borders. Currently, we face urgent problems of global justice, such as climate change, economic inequality, immigration, and health disparities, and how to address these issues is a crucial question for all of us. This course introduces students to normative inquiries into issues of global justice and offers an opportunity to integrate theories and practices by engaging with essential and timely questions. What normative demands does justice impose on individuals and institutions in a global world? Do people in affluent countries bear the responsibility for the suffering of those who live in other countries? Should relatively developed countries open their borders to those from developing countries? How should we allocate responsibilities for reducing global injustice, such as health disparities? How does injustice with historical roots, such as colonialism, further complicate the picture of normative demands? While there are no easy answers to these questions, throughout this course, students will be exposed to interdisciplinary approaches (including philosophy, political theory, gender studies, etc.), learn to critically analyze various theoretical approaches, and use them as frameworks to develop their views on issues of global justice. Please note that in addition to the listed lecture time, students must sign up for a 45-min discussion session. The schedule of the discussion session will be announced during the first week of the quarter.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "12355",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lin, T.",
                                "sunet": "tinanlin"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-EthicReas",
            "WAY-ER"
        ],
        "objectID": "207533",
        "number": "ETHICSOC 136R",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "146",
        "title": "Political Thought in Modern Asia (CHINA 146, CHINA 246, POLISCI 235N, POLISCI 335N)",
        "description": "The study of political theory in the United States has been accused of being Western-centric: We tend to focus on intellectual traditions from Plato to NATO, while ignoring the vast world of non-Western societies and the ways they think about politics and public life. How do Chinese thinkers conceptualize human rights and good governance? How do Indian intellectuals reconcile democracy and inherited hierarchies in Hinduism? How do Islamic scholars view the relationship between religious authority and secular authority? Should we regard liberal democracy, or Western civilization more broadly, as representing the universal value guiding every society? Or, should we learn from non-Western ideas and values so as to solve problems plaguing Western societies? How can competing visions of good life coexist in a globalized and increasingly pluralistic world? This course aims to answer these questions by exploring three Asian traditions and their perspectives on politics: Confucianism, Hinduism, and Islam. We will focus on the modern period (19th-21st centuries) and the ways intellectuals in these societies respond to the challenge of modernity and Western superiority. Special attention is given to how these intellectuals conceive of the relationship between modernity and their respective traditions: Are they compatible or mutually exclusive? In which ways do intellectuals interpret these traditions so as to render them (in)compatible with modernity? We will read academic articles written by Anglophone scholars as well as original texts written by non-Western thinkers. No knowledge of non-Western languages is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "222622",
        "number": "ETHICSOC 146",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "151",
        "title": "The First Amendment:  Freedom of Speech and Press (COMM 151, COMM 251, POLISCI 125P)",
        "description": "(Graduate students enroll in 251. COMM 151 is offered for 5 units, COMM 251 is offered for 4 units.) The First Amendment: Freedom of Speech and Press (Law 7084): Introduction to the constitutional protections for freedom of speech, press, and expressive association. All the major Supreme Court cases dealing with issues such as incitement, libel, hate speech, obscenity, commercial speech, and campaign finance. There are no prerequisites, but a basic understanding of American government would be useful.  This course is crosslisted in the university and undergraduates are eligible to take it.  Elements used in grading:  Law students will be evaluated based on class participation and a final exam.  Non-law students will be evaluated on class participation, a midterm and final exam, and nonlaw students will participate in a moot court on a hypothetical case. Non-law students will also have an additional one hour discussion section each week led by a teaching assistant.  Cross-listed with Communication (COMM 151, COMM 251) and Political Science (POLISCI 125P).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "214488",
        "number": "ETHICSOC 151",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "151C",
        "title": "Ethical STEM: Race, Justice, and Embodied Practice (AFRICAAM 151, ARTSINST 151C, CSRE 151C, STS 51D, SYMSYS 151D, TAPS 151D)",
        "description": "What role do science and technology play in the creation of a just society? How do we confront and redress the impact of racism and bias within the history, theory, and practice of these disciplines? This course invites students to grapple with the complex intersections between race, inequality, justice, and the STEM fields. We orient to these questions from an artistically-informed position, asking how we can rally the embodied practices of artists to address how we think, make, and respond to each other. Combining readings from the history of science, technology, and medicine, ethics and pedagogy, as well as the fine and performing arts, we will embark together on understanding how our STEM practices have emerged, how we participate today, and what we can imagine for them in the future. The course will involve workshops, field trips (as possible), and invited guests. All students, from any discipline, field, interest, and background, are welcome! This course does build upon the STS 51 series from 2020-21, though it is not a prerequisite for this course.  Please contact the professor if you have any questions!",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "33091",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223762",
        "number": "ETHICSOC 151C",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "170",
        "title": "Ethical Theory (PHIL 170, PHIL 270)",
        "description": "This course explores some major topics/themes in ethical theory from the middle of the 20th century through the present.  We'll read philosophy by John Rawls, Thomas Nagel, Bernard Williams, Christine Korsgaard, G.E.M. Anscombe, Philipa Foot, and others.  Substantial background in moral philosophy will be assumed.  Students should have completed Philosophy 2 (or its equivalent - if you have questions, please contact the instructor).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32816",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-EthicReas",
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "122266",
        "number": "ETHICSOC 170",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "171",
        "title": "Justice (PHIL 171, POLISCI 103, POLISCI 336S, PUBLPOL 103C)",
        "description": "Justice, as we use the term in this class, is a question about social cooperation. People can produce much more cooperatively than the sum of what they could produce as individuals, and these gains from cooperation are what makes civilization possible. But on what terms should we cooperate? How should we divide, as the philosopher John Rawls puts it, &quot;the benefits and burdens of social cooperation&quot;? Working primarily within the Anglo-American philosophical tradition, we'll discuss different answers to this big question as a way to bring together some of the most prominent debates in modern political philosophy. We'll study theories including utilitarianism, libertarianism, classical liberalism, and egalitarian liberalism, and we'll take on complex current issues like reparations for racial injustice, the gender pay gap, and responses to climate change. This class is meant to be an accessible entry point to political philosophy. No experience with political science or philosophy is required or assumed, and we will spend time on the strategy of philosophy as well: understanding how our authors make their arguments to better respond to them and make our own.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Please enroll in this course through Axess and use Canvas to enroll in the discussion sections.",
                "classId": "12188",
                "currentClassSize": "0",
                "maxClassSize": "165",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Hewlett Teaching Center 201",
                        "instructors": [
                            {
                                "name": "Coyne, B.",
                                "sunet": "bkcoyne"
                            },
                            {
                                "name": "Minsk, A.",
                                "sunet": "aminsk"
                            },
                            {
                                "name": "Owen, M.",
                                "sunet": "owenmt"
                            },
                            {
                                "name": "Thomas, M.",
                                "sunet": "msthomas"
                            },
                            {
                                "name": "Luo, S.",
                                "sunet": "luos"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-EthicReas",
            "WAY-ER"
        ],
        "objectID": "122269",
        "number": "ETHICSOC 171",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "172",
        "title": "History of Modern Moral Philosophy (PHIL 172, PHIL 272)",
        "description": "A critical exploration of some main forms of systematic moral theorizing in Western philosophy from Hobbes onward and their roots in ancient, medieval, and earlier modern ethical thought. Prerequistes are some prior familiarity with utilitarianism and Kantian ethics and a demonstrated interest in philosophy. Grads enroll in 272.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "33193",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hills, D.",
                                "sunet": "dhills"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "207496",
        "number": "ETHICSOC 172",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "175B",
        "title": "Philosophy of Law (PHIL 175, PHIL 275)",
        "description": "This course will explore foundational issues about the nature of law and its relation to morality, and about legal responsibility and criminal punishment. Toward the end we will turn to issues about the criminal culpability of children.  Prerequisite:  Philosophy 80",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "33194",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bratman, M.",
                                "sunet": "bratman"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "208684",
        "number": "ETHICSOC 175B",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "175W",
        "title": "Philosophy of Law: Protest, Punishment, and Racial Justice (AFRICAAM 175, CSRE 175W, PHIL 175W, PHIL 275W, POLISCI 137, POLISCI 337)",
        "description": "In this course, we will examine some of the central questions in philosophy of law, including: What is law? How do we determine the content of laws? Do laws have moral content? What is authority? What gives law its authority? Must we obey the law? If so, why? How can we justify the law? How should we understand and respond to unjust laws? What is punishment? What is punishment for? What, if anything, justifies punishment by the state? What is enough punishment? What is too much punishment? What does justice require under nonideal conditions?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "15036",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Salkin, W.",
                                "sunet": "salkin"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221829",
        "number": "ETHICSOC 175W",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "176",
        "title": "Political Philosophy: The Social Contract Tradition (PHIL 176, PHIL 276, POLISCI 137A, POLISCI 337A)",
        "description": "(Graduate students register for 276.) What makes political institutions legitimate? What makes them just? When do citizens have a right to revolt against those who rule over them? Which of our fellow citizens must we tolerate?Surprisingly, the answers given by some of the most prominent modern philosophers turn on the idea of a social contract. We will focus on the work of Hobbes, Locke, Rousseau, and Rawls.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32817",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "122284",
        "number": "ETHICSOC 176",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "177K",
        "title": "On Domination (ETHICSOC 277K, PHIL 177K, PHIL 277K)",
        "description": "Domination is a morally problematic form of social power. To be dominated, according to republican political philosophy, is to be subject to the arbitrary or uncontrolled power of another. And to be free is the absence of domination. This view was the dominant political conception of freedom in the western political tradition until the rise of classical liberalism in the 19th century. In this course, we will examine different accounts of domination and freedom in the republican political tradition and critiques of non-domination as a political conception of freedom. We will also examine the contemporary revival of the republican view and its application to social relations ranging from the workplace to the family and beyond (prerequisite: PHIL 80).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223533",
        "number": "ETHICSOC 177K",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "178M",
        "title": "Introduction to Environmental Ethics (EARTHSYS 178M, ETHICSOC 278M, PHIL 178M, PHIL 278M, POLISCI 134L)",
        "description": "How should human beings interact with the natural world? Do we have moral obligations toward non-human animals and other parts of nature? And what do we owe to other human beings, including future generations, with respect to the environment? In this course, we will tackle ethical questions that confront us in our dealings with the natural world, looking at subjects such as: animal rights; conservation; economic approaches to the environment; access to and control over natural resources; environmental justice and pollution; climate change; technology and the environment; and environmental activism. We will frame our inquiry with leading ethical theories and divide our approach to these topics by ecosystem, dedicating time to each unique environment and its specific nuances: aquatic, desert/tundra, forest/grassland, and the increasingly recognized environment of Space.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32457",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Abelson, S.",
                                "sunet": "sabelson"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:EC-EthicReas",
            "WAY-ER"
        ],
        "objectID": "211439",
        "number": "ETHICSOC 178M",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "179W",
        "title": "Du Bois and Democracy (CSRE 179W, PHIL 179W, PHIL 279W)",
        "description": "In this course, we will work together to develop a detailed and comprehensive understanding of the political philosophy of W. E. B. Du Bois, giving special attention to the development of his democratic theory. We will do so by reading a number of key texts by Du Bois as well as contemporary scholarship from philosophy and cognate fields.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221830",
        "number": "ETHICSOC 179W",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "182",
        "title": "Ethics, Public Policy, and Technological Change (COMM 180, CS 182, PHIL 82, POLISCI 182, PUBLPOL 182)",
        "description": "Examination of recent developments in computing technology and platforms through the lenses of philosophy, public policy, social science, and engineering.&nbsp;&nbsp;Course is organized around five main units: algorithmic decision-making and bias; data privacy and civil liberties; artificial intelligence and autonomous systems; the power of private computing platforms; and issues of diversity, equity, and inclusion in the technology sector.&nbsp;&nbsp;Each unit considers the promise, perils, rights, and responsibilities at play in technological developments. Prerequisite: CS106A.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "221395",
        "number": "ETHICSOC 182",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "182M",
        "title": "Markets, Ethics, and Society",
        "description": "Business activity has been an inalienable part of human life; as a result, there is always a pressing demand to address the ethical issues that arise in the business context and consider the ethical implications of their impact on people, society, and the world. This course introduces students to philosophical inquiry into ethical issues surrounding business and offers an opportunity to combine ethical theory and practice by engaging with essential and timely questions. Why is ethics important for business? Should corporations mainly be responsible for the interests of shareholders, or should they also take other factors into account? How should we understand the conflict of interests between employees and managers? What does the value of diversity imply in hiring and corporate culture? What marks the difference between ethical and unethical advertisements? What are some ethical concerns regarding emerging technologies and business models, such as attention economy, sharing economy, and artificial intelligence? Throughout this course, students will learn how philosophers have tried to address these questions and use them as frameworks to develop their views on the relationships between business, ethics, and society. This course meets the requirement for Ethical Reasoning (ER) and is open to students in all majors across the university. No prior knowledge of philosophy is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER:EC-EthicReas",
            "WAY-ER"
        ],
        "objectID": "213266",
        "number": "ETHICSOC 182M",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "185M",
        "title": "Contemporary Moral Problems (PHIL 72, POLISCI 134P)",
        "description": "In this course, we will discuss the body as a site of moral and political conflict. Here are a few of the questions that will be explored: People are encouraged to become kidney donors, but we still don't have enough kidneys for everybody who needs one. Should you be allowed to sell a kidney? Suppose Robert is dying of a rare disease and the only thing that could save his life is a bone marrow transplant from his cousin David, but David doesn't want to donate. Should we force him to &quot;donate&quot;? Some people say a woman should be free to make abortion decisions on whatever grounds she wants, including prenatal genetic testing for conditions like Down syndrome; others condemn such selective abortion as an unacceptable form of eugenics. What genetic testing information, if any, should be allowed to influence a woman's decision about whether to terminate a pregnancy? In addition to these normative questions, we will also study related questions in constitutional law. When the Supreme Court decided that abortion was a constitutional right in Roe v. Wade, on what legal reasoning did they base their decision? When they decided to overturn Roe in the recent Dobbs v. Jackson, what legal reasoning did they use then? How will Dobbs affect other (current) constitutional rights?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13134",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Karlan, B.",
                                "sunet": "bkarlan"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:EC-EthicReas",
            "WAY-ER"
        ],
        "objectID": "209134",
        "number": "ETHICSOC 185M",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "185X",
        "title": "Environmental Ethics",
        "description": "Crosscultural perspective. Application of environmental ethics to contentious or incommensurable beliefs or values.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-SocSci"
        ],
        "objectID": "205309",
        "number": "ETHICSOC 185X",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "187",
        "title": "The Ethics, Law and Politics of Artificial Intelligence (PHIL 78E)",
        "description": "This course explores cutting-edge disputes in the ethics, law and politics of artificial intelligence. We will examine the relation between foundational questions about fairness, autonomy, corporate responsibility, and the value of human life; and practical questions about the ethical design and regulation of emerging technologies. Topics include superintelligence and existential risk, explainable intelligent systems, nudging and targeted advertising, and algorithmic fairness.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "222609",
        "number": "ETHICSOC 187",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "190",
        "title": "Ethics in Society Honors Seminar (PHIL 178)",
        "description": "For Ethics in Society honors students. Methods of research. Students present issues of public and personal morality; topics chosen with advice of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28682",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "McQueen, A.",
                                "sunet": "amcqueen"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "122290",
        "number": "ETHICSOC 190",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "195",
        "title": "Ethics in Society Workshop",
        "description": "Workshop for Ethics in Society seniors completing their honors thesis.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "13104",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McQueen, A.",
                                "sunet": "amcqueen"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220148",
        "number": "ETHICSOC 195",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "199",
        "title": "Independent Studies in Ethics in Society",
        "description": "May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27296",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wenar, L.",
                                "sunet": "lwenar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29199",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wenar, L.",
                                "sunet": "lwenar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28885",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wenar, L.",
                                "sunet": "lwenar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "202670",
        "number": "ETHICSOC 199",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "200A",
        "title": "Ethics in Society Honors Thesis",
        "description": "Limited to Ethics in Society (EiS) honors students. EiS honors students must enroll in 200A in the fall quarter, 200B in the winter quarter, and 200C in the spring quarter of their senior year. Students enrolling in 200A for less than 3 units must get approval from the faculty director.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "10430",
                "currentClassSize": "0",
                "maxClassSize": "1",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McQueen, A.",
                                "sunet": "amcqueen"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "29552",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wenar, L.",
                                "sunet": "lwenar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "29586",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sahami, M.",
                                "sunet": "sahami"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "29551",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chapman, E.",
                                "sunet": "emileebc"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "29553",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "29564",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Reich, R.",
                                "sunet": "reich"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "124385",
        "number": "ETHICSOC 200A",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 6
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "200B",
        "title": "Ethics in Society Honors Thesis",
        "description": "Limited to Ethics in Society honors students, who must enroll once in 200A, once in 200B, and once in 200C in their senior year. Students enrolling in 200B for less than 3 units must get approval from the faculty director.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28727",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McQueen, A.",
                                "sunet": "amcqueen"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "14754",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wenar, L.",
                                "sunet": "lwenar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "11390",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sahami, M.",
                                "sunet": "sahami"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "13589",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chapman, E.",
                                "sunet": "emileebc"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "12791",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "14",
                "component": "T/D",
                "notes": null,
                "classId": "10438",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Reich, R.",
                                "sunet": "reich"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "124386",
        "number": "ETHICSOC 200B",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 6
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "200C",
        "title": "Ethics in Society Honors Thesis",
        "description": "Limited to Ethics in Society honors students, who must enroll once in 200A, once in 200B, and once in 200C in their senior year. Students enrolling in 200C for less than 3 units must get approval from the faculty director.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29430",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wenar, L.",
                                "sunet": "lwenar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "11460",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Reich, R.",
                                "sunet": "reich"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "12541",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bidadanure, J.",
                                "sunet": "jbidadan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "14765",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "King, J.",
                                "sunet": "kingjen"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "14956",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Coyne, B.",
                                "sunet": "bkcoyne"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "14957",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Satz, D.",
                                "sunet": "dsatz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "14958",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Salkin, W.",
                                "sunet": "salkin"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "14959",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sagan, S.",
                                "sunet": "ssagan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "14960",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jackson, R.",
                                "sunet": "robertj2"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215532",
        "number": "ETHICSOC 200C",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 9
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "204",
        "title": "Introduction to Philosophy of Education (EDUC 204)",
        "description": "How to think philosophically about educational problems. Recent influential scholarship in philosophy of education. No previous study in philosophy required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "12613",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Ceras 108",
                        "instructors": [
                            {
                                "name": "Cox, G.",
                                "sunet": "gcox"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "101586",
        "number": "ETHICSOC 204",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "217X",
        "title": "Free Speech, Academic Freedom, and Democracy (EDUC 217, PHIL 278C)",
        "description": "The course examines connected ideas of free speech, academic freedom, and democratic legitimacy that are still widely shared by many of us but have been subject to skeptical pressures both outside and inside the academy in recent years.  The course explores the principled basis of these ideas, how well they might (or might not) be defended against skeptical challenge, and how they might be applied in particular controversies about the rights of students, instructors, and researchers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "219078",
        "number": "ETHICSOC 217X",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "232T",
        "title": "Ethical and Effective Philanthropy for Sustainable Development (POLISCI 236, POLISCI 236S, SUSTAIN 222)",
        "description": "What is the most effective way to support sustainable development? In a team-based, experiential project, students will select a nonprofit organization to receive a class donation of $50,000 to support learning to think ethically and strategically about promoting sustainable development. For example, should we prioritize developing clean energy technology, changing climate policies, advocating for environmental education and justice, or reducing immediate harm to human health? These are the difficult choices facing philanthropists, whose global giving to sustainable development now exceeds 110bn dollars per year. Students will develop a pitch about why an organization should receive the donation and how they would evaluate the grant's success, based on course readings and lectures on topics such as effective altruism, outcomes-based philanthropy, trust-based giving, and philanthropy from an environmental justice lens. We will also reflect on the appropriate role for private philanthropy and nonprofits versus business and government in solving social problems. **This course is designed for undergraduate students**",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "10837",
                "currentClassSize": "0",
                "maxClassSize": "9",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Michalchik, V.",
                                "sunet": "safa"
                            },
                            {
                                "name": "Bromley, P.",
                                "sunet": "triciam"
                            },
                            {
                                "name": "Salia, R.",
                                "sunet": "rsalia"
                            },
                            {
                                "name": "Gavrila, G.",
                                "sunet": "sgavrila"
                            },
                            {
                                "name": "Santos, H.",
                                "sunet": "hsantos1"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "212666",
        "number": "ETHICSOC 232T",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "234",
        "title": "Democratic Theory (PHIL 176P, POLISCI 234)",
        "description": "Most people agree that democracy is a good thing, but do we agree on what democracy is?  This course will examine the concept of democracy in political philosophy.  We will address the following questions: What reason(s), if any, do we have for valuing democracy?  What does it mean to treat people as political equals?  When does a group of individuals constitute &quot;a people,&quot; and how can a people make genuinely collective decisions?  Can democracy really be compatible with social inequality?  With an entrenched constitution?  With representation?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14508",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Coyne, B.",
                                "sunet": "bkcoyne"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "218114",
        "number": "ETHICSOC 234",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "257",
        "title": "Moral Theory and Current Debates",
        "description": "This course is an introduction to contemporary moral and political theory for students outside of philosophy or other fields that concentrate on normative theory. We will study some of the most cutting edge research in moral philosophy and political theory. No prior knowledge of these topics is required. The course aims to equip students with the tools they need to engage with moral questions that are hotly debated in the public sphere, that are connected to students' own research, and that are relevant to their professional and personal lives. Class discussions will be guided by participants' specialized knowledge of their own disciplines and assessment topics will be flexible to allow students to explore topics that they are particularly interested in. The first half of the course will focus on key concepts and first-order moral theories, including utilitarianism, Kantian ethics, and feminist care ethics. The second half of the course will deploy these tools to consider topics of pressing importance. The kinds of questions we will study in the second half of the course include: How can social media platforms be reformed to benefit democratic debate and society more generally? What is algorithmic injustice and what (if anything) can be done about it? What is wrong with colonialism and how should we respond to its legacy? Should state borders be open? What is structural racism and what can individuals and governments do to help mitigate it? Would it be desirable to make politics more democratic (or less polarized) and, if so, how might that be possible? And how might transwomen best be included in elite sport?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223712",
        "number": "ETHICSOC 257",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "277",
        "title": "Professional Ethics Across Sectors (MED 267)",
        "description": "Ethics arise in many aspects of professional life and work environments, whether in corporations, government, the academy, or non-profit organizations. Leaders face increasing challenge internally and externally as well. Age-old challenges from racism to inability to weather scandal persist, but with expanded scope and increased urgency. Technology now infuses almost every ethical challenge. Sectors are porous. Attempts to silo ethics inevitably fail: Ethical mishaps in one sector, or one part of an organization, spread quickly to the others. This course will consider one sector at each class session: corporate; government; the academy; and non-profit organizations. A final session will explore individual leadership irrespective of sector. Prominent guests will join certain sessions for interactive discussion. Class meets on 3/28, 4/4, 4/18, 5/2, 5/16.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "223545",
        "number": "ETHICSOC 277",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "277K",
        "title": "On Domination (ETHICSOC 177K, PHIL 177K, PHIL 277K)",
        "description": "Domination is a morally problematic form of social power. To be dominated, according to republican political philosophy, is to be subject to the arbitrary or uncontrolled power of another. And to be free is the absence of domination. This view was the dominant political conception of freedom in the western political tradition until the rise of classical liberalism in the 19th century. In this course, we will examine different accounts of domination and freedom in the republican political tradition and critiques of non-domination as a political conception of freedom. We will also examine the contemporary revival of the republican view and its application to social relations ranging from the workplace to the family and beyond (prerequisite: PHIL 80).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223533",
        "number": "ETHICSOC 277K",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "278M",
        "title": "Introduction to Environmental Ethics (EARTHSYS 178M, ETHICSOC 178M, PHIL 178M, PHIL 278M, POLISCI 134L)",
        "description": "How should human beings interact with the natural world? Do we have moral obligations toward non-human animals and other parts of nature? And what do we owe to other human beings, including future generations, with respect to the environment? In this course, we will tackle ethical questions that confront us in our dealings with the natural world, looking at subjects such as: animal rights; conservation; economic approaches to the environment; access to and control over natural resources; environmental justice and pollution; climate change; technology and the environment; and environmental activism. We will frame our inquiry with leading ethical theories and divide our approach to these topics by ecosystem, dedicating time to each unique environment and its specific nuances: aquatic, desert/tundra, forest/grassland, and the increasingly recognized environment of Space.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "211439",
        "number": "ETHICSOC 278M",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "280",
        "title": "Transitional Justice, Human Rights, and International Criminal Tribunals (HUMRTS 103, INTLPOL 280, INTNLREL 180A)",
        "description": "(Formerly IPS 280) Historical backdrop of the Nuremberg and Tokyo Tribunals.  The creation and operation of the Yugoslav and Rwanda Tribunals (ICTY and ICTR).  The development of hybrid tribunals in East Timor, Sierra Leone, and Cambodia, including evaluation of their success in addressing perceived shortcomings of the ICTY and ICTR. Examination of the role of the International Criminal Court and the extent to which it will succeed in supplanting all other ad hoc international justice mechanisms and fulfill its goals.  Analysis focuses on the politics of creating such courts, their interaction with the states in which the conflicts took place, the process of establishing prosecutorial priorities, the body of law they have produced, and their effectiveness in addressing the needs of victims in post-conflict societies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "11053",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210843",
        "number": "ETHICSOC 280",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "285",
        "title": "Introduction to Tech Ethics and Policy Career Pathways (ETHICSOC 85)",
        "description": "Focuses on equipping students with critical thinking, analysis, and independent learning skills on topics within tech ethics and policy to prepare them for summer internship placements. Other tech industry, government, and civil society leaders will participate as appropriate. All students requesting admission to this course must be previously selected Tech Ethics and Policy Fellows. Visit https://solo.stanford.edu/apply/F2Q4 for more about this work/study program.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224954",
        "number": "ETHICSOC 285",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "371R",
        "title": "Inequality: Economic and Philosophical Perspectives (PHIL 371D, POLISCI 431L)",
        "description": "The nature of and problem of inequality is central to both economics and philosophy.  Economists study the causes of inequality, design tools to measure it and track it over time, and examine its consequences.  Philosophers are centrally concerned with the justification of inequality and the reasons why various types of inequality are or are not objectionable.nIn this class we bring both of these approaches together. Our class explores the different meanings of and measurements for understanding inequality, our best understandings of how much inequality there is, its causes, its consequences, and whether we ought to reduce it, and if so, how. nThis is an interdisciplinary graduate seminar. We propose some familiarity with basic ideas in economics and basic ideas in contemporary political philosophy; we will explain and learn about more complex ideas as we proceed. The class will be capped at 20 students.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "211243",
        "number": "ETHICSOC 371R",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "374R",
        "title": "Science, Religion, and Democracy (PHIL 374F, RELIGST 374F)",
        "description": "How should conflicts between citizens with science-based and religion-based beliefs be handled in modern liberal democracies? Are religion-based beliefs as suitable for discussion within the public sphere as science-based beliefs? Are there still important conflicts between science and religion, e.g., Darwinian evolution versus creationism or intelligent design? How have philosophy and recent theology been engaged with such conflicts and how should they be engaged now? What are the political ramifications? This is a graduate-level seminar; undergraduates must obtain permission of the instructors.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217141",
        "number": "ETHICSOC 374R",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ETHICSOC",
        "code": "378B",
        "title": "Unequal Relationships (PHIL 378B, POLISCI 338B)",
        "description": "Over the past three decades, a relational egalitarian conception of equality has emerged in political philosophy. Proponents of the view argue that the point of equality is to establish communities whose members are able to stand and relate as equals. This entails building societies free from a variety of modes of relating that are thought to be detrimental to our status as moral equals. The list of those inegalitarian relationships is long: oppression, domination, exploitation, marginalization, objectification, demonization, infantilization, stigmatization, etc. The graduate seminar will introduce students to the rich literature on equality in contemporary political philosophy, with a special focus on identifying and scrutinizing unequal relationships. Each week will be centered on a specific unequal relationship, trying to understand how it operates, what social function it serves, and what makes it specifically harmful or wrongful to groups and individuals. Advanced undergraduate students will be considered and should email the PI to communicate their interest. 2 unit option only for Phil PhDs beyond the second year.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221924",
        "number": "ETHICSOC 378B",
        "units": [
            2,
            3,
            4
        ]
    }
]