[
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "20",
        "title": "Transitions: Landing (Back) at Stanford",
        "description": "This five-week modular course invites students returning to Stanford from away from campus experiences to join together to critically reflect on their journeys, create intentional pathways for re-entry, and map ways of drawing on their experiences for career advancement and global engagement. This course provides a structured space to process, land, and create community through explorations of identity and belonging in our globalized world. This course is particularly well suited to students returning to campus from BOSP programs; SEED, SGS and other global internships; and HAAS cardinal service fellowships.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "225376",
        "number": "GLOBAL 20",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "34Q",
        "title": "Nationalism (POLISCI 34Q)",
        "description": "Nationalist platforms have been on the rise for years across the globe. The success of nationalist parties and candidates is often accompanied by backlash against outgroups, from immigrants to religious and ethnic minorities. Nationalism often leads people to act against their material interest, from voting against economic policies that would improve their standing, to undertaking extreme actions like self-sacrifice. Why is nationalism such a dominant force in today's world? And why is it such a powerful driver of human behavior? In this course, we will explore this question through a broad interdisciplinary lens, drawing lessons from the social sciences and history. We will ask what national identity is, where it comes from and why it has such appeal for humans. We will go back to the roots of nationalism in early modern Europe in order to understand the historical origin of national identities. And we will try to identify the forces that drive the rise in right-wing nationalism today, by exploring a number of country cases across the world.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "224476",
        "number": "GLOBAL 34Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "41Q",
        "title": "The Ape Museum: Exploring the Idea of the Ape in Global History, Science, Art and Film (HISTORY 41Q)",
        "description": "This course will explore the idea of &quot;the ape&quot; in global history, science, art, and film. The idea that apes might be humanity's nearest animal relatives is only about 200 years old. From the start, the idea developed in a global context: living fossil apes were found in Africa and Asia, and were immediately embroiled in international controversies about theories of human origins and racial hierarchies. This class will look at how and why &quot;the ape&quot; became a generative and controversial new concept in numerous national and regional contexts. We'll explore some of the many ways humans have looked at, studied, and thought about apes around the world: the &quot;out of Asia&quot; versus &quot;out of Africa&quot; hypothesis for human origins; Nim Chimpsky, the chimpanzee raised as a human child; Koko, the gorilla who may have learned sign language; Congo, the chimpanzee who made &quot;abstract&quot; paintings; films such as King Kong, Planet of the Apes, and 2001: Space Odyssey; the ape in World War II and Cold War propaganda in Japan, the Soviet Union, Germany, and the United States; Jane Goodall's study of chimpanzees &quot;culture&quot; and &quot;personality&quot;; the place of apes in natural history museums and zoos around the world; and Stanford's own fraught history of comparing apes and humans through the archival writings of eugenicist founding president David Starr Jordan. Taught in conjunction with an exhibit on global ape imagery at the Stanford Library curated by Professors Riskin and Winterer in 2024, the course will culminate in students' own miniature exhibits for a class-generated &quot;Ape Museum.&quot;",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "225226",
        "number": "GLOBAL 41Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "50",
        "title": "At Home Abroad Seminar: International Film Series (DLCL 50)",
        "description": "The At Home Abroad House invites you to challenge your habits of visual culture, fill your ears with less-familiar sounds, and build your own understanding of what it means to live in a global age. Stanford experts from a multitude of cultural disciplines representing multiple geographic regions have selected some of the best of the best of recent film for you to view: come see for yourself and see outside the box with this tailored line-up of contemporary cinema from around the world. Weekly screenings hosted at the At Home Abroad House; class is open to undergrads only and is mandatory for pre-assigned residents of AHA.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32967",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "6:30:00 PM",
                        "endTime": "9:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Knezevic, J.",
                                "sunet": "knezevic"
                            }
                        ],
                        "startTimestamp": 66600.0,
                        "endTimestamp": 76800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223818",
        "number": "GLOBAL 50",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "50C",
        "title": "At Home Abroad Seminar: Global Gastronomies and Multicultural Cooking Class (DLCL 50C)",
        "description": "Global Gastronomies and Multicultural Cooking Class, organized by the At Home Abroad (AHA) House.  Meets in Bollard Suites Teaching Kitchen. Course fees are $90 per student; open to undergraduate students only.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14241",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Knezevic, J.",
                                "sunet": "knezevic"
                            },
                            {
                                "name": "McDermott, M.",
                                "sunet": "mmcd1418"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223956",
        "number": "GLOBAL 50C",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "101",
        "title": "Critical Issues in Global Affairs",
        "description": "It is often stated that we live in a global age.  What does this mean?  How new is this phenomenon? What does it mean to think about the human experience from a global perspective?  And, why does it matter?  In this course, we will examine globalism and globalization in historical and contemporary contexts; engage with theoretical frameworks and a range of case studies from a variety of national/regional contexts; and use these to analyze global economic, political, environmental, and socio-cultural networks, trends, and issues, exploring the interconnectedness of the local and the global.  We will consider how universal is the human experience and how the answer to this question might impact the future of humanity.  (This is the gateway course for students wishing to pursue a Global Studies minor in one of six specializations: African, European, Islamic, Iranian, Latin American, and South Asian studies.)",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13236",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Knezevic, J.",
                                "sunet": "knezevic"
                            },
                            {
                                "name": "Kuhns, K.",
                                "sunet": "kkuhns"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "217019",
        "number": "GLOBAL 101",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "104",
        "title": "Iranian Cuisine",
        "description": "Course offers an introductory look at Iranian cooking and cuisine. Through weekly themes and the preparation of dishes, students will learn about the history of Iranian cuisine, essential ingredients, and general cooking techniques. Guest chefs will lead cooking sessions. Class begins the second week of the quarter and meets for 8 consecutive weeks.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15188",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Milani, A.",
                                "sunet": "amilani"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222648",
        "number": "GLOBAL 104",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "110",
        "title": "Love in the Time of Cinema (FILMEDIA 137, FILMEDIA 337, GLOBAL 211)",
        "description": "Romantic coupling is at the heart of mainstream film narratives around the world. Through a range of film cultures, we will examine cinematic intimacies and our own mediated understandings of love and conjugality formed in dialog with film and other media. We will consider genres, infrastructures, social activities (for example, the drive-in theater, the movie date, the Bollywood wedding musical, 90s queer cinema), and examine film romance in relation to queerness, migration, old age, disability, and body politics more broadly.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221467",
        "number": "GLOBAL 110",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "112",
        "title": "Oceans and the Global Imaginary (GLOBAL 212, OCEANS 112, OCEANS 212)",
        "description": "This course brings together various social, climatic, and ecological perspectives to seek a better understanding of the relationships between people and the sea. Our oceans constitute some 70% of the surface area of our planet; they connect continents, countless islands, and form a universal link between geographically vast regions and culturally diverse peoples. Our oceans are critical to the health of our planet, and to humanity, and it is this interdependent relationship that forms the basis of this course.Taking a genuinely global viewpoint, we will explore the dynamic nature of peoples' interactions with their maritime landscape and seascape. The course will draw on a wide range of social science and natural science data and approaches to assess how we traversed and explored the seas; how the seas have been an enduring source of nutrition; and how they have come to garner immense social and cultural significance to peoples around the world. The course looks at the unique features of the Indian, Atlantic, and Pacific Oceans, using case studies from each, while drawing lines that connect these vast oceanic basins. Ultimately, the course emphasizes the challenges facing our oceans as humanity's impact reaches unprecedented levels and considers how `people and oceans in partnership' might help mitigate the damage climate change has wrought on our planet.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31159",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "200-219",
                        "instructors": [
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224811",
        "number": "GLOBAL 112",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "120",
        "title": "Stories at the Border (COMPLIT 156, ENGLISH 155)",
        "description": "How authors and filmmakers represent the process of border-making as a social experience? How do the genres in which they work shape our understandings of the issues themselves? We will explore several different genres of visual and textual representation from around the world that bear witness to border conflict - including writing by China Mi&eacute;ville, Carmen Boullosa, Joe Sacco, and Agha Shahid Ali - many of which also trouble the borders according to which genres are typically separated and defined.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "221492",
        "number": "GLOBAL 120",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "124",
        "title": "Global Algorithmic Development and Ethics",
        "description": "New generative models like ChatGPT have a unique impact on global AI development and deployment. Like other machine and deep learning models, they promise unprecedented potential for growth, education, improved quality of life, healthcare, and communication. Yet, the massive world-wide opportunities of AI also present risks and potentially harmful social impacts. This course explores the promise and peril of AI systems from global, non-Western perspectives, drawing on the expertise of global AI ethicist Dr. Nakeema Stefflbauer, who will lead many course sessions to elaborate on global, relational perspectives of developing and impacted communities. Starting with the scholarship of Stanford HAI researchers, course participants gain an overview of AI growth on a global scale. Students explore non-Western ethics highlighting perspectives of the Global South considering successes like Africa's Masakhane, Lelapa.AI and case studies in the Arab world, Latin America as well as problems of data sovereignty, labor conditions, and inclusion and marginalization. Students lead discussions of readings, write an original research paper, and/or present a poster or presentation on a topic of their choice.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224982",
        "number": "GLOBAL 124",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "125",
        "title": "Human Rights in an Age of Great Power Rivalry, War, and Political Transformation (CLASSICS 129, GLOBAL 225, HUMRTS 120, INTNLREL 129)",
        "description": "As is well known, great and emerging power rivalries largely shaped the course of the 20th century through WWI, WWII, and the Cold War. In the aftermath of the collapse of the Soviet Union, the 21st century been characterized by the geopolitical reconfiguration underway today with the rise of China and India and the challenges posed for American and European influence. The end of the Cold War brought hope that the proxy wars, post-colonial conflicts, and mass atrocity events that characterized the mid-20th century would yield to a more stable international order of cooperation and, hence, to a greater realization of the human rights aspirations embodied in the UN framework. The founding of the International Criminal Court (ICC) in 2002 was widely hailed as a watershed event marking that transformation. Needless to say, those hopes have remained largely unrealized and the refusal of China, India, the United States, and Russia to join the ICC is indicative of how far away a realization of those aspirations remains. As this age of great power political, economic, and military rivalry intensifies how is it impacting both the countries where the rivalries are being played out (e.g.,in the Middle East, Southeast Asia, Africa) and the societies of the rival nations themselves? How are these conflicts affecting the response to global humanitarian issues such as migration, refugees, statelessness, human trafficking, modern day slavery, climate change, and the turn towards increasing authoritarian governance? The course will explore the humanitarian dimension and consequences of war, conflict, and political transformation in such contexts through a series of case studies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223735",
        "number": "GLOBAL 125",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "133",
        "title": "The Medieval Middle East: Crusaders, Turks, and Mongols (GLOBAL 233, HISTORY 283C, HISTORY 383C)",
        "description": "This course surveys the history of the Middle East from c.950 A.D. to c.1517 A.D., placing particular emphasis on the following questions: What were the social, cultural, and political contexts for conversion to Islam in the Middle Ages? How did the interplay of nomadic and sedentary peoples shape Middle Eastern history? What were the nature of Christian-Muslim relations and the fate of religious minorities in an age of Crusade and Jihad? What were the conditions for the rise, flourishing, and eventual collapse of a &iquest;world-system&iquest; in this period (with the lands of the Middle East serving as its nexus)?  Chronological topics include: the arrival in the Middle East of the Seljuk Turks, new adopters of Islam and recent nomads; the western European crusades to the Holy Land and the establishment of so-called &iquest;Crusader States&iquest; in Syria; the subjugation of Iran to pagan Mongols&iquest;and the Mongols&iquest; eventual conversion to Islam; the rise to power of a dynasty of Turkish slave-soldiers (mamluks) in Cairo and the political reunification of Syria and Egypt under their rule. Readings will consist of both primary sources and works of modern scholarship.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "221703",
        "number": "GLOBAL 133",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "134",
        "title": "The Birth of Islam: Authority, Community, and Resistance (GLOBAL 234, HISTORY 280B, HISTORY 380B)",
        "description": "This course explores the historical problem of how authority and community (in both the political and religious sense) were defined and challenged in the early Islamic period.  Chronological topics covered include: the political, cultural, and religious world of Late Antiquity into which Muhammad was born; the crystallization of a small community of believers who supported Muhammad's message of radical monotheism and aided him in the conquest and conversion of the Arabian Peninsula; the problems of legacy and leadership in the community of the faithful after Muhammad's death; the Arabo-Islamic conquests beyond Arabia during the 7th and early 8th centuries and the establishment of the first Islamic empire under the rule of the Umayyad clan; the Sunni/Shi'a split (and further splits in Shi'ism); the revolution of 750 A.D. and overthrow of the Umayyads by the 'Abbasids; the flourishing of a sophisticated world of learning and culture under the 'Abbasids; and the waning of the 'Abbasids empire in the tenth century and political reconfiguration of the Islamic lands.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "221702",
        "number": "GLOBAL 134",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "135",
        "title": "Around the World in Ten Films (FILMEDIA 135, FILMEDIA 335)",
        "description": "This is an introductory-level course about the cinema as a global language. We will undertake a comparative study of select historical and contemporary aspects of international cinema, and explore a range of themes pertaining to the social, cultural, and political diversity of the world. A cross-regional thematic emphasis and inter-textual methods of narrative and aesthetic analysis, will ground our discussion of films from Italy, Japan, United States, India, China, France, Brazil, Nigeria, Russia, Iran, Mexico, and a number of other countries. Particular emphasis will be placed on the multi-cultural character and the regional specificities of the cinema as a &quot;universal language&quot; and an inclusive &quot;relational network.&quot;nnThere are no prerequisites for this class. It is open to all students; non-majors welcome.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14294",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Levi, P.",
                                "sunet": "plevi"
                            },
                            {
                                "name": "Arellano Vences, J.",
                                "sunet": "javences"
                            },
                            {
                                "name": "Makary, J.",
                                "sunet": "jmakary"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Thursday"
                    },
                    {
                        "startTime": "6:30:00 PM",
                        "endTime": "9:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Levi, P.",
                                "sunet": "plevi"
                            },
                            {
                                "name": "Arellano Vences, J.",
                                "sunet": "javences"
                            },
                            {
                                "name": "Makary, J.",
                                "sunet": "jmakary"
                            }
                        ],
                        "startTimestamp": 66600.0,
                        "endTimestamp": 76800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "219636",
        "number": "GLOBAL 135",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "142",
        "title": "The Global Middle Ages",
        "description": "This course focuses on the historical interconnectedness of pre-modern cultures, necessarily decentering Europe to explore cultural exchange across the world, including the Middle East, Africa, Asia, and the Americas, in the period 600-1600 CE. Providing students with a historical foundation to more modern courses in COLLEGE, The Global Middle Ages introduces a wide variety of sources, and equips students with the tools of critical inquiry necessary to evaluate and contextualize historical witnesses.  In decentering Europe as the geographical focus of study, the course also aims to decenter teleological narratives that have tended to claim modernity for so-called 'developed' (western) nations, while denigrating other regions as 'medieval' (understood as chaotic, violent, and irrational).  Chronology, long presented as neutral fact is acknowledged in this course as both constructed and political.  Drawing on work by historians, art historians, and literary historians, we work in this course to reconsider the pre-modern world in a global context, informed by new trends in global history as well as the emerging field of pre-modern critical race studies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224565",
        "number": "GLOBAL 142",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "145",
        "title": "Space, Public Discourse and Revolutionary Practices (ARTHIST 118A, CSRE 95I)",
        "description": "This course examines the mediums of public art that have been voices of social change, protestnand expressions of community desire. It will offer a unique glimpse into Iran&iquest;sncontemporary art and visual culture through the investigation of public art practices such asngraffiti and street art, as well as older traditions of Naghali and Iranian Coffeehouse Painting.nnBeginning Iranian case studies will be expanded in comparison with global examples that spannprojects that include Insite (San Diego/Tijuana), Project Row Houses (Houston, TX) the DMZnProject (Korea), Munster Skulpture Projects (Germany), among others. Students will alsonexamine the infrastructural conditions of public art, such as civic, public, and private funding,nrelationships with local communities, and the life of these projects as they move in and out ofnthe artworld. This encompassing view anchors a legacy of Iranian cultural contributions in largerntrajectories of art history, contemporary art, and community arts practice. Guest artists,ncurators, and researchers with site visits included. Students will propose either new public artnproposals, exhibitions, or research to provoke their own ideas while engaging the ever changingnstate of public discourse in these case studies",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220090",
        "number": "GLOBAL 145",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "150N",
        "title": "Climate Change and Mental Health (PSYC 150N)",
        "description": "The impact of climate change is far-reaching, extending beyond immediate and imminent ecological effects and into a range of human experiences, including physical and mental disease. This course uses an interdisciplinary approach to consider the interaction of climate change and mental health. Beginning with historical associations of nature and human well-being, we will use a variety of texts&iquest;some historic, some literary, some scientific&iquest;to explore the effects of nature on the human mind. Similarly, we will look at how human psychology influences our reactions to climate change, from grief, to climate change denialism, to action. The seminar has a significant out-of-doors component, including local ecosystem exploration, an applied study of &iquest;nature therapy,&iquest; and field trips to sites where clinical work on the interaction of nature and mental health can be observed first-hand. This year we are fortunate to have received a Global Studies Course Innovation Award to support our field-trips, as well as the visit of several guests nationally known for their work in the areas of climate change and mental health.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222596",
        "number": "GLOBAL 150N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "157",
        "title": "Edward Said, or Scholar vs Empire (CSRE 357, ENGLISH 357S, TAPS 157S, TAPS 357S)",
        "description": "How can an intellectual fight forces far larger than a single individual? How can solidarity be an antidote to racism? Why is there no distinction between the local and the global? What is the scholar's role in an alienating political climate? Why are criticism and humanism necessary partners? The author of Orientalism and world-changing frameworks such as Travelling Theory, Permission To Narrate, and Contrapuntal Reading, as well as remarkable texts, such as On Late Style and Representations of the Intellectual, teaches us how criticism can blunt instruments of empire.  In this course, students observe the journey of one scholar as he writes between worlds against imperialist supremacy and colonial logic. They'll move from Exile to Indigeneity, Silence to Music, Centers to Margins, Victimhood to Dignity, West to East, Peace to Terror, Theory to Practice, Politics to Knowledge, Religiosity to Secularism, Statehood to Fragmentation, and back.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29911",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221593",
        "number": "GLOBAL 157",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "170",
        "title": "Where the Wild Things Are: The Ecology and Ethics of Conserving Megafauna (BIO 185, DLCL 170, EALC 170)",
        "description": "Under conditions of global environmental change and mass extinction, how will humanity share the planet with wildlife? This course invites undergraduate students to consider this question under the guidance of two biologists and a literary scholar. We will engage with a range of interdisciplinary scholarship on how humans seek to study, understand, exploit, protect, and empathize with charismatic megafauna. We ask how regional differences in culture, political economy, and ecology shape conservation efforts.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225082",
        "number": "GLOBAL 170",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "190",
        "title": "Peace and War in Medieval Islam: From the Arab Conquests to the Crusades (GLOBAL 232, HISTORY 218C, HISTORY 318C)",
        "description": "This course interrogates the theory and reality of war-making and peacemaking across the first millennium of Islamic history (c.600-c.1600 CE). We will examine major historical events (e.g. the struggle of the early community of Muslims against the pagan tribes of Arabia; Arab expansion and conquest during the seventh and eighth centuries; a sequence of civil wars, dynastic struggles, and schisms within Islam; and external invasions of the Islamic world by crusaders and steppe nomads, etc.). We will also investigate the development of major normative concepts across the Islamic tradition concerning peace and war (e.g. holy war; treaty- and truce-making; treatment of conquered enemies and prisoner; diplomacy with Muslims and non-Muslims, etc.). With respect to these concepts, we will attend especially to change over time and diversity across various sects. Mix of lecture and discussion. Readings will consist of both primary sources (in English translation) and modern scholarship. No previous experience with pre-modern or Islamic history required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222539",
        "number": "GLOBAL 190",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "191",
        "title": "Undergraduate Directed Reading",
        "description": "Independent studies for undergraduate students under the direction of a faculty member for which academic credit may properly be allowed. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27870",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29942",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29659",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "12385",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Milani, A.",
                                "sunet": "amilani"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "15083",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "El-Sharif, F.",
                                "sunet": "fsharif"
                            },
                            {
                                "name": "Kimmel, A.",
                                "sunet": "ajkimmel"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "13142",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Crombez, C.",
                                "sunet": "crombez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "12914",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Milani, A.",
                                "sunet": "amilani"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "15146",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Emami, A.",
                                "sunet": "aemami1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "13683",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Crombez, C.",
                                "sunet": "crombez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "12372",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Milani, A.",
                                "sunet": "amilani"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219004",
        "number": "GLOBAL 191",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 10
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "193",
        "title": "History of World Cinema III: Queer Cinemas around the World (ARTHIST 164, ARTHIST 364, CSRE 102C, CSRE 302C, FEMGEN 100C, FILMEDIA 100C, FILMEDIA 300C, GLOBAL 390, TAPS 100C, TAPS 300C)",
        "description": "Provides an overview of cinema from around the world since 1960, highlighting the cultural, political, and economic forces that have shaped various film movements over the last six decades. Specific topics may vary by term/year/instructor. This term's topic, Queer Cinemas around the World, engages with a range of queer cinematic forms and queer spectatorial practices in different parts of the world, as well as BIPOC media from North America. Through film and video from Kenya, Malaysia, India, The Dominican Republic, China, Brazil, Palestine, Japan, Morocco, the US etc., we will examine varied narratives about trans experience, same-sex desire, LGBTQI2S+ rights, censorship, precarity, and hopefulness. This course will attune us to regional cultural specificities in queer expression and representation, prompting us to move away from hegemonic and homogenizing understandings of queer life and media. Notes: Screenings will be held on Wednesdays at 5:30PM in Oshman Hall. Screening times will vary slightly from week to week.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13914",
                "currentClassSize": "0",
                "maxClassSize": "350",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Iyer, U.",
                                "sunet": "ushaiyer"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    },
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Iyer, U.",
                                "sunet": "ushaiyer"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": "Section is taught by Delaney Holton and meets in McMurtry 370. See FILMEDIA 100C Section 02 for full details.",
                "classId": "13918",
                "currentClassSize": "0",
                "maxClassSize": "3",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": "Section is taught by Delaney Holton and meets in McMurtry 370. See FILMEDIA 100C Section 03 for full details.",
                "classId": "14376",
                "currentClassSize": "0",
                "maxClassSize": "3",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "DIS",
                "notes": "Section is taught by J. Makary and meets in McMurtry 360. See FILMEDIA 100C Section 04 for full details.",
                "classId": "14377",
                "currentClassSize": "0",
                "maxClassSize": "3",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "DIS",
                "notes": "Section is taught by J. Makary and meets in 200-107. See FILMEDIA 100C Section 05 for full details.",
                "classId": "14378",
                "currentClassSize": "0",
                "maxClassSize": "3",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "205497",
        "number": "GLOBAL 193",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 5
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "194",
        "title": "Understanding China's Rise (SOC 175, SOC 275)",
        "description": "This course is an overview China's national trajectory since the 1980s, and will place its historic economic advance in comparative perspective. We will examine the factors that made this advance possible, explore the ways that China's political and economic institutions are different from other major economies, and consider challenges that now appear to threaten China's continuing economic advance.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224377",
        "number": "GLOBAL 194",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "199",
        "title": "Capstone Project: Global Studies Minor",
        "description": "Students completing a capstone project for the Global Studies Minor must enroll in this course for units (1-5) with their capstone advisor selected as the instructor. The course may be repeated for credit, with advisor approval. Students are expected to participate in regular advising meetings with the instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "12615",
                "currentClassSize": "0",
                "maxClassSize": "0",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "du Perron, L.",
                                "sunet": "lalita"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "12289",
                "currentClassSize": "0",
                "maxClassSize": "0",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "12197",
                "currentClassSize": "0",
                "maxClassSize": "0",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219015",
        "number": "GLOBAL 199",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "200",
        "title": "Utopia, Dystopia, and Technology in Science Fiction: A Cross-Cultural Perspective (CHINA 171, CHINA 271)",
        "description": "This course explores how science fiction (sf) narratives from East and West imagine the future of humanity and human-nature relations. The blind faith in technoscientific power has aggravated class disparity, eroded the social fabric, and undermined the humanist legacy of the Enlightenment. Technological fetishism has given rise to apocalyptic futures of dystopia marked by destructive AI, the digital jungle of existential struggle, environmental degradation, climate disasters, class disparity, and posthuman barbarism. On the other hand, sf narratives keep hopes alive by projecting utopias, exposing the pitfalls of technological 'progress' and keeping faith with human sovereignty in renewing social ecology in balance with natural conditions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "15346",
                "currentClassSize": "0",
                "maxClassSize": "35",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wang, B.",
                                "sunet": "banwang"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224339",
        "number": "GLOBAL 200",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "211",
        "title": "Love in the Time of Cinema (FILMEDIA 137, FILMEDIA 337, GLOBAL 110)",
        "description": "Romantic coupling is at the heart of mainstream film narratives around the world. Through a range of film cultures, we will examine cinematic intimacies and our own mediated understandings of love and conjugality formed in dialog with film and other media. We will consider genres, infrastructures, social activities (for example, the drive-in theater, the movie date, the Bollywood wedding musical, 90s queer cinema), and examine film romance in relation to queerness, migration, old age, disability, and body politics more broadly.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221467",
        "number": "GLOBAL 211",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "212",
        "title": "Oceans and the Global Imaginary (GLOBAL 112, OCEANS 112, OCEANS 212)",
        "description": "This course brings together various social, climatic, and ecological perspectives to seek a better understanding of the relationships between people and the sea. Our oceans constitute some 70% of the surface area of our planet; they connect continents, countless islands, and form a universal link between geographically vast regions and culturally diverse peoples. Our oceans are critical to the health of our planet, and to humanity, and it is this interdependent relationship that forms the basis of this course.Taking a genuinely global viewpoint, we will explore the dynamic nature of peoples' interactions with their maritime landscape and seascape. The course will draw on a wide range of social science and natural science data and approaches to assess how we traversed and explored the seas; how the seas have been an enduring source of nutrition; and how they have come to garner immense social and cultural significance to peoples around the world. The course looks at the unique features of the Indian, Atlantic, and Pacific Oceans, using case studies from each, while drawing lines that connect these vast oceanic basins. Ultimately, the course emphasizes the challenges facing our oceans as humanity's impact reaches unprecedented levels and considers how `people and oceans in partnership' might help mitigate the damage climate change has wrought on our planet.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31160",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "200-219",
                        "instructors": [
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224811",
        "number": "GLOBAL 212",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "225",
        "title": "Human Rights in an Age of Great Power Rivalry, War, and Political Transformation (CLASSICS 129, GLOBAL 125, HUMRTS 120, INTNLREL 129)",
        "description": "As is well known, great and emerging power rivalries largely shaped the course of the 20th century through WWI, WWII, and the Cold War. In the aftermath of the collapse of the Soviet Union, the 21st century been characterized by the geopolitical reconfiguration underway today with the rise of China and India and the challenges posed for American and European influence. The end of the Cold War brought hope that the proxy wars, post-colonial conflicts, and mass atrocity events that characterized the mid-20th century would yield to a more stable international order of cooperation and, hence, to a greater realization of the human rights aspirations embodied in the UN framework. The founding of the International Criminal Court (ICC) in 2002 was widely hailed as a watershed event marking that transformation. Needless to say, those hopes have remained largely unrealized and the refusal of China, India, the United States, and Russia to join the ICC is indicative of how far away a realization of those aspirations remains. As this age of great power political, economic, and military rivalry intensifies how is it impacting both the countries where the rivalries are being played out (e.g.,in the Middle East, Southeast Asia, Africa) and the societies of the rival nations themselves? How are these conflicts affecting the response to global humanitarian issues such as migration, refugees, statelessness, human trafficking, modern day slavery, climate change, and the turn towards increasing authoritarian governance? The course will explore the humanitarian dimension and consequences of war, conflict, and political transformation in such contexts through a series of case studies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223735",
        "number": "GLOBAL 225",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "232",
        "title": "Peace and War in Medieval Islam: From the Arab Conquests to the Crusades (GLOBAL 190, HISTORY 218C, HISTORY 318C)",
        "description": "This course interrogates the theory and reality of war-making and peacemaking across the first millennium of Islamic history (c.600-c.1600 CE). We will examine major historical events (e.g. the struggle of the early community of Muslims against the pagan tribes of Arabia; Arab expansion and conquest during the seventh and eighth centuries; a sequence of civil wars, dynastic struggles, and schisms within Islam; and external invasions of the Islamic world by crusaders and steppe nomads, etc.). We will also investigate the development of major normative concepts across the Islamic tradition concerning peace and war (e.g. holy war; treaty- and truce-making; treatment of conquered enemies and prisoner; diplomacy with Muslims and non-Muslims, etc.). With respect to these concepts, we will attend especially to change over time and diversity across various sects. Mix of lecture and discussion. Readings will consist of both primary sources (in English translation) and modern scholarship. No previous experience with pre-modern or Islamic history required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222539",
        "number": "GLOBAL 232",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "233",
        "title": "The Medieval Middle East: Crusaders, Turks, and Mongols (GLOBAL 133, HISTORY 283C, HISTORY 383C)",
        "description": "This course surveys the history of the Middle East from c.950 A.D. to c.1517 A.D., placing particular emphasis on the following questions: What were the social, cultural, and political contexts for conversion to Islam in the Middle Ages? How did the interplay of nomadic and sedentary peoples shape Middle Eastern history? What were the nature of Christian-Muslim relations and the fate of religious minorities in an age of Crusade and Jihad? What were the conditions for the rise, flourishing, and eventual collapse of a &iquest;world-system&iquest; in this period (with the lands of the Middle East serving as its nexus)?  Chronological topics include: the arrival in the Middle East of the Seljuk Turks, new adopters of Islam and recent nomads; the western European crusades to the Holy Land and the establishment of so-called &iquest;Crusader States&iquest; in Syria; the subjugation of Iran to pagan Mongols&iquest;and the Mongols&iquest; eventual conversion to Islam; the rise to power of a dynasty of Turkish slave-soldiers (mamluks) in Cairo and the political reunification of Syria and Egypt under their rule. Readings will consist of both primary sources and works of modern scholarship.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221703",
        "number": "GLOBAL 233",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "234",
        "title": "The Birth of Islam: Authority, Community, and Resistance (GLOBAL 134, HISTORY 280B, HISTORY 380B)",
        "description": "This course explores the historical problem of how authority and community (in both the political and religious sense) were defined and challenged in the early Islamic period.  Chronological topics covered include: the political, cultural, and religious world of Late Antiquity into which Muhammad was born; the crystallization of a small community of believers who supported Muhammad's message of radical monotheism and aided him in the conquest and conversion of the Arabian Peninsula; the problems of legacy and leadership in the community of the faithful after Muhammad's death; the Arabo-Islamic conquests beyond Arabia during the 7th and early 8th centuries and the establishment of the first Islamic empire under the rule of the Umayyad clan; the Sunni/Shi'a split (and further splits in Shi'ism); the revolution of 750 A.D. and overthrow of the Umayyads by the 'Abbasids; the flourishing of a sophisticated world of learning and culture under the 'Abbasids; and the waning of the 'Abbasids empire in the tenth century and political reconfiguration of the Islamic lands.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221702",
        "number": "GLOBAL 234",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "249A",
        "title": "The Iranian Cinema: Image and Meaning (COMPLIT 249A)",
        "description": "This course will focus on the analysis of ten Iranian films with the view of placing them in discourse on the semiotics of Iranian art and culture.  The course will also look at the influence of a wide array of cinematic traditions from European, American, and Asian masters on Iranian cinema. This course must be taken for a minimum of 3 units and a letter grade to be eligible for WAYS credit.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "211711",
        "number": "GLOBAL 249A",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "249B",
        "title": "Iranian Cinema in Diaspora (COMPLIT 249B)",
        "description": "Despite enormous obstacles, immigrant Iranian filmmakers, within a few decades (after the Iranian Revolution), have created a slow but steady stream of films outside Iran. They were originally started by individual spontaneous attempts from different corners of the world and by now we can identify common lines of interest amongst them. There are also major differences between them. These films have never been allowed to be screened inside Iran, and without any support from the global system of production and distribution, as independent and individual attempts, they have enjoyed little attention. Despite all this, Iranian cinema in exile is in no sense any less important than Iranian cinema inside Iran. In this course we will view one such film, made outside Iran, in each class meeting and expect to reach a common consensus in identifying the general patterns within these works and this movement. Questions such as the ones listed below will be addressed in our meetings each week: What changes in aesthetics and point of view of the filmmaker are caused by the change in his or her work environment? Though unwantedly these films are made outside Iran, how related are they to the known (recognized) cinema within Iran? And in fact, to what extent do these films express things that are left unsaid by the cinema within Iran? NOTE: To satisfy a WAYS requirement, this course must be taken for a minimum 3 units and a letter grade. Please contact your academic advisor for University policy regarding WAYS.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "212740",
        "number": "GLOBAL 249B",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "249C",
        "title": "Contemporary Iranian Theater (COMPLIT 249C)",
        "description": "Today, Iranian plays both in traditional and contemporary styles are staged in theater festivals throughout the world and play their role in forming a universal language of theater which combine the heritages from countries in all five continents. Despite many obstacles, some Iranian plays have been translated into English and some prominent Iranian figures are successful stage directors outside Iran. Forty-six years ago when &quot;Theater in Iran&quot; (a monograph on the history of Iranian plays) by Bahram Beyzaie was first published, it put the then contemporary Iranian theater movement &quot;which was altogether westernizing itself blindly&quot; face to face with a new kind of self-awareness. Hence, today's generation of playwrights and stage directors in Iran, all know something of their theatrical heritage. In this course we will spend some class sessions on the history of theater in Iran and some class meetings will be concentrating on contemporary movements and present day playwrights. Given the dearth of visual documents, an attempt will be made to present a picture of Iranian theater to the student. Students are expected to read the recommended available translated plays of the contemporary Iranian playwrights and participate in classroom discussions. NOTE: To satisfy WAYS requirements, you must enroll in the course for a minimum of 3 units. Please contact your academic advisor for more information regarding University WAYS requirements.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29322",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "212741",
        "number": "GLOBAL 249C",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "253P",
        "title": "Before the Model Minority: South Asians in the US (ASNAMST 153P, HISTORY 253P)",
        "description": "The model minority myth has been used to create a wedge between Asian and Black people in the United States, and masks the histories and lives of itinerant South Asian traders, laborers, and farmers. Beginning in the 1860s, South Asians (mostly male, and often undocumented) traveled to major ports in the US, such as New York City, New Orleans, and the California coast, where they found working-class jobs and married Puerto Rican, African American, Creole, and Mexican women. Some South Asians were double migrants, first brought to British colonies in the Caribbean and South America through indentured servitude, and later migrated to the United States. Their life stories expand to the racial history of the United States by looking beyond a Black/white binary. By juxtaposing immigrant stories with exclusionary US immigration laws, the course touches upon major themes of migration, capitalism, surveillance, race and racism, multiracial couples and communities, resistance, intersectional activism, borderlands and cities in the US, and the formation of national identity. During the quarter, we will seek to connect experiences in the past with contemporary issues of political culture in the United States to engage with the continuing challenge of locating and attaining self-definition, justice, and social progress in a fraught and divided world.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "31629",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "460-126",
                        "instructors": [
                            {
                                "name": "Akhter, M.",
                                "sunet": "makhter"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222772",
        "number": "GLOBAL 253P",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "390",
        "title": "History of World Cinema III: Queer Cinemas around the World (ARTHIST 164, ARTHIST 364, CSRE 102C, CSRE 302C, FEMGEN 100C, FILMEDIA 100C, FILMEDIA 300C, GLOBAL 193, TAPS 100C, TAPS 300C)",
        "description": "Provides an overview of cinema from around the world since 1960, highlighting the cultural, political, and economic forces that have shaped various film movements over the last six decades. Specific topics may vary by term/year/instructor. This term's topic, Queer Cinemas around the World, engages with a range of queer cinematic forms and queer spectatorial practices in different parts of the world, as well as BIPOC media from North America. Through film and video from Kenya, Malaysia, India, The Dominican Republic, China, Brazil, Palestine, Japan, Morocco, the US etc., we will examine varied narratives about trans experience, same-sex desire, LGBTQI2S+ rights, censorship, precarity, and hopefulness. This course will attune us to regional cultural specificities in queer expression and representation, prompting us to move away from hegemonic and homogenizing understandings of queer life and media. Notes: Screenings will be held on Wednesdays at 5:30PM in Oshman Hall. Screening times will vary slightly from week to week.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13915",
                "currentClassSize": "0",
                "maxClassSize": "350",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Iyer, U.",
                                "sunet": "ushaiyer"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    },
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Iyer, U.",
                                "sunet": "ushaiyer"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": "Section is taught by Delaney Holton and meets in McMurtry 370. See FILMEDIA 100C Section 02 for full details.",
                "classId": "13919",
                "currentClassSize": "0",
                "maxClassSize": "2",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": "Section is taught by Delaney Holton and meets in McMurtry 370. See FILMEDIA 100C Section 03 for full details.",
                "classId": "14386",
                "currentClassSize": "0",
                "maxClassSize": "2",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "DIS",
                "notes": "Section is taught by J. Makary and meets in McMurtry 360. See FILMEDIA 100C Section 04 for full details.",
                "classId": "14387",
                "currentClassSize": "0",
                "maxClassSize": "2",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "DIS",
                "notes": "Section is taught by J. Makary and meets in 200-107. See FILMEDIA 100C Section 05 for full details.",
                "classId": "14388",
                "currentClassSize": "0",
                "maxClassSize": "2",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "205497",
        "number": "GLOBAL 390",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 5
    },
    {
        "year": "2023-2024",
        "subject": "GLOBAL",
        "code": "391",
        "title": "Graduate Directed Reading",
        "description": "Independent studies for graduate students under the direction of a faculty member for which academic credit may properly be allowed. May be repeat for credit",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29941",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29658",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218995",
        "number": "GLOBAL 391",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 2
    }
]