[
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "12Q",
        "title": "Humanities Core: Great Books, Big Ideas -- Europe, Middle Ages and Renaissance (DLCL 12Q, FRENCH 12Q, ILAC 12Q)",
        "description": "This three-quarter sequence asks big questions of major texts in the European and American tradition.  What is a good life?  How should society be organized?  Who belongs?  How should honor, love, sin, and similar abstractions govern our actions?  What duty do we owe to the past and future?  The second quarter focuses on the transition from the Middle Ages to Modernity, Europe's re-acquaintance with classical antiquity and its first contacts with the New World. Authors include Dante, Shakespeare, Machiavelli, Cervantes, and Milton. N.B. This is the second of three courses in the European track. These courses offer an unparalleled opportunity to study European history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future. Students who take HUMCORE 11 and HUMCORE 12Q will have preferential admission to HUMCORE 13Q (a WR2 seminar).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220740",
        "number": "HUMCORE 12Q",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "13",
        "title": "Humanities Core: Great Books, Big Ideas -- Europe, Modern (FRENCH 13, HISTORY 239C, PHIL 13)",
        "description": "What is a good life? How should society be organized? Who belongs? How should honor, love, sin, and similar abstractions govern our actions? What duty do we owe to the past and future? This course examines tcourse examines these questions in the modern period, from the rise of revolutionary ideas to the experiences of totalitarianism and decolonization in the twentieth century. Authors include Locke, Mary Shelley, Marx, Nietzsche, Primo Levi, and Frantz Fanon. This course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Mondays you meet in your own course, and on Wednesdays all the HumCore seminars (in session that quarter) meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29619",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "DIS",
                "notes": null,
                "classId": "29618",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "218467",
        "number": "HUMCORE 13",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "13Q",
        "title": "Humanities Core: Great Books, Big Ideas -- Europe, Modern (DLCL 13Q, GERMAN 13Q)",
        "description": "This three-quarter sequence asks big questions of major texts in the European and American tradition. What is a good life? How should society be organized? Who belongs? How should honor, love, sin, and similar abstractions govern our actions? What duty do we owe to the past and future? This third and final quarter focuses on the modern period, from the rise of revolutionary ideas to the experiences of totalitarianism and decolonization in the twentieth century. Authors include Locke, Mary Shelley, Marx, Nietzsche, Freud, Weber, Primo Levi, and Frantz Fanon. N.B. This is the third of three courses in the European track. These courses offer an unparalleled opportunity to study European history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future. Students who take HUMCORE 11 and HUMCORE 12Q will have preferential admission to HUMCORE 13Q (a WR2 seminar). **NOTE** This class meets Monday and Wednesday in room 20-22K and Fridays in room 260-113 to attend a lecture along with the other two HUMCORE courses this quarter.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "Writing 2"
        ],
        "objectID": "220691",
        "number": "HUMCORE 13Q",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "20",
        "title": "Humanities Core: Dao, Virtue, and Nature -- Foundations of East Asian Thought (CHINA 20, JAPAN 20, KOREA 20)",
        "description": "This course explores the values and questions posed in the formative period of East Asian civilizations. Notions of a Dao (&quot;Way&quot;) are common to Confucianism, Daoism, and Buddhism, but those systems of thought have radically different ideas about what that Dao is and how it might be realized in society and an individual's life. These systems of thought appeared first in China, and eventually spread to Korea and Japan. Each culture developed its own ways of reconciling the competing systems, but in each case the comprehensive structure of values and human ideals differs significantly from those that appeared elsewhere in the ancient world. The course examines East Asian ideas about self-cultivation, harmonious society, rulership, and the relation between human and nature with a view toward expanding our understanding of these issues in human history, and highlighting their legacies in Asian civilizations today. The course features selective readings in classics of Confucian, Daoist, and Buddhist texts that present the foundational tenets of Asian thought. N. B. This is the first of three courses in the Humanities Core, East Asian track. These courses show how history and ideas shape our world and future. Take all three to experience a year-long intellectual community dedicated to the life of the mind.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "220552",
        "number": "HUMCORE 20",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "21",
        "title": "Humanities Core: Love and Betrayal in Asia (CHINA 21, JAPAN 21, KOREA 21)",
        "description": "Why are lovers in storybooks East and West always star-crossed? Why do love and death seem to go together? For every Romeo and Juliet, there are dozens of doomed lovers in the Asian literary repertoires, from Genji's string of embittered mistresses, to the Butterfly lovers in early modern China, to the voices of desire in Koryo love songs, to the devoted adolescent cousins in Dream of the Red Chamber, to the media stars of Korean romantic drama, now wildly popular throughout Asia. In this course, we explore how the love story has evolved over centuries of East Asian history, asking along the way what we can learn about Chinese, Japanese, and Korean views of family and community, gender and sexuality, truth and deception, trust and betrayal, ritual and emotion, and freedom and solidarity from canonical and non-canonical works in East Asian literatures. N.B. This is the second of three courses in the East Asian track. These courses offer an unparalleled opportunity to study East Asian history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "219307",
        "number": "HUMCORE 21",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "21Q",
        "title": "Humanities Core: Love and Betrayal in Asia (CHINA 21Q, JAPAN 21Q, KOREA 21Q)",
        "description": "Why are lovers in storybooks East and West always star-crossed? Why do love and death seem to go together? For every Romeo and Juliet, there are dozens of doomed lovers in the Asian literary repertoires, from Genji's string of embittered mistresses, to the Butterfly lovers in early modern China, to the voices of desire in Koryo love songs, to the devoted adolescent cousins in Dream of the Red Chamber, to the media stars of Korean romantic drama, now wildly popular throughout Asia. In this course, we explore how the love story has evolved over centuries of East Asian history, asking along the way what we can learn about Chinese, Japanese, and Korean views of family and community, gender and sexuality, truth and deception, trust and betrayal, ritual and emotion, and freedom and solidarity from canonical and non-canonical works in East Asian literatures. N.B. This is the second of three courses in the East Asian track. These courses offer an unparalleled opportunity to study East Asian history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220549",
        "number": "HUMCORE 21Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "22",
        "title": "Humanities Core: Everybody Eats: The Language, Culture, and Ethics of Food in East Asia (CHINA 118, JAPAN 118, KOREA 118)",
        "description": "Many of us have grown up eating &quot;Asian&quot; at home, with friends, on special occasions, or even without full awareness that Asian is what we were eating. This course situates the three major culinary traditions of East Asia--China, Japan, and Korea--in the histories and civilizations of the region, using food as an introduction to their rich repertoires of literature, art, language, philosophy, religion, and culture. It also situates these seemingly timeless gastronomies within local and global flows, social change, and ethical frameworks. Specifically, we will explore the traditional elements of Korean court food, and the transformation of this cuisine as a consequence of the Korean War and South Korea&iquest;s subsequent globalizing economy; the intersection of traditional Japanese food with past and contemporary identities; and the evolution of Chinese cuisine that accompanies shifting attitudes about the environment, health, and well-being. Questions we will ask ourselves during the quarter include, what is &quot;Asian&quot; about Asian cuisine? How has the language of food changed? Is eating, and talking about eating, a gendered experience? How have changing views of the self and community shifted the conversation around the ethics and ecology of meat consumption?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "Writing 2"
        ],
        "objectID": "219672",
        "number": "HUMCORE 22",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "52",
        "title": "Global Humanities: The Grand Millennium, 800-1800 (DLCL 52, HISTORY 206D, JAPAN 52)",
        "description": "How should we live? This course explores ethical pathways in European, Islamic, and East Asian traditions: mysticism and rationality, passion and duty, this and other worldly, ambition and peace of mind. They all seem to be pairs of opposites, but as we'll see, some important historical figures managed to follow two or more of them at once. We will read works by successful thinkers, travelers, poets, lovers, and bureaucrats written between 800 and 1900 C.E. We will ask ourselves whether we agree with their choices and judgments about what is a life well lived.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "220586",
        "number": "HUMCORE 52",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "111",
        "title": "Texts that Changed the World from the Ancient Middle East (COMPLIT 31, JEWISHST 150, RELIGST 150)",
        "description": "This course traces the story of the cradle of human civilization. We will begin with the earliest human stories, the Gilgamesh Epic and biblical literature, and follow the path of the development of law, religion, philosophy and literature in the ancient Mediterranean or Middle Eastern world, to the emergence of Jewish and Christian thinking. We will pose questions about how this past continues to inform our present: What stories, myths, and ideas remain foundational to us? How did the stories and myths shape civilizations and form larger communities? How did the earliest stories conceive of human life and the divine? What are the ideas about the order of nature, and the place of human life within that order? How is the relationship between the individual and society constituted? This course is part of the Humanities Core: https://humanitiescore.stanford.edu/",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "220477",
        "number": "HUMCORE 111",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "112",
        "title": "Great Books, Big Ideas from Ancient Greece and Rome (CLASSICS 37, DLCL 11)",
        "description": "This course will journey through ancient Greek and Roman literature from Homer to St. Augustine, in constant conversation with the other HumCore travelers in the Ancient Middle East, Africa and South Asia, and Early China. It will introduce participants to some of its fascinating features and big ideas (such as the idea of history); and it will reflect on questions including: What is an honorable life? Who is the Other? How does a society fall apart? Where does human subjectivity fit into a world of matter, cause and effect? Should art serve an exterior purpose? Do we have any duties to the past? This course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Mondays you meet in your own course, and on Wednesdays all the HumCore seminars (in session that quarter) meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class section has been cancelled!",
                "classId": "12265",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "218304",
        "number": "HUMCORE 112",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "113",
        "title": "Looking for the Way (Dao) in East Asia (CHINA 163A)",
        "description": "This course looks at foundations of East Asian thought, including Confucianism, Daoism, and Buddhism as well as other cultural traditions. The ideologies were first articulated in ancient China (or India) and from there spread to Korea, Japan, and throughout Southeast Asia, where they remain important today. We will read selections from seminal texts including &quot;The Confucian Analects&quot;, &quot;Daode jing&quot;, &quot;Zhuangzi&quot;, and &quot;The Platform Sutra of the Sixth Patriarch&quot;. Attention is also given to other perennial (and often problematic) themes of Asian life and society, including those of conflicting loyalties and violent revenge. Finally, the course examines aesthetic expression in painting and calligraphy that became the embodiment of classical philosophical values and their own articulation of an aestheticized Way, still widely practiced and admired. This course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Mondays you meet in your own course, and on Wednesdays all the HumCore seminars (in session that quarter) meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222849",
        "number": "HUMCORE 113",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "121",
        "title": "Ancient Knowledge, New Frontiers: How the Greek Legacy Became Islamic Science (CLASSICS 47, COMPLIT 107A)",
        "description": "What is the relation between magic and science? Is religion compatible with the scientific method? Are there patterns in the stars? What is a metaphor? This course will read key moments in Greek and Islamic science and philosophy and investigate the philosophy of language, mathematical diagrams, manuscripts, the madrasa, free will, predestination, and semantic logic. We will read selections from Ibn Taymiya, Ibn Haytham, Omar Khayyam, Baha al-Din al-Amili, and others. This course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Mondays you meet in your own course, and on Wednesdays all the HumCore seminars (in session that quarter) meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28189",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "380-380W",
                        "instructors": [
                            {
                                "name": "Netz, R.",
                                "sunet": "netz"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Netz, R.",
                                "sunet": "netz"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222628",
        "number": "HUMCORE 121",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "122",
        "title": "Humanities Core: Great Minds of the Italian Renaissance and their World (ENGLISH 112C)",
        "description": "What enabled Leonardo da Vinci to excel in over a dozen fields from painting to engineering and to anticipate flight four hundred years before the first aircraft took off? How did Michelangelo paint the Sistine Chapel Ceiling? What forces and insights led Machiavelli to write &quot;The Prince&quot;? An historical moment and a cultural era, the Italian Renaissance famously saw monumental achievements in literature, art, and architecture, influential developments in science and technology, and the flourishing of multi-talented individuals who contributed profoundly, expertly, and simultaneously to very different fields. In this course on the great thinkers, writers, and achievers of the Italian Renaissance, we will study these &quot;universal geniuses&quot; and their world. Investigating the writings, thought, and lives of such figures as Leonardo da Vinci, Niccol&iquest; Machiavelli, and Galileo Galilei, we will interrogate historical and contemporary ideas concerning genius, creativity, and the phenomenon of &quot;Renaissance man&quot; known as polymathy. Taught in English. On Tuesdays you meet in your own course, and on Thursday all the HumCore seminars in session that quarter meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30860",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "160-323",
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "222760",
        "number": "HUMCORE 122",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "123",
        "title": "Beauty and Renunciation in Japan (JAPAN 163A)",
        "description": "Is it okay to feel pleasure? Should humans choose beauty or renunciation? This is the main controversy of medieval Japan. This course introduces students to the famous literary works that created a world of taste, subtlety, and sensuality. We also read essays that warn against the risks of leading a life of gratification, both in this life and in the afterlife. And we discover together the ways in which these two positions can be not that far from each other. Does love always lead to heartbreak? Is the appreciation of nature compatible with the truths of Buddhism? Is it good to have a family? What kind of house should we build for ourselves? Can fictional stories make us better persons? Each week, during the first class meeting, we will focus on these issues in Japan. During the second class meeting, we will participate in a collaborative conversation with the other students and faculty in Humanities Core classes, about other regions and issues. This course is taught in English. This course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Mondays you meet in your own course, and on Wednesdays all the HumCore seminars (in session that quarter) meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14244",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Stilerman, A.",
                                "sunet": "agstiler"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Wednesday"
                    },
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Stilerman, A.",
                                "sunet": "agstiler"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222850",
        "number": "HUMCORE 123",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "124",
        "title": "East Asia Discovers the World: Cartographic Encounters from the Mongols to Meiji (HISTORY 203B)",
        "description": "Before the modern era, how did curious people in China, Korea, and Japan learn about the world? How did geographical information reach them, and how did they interpret it? This class will probe the history of cartographic exchange from the Mongols to Meiji from an East Asian perspective. Every Tuesday, we will examine East Asian maps; Thursday readings will introduce broader comparative perspectives. This course is part of the Humanities Core, a collaborative humanities seminar cluster. On Tuesdays we meet in our own course, while on Thursdays we will gather with two other HumCore classes for joint Plenary Sessions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31445",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Green Earth Sciences134",
                        "instructors": [
                            {
                                "name": "Wigen, K.",
                                "sunet": "kwigen"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Hewlett Teaching Center 102",
                        "instructors": [
                            {
                                "name": "Wigen, K.",
                                "sunet": "kwigen"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "225126",
        "number": "HUMCORE 124",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "131",
        "title": "Modernity and Politics in Middle Eastern Literatures (COMPLIT 43)",
        "description": "This course will investigate cultural and literary responses to modernity in the Middle East. The intense modernization process that started in mid 19th century and lingers to this day in the region caused Arabic, Persian, and Turkish literary cultures to encounter rapid changes; borders dissolved, new societies and nations were formed, daily life westernized, and new literary forms took over the former models. In order to understand how writers and individuals negotiated between tradition and modernity and how they adapted their traditions into the modern life we will read both canonical and graphic novels comparatively from each language group and focus on the themes of nation, identity, and gender. All readings will be in English translation.  This course is part of the Humanities Core: https://humanitiescore.stanford.edu/",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30233",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Karahan, B.",
                                "sunet": "bkarahan"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222631",
        "number": "HUMCORE 131",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "133",
        "title": "Humanities Core: How to be Modern in East Asia (CHINA 24, COMPLIT 44, JAPAN 24, KOREA 24)",
        "description": "Modern East Asia was almost continuously convulsed by war and revolution in the 19th and 20th centuries. But the everyday experience of modernity was structured more profoundly by the widening gulf between the country and the city, economically, politically, and culturally. This course examines literary and cinematic works from China and Japan that respond to and reflect on the city/country divide, framing it against issues of class, gender, national identity, and ethnicity. It also explores changing ideas about home/hometown, native soil, the folk, roots, migration, enlightenment, civilization, progress, modernization, nationalism, cosmopolitanism, and sustainability. All materials are in English. This course is part of the Humanities Core: https://humanitiescore.stanford.edu/",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This is a HUMCORE course and meets Mondays in the Knight Building, room K201, and Wednesdays in a large group room shared with all HUMCORE courses this quarter, HUMCORE 13, 131, 133, 137, 139.",
                "classId": "13732",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilkison, A.",
                                "sunet": "amgilki"
                            },
                            {
                                "name": "Reichert, J.",
                                "sunet": "reichert"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Wednesday"
                    },
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilkison, A.",
                                "sunet": "amgilki"
                            },
                            {
                                "name": "Reichert, J.",
                                "sunet": "reichert"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220673",
        "number": "HUMCORE 133",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "135",
        "title": "Atlantic Folds: Indigeneity and Modernity (COMPLIT 46)",
        "description": "The Atlantic as an infinite doubling of ancient and modern. The Atlantic as an endless, watery cloth of African, American, and European folds, unfolding and refolding through bodies and ideas: blackness, whiteness, nature, nurture, water, blood, cannibal, mother, you, and I. The Atlantic as a concept, a space, a muse, a goddess. The Atlantic as birth and burial. One ocean under God, divisible, with salt enough for all who thirst. Authors include: Paul Gilroy, Gilles Deleuze, Chimamanda Adichie, Eduardo Viveiros de Castro, Davi Kopenawa, Pepetela, Beyonc&eacute;, and Jos&eacute; Vasconcelos. This course is part of the Humanities Core: https://humanitiescore.stanford.edu/",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222856",
        "number": "HUMCORE 135",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "137",
        "title": "Time Travel in the Americas",
        "description": "Historical fiction refracts our view of the present and our hopes for the future through the prism of the past. This course explores twentieth and twenty-first century writing from the Americas that reflects back on the relationship between American identity, modernity, and colonial power. At the heart of all of these accounts is a reckoning with the nature of recorded history: who has had the power to speak for themselves, who has been represented by others, and who has been left out? For some writers, this entails the re-embodiment of real historical figures, whether Toussaint Louverture in CLR James's The Black Jacobins, Johann Moritz Rugendas in C&eacute;sar Aira's An Episode in the Life of a Landscape Painter, or Esteb&aacute;nico in Laila Lalami's The Moor's Account. For others, it means the manufacture of plausible historical analogues, like Amabelle D&eacute;sir in Edwidge Danticat's The Farming of Bones and Antoinette Rochester in Jean Rhys's Wide Sargasso Sea. And for some, like Rita Indiana in Tentacle and Carmen Boullosa in Heavens on Earth, it means reversing the gaze, using the distant past to speculate about the possibilities of a distant future. This course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Mondays you meet in your own course, and on Wednesdays all the HumCore seminars (in session that quarter) meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30167",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223416",
        "number": "HUMCORE 137",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "138",
        "title": "Narrating the British Empire (HISTORY 238E)",
        "description": "In this course, we will read major British literary works of the age of empire to explore the relationship between imperialism and modern literature. We will attend to the way imperialism shaped the evolution of a range of genres, from romantic to gothic to mystery to the spy novel, fantasy, and modernism, reading works by authors such as Charlotte Bronte, Rudyard Kipling, Joseph Conrad, E. M. Forster, Agatha Christie, and others. This course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Mondays you meet in your own course, and on Wednesdays all the HumCore seminars (in session that quarter) meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224667",
        "number": "HUMCORE 138",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMCORE",
        "code": "139",
        "title": "Pacific Ocean Worlds: A Sea of Islands (TAPS 139)",
        "description": "How do we think about the modern Pacific Ocean world? Here in California, we border this vast waterscape, which is larger than all the world's remaining oceans combined and which could easily fit all of the planet's landmasses within it. What lessons can we learn from the region's diverse and dynamic island cultures, its entangled histories, and its urgent contemporary issues? How has the Pacific impacted ideas about modernity elsewhere in the world? And what unique Oceanian modernities are emerging from the region? Engaging with a rich array of literary and performance texts, films, and artworks from the 19th to the 21st centuries, we will consider different ways in which the Pacific has been imagined. We will further explore how Pacific Islander scholars, artists, and activists have drawn on their cultural traditions and knowledge systems to create new works that respond to current challenges facing the region, including colonialism, globalization, tourism, migration, climate change, militarization, and nuclearization. This course is part of the Humanities Core: https://humanitiescore.stanford.edu.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30182",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223483",
        "number": "HUMCORE 139",
        "units": [
            3
        ],
        "totalSections": 1
    }
]