[
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "20",
        "title": "Humanities Core: Dao, Virtue, and Nature -- Foundations of East Asian Thought (CHINA 20, HUMCORE 20, JAPAN 20)",
        "description": "This course explores the values and questions posed in the formative period of East Asian civilizations. Notions of a Dao (&quot;Way&quot;) are common to Confucianism, Daoism, and Buddhism, but those systems of thought have radically different ideas about what that Dao is and how it might be realized in society and an individual's life. These systems of thought appeared first in China, and eventually spread to Korea and Japan. Each culture developed its own ways of reconciling the competing systems, but in each case the comprehensive structure of values and human ideals differs significantly from those that appeared elsewhere in the ancient world. The course examines East Asian ideas about self-cultivation, harmonious society, rulership, and the relation between human and nature with a view toward expanding our understanding of these issues in human history, and highlighting their legacies in Asian civilizations today. The course features selective readings in classics of Confucian, Daoist, and Buddhist texts that present the foundational tenets of Asian thought. N. B. This is the first of three courses in the Humanities Core, East Asian track. These courses show how history and ideas shape our world and future. Take all three to experience a year-long intellectual community dedicated to the life of the mind.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "220552",
        "number": "KOREA 20",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "21",
        "title": "Humanities Core: Love and Betrayal in Asia (CHINA 21, HUMCORE 21, JAPAN 21)",
        "description": "Why are lovers in storybooks East and West always star-crossed? Why do love and death seem to go together? For every Romeo and Juliet, there are dozens of doomed lovers in the Asian literary repertoires, from Genji's string of embittered mistresses, to the Butterfly lovers in early modern China, to the voices of desire in Koryo love songs, to the devoted adolescent cousins in Dream of the Red Chamber, to the media stars of Korean romantic drama, now wildly popular throughout Asia. In this course, we explore how the love story has evolved over centuries of East Asian history, asking along the way what we can learn about Chinese, Japanese, and Korean views of family and community, gender and sexuality, truth and deception, trust and betrayal, ritual and emotion, and freedom and solidarity from canonical and non-canonical works in East Asian literatures. N.B. This is the second of three courses in the East Asian track. These courses offer an unparalleled opportunity to study East Asian history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "219307",
        "number": "KOREA 21",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "21Q",
        "title": "Humanities Core: Love and Betrayal in Asia (CHINA 21Q, HUMCORE 21Q, JAPAN 21Q)",
        "description": "Why are lovers in storybooks East and West always star-crossed? Why do love and death seem to go together? For every Romeo and Juliet, there are dozens of doomed lovers in the Asian literary repertoires, from Genji's string of embittered mistresses, to the Butterfly lovers in early modern China, to the voices of desire in Koryo love songs, to the devoted adolescent cousins in Dream of the Red Chamber, to the media stars of Korean romantic drama, now wildly popular throughout Asia. In this course, we explore how the love story has evolved over centuries of East Asian history, asking along the way what we can learn about Chinese, Japanese, and Korean views of family and community, gender and sexuality, truth and deception, trust and betrayal, ritual and emotion, and freedom and solidarity from canonical and non-canonical works in East Asian literatures. N.B. This is the second of three courses in the East Asian track. These courses offer an unparalleled opportunity to study East Asian history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220549",
        "number": "KOREA 21Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "24",
        "title": "Humanities Core: How to be Modern in East Asia (CHINA 24, COMPLIT 44, HUMCORE 133, JAPAN 24)",
        "description": "Modern East Asia was almost continuously convulsed by war and revolution in the 19th and 20th centuries. But the everyday experience of modernity was structured more profoundly by the widening gulf between the country and the city, economically, politically, and culturally. This course examines literary and cinematic works from China and Japan that respond to and reflect on the city/country divide, framing it against issues of class, gender, national identity, and ethnicity. It also explores changing ideas about home/hometown, native soil, the folk, roots, migration, enlightenment, civilization, progress, modernization, nationalism, cosmopolitanism, and sustainability. All materials are in English. This course is part of the Humanities Core: https://humanitiescore.stanford.edu/",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32665",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Xu, L.",
                                "sunet": "ljxu"
                            },
                            {
                                "name": "Reichert, J.",
                                "sunet": "reichert"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220673",
        "number": "KOREA 24",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "101N",
        "title": "Kangnam Style: K-pop and the Globalization of Korean Soft Power",
        "description": "For over a decade now, South Korea has established itself as a tireless generator of soft power, the popularity of its pop-culture spreading from Asia to the rest of the world.  This class will look into the economic engine that moves this &quot;cultural contents&quot; industry, and will examine some of its expressions in the form of K-pop.  Class meets in East Asia Library (Lathrop Library), Rm 338.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "215677",
        "number": "KOREA 101N",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "111",
        "title": "From Colonialism to K-pop: Race and Gender in South Korean Culture (COMPLIT 111K, CSRE 111A, FEMGEN 111A, KOREA 222)",
        "description": "Some may associate South Korea with the following: BTS, North Korean nukes, Samsung, Hyundai, Squid Games. Some may repeat what South Korea has said about itself: that it is racially homogenous, an ethnic community that can trace their ancestry back 5000 years. Some may wonder how a country that is often perceived as Christian and conservative developed pop culture like K-pop, or queer subcultures, or feminist activism. This class will use South Korea as a case study to think historically and geographically about race and gender through the following topics: when did racial discourses begin to emerge in Korea? What have been South Korea's significant encounters with the figure of the Other in its modern history? How were women implicated in the changing landscape of colonial Korea, the Korean War, Korea's Vietnam War experience, and compressed modernization? How have the influx of migrant labor and North Korean refugees impacted ideas about race in South Korea? And finally, what does K-pop tell us about shifting South Korean views of race and gender? The primary materials that we will analyze will be drawn from Korean fiction, film, and media in translation.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224456",
        "number": "KOREA 111",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "112",
        "title": "Asian Screen Cultures (CHINA 112A, CHINA 212A, JAPAN 112A, JAPAN 212A, KOREA 212)",
        "description": "Asian screen culture, ranging from cinema to online games, has (re)shaped the global and national/regional imaginings of Asia. The Post-Cold War intensification of intra-Asian interactions has precipitated the rise of a Pan-Asian regional identity wherein the nation-state is not yet obsolete. What role does screen culture plays in the border-crossing interplay among languages, ideologies, aesthetics, and affect? How does the converging media of screen culture capture local/global desires and propel the history of transformation of sign systems from the written words to visual moving images in a digital time? How do we understand the aesthetic, storytelling, and politics of Asian screen cultures vis-&agrave;-vis its historical and social context? While exploring these transnational and transdisciplinary questions, this course will deal with topical issues of Pan-Asian identity, (trans)nationalism, (un)translatability, commodity fetishism, locality and globality, technophobia, and politics of gender. Students will learn how to think and write about screen cultures of East Asia in particular and of our world of screens in general.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222258",
        "number": "KOREA 112",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "118",
        "title": "Humanities Core: Everybody Eats: The Language, Culture, and Ethics of Food in East Asia (CHINA 118, HUMCORE 22, JAPAN 118)",
        "description": "Many of us have grown up eating &quot;Asian&quot; at home, with friends, on special occasions, or even without full awareness that Asian is what we were eating. This course situates the three major culinary traditions of East Asia--China, Japan, and Korea--in the histories and civilizations of the region, using food as an introduction to their rich repertoires of literature, art, language, philosophy, religion, and culture. It also situates these seemingly timeless gastronomies within local and global flows, social change, and ethical frameworks. Specifically, we will explore the traditional elements of Korean court food, and the transformation of this cuisine as a consequence of the Korean War and South Korea&iquest;s subsequent globalizing economy; the intersection of traditional Japanese food with past and contemporary identities; and the evolution of Chinese cuisine that accompanies shifting attitudes about the environment, health, and well-being. Questions we will ask ourselves during the quarter include, what is &quot;Asian&quot; about Asian cuisine? How has the language of food changed? Is eating, and talking about eating, a gendered experience? How have changing views of the self and community shifted the conversation around the ethics and ecology of meat consumption?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "Writing 2"
        ],
        "objectID": "219672",
        "number": "KOREA 118",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "120",
        "title": "Narratives of Modern and Contemporary Korea (COMPLIT 222, KOREA 220)",
        "description": "This introductory survey will examine the development of South and North Korean literature from the turn of the 20th century until the present. The course will be guided by historical and thematic inquiries as we explore literature in the colonial period, in the period of postwar industrialization, and contemporary literature from the last decade. We will supplement our readings with critical writing about Korea from the fields of cultural studies and the social sciences in order to broaden the terms of our engagement with our primary texts.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "213301",
        "number": "KOREA 120",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "121",
        "title": "Doing the Right Thing:  Ethical Dilemmas in Korean Film (KOREA 221)",
        "description": "Ethics and violence seem to be contradictory terms, yet much of Korean film and literature in the past five decades has demonstrated that they are an intricate and in many ways justifiable part of the fabric of contemporary existence. Film exposes time and again the complex ways in which the supposed vanguards of morality, religious institutions, family, schools, and the state are sites of condoned transgression, wherein spiritual and physical violation is inflicted relentlessly. This class will explore the ways in which questions about Truth and the origins of good and evil are mediated through film in the particular context of the political, social, and economic development of postwar South Korea. Tuesday classes will include a brief introduction followed by a film screening that will last on average for two hours; students that are unable to stay until 5 pm will be required to watch the rest of the film on their own.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "214083",
        "number": "KOREA 121",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "151",
        "title": "The Nature of Knowledge: Science and Literature in East Asia (CHINA 151B, CHINA 251B, JAPAN 151B, JAPAN 251B, KOREA 251)",
        "description": "&quot;The Nature of Knowledge&quot; explores the intersections of science and humanities East Asia. It covers a broad geographic area (China, Japan, and Korea) along a long temporal space (14th century - present) to investigate how historical notions about the natural world, the human body, and social order defied, informed, and constructed our current categories of science and humanities. The course will make use of medical, geographic, and cosmological treatises from premodern East Asia, portrayals and uses of science in modern literature, film, and media, as well as theoretical and historical essays on the relationships between literature, science, and society.nnAs part of its exploration of science and the humanities in conjunction, the course addresses how understandings of nature are mediated through techniques of narrative, rhetoric, visualization, and demonstration. In the meantime, it also examines how the emergence of modern disciplinary &quot;science&quot; influenced the development of literary language, tropes, and techniques of subject development. This class will expose the ways that science has been mobilized for various ideological projects and to serve different interests, and will produce insights into contemporary debates about the sciences and humanities.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32670",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zur, D.",
                                "sunet": "dafnaz"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220687",
        "number": "KOREA 151",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "157S",
        "title": "Tyranny and Resistance: East Asia's Political Culture and Tradition (CHINA 157S, JAPAN 157S)",
        "description": "What is tyranny? When does political power cease to be legitimate and government become tyrannical? And what can individuals do in the face of tyranny? This course will explore East Asia's long political tradition through the problem of tyranny and its resistance. We will cover a wide range of material. We begin with how seminal political thinkers in East Asia, including Warring States philosophers such as Mencius and Han Feizi, understood the boundary between legitimate and illegitimate authority. We will also look at the strategies used by various political actors, including government officials, cultural or social elites, and common people, when they confronted what they perceived to be the unjust exercise political power, whether in the form of despotic monarchs, corrupt authorities, or general misrule. Our discussions will be wide-ranging. We will pay particular attention to how these historical examples from China, Korea, and Japan&iquest;s past have resonated with modern and contemporary political discussions in contemporary East Asian societies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219305",
        "number": "KOREA 157S",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "158",
        "title": "Korean History and Culture before 1900 (HISTORY 291K, HISTORY 391K, KOREA 258)",
        "description": "This course serves as an introduction to Korean culture, society, and history before the modern period. It begins with a discussion of early Korea and controversies over Korean origins; the bulk of the course will be devoted to the Chos'n period (1392-1910), that from the end of medieval Korea to the modern period. Topics to be covered include: Korean national and ethnic origins, the role of religious and intellectual traditions such as Buddhism and Confucianism, popular and indigenous religious practices, the traditional Korean family and social order, state and society during the Chos'n dynasty, vernacular prose literature, Korean's relations with its neighbors in East Asia, and changing conceptions of Korean identity.nThe course will be conducted through the reading and discussion of primary texts in English translation alongside scholarly research. As such, it will emphasize the interpretation of historical sources, which include personal letters, memoirs, and diaries, traditional histories, diplomatic and political documents, along with religious texts and works of art. Scholarly work will help contextualize these materials, while the class discussions will introduce students to existing scholarly debates about the Korean past. Students will be asked also to examine the premodern past with an eye to contemporary reception. The final project for the class is a film study, where a modern Korean film portraying premodern Korea will be analyzed as a case study of how the past works in public historical memory in contemporary Korea, both North and South. An open-ended research paper is also possible, pending instructor approval.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "219827",
        "number": "KOREA 158",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "190X",
        "title": "North Korea in a Historical and Cultural Perspective (HISTORY 290, HISTORY 390, KOREA 290X)",
        "description": "North Korea has been dubbed secretive, its leaders unhinged, its people mindless dupes. Such descriptions are partly a result of the control that the DPRK exerts over texts and bodies that come through its borders. Filtered through foreign media, North Korea's people and places can seem to belong to another planet. However, students interested in North Korea can access the DPRK through a broad and growing range of sources including satellite imagery, archival documents, popular magazines, films, literature, art, tourism, and through interviews with former North Korean residents (defectors). When such sources are brought into conversation with scholarship about North Korea, they yield new insights into North Korea's history, politics, economy, and culture. This course will provide students with fresh perspectives on the DPRK and will give them tools to better contextualize its current position in the world. Lectures will be enriched with a roster of guest speakers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "29506",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "216901",
        "number": "KOREA 190X",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "212",
        "title": "Asian Screen Cultures (CHINA 112A, CHINA 212A, JAPAN 112A, JAPAN 212A, KOREA 112)",
        "description": "Asian screen culture, ranging from cinema to online games, has (re)shaped the global and national/regional imaginings of Asia. The Post-Cold War intensification of intra-Asian interactions has precipitated the rise of a Pan-Asian regional identity wherein the nation-state is not yet obsolete. What role does screen culture plays in the border-crossing interplay among languages, ideologies, aesthetics, and affect? How does the converging media of screen culture capture local/global desires and propel the history of transformation of sign systems from the written words to visual moving images in a digital time? How do we understand the aesthetic, storytelling, and politics of Asian screen cultures vis-&agrave;-vis its historical and social context? While exploring these transnational and transdisciplinary questions, this course will deal with topical issues of Pan-Asian identity, (trans)nationalism, (un)translatability, commodity fetishism, locality and globality, technophobia, and politics of gender. Students will learn how to think and write about screen cultures of East Asia in particular and of our world of screens in general.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222258",
        "number": "KOREA 212",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "220",
        "title": "Narratives of Modern and Contemporary Korea (COMPLIT 222, KOREA 120)",
        "description": "This introductory survey will examine the development of South and North Korean literature from the turn of the 20th century until the present. The course will be guided by historical and thematic inquiries as we explore literature in the colonial period, in the period of postwar industrialization, and contemporary literature from the last decade. We will supplement our readings with critical writing about Korea from the fields of cultural studies and the social sciences in order to broaden the terms of our engagement with our primary texts.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "213301",
        "number": "KOREA 220",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "221",
        "title": "Doing the Right Thing:  Ethical Dilemmas in Korean Film (KOREA 121)",
        "description": "Ethics and violence seem to be contradictory terms, yet much of Korean film and literature in the past five decades has demonstrated that they are an intricate and in many ways justifiable part of the fabric of contemporary existence. Film exposes time and again the complex ways in which the supposed vanguards of morality, religious institutions, family, schools, and the state are sites of condoned transgression, wherein spiritual and physical violation is inflicted relentlessly. This class will explore the ways in which questions about Truth and the origins of good and evil are mediated through film in the particular context of the political, social, and economic development of postwar South Korea. Tuesday classes will include a brief introduction followed by a film screening that will last on average for two hours; students that are unable to stay until 5 pm will be required to watch the rest of the film on their own.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "214083",
        "number": "KOREA 221",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "222",
        "title": "From Colonialism to K-pop: Race and Gender in South Korean Culture (COMPLIT 111K, CSRE 111A, FEMGEN 111A, KOREA 111)",
        "description": "Some may associate South Korea with the following: BTS, North Korean nukes, Samsung, Hyundai, Squid Games. Some may repeat what South Korea has said about itself: that it is racially homogenous, an ethnic community that can trace their ancestry back 5000 years. Some may wonder how a country that is often perceived as Christian and conservative developed pop culture like K-pop, or queer subcultures, or feminist activism. This class will use South Korea as a case study to think historically and geographically about race and gender through the following topics: when did racial discourses begin to emerge in Korea? What have been South Korea's significant encounters with the figure of the Other in its modern history? How were women implicated in the changing landscape of colonial Korea, the Korean War, Korea's Vietnam War experience, and compressed modernization? How have the influx of migrant labor and North Korean refugees impacted ideas about race in South Korea? And finally, what does K-pop tell us about shifting South Korean views of race and gender? The primary materials that we will analyze will be drawn from Korean fiction, film, and media in translation.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224456",
        "number": "KOREA 222",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "250",
        "title": "More Real than Fiction: Perspectives of History and Theory in Modern Korean Literature (KOREA 350)",
        "description": "The past two decades have brought about a significant reassessment and new theoretical engagements with colonial and postcolonial Korean fiction. Colonial fiction has typically been read in binary terms: modernist/realist, resistant/collaborative, and political/escapist. In the postwar era, fiction has typically been viewed in frameworks that take into account fallouts from state developmentalism and division, the movements of bodies and capital, precarious social dynamics and gender politics. The purpose of this survey seminar is to interrogate the relationship between Korean fiction and the social/political/economic conditions of its production. We will do so by reading novels and short fiction from the last century alongside recent scholarship from both within and outside the Korean studies field. While doing so, we inquire into the efficacy of the area studies/Korean studies paradigm and investigate theoretical frameworks that might be applicable to Korean fiction in different periods. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219940",
        "number": "KOREA 250",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "251",
        "title": "The Nature of Knowledge: Science and Literature in East Asia (CHINA 151B, CHINA 251B, JAPAN 151B, JAPAN 251B, KOREA 151)",
        "description": "&quot;The Nature of Knowledge&quot; explores the intersections of science and humanities East Asia. It covers a broad geographic area (China, Japan, and Korea) along a long temporal space (14th century - present) to investigate how historical notions about the natural world, the human body, and social order defied, informed, and constructed our current categories of science and humanities. The course will make use of medical, geographic, and cosmological treatises from premodern East Asia, portrayals and uses of science in modern literature, film, and media, as well as theoretical and historical essays on the relationships between literature, science, and society.nnAs part of its exploration of science and the humanities in conjunction, the course addresses how understandings of nature are mediated through techniques of narrative, rhetoric, visualization, and demonstration. In the meantime, it also examines how the emergence of modern disciplinary &quot;science&quot; influenced the development of literary language, tropes, and techniques of subject development. This class will expose the ways that science has been mobilized for various ideological projects and to serve different interests, and will produce insights into contemporary debates about the sciences and humanities.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32673",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zur, D.",
                                "sunet": "dafnaz"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220687",
        "number": "KOREA 251",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "258",
        "title": "Korean History and Culture before 1900 (HISTORY 291K, HISTORY 391K, KOREA 158)",
        "description": "This course serves as an introduction to Korean culture, society, and history before the modern period. It begins with a discussion of early Korea and controversies over Korean origins; the bulk of the course will be devoted to the Chos'n period (1392-1910), that from the end of medieval Korea to the modern period. Topics to be covered include: Korean national and ethnic origins, the role of religious and intellectual traditions such as Buddhism and Confucianism, popular and indigenous religious practices, the traditional Korean family and social order, state and society during the Chos'n dynasty, vernacular prose literature, Korean's relations with its neighbors in East Asia, and changing conceptions of Korean identity.nThe course will be conducted through the reading and discussion of primary texts in English translation alongside scholarly research. As such, it will emphasize the interpretation of historical sources, which include personal letters, memoirs, and diaries, traditional histories, diplomatic and political documents, along with religious texts and works of art. Scholarly work will help contextualize these materials, while the class discussions will introduce students to existing scholarly debates about the Korean past. Students will be asked also to examine the premodern past with an eye to contemporary reception. The final project for the class is a film study, where a modern Korean film portraying premodern Korea will be analyzed as a case study of how the past works in public historical memory in contemporary Korea, both North and South. An open-ended research paper is also possible, pending instructor approval.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219827",
        "number": "KOREA 258",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "290X",
        "title": "North Korea in a Historical and Cultural Perspective (HISTORY 290, HISTORY 390, KOREA 190X)",
        "description": "North Korea has been dubbed secretive, its leaders unhinged, its people mindless dupes. Such descriptions are partly a result of the control that the DPRK exerts over texts and bodies that come through its borders. Filtered through foreign media, North Korea's people and places can seem to belong to another planet. However, students interested in North Korea can access the DPRK through a broad and growing range of sources including satellite imagery, archival documents, popular magazines, films, literature, art, tourism, and through interviews with former North Korean residents (defectors). When such sources are brought into conversation with scholarship about North Korea, they yield new insights into North Korea's history, politics, economy, and culture. This course will provide students with fresh perspectives on the DPRK and will give them tools to better contextualize its current position in the world. Lectures will be enriched with a roster of guest speakers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "29507",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216901",
        "number": "KOREA 290X",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "301",
        "title": "Korean Studies Pedagogy",
        "description": "Workshop on Korean studies pedagogy and course design. Requires consent of instructor to enroll.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [],
        "gers": [],
        "objectID": "224808",
        "number": "KOREA 301",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "350",
        "title": "More Real than Fiction: Perspectives of History and Theory in Modern Korean Literature (KOREA 250)",
        "description": "The past two decades have brought about a significant reassessment and new theoretical engagements with colonial and postcolonial Korean fiction. Colonial fiction has typically been read in binary terms: modernist/realist, resistant/collaborative, and political/escapist. In the postwar era, fiction has typically been viewed in frameworks that take into account fallouts from state developmentalism and division, the movements of bodies and capital, precarious social dynamics and gender politics. The purpose of this survey seminar is to interrogate the relationship between Korean fiction and the social/political/economic conditions of its production. We will do so by reading novels and short fiction from the last century alongside recent scholarship from both within and outside the Korean studies field. While doing so, we inquire into the efficacy of the area studies/Korean studies paradigm and investigate theoretical frameworks that might be applicable to Korean fiction in different periods. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219940",
        "number": "KOREA 350",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "KOREA",
        "code": "355",
        "title": "History and Historiography of \"Premodern\" Korea",
        "description": "This seminar serves as an orientation to the history of &iquest;premodern&iquest; Korea through an examination of its historiography. It interrogates how scholars have situated their research questions within existing historiography and the *probl&eacute;matiques* that emerge from this engagement. Students will therefore read earlier, field-defining scholarship alongside more recent, emerging scholarship as a way to understand the development of premodern Korean history as a field. In particular, the course will critically examine the &iquest;premodern&iquest;/&iquest;modern&iquest; distinction and evaluate how questions in search of &iquest;modernity&iquest; and narratives of &iquest;modernization&iquest; have driven research and debates, whether explicitly or implicitly, on the &iquest;premodern&iquest; past. Topics to be covered include identity and nationalism, political and social history, gender and law, foreign relations and diplomacy, and economic and social &iquest;modernization.&iquest;nnAll required readings in English. Ability to read Korean or another Asian language welcome but not required.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220138",
        "number": "KOREA 355",
        "units": [
            2,
            3,
            4,
            5
        ]
    }
]