[
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "53Q",
        "title": "Storytelling in Medicine (MED 53Q)",
        "description": "Stories are at the core of medical practice, but the skills developed are applicable across disciplines, including technology and business. Storytelling in Medicine is a new sophomore seminar designed to teach skills in multiple modalities of storytelling including narrative, oral, social media, academic presentations and visual storytelling for different audiences. This seminar combines small groups, interactive workshops, and guest speakers who are experts in their fields of medicine. This will also include editing and support to complete your own story by the end of the seminar.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "28100",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "Alway Building, Room M315",
                        "instructors": [
                            {
                                "name": "Edwards, L.",
                                "sunet": "laurened"
                            },
                            {
                                "name": "Lin, B.",
                                "sunet": "bylin"
                            }
                        ],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "222818",
        "number": "LIFE 53Q",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "60N",
        "title": "The Psychology of Stoked (PSYC 60N)",
        "description": "Examines the biological, psychological and social aspects of what it means to live a positive, life-affirming existence. Drawing from a wide range of sources, from psychiatry and psychology, to spirituality and philosophy, seminar informs on the latest thinking about the psychology of happiness, and questions assumptions about personal happiness. Explores the new field of positive psychology and pulls from a multidisciplinary literature, examining life satisfaction and happiness from many perspectives, and the psychiatry of stimulation including substance, human sexuality, and healthy methods of attaining happiness. Includes guest speakers from many different backgrounds and perspectives. Examines what it means to be truly mindful.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "28099",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Reicherter, D.",
                                "sunet": "darynr"
                            },
                            {
                                "name": "Joshi, S.",
                                "sunet": "svjoshi"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216969",
        "number": "LIFE 60N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "81",
        "title": "Claiming Your Stanford Experience: Encountering People, Ideas, and Places (WELLNESS 81)",
        "description": "Engage your Stanford experience at a deeper, more authentic level through conversations with luminary Stanford faculty and experiential, creative immersions into signature Stanford places and spaces. Using a weekly fireside chat format with a cross-section of Stanford thought leaders, probe their ideas, scholarship, and research, ranging in scope from the humanities and arts to the social sciences, natural sciences, and engineering. Explore how their disciplinary points-of-view inform ways of seeing, understanding, and making sense of the world. Additionally, encounter an array of Stanford spaces (Frost amphitheater, the Farm, Hoover Tower, Windhover, and so on) through experiential modalities where a sense of place comes alive in new and surprising ways. Utilize photo documentation, poetry making, and other arts practices alongside generative contemplation, psycho-geography, and phenomenological encounters to broaden and deepen your lived experience of the Stanford world, your personal and scholarly place in it, and how you might construct your life beyond Stanford.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30456",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223897",
        "number": "LIFE 81",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "91CL",
        "title": "Self & Science (PWR 91CL)",
        "description": "&quot;Self &amp; Science&quot; mines the intersection of memoir and science writing. In this advanced experimental writing course, students will read a selection of essays by writers including Lewis Thomas, Oliver Sacks, Annie Dillard, and Mark Doty, which illustrate the shared intellectual foundation in observation of scientific and poetic inquiry. Building on these readings, students will be challenged to produce an experimental essay that transgresses genre boundaries in the service of considering how personal reflection can narrate researched discoveries. Over the course of the quarter, students are invited to bolster their overall communication acumen, enhance their ability to share valuable discoveries beyond the confines of their major discipline, and practice the difficult bliss of engaging a discerning public audience. Click here for course video and full description: https://undergrad.stanford.edu/programs/pwr/courses/advanced-courses/self-science",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "215937",
        "number": "LIFE 91CL",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "99",
        "title": "Kinesthetic Delight: Movement and Meditation (TAPS 99, WELLNESS 99)",
        "description": "The words meditation and mindfulness often conjure images of people sitting quietly in peaceful contemplation. However, as contemplatives and scholars from various fields have argued, though the brain resides in the cranium, the mind functions throughout the body. Students in this class will playfully explore embodied and dynamic forms of meditation and mindfulness through movement in an effort to integrate the mind and body. Examples of modalities include Lisa Nelson's Tuning Scores, Barbara Dilley's Contemplative Dance Practices, and other movement practices including qigong, laughter yoga, and psychogeography. Students will work in teams to develop their own movement-meditation scores inspired by these practices.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "224758",
        "number": "LIFE 99",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "101",
        "title": "Tools for a Meaningful Life",
        "description": "Explores the foundational skills for a meaningful life. Features lectures and experiential practice workshops from instructors within and beyond the university. Draws on research and practices from fields related to psychology, literature, critical studies in race, gender, and sexuality, the visual and performing arts, as well as wisdom traditions from around the world. Focuses on developing human capacities necessary for a meaningful life, including presence, courage, compassion, resilience, imagination, and  gratitude. Examples of workshops and in-class activities include theater improv, movement, laughter yoga, meditation, and qigong.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "This class has a $35 course fee.",
                "classId": "30004",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "This class has a $35 course fee.",
                "classId": "29737",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29557",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Lathrop 299",
                        "instructors": [
                            {
                                "name": "Friedlaender, D.",
                                "sunet": "dianef"
                            },
                            {
                                "name": "Otalvaro, G.",
                                "sunet": "gigio"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "220022",
        "number": "LIFE 101",
        "units": [
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "102",
        "title": "Body Mapping: Embracing the Embodied Experiences of Your Life",
        "description": "Utilize an anthropological lens to combine traditional analytic research with experiential contemplative practice to strengthen awareness of the body and embodied experiences. Explore cultural norms around the body as influenced by racial stereotypes, gender hierarchies, and political/economic/religious history. Investigate and express one's own body narrative through written, verbal, and creative methodologies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "221046",
        "number": "LIFE 102",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "102A",
        "title": "Body Mapping: Tracing the Embodied Experiences of Your Life (WELLNESS 102A)",
        "description": "Body Maps in various forms have been used for thousands of years by people searching for a better understanding of their bodies and their place in the world. This weekend intensive combines self-reflection, artistic expression, and an anthropological lens in order to help you develop a visual ethnographic 'map' of your life. In its basic form, Body Mapping involves drawing one's body outline onto a large paper or canvas and then working with paint, charcoal, markers, pictures, symbols, and words to visually chart the texture, terrain and topography of our embodied experiences. Body Mapping is a pathway to both understanding and sharing our lived stories.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224975",
        "number": "LIFE 102A",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "104",
        "title": "Tools for Meaningful Communities (ANTHRO 104, LEAD 104)",
        "description": "How can we live together and honor both difference and belonging? How do we create community amidst divisiveness and the existential threats of climate change, oppression of marginalized peoples, and our disconnection from ourselves and each other? We are inherently relational and have the potential to heal, flourish, and lead. Leadership and changemaking must be rooted in a commitment to deep inner work that cultivates wellbeing, insight, and wisdom. Inner work radiates outward to shape the systems that create and sustain our societies. In this class, grounded in your experiences at Stanford, you will cultivate skills and tools to enhance your intrapersonal, interpersonal and extrapersonal capacities to enact change for yourself and others. Working in teams, you will learn about and practice building community through the application of interdisciplinary frameworks that provide multiple perspectives on the transformation of the self, our relations with each other, our communities, and societal systems.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-CE",
            "WAY-EDP"
        ],
        "objectID": "223873",
        "number": "LIFE 104",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "105",
        "title": "Meeting the Moment: Inner Resources for Hard Times (WELLNESS 105)",
        "description": "In the face of social, economic, environmental, and public health upheavals, many of us are experiencing an unprecedented degree of uncertainty, isolation, and stress affecting academic and day-to-day life. Challenging times ask us, in a voice louder than usual, to identify sources of strength and develop practices that sustain and even liberate. In this experiential, project-oriented class: Explore practices to find true ground and enact positive change for self and community; Cultivate natural capacities of presence, courage, and compassion; Develop resources to share with one another and the entire Stanford community.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "26596",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "26131",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": "Thornton 110",
                        "instructors": [
                            {
                                "name": "Willihnganz, J.",
                                "sunet": "jonahw"
                            },
                            {
                                "name": "Floro, M.",
                                "sunet": "mfloro"
                            },
                            {
                                "name": "Preuninger, C.",
                                "sunet": "cpreunin"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "27409",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Willihnganz, J.",
                                "sunet": "jonahw"
                            },
                            {
                                "name": "Preuninger, C.",
                                "sunet": "cpreunin"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "222956",
        "number": "LIFE 105",
        "units": [
            1,
            2
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "120",
        "title": "Yoga Psychology for Resilience and Creativity (PSYC 120, TAPS 102L)",
        "description": "In this integrative class, learn about the practice, psychology, and philosophy of yoga as a conceptual model for well-being. Supported by findings in modern neuroscience and psychological research, yoga is an ancient, holistic modality that integrates body, mind, and community through ethical awareness, movement, breathing, and meditation. This integration lends itself to embodied, creative expression as wellas other healing modalities you will explore, such as theater and performance, dance, qigong, and laughter yoga. Yoga philosophy and postures are drawn from Dr. Christiane Brem's protocol developed as a therapeutic yoga class. The weekly performance exercises we will practice were developed by theater makers such as Augusto Boal and the UK-based performance duo Curious.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "223872",
        "number": "LIFE 120",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "124",
        "title": "Counterstory in Literature and Education (CSRE 141E, EDUC 141, EDUC 341)",
        "description": "Counterstory is a method developed in critical legal studies that emerges out of the broad &quot;narrative turn&quot; in the humanities and social science. This course explores the value of this turn, especially for marginalized communities, and the use of counterstory as analysis, critique, and self-expression. Using an interdisciplinary approach, we examine counterstory as it has developed in critical theory, critical pedagogy, and critical race theory literatures, and explore it as a framework for liberation, cultural work, and spiritual exploration.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29867",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE",
            "WAY-EDP"
        ],
        "objectID": "218109",
        "number": "LIFE 124",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "125",
        "title": "The Stillness of the Dunes",
        "description": "An advanced writing course in nonfiction craft, drawing, and contemplative practice. a significant portion of each class meeting will focus on the development and sharpening of writing craft, especially of the essay, in a hybrid form both scholarly and personal. We will also explore writing as meditative practice, through examples and through short exercises. We will deepen our cultural understanding of the desert and its impact, through art, literature, philosophy, film, and contemplative practice, and the course will build toward a four-day camping trip to the dunes of Death Valley, six weeks into the quarter.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "216528",
        "number": "LIFE 125",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "144",
        "title": "Transforming Self and Systems: Crossing Borders of Race, Nation, Gender, Sexuality, and Class (ASNAMST 144, CSRE 144, FEMGEN 144X)",
        "description": "Exploration of crossing borders within ourselves, and between us and them, based on a belief that understanding the self leads to understanding others. How personal identity struggles have meaning beyond the individual, how self healing can lead to community healing, how the personal is political, and how artistic self expression based in self understanding can address social issues. The tensions of victimization and agency, contemplation and action, humanities and science, embracing knowledge that comes from the heart as well as the mind. Studies are founded in synergistic consciousness as movement toward meaning, balance, connectedness, and wholeness. Engaging these questions through group process, journaling, reading, drama, creative writing, and storytelling. Study is academic and self-reflective, with an emphasis on developing and presenting creative works in various media that express identity development across borders.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29602",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE",
            "WAY-EDP"
        ],
        "objectID": "212500",
        "number": "LIFE 144",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "150G",
        "title": "Performing Race, Gender, and Sexuality (ARTSINST 150G, CSRE 150G, CSRE 350G, FEMGEN 150G, TAPS 150G)",
        "description": "In this theory and practice-based course, students will examine performances by and scholarly texts about artists who critically and mindfully engage race, gender, and sexuality. Students will cultivate their skills as artist-scholars through written assignments and the creation of performances in response to the assigned material. Attendance and written reflection about a live performance event on campus are required. Students will also learn various meditation practices as tools for making and critiquing performance, in both our seminar discussions and performance workshops. We will approach mindfulness as method and theory in our own practice, as well as in relation to the works studied. We will also consider the ethics and current debates concerning the mindfulness industry. Examples of artists studied include James Luna, Nao Bustamante, Renee Cox, William Pope.L, Cassils, boychild, Curious, Adrian Piper, Xandra Ibarra, Val&eacute;rie Reding, Guillermo Gomez-Pe&ntilde;a, and Ana Mendieta.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-CE",
            "WAY-EDP"
        ],
        "objectID": "219536",
        "number": "LIFE 150G",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "151",
        "title": "Feminist Life-Writing (FEMGEN 151)",
        "description": "This course explores life-writing as a form of feminist praxis. Feminist life-writing is an art form grounded in truth-telling, activism, and self-making that emerges from the long tradition of women writing private lives. Beginning with the politicized practices of second wave feminists up through contemporary trends in memoir and autofiction, we will confront an array of intersectional autobiographies that connect personal experience to broader movements, power structures, and oppressions. How has life-writing contributed to the articulation of feminist consciousness? How has feminism impacted the methods marginalized authors use to create forms for belonging and self-determination? As we think about the politics of life-writing, we will also consider feminist rhetorical and aesthetic strategies for confronting issues like trauma, disability, incarceration, motherhood, and friendship. Each student will conduct a large-scale research project focused on an author, genre, or theme of their choice. As we research the critical historical contexts for feminist memoir, we will simultaneously conduct our own creative experiments in life-writing.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "222699",
        "number": "LIFE 151",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "161P",
        "title": "Dance and the Politics of Movement (DANCE 161P, TAPS 161P, TAPS 361P)",
        "description": "This course examines how the dancing body has been viewed, exhibited, analyzed, and interpreted from the late nineteenth century to the present. We will discuss how ideologies about race, gender, and sexual orientation are mapped onto the body, as well as investigate the body's place in discourses on religion, health, war, performance, and consumer culture. We will explore how people create meaning through dance and how dance, in turn, shapes social norms, political institutions, and cultural practices. The course's structure challenges the Western/non-Western binary by comparing dance forms across the globe.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221862",
        "number": "LIFE 161P",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "170",
        "title": "Laughter & Play for Wellbeing (TAPS 170W, WELLNESS 170)",
        "description": "Learn about and practice laughter yoga, combined with theater exercises. Laughter yoga (distinct from traditional movement-based yoga) is a modality that integrates laughter exercises with yogic breathing. Explore the growing field of research on laughter yoga and its positive effects on wellbeing and other health outcomes. Examine the various dimensions of laughter yoga as a form of cardiovascular and aerobic exercise, mindfulness, and play. Use theater exercises to leverage the power of performative, healing laughter and to cultivate embodied awareness, creativity, resilience, and joy. Readings and exercises will draw from the work of pioneers in the fields of laughter wellness and socially engaged theater, such as Madan Kataria and Augusto Boal.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "29994",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "222194",
        "number": "LIFE 170",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "174S",
        "title": "When Half is Whole: Developing Synergistic Identities and Mestiza Consciousness (ASNAMST 174S, CSRE 174S)",
        "description": "This is an exploration of the ways in which individuals construct whole selves in societies that fragment, label, and bind us in categories and boxes. We examine identities that overcome the destructive dichotomies of us and them, crossing borders of race, ethnicity, culture, nation, sex, and gender. Our focus is on the development of hybrid and synergistic forms of identity and mestiza consciousness in which the whole is greater than the sum of its parts.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29358",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "213763",
        "number": "LIFE 174S",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "180",
        "title": "Art, Meditation, and Creation (ARTHIST 180, ARTSINST 280)",
        "description": "Art and meditation invite us to be fully present in our minds and bodies. This class will give you tools to integrate mind and body as you explore artworks on display at the university's museums and throughout campus. In your engagement with activity-based learning at these venues, you will attend to perception and embodiment in the process of writing and making creative work about art. You will also learn meditation techniques and be exposed to authors who foreground the importance of the body in both writing and making art. For your meditation-centered and research-based final creative project, you will have the option of writing an experimental visual analysis or devising a performance.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "223361",
        "number": "LIFE 180",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "182",
        "title": "Holistic College Student Development: Theory and Practices (EDUC 182, EDUC 382)",
        "description": "In this course we examine, explore, and develop practices supporting holistic college student development. We will examine classic cognitive theories of intellectual and ethical development (Perry, Baxter-Magolda), moral development and reasoning (Kohlberg, Gilligan), psychosocial development (Chickering and Reisser), and racial, ethnic, and religious identity development. We will also explore the development of capacities and qualities that are of growing contemporary interest including presence/mindfulness, authenticity/courage, compassion/empathy, and forgiveness/gratitude. We will also consider models of leadership that flow from holistic development. Lastly, we will introduce practices for the continued development of these cognitive, affective, and spiritual capacities. This course is appropriate for those interested in student/human development, student affairs, and leadership.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31545",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "160-127",
                        "instructors": [
                            {
                                "name": "Antonio, A.",
                                "sunet": "aantonio"
                            },
                            {
                                "name": "Willihnganz, J.",
                                "sunet": "jonahw"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "102096",
        "number": "LIFE 182",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "185",
        "title": "Heartfulness: Mindfulness, Compassion, and Responsibility (CSRE 47)",
        "description": "We practice mindfulness as a way of enhancing well-being, interacting compassionately with others, and engaging in socially responsible actions as global citizens. Contemplation is integrated with social justice through embodied practice, experiential learning, and creative expression. Class activities and assignments include journaling, mindfulness practices, and expressive arts. We build a sense of community through appreciative intelligence, connected knowing, deep listening and storytelling.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Introductory Seminar. Preference to sophomores; first-year students admitted if space available. Advance sign-up process and deadlines at http://introsems.stanford.edu.",
                "classId": "27764",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Murphy-Shigematsu, S.",
                                "sunet": "smshige"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "218214",
        "number": "LIFE 185",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "198",
        "title": "Directed Reading and Individual Studies - LifeWorks",
        "description": "Translate theoretical knowledge and acquired skills into actionable projects or initiatives that make positive impact within and/or beyond the Stanford community. Students work in collaborative groups or individually under the mentorship of the course instructor(s) to design, deliver, and evaluate an initiative or project.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30081",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29842",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": "This course needs instructor permission. Students need to contact the instructor to set-up an individual studies project, schedule, and obtain a permission code.",
                "classId": "25042",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Otalvaro, G.",
                                "sunet": "gigio"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": "This course needs instructor permission. Students need to contact the instructor to set-up an individual studies project, schedule, and obtain a permission code.",
                "classId": "28098",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Otalvaro, G.",
                                "sunet": "gigio"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "27240",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Otalvaro, G.",
                                "sunet": "gigio"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220935",
        "number": "LIFE 198",
        "units": [
            1,
            2
        ],
        "totalSections": 5
    },
    {
        "year": "2023-2024",
        "subject": "LIFE",
        "code": "199",
        "title": "Selected Topics: LifeWorks",
        "description": "Exploration of a topic (to be determined) not covered by the standard curriculum but of interest to faculty/instructor(s) and students in a particular quarter. May be repeated with change of content. For more information regarding specific course titles and topics, please refer to the notes of each course section.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "DCI students will be directly added to the Canvas page for this course.",
                "classId": "26624",
                "currentClassSize": "0",
                "maxClassSize": "0",
                "schedules": [
                    {
                        "startTime": "8:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Todhunter, A.",
                                "sunet": "todhuntr"
                            }
                        ],
                        "startTimestamp": 30600.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "THIS CLASS IS FOR DCI FELLOWS ONLY as part of the Second Adventure course series. Becca Taylor in the DCI office is the point person for providing course add codes. Class takes place on two Saturdays, April 15 and 29, from 10a-6p at the O'Donahoe Family Farm.",
                "classId": "26390",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sol, K.",
                                "sunet": "kwiatt"
                            },
                            {
                                "name": "Meyer Tapia, S.",
                                "sunet": "skmeyer1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220934",
        "number": "LIFE 199",
        "units": [
            1,
            2
        ],
        "totalSections": 2
    }
]