[
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "5A",
        "title": "Muwekma House Seminar",
        "description": null,
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Meet at Muwekma House.",
                "classId": "14017",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Stone, P.",
                                "sunet": "ptstone"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 69600.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220704",
        "number": "NATIVEAM 5A",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "5B",
        "title": "Muwekma House Seminar",
        "description": "Second Quarter of Muwekma House Seminar.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13042",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Stone, P.",
                                "sunet": "ptstone"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 69600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220705",
        "number": "NATIVEAM 5B",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "12",
        "title": "Muwekma Native Plants Garden Field  Lab",
        "description": "This course will allow students interested in working with the Muwekma Ohlone Tribe to  engage in Community Based Participatory Research (CBPR) through (CEL) Community Engaged  Learning. This CARDINAL COURSE  draws from the knowledge and support provided by The  HAAS Center. Previous Muwekma collaborations and ongoing projects  are found here on the HAAS Center Website: (https://stanford.maps.arcgis.com/apps/dashboards/820e700616fe472fa2ca5d5c7df58580).  Students will be designing, tending and maintaining a native plants garden in the area surrounding the dish. Students will learn about the local environmental history of the Bay Area, the biotic community and plants used by California native people in the by designing a demonstration and educational garden at our worksite. The course will emphasize protocols and specific methods in Indigenous spaces. Cultural heritage and archaeological surveys and mapping may be a a part of this course, depending upon the needs of the Muwekma community. Other projects may include educational projects for k-12 students, in as well as field trips to archaeological sites in ancestral spaces within the territory of Muwekma Ohlone. Other projects to be determined by local tribal members. The Course will emphasize protocols and specific methods of collaboration with Native communities and in Indigenous spacesAttendance Policy: Attendance at all class meetings is required. This course meets weekly.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "225059",
        "number": "NATIVEAM 12",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "14",
        "title": "Indigenous Peoples in Film and Visual Media: Reframing Narratives of Race, Gender and Personhood",
        "description": "This class explores the multiple valences of Indigenous Peoples within the genre of visual media and film with articular attention to race and gender as reflective and reflexive categories. Using the lenses of, anthropology,  postcolonial, Indigenous and Gender Studies this course will  examine the ways in which the imagery of indigenous peoples has been woven into Western narratives, appropriated as projections of Western masculinity and in more recent years reclaimed by indigenous filmmakers and documentarians. The format of the class will involve  a &quot;flipped classroom&quot; pedagogy, weekly screenings and  closely supervised student presentations on topics related to the course. Weekly screenings of films, lectures and discussions will require mandatory attendance at every class meeting and within working groups. Students will develop skills to identify visual media referents, related to contemporary and digital contexts while gaining appreciation for indigenous identity history and sovereignty weekly reflection papers are required. No previous film studies experience is necessary.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222024",
        "number": "NATIVEAM 14",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "16",
        "title": "Native Americans in the 21st Century: Encounters, Identity, and Sovereignty in Contemporary America (ANTHRO 16, ARCHLGY 16)",
        "description": "What does it mean to be a Native American in the 21st century? Beyond traditional portrayals of military conquests, cultural collapse, and assimilation, the relationships between Native Americans and American society. Focus is on three themes leading to in-class moot court trials: colonial encounters and colonizing discourses; frontiers and boundaries; and sovereignty of self and nation. Topics include gender in native communities, American Indian law, readings by native authors, and Indians in film and popular culture.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-AmerCul"
        ],
        "objectID": "201175",
        "number": "NATIVEAM 16",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "17",
        "title": "Indigenous Peacemaking: A Framework for Learning and Practice at Stanford",
        "description": "The course explores Indigenous Peacemaking as a framework to promote understanding, conflict resolution, and change on campus, and outside of the academy in tribal and other courts. Content will address issues of cultural appropriation and knowledge, and will include Peacemaking as a way of personal and community health and Indigenous future building.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223812",
        "number": "NATIVEAM 17",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "32SI",
        "title": "Sustainable Design and Practice in Native American Architecture (ARTSTUDI 32XSI, CEE 32XSI)",
        "description": "This lecture series highlights and celebrates Native American design practices, both in architectural design and in materials use. As practicing Indigenous architects and designers, the guest speakers aim to share how Indigineity and Nativeness influence the built environment. Equally important is the future, what is the place and responsibility of Native design as we combat climate change and as Native tribes fight to preserve land and heritage?",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224794",
        "number": "NATIVEAM 32SI",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "39",
        "title": "Long Live Our 4Bil. Year Old Mother: Black Feminist Praxis, Indigenous Resistance, Queer Possibility (AFRICAAM 39, CSRE 39, FEMGEN 39)",
        "description": "How can art facilitate a culture that values women, mothers, transfolks, caregivers, girls? How can black, indigenous, and people of color frameworks help us reckon with oppressive systems that threaten safety and survival for marginalized people and the lands that sustain us? How can these questions reveal the brilliant and inventive forms of survival that precede and transcend harmful systems toward a world of possibility? Each week, this course will call on artists, scholars, and organizers of color who clarify the urgency and interconnection of issues from patriarchal violence to environmental degradation; criminalization to legacies of settler colonialism. These same thinkers will also speak to the imaginative, everyday knowledge and creative healing practices that our forebears have used for millennia to give vision and rise to true transformation.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "221249",
        "number": "NATIVEAM 39",
        "units": [
            1,
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "57A",
        "title": "Cherokee Language Lab",
        "description": "This course is intended for students who have already completed First Year Cherokee and would like to continue their exposure, learning, and understanding of the language.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "221037",
        "number": "NATIVEAM 57A",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "100",
        "title": "Decolonizing Methodologies: Introduction to Native American Studies (AMSTUD 100A)",
        "description": "This course provides students with an introductory grasp on major concepts, theoretical highlights, and important figures in Native American and Indigenous Studies, also known as American Indian Studies or First Nations Studies. The discipline emerged in the United States during the late 1960s when Native student-activists demanded the inclusion of their histories alongside the dominant white settler narratives in universities&iquest; educational catalog. By examining historical and legal documents, storytelling accounts, images, films, and literary works, students will explore a diverse range of themes and perspectives, gaining an understanding of Native American cultures, histories, and contemporary lifeworlds. The course emphasizes materials from relevant sources produced by and about Natives to foster critical thinking and analysis. It also aims to cultivate an appreciation for the richness and complexity of Native American experiences while introducing major concepts, theoretical highlights, and important figures in the field of Native American Studies. Throughout the course, students will explore the global development of the discipline from a pan-Indian perspective, discussing keywords, histories, politics, disciplinary concerns, and the recent &quot;decolonial turn&quot; within academia. By the end of the course, students will have an introductory understanding of key disciplinary jargon, methodological research, and constitutive issues in Native American Studies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30911",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Hewlett Teaching Center 103",
                        "instructors": [
                            {
                                "name": "Stone, P.",
                                "sunet": "ptstone"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223096",
        "number": "NATIVEAM 100",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "103S",
        "title": "Indigenous Feminisms (AMSTUD 103, CSRE 103S, FEMGEN 103S)",
        "description": "Seminar examines Indigenous Feminisms and the impact of colonialism on gender roles &amp; gender relations beginning with the 17th century to the present. Topics include demographic changes; social, political &amp; economic transformations associated with biological &amp; spiritual assaults; the dynamism &amp; diversity of Indigenous societies. Sources include history, ethnography, biography, autobiography, the novel &amp; film.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32374",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Stone, P.",
                                "sunet": "ptstone"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:EC-Gender",
            "WAY-EDP"
        ],
        "objectID": "204395",
        "number": "NATIVEAM 103S",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "109A",
        "title": "Federal Indian Law (CSRE 109A)",
        "description": "Cases, legislation, comparative justice models, and historical and cultural material. The interlocking relationships of tribal, federal, and state governments. Emphasis is on economic development, religious freedom, and environmental justice issues in Indian country.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31050",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": "Lathrop 296",
                        "instructors": [
                            {
                                "name": "Bill, J.",
                                "sunet": "bill2110"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "202472",
        "number": "NATIVEAM 109A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "111B",
        "title": "Muwekma: Landscape Archaeology and the Narratives of California Natives (ANTHRO 111C, ARCHLGY 111B)",
        "description": "This course explores the unique history of San Francisco Bay Area tribes with particular attention to Muwekma Ohlone- the descendent community associated with the landscape surrounding and including Stanford University. The story of Muwekma provides a window into the history of California Indians from prehistory to Spanish exploration and colonization, the role of Missionaries and the controversial legacy of Junipero Serra, Indigenous rebellions throughout California, citizenship and land title during the 19th century, the historical role of anthropology and archaeology in shaping policy and recognition of Muwekma, and the fight for acknowledgement of Muwekma as a federally recognized tribe. We will visit local sites associated with this history and participate in field surveys of the landscape of Muwekma.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216476",
        "number": "NATIVEAM 111B",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "112",
        "title": "Muwekma Community Engaged Learning, Cultural Heritage and Native Plants Garden Field Project (ARCHLGY 112A)",
        "description": "This course will allow students interested in working with the Muwekma Ohlone Tribe to engaged in community based participatory research. More specifically students will be creating tending and maintaining a native plants garden in the area surrounding the dish. Students will be required to learn about the biotic community and plants used by California native people in a demonstration and educational garden. Course discussions include food sovereignty in indigenous communities, tribal land trusts,  and working with indigenous and native communities as a form of field based learning, and service learning. Course will emphasize protocols and specific methods  in Indigenous spaces. Cultural heritage and archaeological surveys and mapping may be a a part of this course, depending upon the needs of the Muwekma community. Workdays will be scheduled  Saturdays from 10:00 to 12:30 pm. Other projects may include educational projects for k-12 students, in as well as field trips to archaeological sites in ancestral spaces within the territory of Muwekma Ohlone. Other projects to be determined by local tribal members.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30915",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "160-129",
                        "instructors": [
                            {
                                "name": "Wilcox, M.",
                                "sunet": "mwilcox"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224651",
        "number": "NATIVEAM 112",
        "units": [
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "114",
        "title": "Comparative History of Racial & Ethnic Groups in California (CSRE 114R, HISTORY 250B)",
        "description": "Comparative focus on the demographic, political, social and economic histories of American Indians &amp; Alaska Natives, African Americans, Chinese Americans and Japanese Americans during late 18th and early 20th century California.  Topics: relationships with Spanish, Mexican, U.S. Federal, State and local governments; intragroup and intergroup relationships; and differences such as religion, class and gender.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30908",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": "Gates100",
                        "instructors": [
                            {
                                "name": "Anderson, J.",
                                "sunet": "shivelyj"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224599",
        "number": "NATIVEAM 114",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "115",
        "title": "Introduction to Native American History (AMSTUD 115A)",
        "description": "This course incorporates a Native American perspective in the assigned readings and is an introduction to Native American History from contact with Europeans to the present.  History, from a Western perspective, is secular and objectively evaluative whereas for most Indigenous peoples, history is a moral endeavor (Walker, Lakota Society 113).  A focus in the course is the civil rights era in American history when Native American protest movements were active.  Colonization and decolonization, as they historically occurred are an emphasis throughout the course using texts written from the perspective of the colonized at the end of the 20th century in addition to the main text.  Students will be encouraged to critically explore issues of interest through two short papers and one longer paper that is summarized in a 15-20 minute presentation on a topic of interest relating to the course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32747",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Red Shirt, D.",
                                "sunet": "redshirt"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:EC-AmerCul",
            "WAY-EDP"
        ],
        "objectID": "214824",
        "number": "NATIVEAM 115",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "116",
        "title": "Decolonizing the Indigenous Classroom (CSRE 116, CSRE 302, EDUC 186, EDUC 286)",
        "description": "Using Indigenous and decolonizing perspectives on education, this interdisciplinary course will examine interaction and language in cross-cultural educational situations, including language, literacy and interethnic communication as they relate to Indigenous American classrooms. Special attention will be paid to implications of social, cultural and linguistic diversity for educational practice, along with various strategies for bridging intercultural differences between schools and Native communities.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-SocSci"
        ],
        "objectID": "201188",
        "number": "NATIVEAM 116",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "117",
        "title": "Indigenous Archaeology",
        "description": "This course will explore the basic concepts of indigenous archaeology. Indigenous archaeology represents an intervention in the field of heritage studies and cultural resource management within the profession of archaeology. We will discuss the theoretical motivations for the creation of the sub discipline,  which seeks to realize a more ethical engagement with Indigenous communities by conducting research &quot;with, for, and by&quot; Indigenous descendant communities. Reviews key theoretical frameworks (e.g., traditional knowledge systems, collaboration, repatriation) and explores the ways this approach is being put into action using the Muwekma Ohlone Tribe as our key partner. The course requires attendance at 3 field trips held on Saturdays to be announced.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30956",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Hum Rgts / Int'l Rel Conf Room",
                        "instructors": [
                            {
                                "name": "Wilcox, M.",
                                "sunet": "mwilcox"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225562",
        "number": "NATIVEAM 117",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "117S",
        "title": "History of Native Americans in California (CSRE 117S, HISTORY 250A)",
        "description": "This course examines the political histories and cultural themes of Native Americans in California, 1700s1950s. Throughout the semester we will focus on: demographics, diversity of tribal cultures; regional environmental backgrounds; the Spanish Era and missionization; the Mexican Era and secularization; relations with the United States Government and the State of California, including the gold rush period, statehood, unratified treaties, origin of reservations/rancherias, and other federal policies, e.g., Allotment Act, Indian Reorganization Act and termination.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:EC-AmerCul",
            "WAY-EDP"
        ],
        "objectID": "207602",
        "number": "NATIVEAM 117S",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "118",
        "title": "Heritage, Environment, and Sovereignty in Hawaii (CSRE 118E, SUSTAIN 118)",
        "description": "This course explores the cultural, political economic, and environmental status of contemporary Hawaiians. What sorts of sustainable economic and environmental systems did Hawaiians use in prehistory? How was colonization of the Hawaiian Islands informed and shaped by American economic interests and the nascent imperialism of the early 20th century? How was sovereignty and Native Hawaiian identity been shaped by these forces? How has tourism and the leisure industry affected the natural environment? This course uses archaeological methods, ethnohistorical sources, and historical analysis in an exploration of contemporary Hawaiian social economic and political life. Restricted to students accepted into the Wrigley Field Program in Hawaii.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32376",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wilcox, M.",
                                "sunet": "mwilcox"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 69600.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "211098",
        "number": "NATIVEAM 118",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "119",
        "title": "Native American Creative Writing",
        "description": "This class will serve a twofold function. It will introduce students to a basic, aesthetic understanding of the short story form. This will involve weekly reading of masterful examples of the form, in-depth discussion of the stories and how they work, and workshop critiques of student work. Over the course of the quarter we will also consider the place of Native fiction within the larger tradition, and how it works, the ways it is the similar and the ways it might be different, and of course how different Native writers have dealt with the set of problems specific to them both as citizens of tribal nations and as artists who must consider and respond to the pressures and expectations typical to colonized peoples. By the close of the course students will have gained a foundational vocabulary and aesthetic perspective that will allow them to reflect on the short story form, and move forward as writer should they feel so inclined. Note: While this course will at times take a POV that allows for discussions particular to Native peoples, it is not an explicitly political course. This class will greatly benefit anyone who wants to begin their training in the discipline of fiction. Note: Students will not be allowed to join this class after the first week of the quarter",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32924",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225631",
        "number": "NATIVEAM 119",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "119S",
        "title": "The History of Native Americans of California (EDUC 119S, EDUC 429S)",
        "description": "How the federal government placed education at the center of its Indian policy in second half of 19th century, subjecting Native Americans to programs designed to erase native cultures and American Indian responses to those programs. Topics include traditional Indian education, role of religious groups, Meriam Report, Navajo-Hopi Rehabilitation Act, Johnson-O'Malley Act, and public schools.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "205719",
        "number": "NATIVEAM 119S",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "120",
        "title": "Is Pocahontas a Myth?  Native American Women in History (FEMGEN 120)",
        "description": "This course will look at notable Native American Women in Native American history  starting with Native American oral tradition narratives about important women in specific tribal narratives including origin narratives used in Native American tribal history.  Native American history is not required in any national curriculum and as a result,  Native American people(s) encounter many stereotypes and false beliefs about indigenous peoples of the United States.  This course will focus on the role of women in Native American history including historic narratives in oral tradition as maintained in specific Native American histories (as told from a Native American perspective).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13715",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "200-032",
                        "instructors": [
                            {
                                "name": "Red Shirt, D.",
                                "sunet": "redshirt"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222934",
        "number": "NATIVEAM 120",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "121",
        "title": "Discourse of the Colonized: Native American and Indigenous Voices (CSRE 121)",
        "description": "Using the assigned texts covering the protest movements in the 20th century to the texts written from the perspective of the colonized at the end of the 20th century, students will engage in discussions on decolonization.  Students will be encouraged to critically explore issues of interest through two short papers and a 15-20 minute presentation on the topic of interest relating to decolonization for Native Americans in one longer paper.  Approaching research from an Indigenous perspective will be encouraged throughout.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32650",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Red Shirt, D.",
                                "sunet": "redshirt"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:EC-AmerCul"
        ],
        "objectID": "214979",
        "number": "NATIVEAM 121",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "123",
        "title": "Food Sovereignty",
        "description": "Connections: Tribal Food Systems and Indigenous Food Sovereignty&iquest; will explore Indigenous food systems and implications on land, environment, community and Individual health of Indigenous peoples of North America, pre-contact to present, Indigenous responses to western colonial models of eating and living, challenges to Indigenous food sovereignty initiatives and implications for &iquest;present&iquest; understandings of food, food production, and relationships with collective resources such as water, land, and people.  Students will be exposed to Indigenous food sovereignty advocates, protectors, and thinkers, as well as, hands on activities along with practical grant writing skills.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224968",
        "number": "NATIVEAM 123",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "124",
        "title": "Pueblo Revolt",
        "description": "The pueblo revolt of 1680 is recognized as the most successful indigenous rebellion in the New World. The revolt demonstrates a powerful counter narrative to the official histories of colonial America. In this course, we discuss and interrogate the four pillars of settler colonial &quot;terminal narratives&quot;- disease and demographic collapse, military conquest, missionization and acculturation. We will explore the philosophical and legal justifications for Spanish colonization, the use of and impact of colonial violence against Native Peoples and the ways in which the collective experience of colonial violence helped motivate a powerful social movement among Native Peoples. We discuss the historiography of the southwest, the role of anthropology and archaeology in perpetuating the mythology of conquest and the formation of collective identity and community in New Mexico using primary historical texts and archaeological evidence",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32748",
                "currentClassSize": "0",
                "maxClassSize": "35",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wilcox, M.",
                                "sunet": "mwilcox"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225626",
        "number": "NATIVEAM 124",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "126",
        "title": "Mo'olelo Aloha Aina: Hawaiian Perspectives on Storytelling, Land, and Sovereignty",
        "description": "This course will introduce a wide variety of topics pertaining to the culture and history of the Hawaiian Islands and the aboriginal people of Hawai&iquest;i (k&iquest;naka maoli). Topics will range from Hawaiian perspectives on genealogies, Hawaiian conceptions of land governance, brief overview of Hawaiian Kingdom history, case studies of modern Hawaiian activism, and more. Students will be introduced to surface-level coverage of included topics through a variety of readings and interactive assignments.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222267",
        "number": "NATIVEAM 126",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "132",
        "title": "Decolonizing the American Indigenous Classroom",
        "description": "Using Indigenous and decolonizing perspectives on education, this interdisciplinary course will examine interaction and language in cross-cultural educational situations, including language, literacy and interethnic communication as they relate to Indigenous American classrooms. Special attention will be paid to implications of social, cultural and linguistic diversity for educational practice, along with various strategies for bridging intercultural differences between schools and Native communities.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222033",
        "number": "NATIVEAM 132",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "161",
        "title": "Entrepreneurship for Social and Racial Equity (CSRE 161P)",
        "description": "This course is designed for students of all backgrounds and provides an introduction to business ownership and an entrepreneurial mindset with a focus on operating businesses with racial equity as a core principle and/or within diverse communities with an aim to create social impact for future generations as well as profitability and sustainability models. The course will introduce the beginning elements of creating a business concept (formation, product, business strategy) as well as the additional overlay of social impact and cultural considerations. Types of financing as well as effective pitching will also be covered. Course materials will include instructor presentations, case studies, homework assignments, creation of students own business concept plan and guest interviews with successful professionals working within social impact and diverse communities.  Business considerations related to culture, finance, policy and advocacy will also be covered.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221017",
        "number": "NATIVEAM 161",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "162",
        "title": "Tribal Economic Development and Sustainability (EARTHSYS 163)",
        "description": "Native Americans, Alaska Natives, Inuit and First Nations in Canada have experienced a revolution in economic development over the last 30 years. The course will examine different aspects of Indigenous economic development with a focus on case studies and discussions with practitioners",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222136",
        "number": "NATIVEAM 162",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "200R",
        "title": "Directed Research",
        "description": null,
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29135",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10386",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Snipp, C.",
                                "sunet": "snipp"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10387",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "LaFromboise, T.",
                                "sunet": "lafrom"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11182",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wilcox, M.",
                                "sunet": "mwilcox"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "200907",
        "number": "NATIVEAM 200R",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 4
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "200W",
        "title": "Directed Reading",
        "description": null,
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29136",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "9486",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Biestman, K.",
                                "sunet": "biestman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "9487",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "LaFromboise, T.",
                                "sunet": "lafrom"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "9488",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Snipp, C.",
                                "sunet": "snipp"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11070",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Red Shirt, D.",
                                "sunet": "redshirt"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "11071",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wilcox, M.",
                                "sunet": "mwilcox"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "12091",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jessiman, S.",
                                "sunet": "sjdenant"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "200908",
        "number": "NATIVEAM 200W",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 7
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "221",
        "title": "Crafting Challenging Conversations in a Conflicted World (CSRE 221D)",
        "description": "In moments of divisive, time-sensitive conflict and disagreement, interdependent community groups that are we-us oriented often struggle to maintain cohesive relationships. In this interactive, project-based course, participants will dive into the art of designing new products, services, or experiences for conflict. Throughout the course, participants can expect to unpack the fundamentals of design thinking and components of strong listening, leadership, and effective cultural competency. Individual one-on-one conversations as well as indigenous forms of group-interviewing, known as Peacemaking and Ho'oponopono, will be also explored. At the end of the course, students can expect to have created a low-resolution prototype based on qualitative research that answers the question: How might we lead with community-centered approaches, rather than with independent, divisive reactions in moments of conflict?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29997",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219946",
        "number": "NATIVEAM 221",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "NATIVEAM",
        "code": "240",
        "title": "Psychology and American Indian/Alaska Native Mental Health (EDUC 340, PSYCH 272)",
        "description": "Western medicine's definition of health as the absence of sickness, disease, or pathology; Native American cultures' definition of health as the beauty of physical, spiritual, emotional, and social things, and sickness as something out of balance. Topics include: historical trauma; spirituality and healing; cultural identity; values and acculturation; and individual, school, and community-based interventions. Prerequisite: experience working with American Indian communities.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "101996",
        "number": "NATIVEAM 240",
        "units": [
            3,
            4,
            5
        ]
    }
]