[
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "3",
        "title": "Frontiers in Ocean Science (BIO 3)",
        "description": "An introduction to contemporary research in ocean sciences, including oceanography, ecology, evolution, developmental biology, conservation, animal  behavior, physiology, and sociological aspects. Emphasis is on new discoveries and the technologies used to make them. Weekly lectures and panel discussions by faculty from Oceans, Biology, and other departments.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16149",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "2:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "STLC 114",
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 52200.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "202580",
        "number": "OCEANS 3",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "3N",
        "title": "Views of a Changing Sea: Literature & Science",
        "description": "The state of a changing world ocean, particularly in the eastern Pacific, will be examined through historical and contemporary fiction, non-fiction and scientific publications. Issues will include harvest and mariculture fisheries, land-sea interactions and oceanic climate change in both surface and deep waters.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "13707",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "2:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 52200.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci",
            "WAY-A-II"
        ],
        "objectID": "210979",
        "number": "OCEANS 3N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "6N",
        "title": "Ocean Conservation: Pathways to Solutions",
        "description": "(Formerly BIO 6N) We will learn how to design pathways to solutions by integrating social sciences and governance into our case studies. We will address both conventional (fisheries management, reducing the impacts of global shipping, marine protected areas) and emerging research and management approaches (marine spatial planning, dynamic ocean management, environmental DNA).  Oceans are facing long-term challenges, like overfishing and pollution that we know how to solve, and emerging challenges, like climate change and ocean plastics, for which solutions are more elusive. Ultimately to achieve long-term sustainability, solutions have to work for both people and the planet. These puzzles offer challenging complex systems problems that will require our best interdisciplinary thinking to solve.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "13339",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Crowder, L.",
                                "sunet": "lbcrowd"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 44400.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221505",
        "number": "OCEANS 6N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "10SC",
        "title": "Discover Monterey Bay through Oceanography",
        "description": "Monterey Bay supports an amazing diversity of marine life and important fisheries. There is much to explore here, from the near-shore rocky reefs and kelp forests to a submarine canyon that rivals the Grand Canyon in scope. A day on the Bay can reveal a fleet of purse-seine vessels searching for squid, sport fishermen seeking salmon and halibut, and humpback whales breaching and feeding on anchovies &iquest; all within a relatively small area. What are the oceanographic and biological processes that support these creatures and human endeavors? How do they vary in different parts of the Bay? How are these processes linked to the fog that controls the coastal climate and is critical to local agriculture?  We will address such questions through lectures, discussion, and field work using the restored Western Flyer - the ship John Steinbeck and Ed Ricketts took to the Gulf of California in 1940, resulting in publication of Sea of Cortez. You will collect oceanographic and biological data at sea using a variety of scientific instruments, including remotely operated video platforms, echosounder (sonar), water-column profiler, plankton-imaging microscopes, and aerial drones. And we will relate these data to the life of the Bay, moving all the way from wind to whales. We will also dive into Monterey Bay's rich cultural and literary history. This program will reveal a dynamic ocean from new viewpoints and will  build teamwork skills that are essential to working at sea. Our base of operation will be Hopkins Marine Station in Pacific Grove. We will make several relevant field trips on land. On seven days, we will use the Western Flyer as our classroom (these are all day trips - we will spend all nights on land). Four days of ship time will be devoted to studying spawning squid and feeding whales and carrying out an oceanographic transect across the Bay from kelp forest to canyon. Two additional days of ship time will be devoted to collecting data for team projects of your own design. Teams will present their projects at a symposium on the second last day. The last day of SoCo will feature a final morning of reflection on the Western Flyer before you return to Stanford.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "225085",
        "number": "OCEANS 10SC",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "12N",
        "title": "Sensory Ecology of Marine Animals (BIO 12N)",
        "description": "Animals living in the oceans experience a highly varied range of environmental stimuli.  An aquatic lifestyle requires an equally rich range of sensory adaptations, including some that are totally foreign to us.  In this course we will examine sensory system in marine animals from both an environmental and behavioral perspective and from the point of view of neuroscience and information systems engineering.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "27615",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "STLC 118",
                        "instructors": [
                            {
                                "name": "Thompson, S.",
                                "sunet": "stuartt"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "212507",
        "number": "OCEANS 12N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "14H",
        "title": "Bio-logging and Bio-telemetry",
        "description": "Bio-logging is a rapidly growing discipline that includes diverse fields such as consumer electronics, medicine, and marine biology. The use of animal-attached digital tags is a powerful approach to study the movement and ecology of individuals over a wide range of temporal and spatial scales. This course is an introduction to bio-logging methods and analysis. Using whales as a model system, students will learn how use multi-sensor tags to study behavioral biomechanics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "This course takes place at Hopkins Marine Station.",
                "classId": "30969",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "AGASSIZ 11 (Hopkins)",
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 42600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "217512",
        "number": "OCEANS 14H",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "47H",
        "title": "Introduction to Research in Ecology and Ecological Physiology",
        "description": "This course is a field-based inquiry into rocky intertidal shores at Hopkins Marine Station that introduces students to ecology and environmental physiology and the research methods used to study them. Students will learn how to detect patterns quantitatively in nature through appropriate sampling methods. Following exploration of appropriate background material in class and through exploration of the scientific literature, students will formulate testable hypotheses regarding the underlying causes of the patterns they discern. A variety of different aspects of ecology and physiology will be investigated cooperatively by the students during the quarter, culminating in development of an individual final paper in the form of a research proposal based on data collected during the course. The course will provide a broad conceptual introduction to the underlying biological principles that influence adaptation to dynamic habitats, as well as an inquiry-based experience in how to explore complex systems in nature. This course fulfills the same laboratory requirement as BIO 47. Satisfies WIM in Biology.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Course taught in person at Hopkins Marine Station. Lecture and discussion sections will occur from 9-12 and 1-2.",
                "classId": "13930",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci",
            "WAY-SMA"
        ],
        "objectID": "204021",
        "number": "OCEANS 47H",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "71",
        "title": "Planet Ocean (BIO 71, ESS 71)",
        "description": "Oceans make up the majority of our planet's area and living spaces and are fundamental to biodiversity, climate, food and commerce.This course covers integration of the oceanography and marine biology of diverse ocean habitats such as the deep sea, coral reefs, open ocean, temperate coasts, estuaries and polar seas. Lectures include state of the art knowledge as well as emerging technologies for future exploration. The second section focuses on how the oceans link to the global environment, and how ocean capacity helps determine human sustainability.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31446",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            },
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "223499",
        "number": "OCEANS 71",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "74H",
        "title": "Sustainability in Marine Organisms: Learning from the Evolutionary Survivors (BIO 74)",
        "description": "While climate change has impacted life at land and sea, it's impossible to know exactly how fast species will adapt to warmer and more acidic sea water, and which species will survive into the future. In this course we will explore ancient marine organisms that have adapted and survived to diverse environmental changes across millions years of evolution, in order to better understand the molecular cellular and communal elements that allowed for their success. The course will include observation and experimentation with diverse marine organisms, lectures, readings, writings, and discussions.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Course taught in-person at Hopkins Marine Station. Potential transportation from main campus to Hopkins on Fridays via university vehicles; student services will facilitate and coordinate carpooling with personal cars as well.",
                "classId": "16779",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "11:00:00 AM",
                        "endTime": "12:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Voskoboynik, A.",
                                "sunet": "ayeletv"
                            }
                        ],
                        "startTimestamp": 39600.0,
                        "endTimestamp": 43200.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "30637",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:00:00 PM",
                        "endTime": "3:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Voskoboynik, A.",
                                "sunet": "ayeletv"
                            }
                        ],
                        "startTimestamp": 46800.0,
                        "endTimestamp": 54000.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224301",
        "number": "OCEANS 74H",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "81H",
        "title": "Introduction to Ecology (OCEANS 183H)",
        "description": "The course is designed to provide background on key concepts in ecology, familiarize students with key ecological processes and ecosystems, and the methods used in ecological studies. The course will further build students' skills in critical scientific thinking, reading the literature, and scientific communication. A major goal of the course is to train students to ask questions in ecology, and to design, conduct and report studies addressing these questions.  Thus, emphasis is also placed, in additional to general ecological concepts, on field observations, experimental design, and the analysis, interpretation and presentation of ecological data (through computer laboratories, written assignments and presentations). Written assignments, presentations and discussions are designed to provide experience in organizing and presenting information and to expose students to multiple perspectives on ecological processes and their applications. This course fulfills the same requirement as BIO 81. Formerly BIOHOPK 81.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29712",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "219703",
        "number": "OCEANS 81H",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "85H",
        "title": "Evolution",
        "description": "Principles of micro- and macro-evolution from molecular genetics to the development of biological diversity. Adaptation, divergence and natural selection in the past and in contemporary ecological settings. Evolution of humans and human-caused evolution. Emphasis on major body plans in the sea and ocean examples of major evolutionary processes.This course fulfills the same requirements as BIO 85.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "219704",
        "number": "OCEANS 85H",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "112",
        "title": "Oceans and the Global Imaginary (GLOBAL 112, GLOBAL 212, OCEANS 212)",
        "description": "This course brings together various social, climatic, and ecological perspectives to seek a better understanding of the relationships between people and the sea. Our oceans constitute some 70% of the surface area of our planet; they connect continents, countless islands, and form a universal link between geographically vast regions and culturally diverse peoples. Our oceans are critical to the health of our planet, and to humanity, and it is this interdependent relationship that forms the basis of this course.Taking a genuinely global viewpoint, we will explore the dynamic nature of peoples' interactions with their maritime landscape and seascape. The course will draw on a wide range of social science and natural science data and approaches to assess how we traversed and explored the seas; how the seas have been an enduring source of nutrition; and how they have come to garner immense social and cultural significance to peoples around the world. The course looks at the unique features of the Indian, Atlantic, and Pacific Oceans, using case studies from each, while drawing lines that connect these vast oceanic basins. Ultimately, the course emphasizes the challenges facing our oceans as humanity's impact reaches unprecedented levels and considers how `people and oceans in partnership' might help mitigate the damage climate change has wrought on our planet.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31147",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "200-219",
                        "instructors": [
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224811",
        "number": "OCEANS 112",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "114H",
        "title": "Hopkins Marine Station Seminar",
        "description": "Introduction to research in marine science through a weekly seminar series at Hopkins Marine Station. The weekly seminars will approach questions of development, physiology, ecology, evolution, and oceanography using contemporary methods. Class offered in-person only at Hopkins Marine Station.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class meets in-person at Hopkins Marine Station.",
                "classId": "31207",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:00:00 PM",
                        "location": "BTWKSLEC (Hopkins)",
                        "instructors": [
                            {
                                "name": "Voskoboynik, A.",
                                "sunet": "ayeletv"
                            },
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 46800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224299",
        "number": "OCEANS 114H",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "123H",
        "title": "Catalyzing Solutions for a Sustainable Ocean: Learning with Local Communities (BIO 123, OCEANS 223H)",
        "description": "The ocean is impacted by overfishing, plastic pollution, climate change and acidification, which are leading to the disruption of marine ecosystem functions and services critical for human wellbeing. Ocean mining, offshore wind farming, increasing shipping, land sea interactions and carbon sequestration are all posing a whole new set of unprecedented challenges and, at the same time, opportunities to solve the pressing problem humanity has to face. By leveraging  the unique location of Hopkins Marine Station as a living laboratory in Monterey Bay, this course will provide a unique opportunity for students to learn through real world examples about the multifaceted nature of problems at the very core of ocean sustainability.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class taught in-person at Hopkins Marine Station. Lecture and discussions will occur from 11-1 and 2-3.",
                "classId": "16253",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "11:00:00 AM",
                        "endTime": "1:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "De Leo, G.",
                                "sunet": "deleo"
                            },
                            {
                                "name": "Mikles, C.",
                                "sunet": "csmikles"
                            },
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 39600.0,
                        "endTimestamp": 46800.0,
                        "days": "Thursday"
                    },
                    {
                        "startTime": "2:00:00 PM",
                        "endTime": "3:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "De Leo, G.",
                                "sunet": "deleo"
                            },
                            {
                                "name": "Mikles, C.",
                                "sunet": "csmikles"
                            },
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 50400.0,
                        "endTimestamp": 54000.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "31159",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224313",
        "number": "OCEANS 123H",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "125H",
        "title": "Environmental Change and Marine Biodiversity (OCEANS 225)",
        "description": "In this course we will study marine biodiversity and the impacts of environmental change on ocean life and marine ecosystems. Students will first study fundamental aspects of physiology, ecology, and evolution in marine animals and plants. Then, students will apply these principles to understand the consequences of environmental change on the functioning of organisms and ecosystems. Through field activities in the living laboratory of the Monterey coast, students will be immersed in the richness and complexity of marine food webs. Students will develop an integrative view of the past and future of ocean ecosystems, forming an evidence-based understanding of the consequences of recent anthropogenic influences on ocean biodiversity and associated ecosystem services. This course take place at Hopkins Marine Station.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30983",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:20:00 PM",
                        "location": "AGASSIZ 10 (Hopkins)",
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            },
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 51600.0,
                        "days": "Monday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "LAB",
                "notes": "This course take place down at Hopkins Marin Station.",
                "classId": "30984",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "AGASSIZ 10 (Hopkins)",
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            },
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224311",
        "number": "OCEANS 125H",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "129C",
        "title": "A Deep Dive Into the Indian Ocean: From Prehistory to the Modern Day (ANTHRO 129C, ANTHRO 229C, ARCHLGY 129C, OCEANS 229C)",
        "description": "The Indian Ocean has formed an enduring connection between three continents, countless small islands and a multitude of cultural and ethnic groups and has become the focus of increasing interest in this geographically vast and culturally diverse region. This course explores a range of topics and issues, from the nature and dynamics of colonization and cultural development as a way of understanding the human experience in this part of the world, to topics such as religion, disease, and heritage  The course guides studies in the many ways in which research in the Indian Ocean has a direct impact on our ability to compare developments in the Atlantic and Pacific. Significant work outside of class time is expected of the student for this course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course takes place in Bldg 500, Rm101.",
                "classId": "31143",
                "currentClassSize": "0",
                "maxClassSize": "8",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222044",
        "number": "OCEANS 129C",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "140H",
        "title": "Statistical Modeling (OCEANS 240H)",
        "description": "(Graduate students register for 240H.) Introduction to applied statistical modeling in a Bayesian framework. Topics will include probability, regression, model comparison, and hierarchical modeling. We will take a hands-on, computational approach (R, Stan) to gain intuition so that students can later design their own inferential models. Prerequisites for this course include introductory statistics and some calculus or linear algebra, as well as previous exposure to scientific computing. Open to graduate students; undergraduate students may enroll with consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221160",
        "number": "OCEANS 140H",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "143H",
        "title": "Quantitative methods for marine ecology and conservation (BIO 143, BIO 243, BIOHOPK 243H, CEE 164H, CEE 264H, EARTHSYS 143H, EARTHSYS 243H)",
        "description": "NOTE: This course will be taught in-person on main campus, in hybrid format with Zoom options. The goal of this course is to learn the foundations of ecological modeling with a specific (but not exclusive) focus on marine conservation and sustainable exploitation of renewable resources. Students will be introduced to a range of methods - from basic to advanced - to characterize population structure, conduct demographic analyses, estimate extinction risk, identify temporal trends and spatial patterns, quantify the effect of environmental determinants and anthropogenic pressures on the dynamics of marine populations, describe the potential for adaptation to climate change. This course will emphasize learning by doing, and will rely heavily on practical computer laboratories, in R and/or Phyton, based on data from our own research activities or peer reviewed publications. Students with a background knowledge of statistics, programming and calculus will be most welcome. Formally BIOHOPK 143H and 243H.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31201",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "De Leo, G.",
                                "sunet": "deleo"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR",
            "WAY-FR"
        ],
        "objectID": "223119",
        "number": "OCEANS 143H",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "152",
        "title": "Marine Chemistry (EARTHSYS 152, EARTHSYS 252, ESS 152, ESS 252, OCEANS 252)",
        "description": "Introduction to the interdisciplinary knowledge and skills required to critically evaluate problems in marine chemistry and related disciplines.  Physical, chemical, and biological processes that determine the chemical composition of seawater.  Air-sea gas exchange, carbonate chemistry, and chemical equilibria, nutrient and trace element cycling, particle reactivity, sediment chemistry, and diagenesis.  Examination of chemical tracers of mixing and circulation and feedbacks of ocean processes on atmospheric chemistry and climate.  Designed to be taken concurrently with Biological Oceanography (ESS/EARTHSYS 151/251)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30862",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "213658",
        "number": "OCEANS 152",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "153H",
        "title": "Current Topics and Concepts in Quantitative Fish Dynamics and Fisheries Management (OCEANS 253H)",
        "description": "(Graduate students register for 253H)  The course will focus on extensive reading of seminal and reference papers published in the literature in the last decade on modeling population biology, community dynamics and fishery management in the marine environment. Basic knowledge of population dynamics is welcome. The goal is to develop an appreciation on both traditional and cutting-edge modeling approaches to study the dynamics and management of marine populations subjected to natural or anthropogenic shocks and pressures. Formerly BIOHOPK 153H and BIOHOPK 253H.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "215585",
        "number": "OCEANS 153H",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "157",
        "title": "Creative Writing & Science: The Artful Interpreter (ENGLISH 91AI, OCEANS 257H)",
        "description": "What role does creativity play in the life of a scientist? How has science inspired great literature? How do you write accessibly and expressively about things like whales, DNA or cancer? This course provides a unique opportunity for students to directly engage with marine animals, coastal habitats and environmental concerns of Monterey Bay. As historian Jill Lepore writes of Rachel Carson: &quot;She could not have written Silent Spring if she hadn't, for decades, scrambled down rocks, rolled up her pant legs, and waded into tide pools, thinking about how one thing can change another...&quot; Students will complete and workshop three original nonfiction essays that explore the intersection between personal narrative and scientific curiosity. You will develop a more patient and observant eye and improve your ability to articulate scientific concepts to a general readership. **This course takes place at Hopkins Marine Station.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "16744",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:15:00 PM",
                        "endTime": "4:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Michas-Martin, S.",
                                "sunet": "martinsg"
                            }
                        ],
                        "startTimestamp": 47700.0,
                        "endTimestamp": 57600.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "221060",
        "number": "OCEANS 157",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "158H",
        "title": "Science Meets Literature on the Monterey Peninsula (ENGLISH 158H, OCEANS 258H)",
        "description": "(Graduate students register for 258H) This course will consider the remarkable nexus of scientific research and literature that developed on the Monterey Peninsula in the first half of the 20th century and how the two areas of creativity influenced each other. The period of focus begins with the 1932 association of John and Carol Steinbeck, Ed Ricketts, and Joseph Campbell, all of whom were highly influenced by  the Carmel poet, Robinson Jeffers &iquest; and ends with the novels Cannery Row (1945) and Sweet Thursday (1954). An indisputable high-tide mark, Sea of Cortez: A Leisurely of Travel and Research (1941) will be considered in detail. Weekend field trips will include intertidal exploration, a tour of the Jeffers Tor House in Carmel, and whale watching on Monterey Bay. Formally BIOHOPK 158H &amp; 258H.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "221129",
        "number": "OCEANS 158H",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "159H",
        "title": "Ocean Forensics: Ecological, Conservation and Market Data from Environmental DNA (OCEANS 259H)",
        "description": "DNA collected from the environment - air, water, market samples, soil, substrates, etc - contains a wealth of information about the species that have been in those locations. This course is about the methods to extract DNA, manipulate it and sequence it to determine the species and populations there. It will also delve into the bioinformatic tools needed to ensure data quality, compare results to existing taxonomic data bases, test hypotheses, and visualize the results. Formerly BIOHOPK 159H and BIOHOPK 259H.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221103",
        "number": "OCEANS 159H",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "161H",
        "title": "Between Pacific Tides: Invertebrate Zoology in Monterey Bay (OCEANS 261H)",
        "description": "Invertebrates range in size from microscopic mites to giant squid and are integral to ecosystems and their functioning. More than 97% of all described animal species lack a spine, and this course is an introductory survey of invertebrate diversity with an emphasis on intertidal habitats of Monterey Bay. Students will explore the form, function, evolution, and natural history of the major invertebrate groups through lectures, labs, and field trips. Prerequisite: BIO 81 or BIO 85 recommended.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "28491",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci",
            "WAY-SMA"
        ],
        "objectID": "112165",
        "number": "OCEANS 161H",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "162H",
        "title": "Comparative Animal Physiology (OCEANS 262H)",
        "description": "(Graduate students register for 262H) How animals work. Topics: physiology of respiration, circulation, energy metabolism, thermal regulation, osmotic regulation, muscle physiology, and locomotion. Evolutionary and ecological physiology. Lectures, lab, and field research. An option to combine the course work with a more intensive research focus, with more units, is available. Prerequisite:  Consent of instructor. Formally BIOHOPK 162H and 264H.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER: DB-NatSci"
        ],
        "objectID": "112166",
        "number": "OCEANS 162H",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "170",
        "title": "Taking the Pulse of the Ocean: Innovative Technologies for the Blue Planet (BIO 170, OCEANS 270)",
        "description": "This will be an interdisciplinary course focused on the intersection of ocean science, marine biology, engineering and computer science. Students will develop an in-depth understanding of the quantitative and field challenges involved in collecting ocean data and designing ocean instruments. Participants will have the opportunity to work with existing ocean technologies such as autonomous underwater and surface vehicles, biologging devices, drones, echosounders, environmental DNA samplers, ocean buoys, ocean drifters, and remotely operated vehicles that will be housed in the 'Ocean Garage'. They will deploy these instruments to study the interplay between physical, chemical and biological oceanography.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class taught in-person at Hopkins Marine Station. Transportation will not be provided.",
                "classId": "16294",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "4:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            },
                            {
                                "name": "Cade, D.",
                                "sunet": "davecade"
                            },
                            {
                                "name": "DiGiacomo, A.",
                                "sunet": "aed41"
                            },
                            {
                                "name": "Pagniello, C.",
                                "sunet": "cpagniel"
                            },
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            },
                            {
                                "name": "Johri, S.",
                                "sunet": "shailij"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 57600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224314",
        "number": "OCEANS 170",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "173",
        "title": "Marine Conservation Biology (OCEANS 173H, OCEANS 273H)",
        "description": "Class can be taken in-person or via Zoom. Introduction to the key concepts of ecology and policy relevant to marine conservation issues at the population to ecosystems level. Focus on the origin and maintenance of biodiversity and conservation applications from both the biology and policy perspectives (for example, endangered species, captive breeding, reserve design, habitat fragmentation, ecosystem restoration/rehabilitation).  Also includes emerging approaches such as ecosystem based management, ocean planning, and coupled social-ecological systems.  The course will include lectures, readings and discussions of primary literature, and attendance at seminars with visiting scholars.  Prerequisite: introductory biology; suggested: a policy and/or introductory ecology course. Students who want to enroll only in the seminar and discussion course (2 units) should register for BIOHOPK 173HA. (Graduate students register for 273H.)",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28144",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112177",
        "number": "OCEANS 173",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "173A",
        "title": "Marine Conservation Biology - Seminar and Discussion Only (BIOHOPK 173HA, BIOHOPK 273HA)",
        "description": "Class can be taken in-person or via Zoom. Introduction to the key concepts of ecology and policy relevant to marine conservation issues at the population to ecosystems level. Focus on the origin and maintenance of biodiversity and conservation applications from both the biology and policy perspectives (for example, endangered species, captive breeding, reserve design, habitat fragmentation, ecosystem restoration/rehabilitation). Also includes emerging approaches such as ecosystem based management, ocean planning, and coupled social-ecological systems. The course will include lectures, readings and discussions of primary literature, and attendance at seminars with visiting scholars. Prerequisite: introductory biology; suggested: a policy and/or introductory ecology course. Students should enroll in this course if they are only joining the seminar and discussion. Students who will engage in the full course should enroll in BIOHOPK 173H/273H. (Graduate students register for 273HA.)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29775",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "29774",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220273",
        "number": "OCEANS 173A",
        "units": [
            1,
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "173H",
        "title": "Marine Conservation Biology (OCEANS 173, OCEANS 273H)",
        "description": "Class can be taken in-person or via Zoom. Introduction to the key concepts of ecology and policy relevant to marine conservation issues at the population to ecosystems level. Focus on the origin and maintenance of biodiversity and conservation applications from both the biology and policy perspectives (for example, endangered species, captive breeding, reserve design, habitat fragmentation, ecosystem restoration/rehabilitation).  Also includes emerging approaches such as ecosystem based management, ocean planning, and coupled social-ecological systems.  The course will include lectures, readings and discussions of primary literature, and attendance at seminars with visiting scholars.  Prerequisite: introductory biology; suggested: a policy and/or introductory ecology course. Students who want to enroll only in the seminar and discussion course (2 units) should register for BIOHOPK 173HA. (Graduate students register for 273H.)",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Course offered in-person at Hopkins Marine Station or via Zoom. Lectures, field trips, seminars and discussions will occur from 9-12, 12-1 and 2-3.",
                "classId": "13858",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "3:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Crowder, L.",
                                "sunet": "lbcrowd"
                            },
                            {
                                "name": "Early, M.",
                                "sunet": "earlyc"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 54000.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112177",
        "number": "OCEANS 173H",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "174H",
        "title": "Experimental Design and Probability (OCEANS 274H)",
        "description": "Nature is inherently variable. Statistics gives us the tools to quantify the uncertainty of our measurements and draw conclusions from data. This course is an introduction to probability, statistical analysis, and experimental design. The primary focus is on the use of general linear models (e.g., t-tests, analysis of variance, regression). Students will use R to explore and analyze datasets relevant to the life and ocean sciences. No programming or statistical background is assumed. Graduate students register for 274H. Course taught at Hopkins Marine Station. Formerly BIOHOPK 174H/274H.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "This course take place at Hopkins Marine Station.",
                "classId": "31098",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "AGASSIZ 10 (Hopkins)",
                        "instructors": [
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Wednesday"
                    },
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": "AGASSIZ 10 (Hopkins)",
                        "instructors": [
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci",
            "GER:DB-Math",
            "WAY-AQR",
            "WAY-FR"
        ],
        "objectID": "112178",
        "number": "OCEANS 174H",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "182H",
        "title": "Stanford at Sea (EARTHSYS 323, ESS 323, OCEANS 323H)",
        "description": "Graduate students register for 323H. Five weeks of marine science including oceanography, marine physiology, policy, maritime studies, conservation, and nautical science at Hopkins Marine Station, followed by five weeks at sea aboard a sailing research vessel in the Pacific Ocean. Shore component comprised of three multidisciplinary courses meeting daily and continuing aboard ship. Students develop an independent research project plan while ashore, and carry out the research at sea. In collaboration with the Sea Education Association of Woods Hole, MA. Only 6 units may count towards the Biology major. Formally BIOHOPK 182H and 323H.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "16",
        "unitsMax": "16",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "31109",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "5:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dunbar, R.",
                                "sunet": "dunbar"
                            },
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 61200.0,
                        "days": "Monday Tuesday Wednesday Thursday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci",
            "WAY-SMA"
        ],
        "objectID": "202013",
        "number": "OCEANS 182H",
        "units": [
            16
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "183H",
        "title": "Introduction to Ecology (OCEANS 81H)",
        "description": "The course is designed to provide background on key concepts in ecology, familiarize students with key ecological processes and ecosystems, and the methods used in ecological studies. The course will further build students' skills in critical scientific thinking, reading the literature, and scientific communication. A major goal of the course is to train students to ask questions in ecology, and to design, conduct and report studies addressing these questions.  Thus, emphasis is also placed, in additional to general ecological concepts, on field observations, experimental design, and the analysis, interpretation and presentation of ecological data (through computer laboratories, written assignments and presentations). Written assignments, presentations and discussions are designed to provide experience in organizing and presenting information and to expose students to multiple perspectives on ecological processes and their applications. This course fulfills the same requirement as BIO 81. Formerly BIOHOPK 81.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29713",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "219703",
        "number": "OCEANS 183H",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "185H",
        "title": "Ecology and Conservation of Kelp Forest Communities (OCEANS 285H)",
        "description": "(Graduate students register for 285H) This is an experiential field course on the ecology of giant kelp forests. Through daily scuba dives, lectures, and labs, students become acquainted with the common invertebrates, fishes, and seaweeds and how their interactions shape the community. The course has three major components: scientific dive training, natural history, and ecology. In the first portion of the course, students learn how to do science underwater and upon completion of the course, will be certified to conduct scientific diving at Hopkins Marine Station in accordance with the standards set by the American Academy of Underwater Scientists. Topics include best practices for water safety, rescue methods, navigation and mapping, and data collection techniques. The second portion of the course concentrates on how to recognize the common species, how to identify them if you don't know who they are, and to learn where they can be found. Third, once students are familiar with the basic biology of kelp forest inhabitants, we use that as a springboard to discuss population and community processes that affect both obvious and more subtle differences in patterns of distribution and abundance that can be seen in different kelp forests around the Monterey peninsula. We will practice commonly used methods for conducting quantitative surveys of abundance and population structure for a variety of species. The data we collect during the course contribute to on-going time series for the Hopkins Marine Life Observatory, some of which have been going on for nearly 25 years. Course times reflect lecture only; course is a full-time commitment from June 26-July 28. Formerly BIOHOPK 185H/285H.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "208488",
        "number": "OCEANS 185H",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "198H",
        "title": "Directed Instruction or Reading",
        "description": "May be taken as a prelude to research and may also involve participation in a lab or research group seminar and/or library research. Credit for work arranged with out-of-department instructors restricted to Biology majors and requires department approval. May be repeated for credit. Formerly BIOHOPK 198H.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28494",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "26688",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28145",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "7712",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "8382",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "8237",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "7713",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "8383",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "8238",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "7714",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "8384",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "8239",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "7715",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "8385",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "8240",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "7716",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "8386",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "8241",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "8387",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "8242",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112187",
        "number": "OCEANS 198H",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ],
        "totalSections": 38
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "199H",
        "title": "Undergraduate Research",
        "description": "Qualified undergraduates undertake individual work in the fields listed under 300H. Arrangements must be made by consultation or correspondence.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28495",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "26689",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28146",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "8390",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "7719",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "8245",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "8391",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "7720",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "8246",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "8392",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "7721",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "8247",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "8393",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "7722",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "8248",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "8394",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "7723",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "8249",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "8395",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "7724",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112189",
        "number": "OCEANS 199H",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ],
        "totalSections": 39
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "200H",
        "title": "Topics in Scientific and Statistical Computing",
        "description": "Seminar course for graduate students only. The goal is to build community, foster discussion, and develop a deeper understanding of a single topic, or an introduction to multiple topics, relevant to scientific or statistical programming using R. The specific format will be chosen by participants in the course; students are empowered to take the lead in the discussion of weekly readings. Prerequisites: an introductory course in statistics and some familiarity with the R programming language. Formerly BIOHOPK 200H.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16783",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "AGASSIZ 10 (Hopkins)",
                        "instructors": [
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224933",
        "number": "OCEANS 200H",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "212",
        "title": "Oceans and the Global Imaginary (GLOBAL 112, GLOBAL 212, OCEANS 112)",
        "description": "This course brings together various social, climatic, and ecological perspectives to seek a better understanding of the relationships between people and the sea. Our oceans constitute some 70% of the surface area of our planet; they connect continents, countless islands, and form a universal link between geographically vast regions and culturally diverse peoples. Our oceans are critical to the health of our planet, and to humanity, and it is this interdependent relationship that forms the basis of this course.Taking a genuinely global viewpoint, we will explore the dynamic nature of peoples' interactions with their maritime landscape and seascape. The course will draw on a wide range of social science and natural science data and approaches to assess how we traversed and explored the seas; how the seas have been an enduring source of nutrition; and how they have come to garner immense social and cultural significance to peoples around the world. The course looks at the unique features of the Indian, Atlantic, and Pacific Oceans, using case studies from each, while drawing lines that connect these vast oceanic basins. Ultimately, the course emphasizes the challenges facing our oceans as humanity's impact reaches unprecedented levels and considers how `people and oceans in partnership' might help mitigate the damage climate change has wrought on our planet.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31144",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "200-219",
                        "instructors": [
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224811",
        "number": "OCEANS 212",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "214",
        "title": "Hopkins Marine Station Seminar",
        "description": "Introduction to research in marine science through a weekly seminar series at Hopkins Marine Station. The weekly seminars will approach questions of development, physiology, ecology, evolution, and oceanography using contemporary methods. Class offered in-person only at Hopkins Marine Station.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224300",
        "number": "OCEANS 214",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "214H",
        "title": "Hopkins Marine Station Seminar",
        "description": "Introduction to research in marine science through a weekly seminar series at Hopkins Marine Station. The weekly seminars will approach questions of development, physiology, ecology, evolution, and oceanography using contemporary methods. Class offered in-person only at Hopkins Marine Station.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Course meets in-person at Hopkins Marine Station. Potential transportation from main campus to Hopkins on Fridays via university vehicles; student services will facilitate and coordinate carpooling with personal cars as well.",
                "classId": "15070",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:00:00 PM",
                        "location": "BTWKSLEC (Hopkins)",
                        "instructors": [
                            {
                                "name": "Voskoboynik, A.",
                                "sunet": "ayeletv"
                            },
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 46800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224309",
        "number": "OCEANS 214H",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "223H",
        "title": "Catalyzing Solutions for a Sustainable Ocean: Learning with Local Communities (BIO 123, OCEANS 123H)",
        "description": "The ocean is impacted by overfishing, plastic pollution, climate change and acidification, which are leading to the disruption of marine ecosystem functions and services critical for human wellbeing. Ocean mining, offshore wind farming, increasing shipping, land sea interactions and carbon sequestration are all posing a whole new set of unprecedented challenges and, at the same time, opportunities to solve the pressing problem humanity has to face. By leveraging  the unique location of Hopkins Marine Station as a living laboratory in Monterey Bay, this course will provide a unique opportunity for students to learn through real world examples about the multifaceted nature of problems at the very core of ocean sustainability.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class will meet in-person at Hopkins Marine Station. Transportation will not be provided. Lecture and discussion sections will occur from 11-1 and 2-3.",
                "classId": "16309",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "11:00:00 AM",
                        "endTime": "1:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "De Leo, G.",
                                "sunet": "deleo"
                            },
                            {
                                "name": "Mikles, C.",
                                "sunet": "csmikles"
                            },
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 39600.0,
                        "endTimestamp": 46800.0,
                        "days": "Thursday"
                    },
                    {
                        "startTime": "2:00:00 PM",
                        "endTime": "3:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "De Leo, G.",
                                "sunet": "deleo"
                            },
                            {
                                "name": "Mikles, C.",
                                "sunet": "csmikles"
                            },
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 50400.0,
                        "endTimestamp": 54000.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "31160",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224313",
        "number": "OCEANS 223H",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "225",
        "title": "Environmental Change and Marine Biodiversity (OCEANS 125H)",
        "description": "In this course we will study marine biodiversity and the impacts of environmental change on ocean life and marine ecosystems. Students will first study fundamental aspects of physiology, ecology, and evolution in marine animals and plants. Then, students will apply these principles to understand the consequences of environmental change on the functioning of organisms and ecosystems. Through field activities in the living laboratory of the Monterey coast, students will be immersed in the richness and complexity of marine food webs. Students will develop an integrative view of the past and future of ocean ecosystems, forming an evidence-based understanding of the consequences of recent anthropogenic influences on ocean biodiversity and associated ecosystem services. This course take place at Hopkins Marine Station.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224311",
        "number": "OCEANS 225",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "229C",
        "title": "A Deep Dive Into the Indian Ocean: From Prehistory to the Modern Day (ANTHRO 129C, ANTHRO 229C, ARCHLGY 129C, OCEANS 129C)",
        "description": "The Indian Ocean has formed an enduring connection between three continents, countless small islands and a multitude of cultural and ethnic groups and has become the focus of increasing interest in this geographically vast and culturally diverse region. This course explores a range of topics and issues, from the nature and dynamics of colonization and cultural development as a way of understanding the human experience in this part of the world, to topics such as religion, disease, and heritage  The course guides studies in the many ways in which research in the Indian Ocean has a direct impact on our ability to compare developments in the Atlantic and Pacific. Significant work outside of class time is expected of the student for this course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31156",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222044",
        "number": "OCEANS 229C",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "234H",
        "title": "Topics in Comparative and Environmental Physiology",
        "description": "*Offered in-person for Hopkins Marine Station graduate students only.* Seminar and discussion focused on current topics and research at the interface of physiology and ecology.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14602",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218576",
        "number": "OCEANS 234H",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "240H",
        "title": "Statistical Modeling (OCEANS 140H)",
        "description": "(Graduate students register for 240H.) Introduction to applied statistical modeling in a Bayesian framework. Topics will include probability, regression, model comparison, and hierarchical modeling. We will take a hands-on, computational approach (R, Stan) to gain intuition so that students can later design their own inferential models. Prerequisites for this course include introductory statistics and some calculus or linear algebra, as well as previous exposure to scientific computing. Open to graduate students; undergraduate students may enroll with consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221160",
        "number": "OCEANS 240H",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "249",
        "title": "Marine Stable Isotopes (ESS 249)",
        "description": "This course will provide an introduction to stable isotopes biogeochemistry with emphasis on applications in marine science. We will cover fundamental concepts of nuclear structure and origin of elements and isotopes, and stable isotopic fractionation. We will discuss mass spectrometry techniques, mass independent fractionation, clumped isotopes, mass balance and box models. Applications of these concepts to studies of ocean circulation, marine carbon and nitrogen cycles, primary productivity, and particle scavenging will also be discussed.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "212952",
        "number": "OCEANS 249",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "252",
        "title": "Marine Chemistry (EARTHSYS 152, EARTHSYS 252, ESS 152, ESS 252, OCEANS 152)",
        "description": "Introduction to the interdisciplinary knowledge and skills required to critically evaluate problems in marine chemistry and related disciplines.  Physical, chemical, and biological processes that determine the chemical composition of seawater.  Air-sea gas exchange, carbonate chemistry, and chemical equilibria, nutrient and trace element cycling, particle reactivity, sediment chemistry, and diagenesis.  Examination of chemical tracers of mixing and circulation and feedbacks of ocean processes on atmospheric chemistry and climate.  Designed to be taken concurrently with Biological Oceanography (ESS/EARTHSYS 151/251)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32321",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213658",
        "number": "OCEANS 252",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "253H",
        "title": "Current Topics and Concepts in Quantitative Fish Dynamics and Fisheries Management (OCEANS 153H)",
        "description": "(Graduate students register for 253H)  The course will focus on extensive reading of seminal and reference papers published in the literature in the last decade on modeling population biology, community dynamics and fishery management in the marine environment. Basic knowledge of population dynamics is welcome. The goal is to develop an appreciation on both traditional and cutting-edge modeling approaches to study the dynamics and management of marine populations subjected to natural or anthropogenic shocks and pressures. Formerly BIOHOPK 153H and BIOHOPK 253H.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "215585",
        "number": "OCEANS 253H",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "257H",
        "title": "Creative Writing & Science: The Artful Interpreter (ENGLISH 91AI, OCEANS 157)",
        "description": "What role does creativity play in the life of a scientist? How has science inspired great literature? How do you write accessibly and expressively about things like whales, DNA or cancer? This course provides a unique opportunity for students to directly engage with marine animals, coastal habitats and environmental concerns of Monterey Bay. As historian Jill Lepore writes of Rachel Carson: &quot;She could not have written Silent Spring if she hadn't, for decades, scrambled down rocks, rolled up her pant legs, and waded into tide pools, thinking about how one thing can change another...&quot; Students will complete and workshop three original nonfiction essays that explore the intersection between personal narrative and scientific curiosity. You will develop a more patient and observant eye and improve your ability to articulate scientific concepts to a general readership. **This course takes place at Hopkins Marine Station.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "30090",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221060",
        "number": "OCEANS 257H",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "258H",
        "title": "Science Meets Literature on the Monterey Peninsula (ENGLISH 158H, OCEANS 158H)",
        "description": "(Graduate students register for 258H) This course will consider the remarkable nexus of scientific research and literature that developed on the Monterey Peninsula in the first half of the 20th century and how the two areas of creativity influenced each other. The period of focus begins with the 1932 association of John and Carol Steinbeck, Ed Ricketts, and Joseph Campbell, all of whom were highly influenced by  the Carmel poet, Robinson Jeffers &iquest; and ends with the novels Cannery Row (1945) and Sweet Thursday (1954). An indisputable high-tide mark, Sea of Cortez: A Leisurely of Travel and Research (1941) will be considered in detail. Weekend field trips will include intertidal exploration, a tour of the Jeffers Tor House in Carmel, and whale watching on Monterey Bay. Formally BIOHOPK 158H &amp; 258H.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221129",
        "number": "OCEANS 258H",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "259H",
        "title": "Ocean Forensics: Ecological, Conservation and Market Data from Environmental DNA (OCEANS 159H)",
        "description": "DNA collected from the environment - air, water, market samples, soil, substrates, etc - contains a wealth of information about the species that have been in those locations. This course is about the methods to extract DNA, manipulate it and sequence it to determine the species and populations there. It will also delve into the bioinformatic tools needed to ensure data quality, compare results to existing taxonomic data bases, test hypotheses, and visualize the results. Formerly BIOHOPK 159H and BIOHOPK 259H.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221103",
        "number": "OCEANS 259H",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "261H",
        "title": "Between Pacific Tides: Invertebrate Zoology in Monterey Bay (OCEANS 161H)",
        "description": "Invertebrates range in size from microscopic mites to giant squid and are integral to ecosystems and their functioning. More than 97% of all described animal species lack a spine, and this course is an introductory survey of invertebrate diversity with an emphasis on intertidal habitats of Monterey Bay. Students will explore the form, function, evolution, and natural history of the major invertebrate groups through lectures, labs, and field trips. Prerequisite: BIO 81 or BIO 85 recommended.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "28493",
                "currentClassSize": "0",
                "maxClassSize": "19",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112165",
        "number": "OCEANS 261H",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "262C",
        "title": "Coastal Ocean Modeling (CEE 262C)",
        "description": "Introduction to numerical methods for modeling flows in the coastal ocean and estuaries that are influenced by river flows, tides, winds and gravity waves. Topics include stability and accuracy analysis, curvilinear and unstructured grids, implicit/explicit methods, transport and diffusion, shallow water equations, nonhydrostatic equations, Navier-Stokes solvers, turbulence modeling, and wave modeling. Prerequisites: CEE 262A, CME 206, or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28976",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "204560",
        "number": "OCEANS 262C",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "262H",
        "title": "Comparative Animal Physiology (OCEANS 162H)",
        "description": "(Graduate students register for 262H) How animals work. Topics: physiology of respiration, circulation, energy metabolism, thermal regulation, osmotic regulation, muscle physiology, and locomotion. Evolutionary and ecological physiology. Lectures, lab, and field research. An option to combine the course work with a more intensive research focus, with more units, is available. Prerequisite:  Consent of instructor. Formally BIOHOPK 162H and 264H.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "112166",
        "number": "OCEANS 262H",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "270",
        "title": "Taking the Pulse of the Ocean: Innovative Technologies for the Blue Planet (BIO 170, OCEANS 170)",
        "description": "This will be an interdisciplinary course focused on the intersection of ocean science, marine biology, engineering and computer science. Students will develop an in-depth understanding of the quantitative and field challenges involved in collecting ocean data and designing ocean instruments. Participants will have the opportunity to work with existing ocean technologies such as autonomous underwater and surface vehicles, biologging devices, drones, echosounders, environmental DNA samplers, ocean buoys, ocean drifters, and remotely operated vehicles that will be housed in the 'Ocean Garage'. They will deploy these instruments to study the interplay between physical, chemical and biological oceanography.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Class will meet in-person at Hopkins Marine Station.  Lecture, lab and discussion sections will occur from 10-11 and 1-4.",
                "classId": "16311",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "4:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            },
                            {
                                "name": "Cade, D.",
                                "sunet": "davecade"
                            },
                            {
                                "name": "DiGiacomo, A.",
                                "sunet": "aed41"
                            },
                            {
                                "name": "Pagniello, C.",
                                "sunet": "cpagniel"
                            },
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            },
                            {
                                "name": "Johri, S.",
                                "sunet": "shailij"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 57600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224314",
        "number": "OCEANS 270",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "273H",
        "title": "Marine Conservation Biology (OCEANS 173, OCEANS 173H)",
        "description": "Class can be taken in-person or via Zoom. Introduction to the key concepts of ecology and policy relevant to marine conservation issues at the population to ecosystems level. Focus on the origin and maintenance of biodiversity and conservation applications from both the biology and policy perspectives (for example, endangered species, captive breeding, reserve design, habitat fragmentation, ecosystem restoration/rehabilitation).  Also includes emerging approaches such as ecosystem based management, ocean planning, and coupled social-ecological systems.  The course will include lectures, readings and discussions of primary literature, and attendance at seminars with visiting scholars.  Prerequisite: introductory biology; suggested: a policy and/or introductory ecology course. Students who want to enroll only in the seminar and discussion course (2 units) should register for BIOHOPK 173HA. (Graduate students register for 273H.)",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Course taught in-person at Hopkins Marine Station or via Zoom. Lectures, field trips, seminars and discussions will occur from 9-12, 12-1 and 2-3.",
                "classId": "13859",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "3:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Crowder, L.",
                                "sunet": "lbcrowd"
                            },
                            {
                                "name": "Early, M.",
                                "sunet": "earlyc"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 54000.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112177",
        "number": "OCEANS 273H",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "274",
        "title": "Hopkins Microbiology Course (BIO 274S, CEE 274S, ESS 253S)",
        "description": "Four-week, intensive. The interplay between molecular, physiological, ecological, evolutionary, and geochemical processes that constitute, cause, and maintain microbial diversity. How to isolate key microorganisms driving marine biological and geochemical diversity, interpret culture-independent molecular characterization of microbial species, and predict causes and consequences. Laboratory component: what constitutes physiological and metabolic microbial diversity; how evolutionary and ecological processes diversify individual cells into physiologically heterogeneous populations; and the principles of interactions between individuals, their population, and other biological entities in a dynamically changing microbial ecosystem. Prerequisites: CEE 274A and CEE 274B, or equivalents. Formerly BIOHOPK 274H.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "12",
        "sections": [],
        "gers": [],
        "objectID": "206173",
        "number": "OCEANS 274",
        "units": [
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "274H",
        "title": "Experimental Design and Probability (OCEANS 174H)",
        "description": "Nature is inherently variable. Statistics gives us the tools to quantify the uncertainty of our measurements and draw conclusions from data. This course is an introduction to probability, statistical analysis, and experimental design. The primary focus is on the use of general linear models (e.g., t-tests, analysis of variance, regression). Students will use R to explore and analyze datasets relevant to the life and ocean sciences. No programming or statistical background is assumed. Graduate students register for 274H. Course taught at Hopkins Marine Station. Formerly BIOHOPK 174H/274H.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "This course takes place at Hopkins Marine Station.",
                "classId": "31106",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "AGASSIZ 10 (Hopkins)",
                        "instructors": [
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Wednesday"
                    },
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": "AGASSIZ 10 (Hopkins)",
                        "instructors": [
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112178",
        "number": "OCEANS 274H",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "275",
        "title": "Nitrogen in the Marine Environment (ESS 275)",
        "description": "The goal of this seminar course is to explore current topics in marine nitrogen cycle. We will explore a variety of processes, including primary production, nitrogen fixation, nitrification, denitrification, and anaerobic ammonia oxidation, and their controls. We will use the book Nitrogen in the Marine Environment and supplement with student-led discussions of recent literature. A variety of biomes, spatial and temporal scales, and methodologies for investigation will be discussed.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29318",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:50:00 PM",
                        "location": "200-202",
                        "instructors": [
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 60600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217631",
        "number": "OCEANS 275",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "285H",
        "title": "Ecology and Conservation of Kelp Forest Communities (OCEANS 185H)",
        "description": "(Graduate students register for 285H) This is an experiential field course on the ecology of giant kelp forests. Through daily scuba dives, lectures, and labs, students become acquainted with the common invertebrates, fishes, and seaweeds and how their interactions shape the community. The course has three major components: scientific dive training, natural history, and ecology. In the first portion of the course, students learn how to do science underwater and upon completion of the course, will be certified to conduct scientific diving at Hopkins Marine Station in accordance with the standards set by the American Academy of Underwater Scientists. Topics include best practices for water safety, rescue methods, navigation and mapping, and data collection techniques. The second portion of the course concentrates on how to recognize the common species, how to identify them if you don't know who they are, and to learn where they can be found. Third, once students are familiar with the basic biology of kelp forest inhabitants, we use that as a springboard to discuss population and community processes that affect both obvious and more subtle differences in patterns of distribution and abundance that can be seen in different kelp forests around the Monterey peninsula. We will practice commonly used methods for conducting quantitative surveys of abundance and population structure for a variety of species. The data we collect during the course contribute to on-going time series for the Hopkins Marine Life Observatory, some of which have been going on for nearly 25 years. Course times reflect lecture only; course is a full-time commitment from June 26-July 28. Formerly BIOHOPK 185H/285H.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "208488",
        "number": "OCEANS 285H",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "290H",
        "title": "Teaching Practicum in Biology",
        "description": "Open to upper-division undergraduates and graduate students. Practical supervised teaching experience in a biology or lecture course. Training often includes attending lectures, initiating and planning discussion sections, and assisting in the preparation of course materials. May be repeated for credit.  Prerequisite: consent of instructor. Formally BIOHOPK 290H.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28496",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28147",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "8253",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "8398",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "8254",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "8399",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "8255",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "8400",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "8256",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "8401",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "8257",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "8402",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "8258",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "8403",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "8259",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Thompson, S.",
                                "sunet": "stuartt"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "8404",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Thompson, S.",
                                "sunet": "stuartt"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "11",
                "component": "INS",
                "notes": null,
                "classId": "8260",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "11",
                "component": "INS",
                "notes": null,
                "classId": "8405",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Elahi, R.",
                                "sunet": "elahi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "10866",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lowe, C.",
                                "sunet": "clowe"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "10655",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lowe, C.",
                                "sunet": "clowe"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112214",
        "number": "OCEANS 290H",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ],
        "totalSections": 24
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "291H",
        "title": "Teaching of Stanford at Sea",
        "description": "Only open to graduate students who are teaching assistants for Stanford at Sea. Provides practical experience in teaching field oceanography and marine biology. Serving as an assistant in a lecture course (five weeks) is coupled with acting as a laboratory teaching assistant on board an oceanographic research vessel during a five-week research cruise with the Stanford at Sea course. Prerequisite: consent of instructor. Formerly BIOHOPK 291H.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "10",
        "unitsMax": "10",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29886",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221404",
        "number": "OCEANS 291H",
        "units": [
            10
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "299H",
        "title": "Advanced Topics in Marine Conservation",
        "description": "Graduate students only.  Topics will change from year to year but will include such topics as sustainable fisheries, protected areas, ocean planning, social-ecological systems, dynamic management, sustainable seafood, and impacts of climate change. Formally BIOHOPK 299H.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "220001",
        "number": "OCEANS 299H",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "300",
        "title": "Research",
        "description": "Graduate study involving original work undertaken with staff in the fields indicated. B. Block: Comparative Vertebrate Physiology (biomechanics, metabolic physiology and phylogeny of pelagic fishes, evolution of endothermy);  L. Crowder: Marine ecology, fisheries, bycatch, integrating science and policy, marine conservation;  G. De Leo: Population dynamics and management, wildlife diseases, environmental policies and sustainable development; M. Denny: Biomechanics (the mechanical properties of biological materials and their consequences for animal size, shape, and performance);  W. Gilly: Neurobiology (analysis of giant axon systems in marine invertebrates from molecular to behavioral levels); J. Goldbogen: Physiological and Behavioral Ecology (functional morphology and biomechanics of marine organisms): C. Lowe: Evolution of Development (origin of chordates, early evolution of body plans);  F. Micheli: Marine Ecology (species interactions and community ecology, scale-dependent aspects of community organization, marine conservation and design of multi-species marine protected areas, behavioral ecology); S. Palumbi: Molecular Evolution (mechanisms of speciation, genetic differentiations of populations, use of molecular tools in conservation biology, design of marine protected areas); S. Thompson: Neurobiology (neuronal control of behavior and mechanisms of ion permeation, signal transduction, calcium homeostasis, and neurotransmission). Formally BIOHOPK 300H.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "26690",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28148",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28497",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "7727",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "8261",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "8406",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "8262",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "8407",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "7728",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "7729",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "8263",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "8408",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "7730",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "8264",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "8409",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "7731",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "8265",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "8410",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "8266",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "8411",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112217",
        "number": "OCEANS 300",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ],
        "totalSections": 43
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "300A",
        "title": "Get to Know Your Oceans",
        "description": "Required of and restricted to first-year Oceans Ph.D. students. Incoming PhD students will spend fall and winter quarters learning about the cutting-edge research happening in diverse labs across the Oceans Department and beyond. Discussion will focus on primary literature in ocean science, including biological, physical, and social sciences, and technology. Several experiential daylong field trips to the Monterey Bay and beyond will be organized throughout fall and winter quarter. Required of first-year Oceans PhD students. OCEANS 300A and OCEANS 300B are both requirements for first-year Oceans PhD students.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29533",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "260-003",
                        "instructors": [
                            {
                                "name": "Koseff, J.",
                                "sunet": "koseff"
                            },
                            {
                                "name": "Fringer, O.",
                                "sunet": "fringer"
                            },
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            },
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            },
                            {
                                "name": "Francis, C.",
                                "sunet": "caf"
                            },
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            },
                            {
                                "name": "De Leo, G.",
                                "sunet": "deleo"
                            },
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            },
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            },
                            {
                                "name": "Dunbar, R.",
                                "sunet": "dunbar"
                            },
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            },
                            {
                                "name": "Monismith, S.",
                                "sunet": "stephen"
                            },
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225459",
        "number": "OCEANS 300A",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "300B",
        "title": "Get to Know Your Oceans",
        "description": "Required of and restricted to first-year Oceans Ph.D. students. Incoming PhD students will spend fall and winter quarters learning about the cutting-edge research happening in diverse labs across the Oceans Department and beyond. Discussion will focus on primary literature in ocean science, including biological, physical, and social sciences, and technology. Several experiential daylong field trips to the Monterey Bay and beyond will be organized throughout fall and winter quarter. Required of first-year Oceans PhD students. OCEANS 300A and OCEANS 300B are both requirements for first-year Oceans PhD students.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31466",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225455",
        "number": "OCEANS 300B",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "301",
        "title": "Managing Your PhD",
        "description": "The course will focus on 5 themes for effectively managing your PhD: professionalism, scholarship, well-being, community-engagement and career development. We will meet every other week for an active discussion-based class meeting. At the end of the quarter students and instructors will co-organize a departmental half-day workshop on a particular topic relevant to the topics covered in the class. Team taught between faculty, student services and campus experts. Required of first-year Oceans PhD students.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29535",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:50:00 PM",
                        "location": "160-314",
                        "instructors": [
                            {
                                "name": "De Leo, G.",
                                "sunet": "deleo"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 60600.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225456",
        "number": "OCEANS 301",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "302",
        "title": "Introduction to Scientific Reading and Writing",
        "description": "Designed to support Oceans PhD students in their first years of graduate study, this course focuses on short readings, writing exercises and peer feedback in order to acclimate students to the core elements of research papers and scientific articles. We will also touch on strategies for overcoming writer's block, setting and maintaining writing goals, the importance of clarity and concision, and the intersection of creativity and the sciences. We'll examine specific strategies and practices that facilitate productivity at various stages in the writing process and in different scientific genres. Students are welcome to bring a finished paper or a draft in process for review and constructive critique. Team taught between faculty, student services and campus experts. Required for first year Oceans PhD students.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "225454",
        "number": "OCEANS 302",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "303",
        "title": "Quals Prep Writing Workshop",
        "description": "TBD",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "225552",
        "number": "OCEANS 303",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "304",
        "title": "Quals Prep Presentation Workshop",
        "description": "TBD",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "225553",
        "number": "OCEANS 304",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "323H",
        "title": "Stanford at Sea (EARTHSYS 323, ESS 323, OCEANS 182H)",
        "description": "Graduate students register for 323H. Five weeks of marine science including oceanography, marine physiology, policy, maritime studies, conservation, and nautical science at Hopkins Marine Station, followed by five weeks at sea aboard a sailing research vessel in the Pacific Ocean. Shore component comprised of three multidisciplinary courses meeting daily and continuing aboard ship. Students develop an independent research project plan while ashore, and carry out the research at sea. In collaboration with the Sea Education Association of Woods Hole, MA. Only 6 units may count towards the Biology major. Formally BIOHOPK 182H and 323H.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "16",
        "unitsMax": "16",
        "sections": [],
        "gers": [],
        "objectID": "202013",
        "number": "OCEANS 323H",
        "units": [
            16
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "330",
        "title": "Breathless in the Oceans (EPS 330)",
        "description": "(Formerly GEOLSCI 330) This reading course will explore how oxygen and temperature changes affect marine life in the oceans, both in the geological past and with respect to modern global change. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224749",
        "number": "OCEANS 330",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "350H",
        "title": "Life history variation in the evolution of developmental mechanisms",
        "description": "We study the development of adult body plans by a strong focus on understanding embryonic development. Most animal developmental models are defined by direct development, where the adult body plan forms directly during embryogenesis. However, in many bilaterian phyla, the embryo gives rise to a larval body plan, that is often characterized by a body plan very distinct from the adults that they give rise to. The adult body plan forms postembryonically, often weeks into larval development.  Most broad evolutionary body plan comparative studies  compare developmental mechanisms of embryos without considering the mode of development of the animals being compared and how this may affect the analysis. In this course we will explore the diversity of developmental strategies in animal phyla and discuss the importance of integrating a more explicit consideration of life history into broad body plan comparisons across distantly related phyla. This course was formally BIOHOPK 350H.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "223420",
        "number": "OCEANS 350H",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "801H",
        "title": "TGR Project",
        "description": "TGR Project",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28498",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "26691",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28149",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "7734",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "8413",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "8268",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "8414",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "8269",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "8415",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "8270",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "7737",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "8416",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "8271",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "7738",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "8417",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "8272",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "8418",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "8273",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "8419",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Thompson, S.",
                                "sunet": "stuartt"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "8274",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Thompson, S.",
                                "sunet": "stuartt"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112224",
        "number": "OCEANS 801H",
        "units": [
            0
        ],
        "totalSections": 29
    },
    {
        "year": "2023-2024",
        "subject": "OCEANS",
        "code": "802H",
        "title": "TGR Dissertation",
        "description": "TGR Dissertation",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28499",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28150",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "26692",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "8420",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "8275",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "7741",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Block, B.",
                                "sunet": "bblock"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "8421",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "8276",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denny, M.",
                                "sunet": "mwdenny"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "7742",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Monismith, S.",
                                "sunet": "stephen"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "8422",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "8277",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "7743",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gilly, W.",
                                "sunet": "lignje"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "8423",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "8278",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "7744",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "8424",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "8279",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "7745",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "8425",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "8280",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldbogen, J.",
                                "sunet": "jergold"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "112227",
        "number": "OCEANS 802H",
        "units": [
            0
        ],
        "totalSections": 34
    }
]