[
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "10",
        "title": "Introduction to Japan: History, Religion, Culture",
        "description": "This course provides a broad introduction to the history, religion, and culture of Japan from prehistory until the death of the Meiji Emperor in 1912, with emphasis on Japan's relations with the continent (especially China) and the wider world and how those relations changed over time in the context of successive waves of globalization. The course is experience-intensive, taking full advantage of the historical and cultural treasures of Kyoto and environs through multiple field trips per week.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224116",
        "number": "OSPGEN 10",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "12",
        "title": "\"Uttermost Part of the Earth\" The Intersection of Nature and the Human Enterprise in Patagonia",
        "description": "This field-based course introduces students to the environmental gradients and natural resources of southern Patagonia as well as current issues in fisheries, ranching, tourism, and indigenous rights. The coupled human-natural systems of Patagonia provide a unique lens for students to explore broader resource management and conservation issues. The curriculum balances field exercises with community exploration in which students meet government planners, fishermen and fish processing plant operators, tour operators, and local conservationists. We will complete two team-based research projects.Date(s) of course:August 30-September 22, 2023",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "217928",
        "number": "OSPGEN 12",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "14",
        "title": "Faith, Science and the Classical Tradition in Renaissance Florence",
        "description": "The story of the Renaissance can be told as a shift from a god-centered world to a human-centered one, a shift that began with the rediscovery of the classical humanist tradition (especially the philosopher-poet Lucretius) and led eventually to the scientific revolution. It is quintessentially the story of Florence. This course presents the story by using the city itself to look at the ways people represented their relationship with God and their understanding of what it is to be human and rational. That in turn leads us to a larger question: how to understand belief itself.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224115",
        "number": "OSPGEN 14",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "20",
        "title": "Engineering and Technology in India",
        "description": "&quot;This seminar investigates engineering, technology, business, and cultural aspects of India. Upon completion of the program, students are able to demonstrate an improved understanding of the following: 1. major industries, companies, and technologies in each location, 2. key challenges and opportunities facing various sectors, and 3. ways in which businesses and agencies operate within the political, economic, and cultural contexts. Following pre-briefings by students, we will have visits to universities, research centers, industrial, government, and cultural sites. Debriefings will follow each visit.&quot; Dates of course: September 1-15, 2023",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "225049",
        "number": "OSPGEN 20",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "21",
        "title": "Kangnam Style: South Korea's Soft Power Empire",
        "description": "South Korea has become a driver of pop culture and art. The musical/audio-visual genre known as K-pop has become globally mainstream, Korean dramas reach viewers around the globe, the K-beauty routine is championed by online influencers, and Korean fine arts dominate in the international arena. In this seminar, students will become familiar with South Korea's economic, social, and political history that enabled these astonishing developments. Through field trips we will explore the following questions: Who are the people driving Korea's &quot;K&quot;-industries? How can we understand its sustained success? At what cost has Korea achieved dominance in this field? Students will visit the centers of South Korea's art establishment and entertainment industries, and will meet executives, performers, and contemporary artists. Students will contemplate the relationship between history and culture, and will interrogate the boundaries between the authentic and artificial. Date (s) of course: August 20-September 9, 2023",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "225050",
        "number": "OSPGEN 21",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "25",
        "title": "The Khmer Rouge Legacy and Transitional Justice in Cambodia",
        "description": "The ongoing trials at the Extraordinary Chambers in the Courts of Cambodia (ECCC) began a transitional justice process that ushered in an era in which Cambodians began to examine their experience of the Khmer Rouge regime (1975-1979). This seminar will focus on Cambodia's experience of civil war, trials, reparations, reconciliation, and coming to terms with the past. We will engage with ECCC, UN, and human rights NGO representatives, as well as young Cambodian artists, human rights lawyers, and academics. In Phnom Penh, we will visit the ECCC, the Tuol Sleng Genocide Museum, the Choeng Ek Killing Fields, human rights NGOs, etc. We will go on to visit Siem Reap and the temple complex of Angkor Wat.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222224",
        "number": "OSPGEN 25",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "26",
        "title": "Interdisciplinary Introduction to African Urban Studies",
        "description": "The main idea for this course will beto use Accra as a way to illuminate cities of the students'own choice.This meansthat the course will be inherently comparative andfeatures of Accra will be usedto ignite students&iquest;understanding of details of the urbanin general.Features of other African cities such as Cairo,Lagos, Kinshasa, and Johannesburg will beintroduced primarily through literary, anthropological,and other humanistic texts. And spatial concepts such asspatial morphology, spatial traversal and the means of locomotion, space-time anamorphism (for science fiction), topoanalysis (from phenomenology), and chronotopes(from Bakhtin)will be progressively introduced and applied to different urban features. The course will be a combination of classroom discussions and various fieldwork walking and bus tours of Accra.  These will help to further ground the spatial concepts they will have been introduced to in class.There willalsobetrips to the Elmina and Cape Coast Castles, old seats of the European trading presence on the Gold Coast/Ghanaand sites of the slave trade.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222225",
        "number": "OSPGEN 26",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "27",
        "title": "Creative City: Culture and Resistance in Global Bangalore",
        "description": "Formerly described as &quot;pensioner's paradise,&quot; and &quot;garden city,&quot; Bangalore is a city in southern India that once evoked images of rest and retreat. From an earlier somnolent rhythm of life, Bangalore has transformed into the high technology capital of the Global South and grows at a pace so rapid that it eludes our conceptual grasp of it. This course explores a central question: How did the southern Indian city, Bangalore, transform from &iquest;pensioner's paradise&iquest; to India's high tech capital? We will study the urban transformations of Bangalore through three vectors of analysis: the city'sn2vibrant arts scene, civic and legal activism, and environmental and social justice movements.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222226",
        "number": "OSPGEN 27",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "28",
        "title": "Can a Start-Up Culture and Technology Heal the World?",
        "description": "Israel's health system is one of the most admired in the world. Despite its small size, Israel is home to a disproportionate number of start-ups.Through this immersive seminar, students will gain an understanding of how socio-cultural conditions, including political, regulatory, military, and academic institutions; geographical, historical, and environmental conditions; and human cultures and activities have shaped the health innovation ecosystem in Israel into one of the world's most productive centers; and an appreciation of the advantages and disadvantages faced by entrepreneurs in Israel, how they have evolved, and how they compare to the experience of entrepreneurs elsewhere.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222227",
        "number": "OSPGEN 28",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "29",
        "title": "A cultural, ethical, medical and legal exploration of Japanese and American Societies",
        "description": "How can someone be dead in America but alive in Japan? Why does Japan have among the lowest rates of life-saving organ transplantation in the world despite being a highly developed society? While death is broadly considered an absolute biological event, the space between life and death may be blurry and influenced by often-competing forces. This course will explore historical, anthropological, ethical, and medical constructs around death and dying, brain death and organ transplantation. Through in-classroom and experiential learning, we will compare the US and Japanese perspectives and will include unique cultural, ethical, and medical experiences in Osaka and Kyoto, Japan.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222228",
        "number": "OSPGEN 29",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "47",
        "title": "Governance, Culture, and Innovation in Oxford",
        "description": "The most prestigious research universities are esteemed, among other reasons, for fostering innovation. In this course, students will be part of a research team that will investigate the oldest of what Times Higher Education calls the &quot;superbrand&quot; universities - Oxford - in a comparative study with the youngest of the superbrands: Stanford. In the past four decades, both the University and City of Oxford have emerged as hubs of innovation - replicating in some ways the success of Stanford in cultivating Silicon Valley.  We will investigate questions such as the following: How is Oxford governed, and how has this changed over time? How does this governance differ from Stanford and its surrounding communities? In what ways is Oxford culturally different from (or similar to) Stanford, and how does culture show itself in the city and in the university today? How have the barriers to central coordination in Oxford been overcome? How does Oxford's model for innovation work, and what can students learn from it? How does innovation fit (or not) with Oxford&iquest;s emphasis on tradition? Date(s) of course:  August 28-September 15, 2023",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "225052",
        "number": "OSPGEN 47",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "48",
        "title": "Jordanian Futurities between Ancient Antiquities and Performances of Urban Life",
        "description": "Present-day Hashemite Kingdom of Jordan is the site of remarkable civilizations of Antiquity. In Jordan, the Eastern civilizations of Ammon, Moab, Canaan, Assyria, and Babylon thrived as did the Romans and the Persians. Today, the most visible of Jordan's ancient world are the Roman, Nabatean, and Islamic civilizations. The proposed course takes cultural artifacts as the foundational blocks of the Levant, asking a fundamental question about how a contemporary state exists on top and beside the ancient past, by exploring three cities: Petra, Jerash, and Amman. All three cities have large Amphitheatres that suggest a particular pattern of growth over time, and play a major role in how these cities function today as tourist attractions and geography for performances of everyday life. In these three case studies, students will investigate how theatre and performance, along with culture in its broadest definition, have shaped the destiny of the Levant historically and the present-day Hashemite Kingdom. We will ask: How did three major metropolitan cities that stretch back to antiquity develop into very different urban living spaces today? Why do all of them have a massive theatrical space in their midst? What conclusions can be drawn from the stunted development of Petra, the semi-developed city of Jerash, and the highly developed capital city, Amman, based on the position and the level of activity in their theatrical spaces over time?",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224114",
        "number": "OSPGEN 48",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "53",
        "title": "Corals of Palau: Ecology, the Physical Environment, and Reefs at Risk",
        "description": "Coral reef ecology, biogeochemistry, physics with a view towards developing science-based solutions for coral reef protection and management.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "214075",
        "number": "OSPGEN 53",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "58",
        "title": "Stoking an ancient flame: Ceramics intensive in Tamba",
        "description": "The Tamba region near Kyoto, Japan, has been a center of pottery production for over eight centuries.  In many ways, medieval stoneware pottery of Tamba and Japan&iquest;s other &iquest;six ancient kilns&iquest; can be seen as forebears of what we now know as the wabi-sabi aesthetic of Japanese tea culture.  Today, surviving heirloom pieces such as jars (tsubo) and flower vessels (hanaire) serve as inspirational archetypes for surging international interest in the revival of styles and methods of traditional Japanese wood-fired ceramics (yakishime).  In this Bing Overseas Seminar, Stanford students will travel to Tamba to undertake an intensive introduction to forming and firing clay.  Lectures, discussions and studio demos will build a broad view of traditional aesthetic elements of yakishime, but at the same time, students will be encouraged to explore a modern individualistic approach to creative process to help them develop their own expressive forms.  The seminar culminates in a traditional wood firing reaching kiln temperatures in excess of 2300F, which is a process that one must experience first-hand to viscerally comprehend.  A final critique of student work will probe the complex interplay of natural materials, creative vision, manual skills and serendipity in this most ancient yet vital paragon of the arts of fire.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "222230",
        "number": "OSPGEN 58",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "60",
        "title": "Earth's 3rd Pole: Coupled Human-Natural Systems in the Khumbu Valley, Nepal",
        "description": "Through place-based exploration of the Khumbu Valley, Nepal, this field seminar focuses on the complex relationships between mountain and glacial geomorphology, culture and religion, land use in extreme environments, climate change, and sustainable resource development and management. An analysis of the coupled human-natural systems of the Khumbu Valley provides a unique lens for students to interpret broader resource management and conservation issues. The curriculum balances field explorations, classroom lectures, and meetings with government officials, NGO staff, national park managers, Sherpa leaders, and several Buddhist Lamas.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222231",
        "number": "OSPGEN 60",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "61",
        "title": "SETS: Sustainable Water and Sanitation in Southeast Asia",
        "description": "This course investigates sustainable water and sanitation management through connections with water, energy, and food scarcity in Southeast Asia. Upon completion of the course, students will demonstrate improved understanding of: (1)The linkages between food, energy, water, and sanitation provision(2)Key challenges and opportunities facing each sector, and cross-cutting solutions(3)Ways in which industries, governments, and research institutions envision resource efficiency in the 21st century.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222232",
        "number": "OSPGEN 61",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "63",
        "title": "Bio-Cultural Diversity and Community-Based Conservation in Oaxaca",
        "description": "Interdisciplinary seminar emphasizing two major areas of study: biological sciences (ecology) and culture (the human dimensions of conservation and use of natural resources based on indigenous traditional knowledge). Challenges and opportunities of interacting with researchers and students from other cultures; analysis of the ways in which academic institutions and rural, indigenous institutions are, jointly, undertaking the challenge of sustainably managing biological resources. Location: Mexico City and Oaxaca, Mexico.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "216819",
        "number": "OSPGEN 63",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "74",
        "title": "St. Petersburg: Imagining a City, Building a City",
        "description": "St. Petersburg, the world's most beautiful city, was designed to display an 18th-century autocrat's power and to foster ties between Russia and the West on the tsar's terms. It went through devastating floods and a deadly siege; it birthed the Petersburg myth, poems and prose that explore the force of the state and the individual's ability to resist. This class addresses the struggle between the authorities and the inhabitants; the treacherous natural environment; the city as a node in national and international networks of communication; the development of urban transportation networks; and the supply of goods",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "220114",
        "number": "OSPGEN 74",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "79",
        "title": "Preserving Biodiversity: Conservation Photography in South Africa",
        "description": "Conservation photographers photograph the natural world, animals and plants, and people that threaten, protect or study wildlife and ecosystems, with the goal of advocating for specific conservation outcomes.  We will actively practice conservation photography to address biodiversity and environmental issues in national, regional and private reserves in South Africa. Explore the fundamentals of creative&nbsp;cooperation in small teams, with the goal of producing effective photoessays. Workshops and guest speakers will address issues of biodiversity, wildlife management, poaching, ecotourism, and community engagement with conservation. Daily field trips culminate in group and individual projects. Location: Kruger National Park and surrounds, South Africa.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "220110",
        "number": "OSPGEN 79",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPGEN",
        "code": "259",
        "title": "Community Health in Oaxaca",
        "description": "Close observation of clinicians at work in community health settings in Oaxaca and service with local community health organizations. Combination of classroom study and discussion with cultural immersion, language training, clinical shadowing, and community service. Topics include: Mexican healthcare system; cultural, socioeconomic and educational factors impacting health of Mexicans and Mexican immigrants to U.S.; Mexican cultural and health beliefs; Mexican migration as a multi-ethnic process.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "214452",
        "number": "OSPGEN 259",
        "units": [
            2
        ]
    }
]