[
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "14",
        "title": "China's Strategic and Diplomatic Cultures",
        "description": "This course looks at the ways in which diplomacy and strategy have developed in the Chinese context. It examines Chinese strategic and diplomatic cultures through key historical texts, case studies, and contested ideas about Chinese approaches to international politics in peace and war. A theme of the course will be the question of how history and culture are understood in the present and what this can tell us about contemporary China. CUHK Course code: CHES3006, Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223806",
        "number": "OSPHONGK 14",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "15",
        "title": "State and Market in Modern China",
        "description": "This course examines the political economy of China's development from the perspective of state-market relations. It situates China's case in the broader context and debates on the role of the state and markets in economic development and transition. It will cover topics including the political logic of China's economic reform, the institutional foundations of China's growth miracle, China's corporate sector reforms, China's industrial and innovation policy, corruption/anti-corruption, China's integration into the world economy, Chinese financial reforms, among others. Students will gain a deeper understanding of why and how China has reformed and grown rapidly; and to what extent China's experience may be generalized as a model for other developing countries. CUHK Course code: CHES2109. Enrollment limited",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223804",
        "number": "OSPHONGK 15",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "18",
        "title": "Cantonese Taster Course for CUHK International Students",
        "description": "(This course is offered via asynchronous online mode. Students should register the course via KEEP, a CUHK eLearning platform where the course materials are uploaded.)This course is an asynchronous online course offering to CUHK international students. This taster course focuses on helping students engage in basic daily social interaction using Cantonese.CUHK # CLCC1001Enrollment is limited",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224768",
        "number": "OSPHONGK 18",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "20",
        "title": "Financialization and China's Development",
        "description": "This course examines the political economy of China's transition and development from the perspective of financialization. It situates China's case in the broader context and debates on the role of financialization in reshaping the contemporary socio-economic governance and the relations between the financial sector and real sector economy. It will cover topics including the logics of financialization, financial repression and financial liberalization, China's financial governance, industrial policy and financialization, corporate governance, commercial banking and shadow banking, development finance, capital market, public investment, law and finance, risk management, innovation and regulation as well as RMB internationalization. CUHK Course code: CHES3011, Enrollment limited",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223820",
        "number": "OSPHONGK 20",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "21",
        "title": "China's Business Environment in Historical Perspective",
        "description": "China's transition from a centrally planned company to a more market-oriented system has been a remarkable process of reform and opening up. Business in China has been accordingly transformed. This course discusses the evolution of business sector development in contemporary China during the recent decades. Using economic reforms as the overall framework, it combines institutional analyses with business histories and company-level case studies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221833",
        "number": "OSPHONGK 21",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "22",
        "title": "China's Financial Reforms - Problems and Perspectives",
        "description": "This course examines the key aspects of China's institutional reform and political-economic development since the 1970s. It reviews the major policy controversies on China's system transition, based on leading research contributions from the academia, policy think tanks and international institutions. Students will gain a deeper understanding of why and how China has reformed; and to what extent China's experience may be generalized as a model for other developing countries.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221834",
        "number": "OSPHONGK 22",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "24",
        "title": "Urban China",
        "description": "Socioeconomic, political, and cultural facets of urbanization with a regional focus on China. Critical observation and analysis of the process of urbanization and its lived experiences in the Chinese context. Comparative lessons from other regions for comparative understanding of the complex processes of urbanization across the globe. Critical investigation of urban issues ranging from land politics, urban planning, urban governance, to citizen rights, urban space, and urban culture. Overview of China's quest for modernity and its urban transformation since the late imperial era, followed by an interdisciplinary approach to examine China's unprecedented urban development in the post-reform era. Hands-on field trip in Hong Kong to take full advantage of Hong Kong as a global city.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221846",
        "number": "OSPHONGK 24",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "25",
        "title": "Cultural History of China",
        "description": "Multi-disciplinary approach to the study of Chinese cultural history conceived of as a succession of modes of rationality (philosophical, bureaucratic, and economic processes of rationalization). Focus on the moments of paradigm shift from one mode of rationality to another. For moment, examine cultural facts and artifacts&iquest;thought, literature, ritual&iquest;in relationship to changing social, political, and economic systems. This semester, focus on the emergence of modern China in the Song-Yuan (960-1368) and of today's China 1850 to the present. How the modern attack on religion, redefined as &quot;superstition&quot;, led not only to religious reform movements but also to a society in which science and the nation became the primary value systems promoted by the state.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221837",
        "number": "OSPHONGK 25",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "26",
        "title": "East Asian Film Genres in a Globalizing World",
        "description": "Connections between different cinemas within East Asia and between East Asia and the rest of the world explored from a genre perspective. Hong Kong and Korean gangster movies, Chinese swordplay and Japanese samurai films, and horror films from Japan and Thailand as examples of the transnational circulation of genres, involving processes of both localization and globalization. Focus on three interrelated genres: the martial arts film, the Eastern Western and the film noir/crime film. Explore Hollywood-centered genre theory, trace complex webs of creative influences, and appreciate the sameness and difference that characterizes both genre films and our globalizing world. Make a short &quot;genre film&quot; for screening at the end of the term",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "221838",
        "number": "OSPHONGK 26",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "27",
        "title": "China and Regional Order",
        "description": "This course looks at China's changing political, economic and security relationships in Asia through frameworks in the International Relations literature. It contextualizes China's external relationships across Asia-Pacific in the ongoing evolution and negotiation of Asian regional order and institutions in the aftermath of the Cold War, and argues that this context helps account for the objectives of and some apparent ambiguities and contradictions in Chinese foreign and security policy. Three parts: context and background; empirical view of developments involving China's international relationships in Asia; theoretical frameworks to evaluate China's relations with regional order.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221835",
        "number": "OSPHONGK 27",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "28",
        "title": "An Introduction to the Development of Science and Technology in China",
        "description": "Science and technology in China from antiquity to the present is surveyed through the study of selected topics in some depth. Particular emphasis is given to science and technology as a window to appreciate certain aspects of Chinese culture and history. Two important questions are explored through contrasting China with the West: the conditions for the development of modern science and the central role of science and technology in modernization.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221832",
        "number": "OSPHONGK 28",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "29",
        "title": "The Rise of China in the Global Context I: Diplomacy, Trade, and Soft Power",
        "description": "The &quot;Rise of China&quot; from the perspective of Global Governance, shedding light on its diplomatic, trade and cultural relations with others in the Global Community. Critical analysis of the transformation of Chinese foreign policies since the establishment of the People's Republic of China and the momentum behind this change of practices. Topics include: history and evolution of Chinese foreign policies; analytical framework of policy-making process in China, particularly in handling foreign and security affairs; foreign relations with both the developed and developing nations; booming economy and integration with the global economy; assessment of the rhetoric of &quot;Peaceful Rise&quot; and &quot;Charm Offensive&quot; with reference to the Confucius Institute.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221843",
        "number": "OSPHONGK 29",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "30",
        "title": "Investigating Hong Kong Through Multidisciplinary Lens",
        "description": "Introduction to Hong Kong society with a particular focus on the social and cultural dynamics of contemporary Hong Kong. Some of the central questions include: What is so unique about Hong Kong? How do a Hong Kong in the past and some of the special features of the Hong Kong society contribute to a transforming China? Topics may include: (1) historical trajectory of Hong Kong; (2) identity formation: from migrants to local Hong Kong; (3) the making of Hong Kong: urban development as a case; (4) the paradise of capitalism and the Hong Kong miracle; (5) governance and politics; (6) foodways and heritage; (7) religion and folk beliefs; (8) the great transformation: Guangdong-Hong Kong-Macao Greater Bay Area initiatives. Also enroll in CUHK course # IASP2600. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "15140",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wong, S.",
                                "sunet": "sukying"
                            },
                            {
                                "name": "Doyle, A.",
                                "sunet": "addoyle"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221855",
        "number": "OSPHONGK 30",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "31",
        "title": "Religion in Modern Society",
        "description": "Modernity has long been imagined as a kind of a secular space and time, empty of religion. Yet,religion is found in modern societies everywhere, often thriving and influencing politics, culture, andcivil society. The majority of Hong Kongers identify as non-religious and yet signs of religious beliefand practice abound throughout the city. Why? In this course, students will study how sociologistshave theorized and investigated religion and modernity together. We will not focus on any particularfaith, doctrine, or systems of beliefs and ritual. Instead, we will emphasize the relationship of&quot;religion&quot; &iquest; broadly defined &iquest; to other social formations, such as cultural solidarity, gender hierarchy,capitalism, state regulation, political movements, marketplace competition, and democracy. Thecourse will introduce classical and contemporary social science theories and also explore specifictopics related to religion in Chinese societies. Students will be asked to think, discuss, and write aboutbig ideas and bold arguments. Pandemic allowing, we will also do optional field trips to religious sitesin Hong Kong.CUHK course code: SOCI4209Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224683",
        "number": "OSPHONGK 31",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "32",
        "title": "Fintech and Entrepreneurship in China",
        "description": "Introduction to the concepts essential to the entrepreneurial process and a look at the role of the individual and teams within high-impact ventures, intended for sophomores, juniors, and seniors of all majors. Case studies, lectures, workshops and mentor-guided team projects cover high-growth ventures involving technology, with special emphasis on the significance of entrepreneurship, blockchain/AI/ML related to financial innovation and opportunities in Hong Kong and China more broadly. Explore both financial innovation for high net worth as well as &quot;bottom of the pyramid&quot; individuals and ethical issues in startups. No prerequisites. Also enroll in CUHK course # EPIN4010. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "28079",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Eesley, C.",
                                "sunet": "cee"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221797",
        "number": "OSPHONGK 32",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "33",
        "title": "Comparative Analysis of Entrepreneurship and Innovation: Fintech in Hong Kong and Silicon Valley",
        "description": "Independent research and analysis of the historical, current, and future potential for high-growth entrepreneurship in Hong Kong, China and its surrounding region. How entrepreneurship in China compares to Silicon Valley and other similar innovation clusters today around the globe. Special emphasis on financial innovations such as bitcoin, blockchain, AI/ML applications in finance and insurance. Role of context with respect to entrepreneurship and innovation through direct contact with entrepreneurs, interviewing potential customers, professional investors, innovation education centers, policy makers, government officials, and any NGOs involved with entrepreneurship.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "221854",
        "number": "OSPHONGK 33",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "34",
        "title": "Chinese Legal and Justice Cultures",
        "description": "Course in Development",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224682",
        "number": "OSPHONGK 34",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "36",
        "title": "Understanding Masculinities and Social Change",
        "description": "This course examines men's diverse experiences as boys/men and public discourses and practices about masculinities. It will focus on how the gendered social order influences men's actions and the way men perceive themselves, other men, women, and social situations. It will pay special attention to the exploration of the relationships between multiple dimensions of social relations and inequalities including gender, race/ethnicity, class, and sexual orientation. It will address issues including but not limited to: male socialization, boyhood culture, male body images, male friendship, male sexuality and fertility, men's experiences as fathers, male aggression and violence, men's commitments to work, men's social participation, and media representations of boys and men in contemporary culture. It will also explore female masculinities and queer masculinities and to what extent they post challenges to hegemonic masculinity. Students will be introduced to the latest developments and their global networks, and to evaluate the prospects for social change in how men may think, feel, and act otherwise.CUHK course code: GDRS3007Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224681",
        "number": "OSPHONGK 36",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "37",
        "title": "Economics and Society",
        "description": "An aim of economics is to study the interaction of individuals' decisions and how marketssolve the problems of resource allocation. This course uses economics to study certainpressing problems that society faces today.Topics include pollution, global warming, economic growth, inflation, unemployment,poverty, economic fluctuations and the role of government in stabilizing the economy. Inthe process of studying these problems, students get some exposure to economics andat the same time, come to understand society more deeply.On completion of this course, students should be able to understand basic concepts usedin economics, know how the market works, apply economics to study environmentalproblems, understand the economic nature of social problems.CUHK course code: ECON1210AEnrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31475",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224680",
        "number": "OSPHONGK 37",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "39",
        "title": "Studies of Cities in Comparative Perspective",
        "description": "This course introduces students to the studies of comparative urbanism. Urban studies havestrong west-centric and modernist biases that designate specific cities as universal modelsfor city-proper status and/or as harbingers of new urban forms. Drawing on postcolonial andpoststructuralist critiques, the course aims at aiding future urbanists to explore a world ofcities beyond developmentalist perspectives and the fetishization of novelty. The studentswill instead learn to become aware of and analyze the complex and interconnectedmanifestations of urban forms and experiences across different times and places. CUHK course code: URSP2400Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31452",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224679",
        "number": "OSPHONGK 39",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "41",
        "title": "Introduction to Creative and New Media",
        "description": "Introduction to the creative aspects of the mass media, media art, new media and popular culture. Enhance students' creative, aesthetic as well as intellectual ability to evaluate different media art forms and expression. Topics include art theory, aesthetics, theories on creativity, technical and commercial aspects of various forms of production and popular culture.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "221841",
        "number": "OSPHONGK 41",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "42",
        "title": "Gender and Sexuality in Contemporary Society",
        "description": "Examination of gender and sexuality from a contemporary and regional perspective. Based on a cross-cultural perspective, read and analyze different meanings of gender and sexuality, and how these meanings are constructed. How gender relations and sexual politics are related with historical backgrounds, cultural heritage, market expansion, ideological shifts, and capitalist dynamics in a context of modernization campaigns and globalization processes. The topics of gender and sexuality interwoven with that of migration, work, family, popular culture, mass media, and consumerism.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "221839",
        "number": "OSPHONGK 42",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "43",
        "title": "Mainstream Chinese Philosophical Thought",
        "description": "Introduction to the philosophical thought of Confucianism, Taoism, and Buddhism, to provide a deeper understanding of the roots of Chinese values and culture. As a cornerstone of Chinese culture, Confucianism contributes to the establishment of the human moral way by articulating a conception of humans as moral subjects. Taoism stresses the pursuit of an ideal life by understanding the changes of the universe, while Buddhism applies the concept of karma to show how the ultimate cause of human suffering lies in ignorance. Other Chinese philosophical thought such as Mohism, Legalism, and the School of Yin and Yang may be covered.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221842",
        "number": "OSPHONGK 43",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "44",
        "title": "Medical Sociology",
        "description": "From a sociological perspective, dissect issues such as conflicts between patients and doctors; safety of medical treatments and reliability of medical knowledge; inequality in health and longevity; and ever-increasing health care spending. Questions such as: What counts as illness? How do people understand illness? How does illness affect people's life? Who gets ill and why? What is the role of medical technology in fostering health? Why do doctors and patients have trouble communicating? How should health care systems be organized? Also examine some of these issues in the contexts of Chinese societies, such as China and Hong Kong with comparative perspectives.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221845",
        "number": "OSPHONGK 44",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "45",
        "title": "Chinese Culture and Society",
        "description": "An anthropological approach to China. Discussions concentrate on major cultural and social institutions of China, both traditional and contemporary, such as family, marriage, kinship, lineage and clan, economic system, religion and value orientation.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221836",
        "number": "OSPHONGK 45",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "47",
        "title": "China on Screen",
        "description": "Many 20th-century Chinese films were concerned with issues of nationhood, identity, trauma, and a national past. In recent years, however, while some directors have continued to focus on the nation's past, others have chosen to look at the present and the effects of globalization on Chinese society and culture. This course asks that students begin to understand Chinese cinema(s) as transnational, a triangular composite of Mainland, Taiwan, and Hong Kong cinema that has also been influenced by Hollywood, Japanese and Korean cinema, amongst others. Students will be introduced to Chinese film history and criticism via an examination of a number of films directed by some of Greater China's most skilled directors. CUHK Course code: CHES3101, Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223807",
        "number": "OSPHONGK 47",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "50",
        "title": "Survival Cantonese",
        "description": "An introductory course designed to provide international or exchange students a comprehensive Cantonese training covering basic vocabulary and grammar points through various kinds of speaking practices in a casual manner. The course focuses on students' speaking and listening skills. Real life settings are introduced such as shopping, introducing yourself, asking directions, etc. Not equivalent to home campus courses. Also enroll in CUHK course # CLCC1000 You cannot simultaneously enroll in OSPHONGK 51, 52, 53, 54A, 55A, 90, 92. Enrollment limited.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "28392",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Doyle, A.",
                                "sunet": "addoyle"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223805",
        "number": "OSPHONGK 50",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "51",
        "title": "Beginner Putonghua/Mandarin Level 1",
        "description": "An elementary course combining the use of basic vocabulary and grammar points with a focus on communication. Focus on appropriateness in application. Vocabulary based on everyday conversation and daily usage and communication in real life settings such as shopping, introducing family members, and asking directions. Not equivalent to home campus courses. Also enroll in CUHK course # CLCP1113. You cannot simultaneously enroll in OSPHONGK 50, 52, 53, 54A, 55A, 90, 92. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "15148",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Doyle, A.",
                                "sunet": "addoyle"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221950",
        "number": "OSPHONGK 51",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "52",
        "title": "Communication in Context I-Putonghua",
        "description": "The course aims to enrich students' vocabulary and grammar points through language tasks/activities and contextualized exercises. Students will be able to collect information through asking and answering questions and communicate in real-life contexts. Topics include simple self- introduction, common questions related to traveling and providing information, etc. Also enroll in CUHK course # CLCP1133You cannot simultaneously enroll in OSPHONGK 50, 51, 53, 54A, 55A, 90, 92.Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "15147",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Doyle, A.",
                                "sunet": "addoyle"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221949",
        "number": "OSPHONGK 52",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "53",
        "title": "Application of Vocabulary and Grammar II-Putonghua",
        "description": "Course contents focus on familiarizing students with the use of more vocabulary and grammar points. Vocabulary and grammar points introduced in this course are based on everyday conversations and daily usage. Focus will be on appropriateness in application. Also enroll in CUHK course # CLCP2213. You cannot simultaneously enroll in OSPHONGK 50, 51, 52, 54A, 55A, 90, 92. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "15149",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Doyle, A.",
                                "sunet": "addoyle"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221951",
        "number": "OSPHONGK 53",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "54A",
        "title": "Communication in Context II-Putonghua",
        "description": "An intermediate course designed to familiarize students with newly acquired vocabulary and grammar points through language tasks/activities and contextualized exercises in real life settings. Not equivalent to home campus courses. Also enroll in CUHK course # CLCP2233.  You cannot simultaneously enroll in OSPHONGK 50, 51, 52, 53, 55A, 90, 92. Enrollment limited",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "15150",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Doyle, A.",
                                "sunet": "addoyle"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221952",
        "number": "OSPHONGK 54A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "54B",
        "title": "Intermediate Putonghua/Mandarin Level 2 Upper: Basic Presentation Skills & Daily Situations II",
        "description": "An intermediate course designed to help students improve their proficiency to communicate in authentic situations by integrating the newly acquired vocabulary items and grammar structures. Not equivalent to home campus courses. Also enroll in CUHK course# CLCP2253",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221953",
        "number": "OSPHONGK 54B",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "55A",
        "title": "Application of Vocabulary and Grammar III-Putonghua",
        "description": "An upper intermediate course designed to familiarize students with the use of newly acquired vocabulary and grammar points. Focus will be on appropriateness in application. Topics include various aspects on Chinese language and culture. Not equivalent to home campus courses. Also enroll in CUHK course# CLCP3313. You cannot simultaneously enroll in OSPHONGK 50, 51, 52, 53, 54A, 90, 92. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "15151",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Doyle, A.",
                                "sunet": "addoyle"
                            },
                            {
                                "name": "Hon, S.",
                                "sunet": "hansy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221954",
        "number": "OSPHONGK 55A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "55B",
        "title": "Intermediate Putonghua/Mandarin Level 3: Oral Skills Practice III",
        "description": "An upper intermediate course focused on students' fluency in speaking practice with newly acquired vocabulary and grammar points. Topics include various aspects on Chinese language and culture. Not equivalent to home campus courses. Also enroll in CUHK course# CLCP3323",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221955",
        "number": "OSPHONGK 55B",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "55C",
        "title": "Intermediate Putonghua/Mandarin Level 3: Communication in Context III",
        "description": "An upper intermediate course designed to familiarize students with the use of newly acquired vocabulary and grammar points. Focus will be on appropriateness in application. Topics include various aspects on Chinese language and culture. Not equivalent to home campus courses. Also enroll in CUHK course # CLCP3333",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221956",
        "number": "OSPHONGK 55C",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "55D",
        "title": "Intermediate Putonghua/Mandarin Level 3: Basic Presentation Skills & Daily Situations III",
        "description": "A higher intermediate course designed to help students further improve their proficiency to communicate in a variety of authentic situations by integrating the newly acquired vocabulary items and grammar structures. Not equivalent to home campus courses. Also enroll in CUHK course# CLCP3353",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221957",
        "number": "OSPHONGK 55D",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "55E",
        "title": "Listening and Reading Comprehension Skills III - Business Topics",
        "description": "Course contents focus on building up students' listening, reading, and speaking abilities to improve their conversation skills in business settings, such as making an offer, using promotional skills, making a negotiation, etc.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223809",
        "number": "OSPHONGK 55E",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "57",
        "title": "Presentation Skills and Daily Situations",
        "description": "An upper intermediate listening and speaking course in Putonghua and the continuation of CLCP3323. In addition to more daily situations and semi-formal situations, students will also be introduced to more aspects of Chinese culture and society. Through various class exercises and group discussions, students will also have opportunities to present their ideas orally and substantially. Students will be ready for the advanced level of study upon completion of this course.Enrollment is limited.  CUHK course # CLCP3353",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224792",
        "number": "OSPHONGK 57",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "61",
        "title": "Governing China",
        "description": "This course introduces key issues and concepts in politics and governance in contemporary China. It takes a thematic approach, looking at the historical origins of China's contemporary political system, its structures and processes today, the main goals which the system is designed to achieve, and some of the challenges it faces. Throughout, the course will examine different ways that Chinese politics and governance have been analysed and introduce key concepts in the academic literature on Chinese politics. CUHK course code: CHES3010Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224694",
        "number": "OSPHONGK 61",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "63",
        "title": "Understanding Movies",
        "description": "This course helps students develop a critical, analytical eye for watching and understanding films. Students will learn about basic cinematic techniques and structures, including mise-en-scene and montage, use of cinematic time and space, soundtrack, and script through viewing local and international films. Students will also become familiar with theoretical perspectives encompassing culture, ethnicity, gender and ideology, through which they can understand the political, economic and socio-cultural implications of movies. Equipped with these analytical tools, students will be more capable of understanding and analyzing both current domestic films as well as those from different times and places.CUHK course code: COMM2930AEnrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224678",
        "number": "OSPHONGK 63",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "66",
        "title": "Chinese Culture and Society in Transformation",
        "description": "This English-taught, introductory course provides a survey of Chinese culture and society. It focuses on basic social institutions and cultural norms in traditional Chinese society and their modern transformations. The readings, drawn mainly from the disciplines of history and anthropology, cover topics of family and kinship, marriage and gender relations, popular religion and rituals, ethnicity, community institutions, state power and its political control, and rural and urban political economies. The second half of the course draws particular attention to China's constant modernizing efforts in the past century, especially during the socialist revolution and post-Mao reforms, as well as their bearings upon contemporary Chinese social practices and cultural patterns. CUHK Course code: CHES2002, Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223808",
        "number": "OSPHONGK 66",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "70",
        "title": "Modern Chinese Literature",
        "description": "Critical changes in literature and culture took place across the twentieth century in China. These changes were in response to the self-strengthening demands of young revolutionaries after decades of war and national humiliation. Over several decades, Chinese writers experimented with Western literary genres, including realism, romanticism, imagism, modernism, critical realism, magical realism, postmodernism, and so on. Chinese writers constantly probed the issue of literary modernity and attempted to redefine China and Chineseness by incorporating Western influences into classical Chinese aesthetics. This class explores Chinese literary tradition in the twentieth century and early twenty first century through fiction (novels, short stories, poetry, etc.) and films from Hong Kong, Taiwan, and Mainland China. Major themes we will discuss include socio-political reformation, gender relations, urban space, the environment, and individual subjectivity. Creatively engaging with Western influences and classical literary traditions, Chinese writers and filmmakers we examine showcase how the Chinese reconstructed modern literature in relation to China's nation-building process. All readings are available in English translations of Chinese originals. No prior knowledge of Chinese is assumed or required. Also enroll in CUHK course# CHES2105. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31543",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225667",
        "number": "OSPHONGK 70",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "72",
        "title": "China Under Mao",
        "description": "More than four decades after the death of Mao Zedong, the assessment of his twenty-seven years in power in the founding period of the People's Republic of China remains a subject of intense debate inside and outside of China. Much of this involves contestations over China's historical past and Maoist legacies for the future that both are primarily concerned with politics in the present. Historians, meantime, are more deeply engaged than ever before in seeking to advance our understanding of how this era and its events emerged and developed as they did, and what its consequences have been for China today. The quest to illuminate the historical processes contributing to this era of turbulent elite politics, chaotic and often horrifically violent revolutionary political campaigns, and unprecedentedly vast state-directed restructuring of the economy, culture, and nearly all aspects of society has been joined by an interest in the related human and natural costs, the lived experiences, and the diverse forms in which local societies at the grassroots distant from the central government adapted their own variations of life under Chinese socialism. This upper-level course invites students to join the exploration of a history of great consequence that is still in the early stages of being brought to light. Also enroll in CUHK course# CHES3003. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31607",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221853",
        "number": "OSPHONGK 72",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "74",
        "title": "Consumer Culture in Contemporary China",
        "description": "This course offers an overview of China's consumer culture. Since embarking on its reform andopening-up policy in 1978, China has transformed from a command economy to a market-orientedsystem and achieved over three decades of rapid growth. Chinese society has also undergone an allencompassing socio-cultural change, from a proletarian culture in the Mao era to a burgeoningconsumer culture today. This course will address both the historical processes of cultural changes andmajor consumer issues in contemporary China. It aims to provide a roadmap for students to develop acritical perspective on China's consumer culture. In essence, the class explores what it means tobelong to a consumer society with &quot;Chinese characteristics&quot;. We will start by introducing core concerns,arguments, and approaches related to consumer culture in China. After the introductory sessions, wewill focus, week by week, on common (and oftentimes controversial) consumer issues we encounterin our daily lives. We will read works covering various consumption experiences while paying specialattention to how consumer culture, embedded in the specific economic, political and socio-culturalmilieu of contemporary China constructs our ways of &quot;being-in-the-world&quot;. We will also look into thedetrimental aspects of consumer culture, including its psychological and ethical impacts, class andgender exploitation, and environmental degradation. Students are encouraged to examine their ownconsumer values and behaviors, join in conversation with the existing critics of China's consumerculture, and offer their own reflections. CUHK course code: CHES2104Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224677",
        "number": "OSPHONGK 74",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "76",
        "title": "Cultural and Creative Industries",
        "description": "This course examines issues surrounding Cultural and Creative Industries (CCI) in contemporary societies. The course traces the development of cultural and creative industries in both the academic field and the industry world. Using cultural studies theories as the backdrop, the course investigates issues related to the CCI that intersect culture, economy, technology and industry. Unlike typical cultural studies curriculum that emphasizes on critical scholarship in the cultural field, this course incorporates critical curriculum into the areas of business culture and financial management in transnational cultural corporations. The course investigates the marketing aspects of cultural and creative industries both within Asia and Hong Kong. It contains three parts in order to provide comprehensive overview of the CCI field. The course first begins with an introduction of the basic constitution of the CCI in Hong Kong. This understanding of Hong Kong's CCI sets up the main perspective as the course continues to discuss the historical development of cultural and creative industries in other parts of the world. The second section of the course covers important topics relevant to the CCI at the theoretical level. The topics include critical history and definition, cultural and creative industry theories and emerging themes in the CCI. Weekly discussion covers industry issues such as production, consumption, market, place, value chain, informal economy and digital distribution. The course also covers management curriculum as students learn concepts such as creative management, digital disruption, cultural entrepreneurship, technological innovation and strategy planning in social media environment. The third section of the course includes practical case studies, which require students to focus on specific cultural products, commercial art works and performing art shows in Hong Kong, China and Asia. The ultimate goal of this course is to encourage students to develop creative entrepreneurship based upon cultural and industry knowledge learnt in this course. Students are required to present a case analysis of his or her own in the final project to demonstrate the comprehensive learning of the cultural and creative industries in this course. Also enroll in CUHK course# CURE3027. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31608",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225669",
        "number": "OSPHONGK 76",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "77",
        "title": "Gender Studies: Special Topic I",
        "description": "Tinder, Grindr, Her - are these on your phone? In 2022, there were over 360 million online daters worldwide. This course provides an interdisciplinary approach to look into one of the latest and most widely discussed online cultures - online dating and hookups. Departing from the public health approach that focuses exclusively on sexually transmitted diseases via the use of online dating platforms, this course examines the communicative, technological, and social aspects of online dating and hookup culture. Topics include online relationship development, motivations of app use, app design, gender politics, and queer world-making. Cases will be drawn from different regions. Students will be invited to design their own dating apps, compare courtship practices on and off the apps, and play the role of app administrators. By the end of the course, students will be able to identify the opportunities and challenges dating and hookup apps bring to different groups of users and take up a responsible mindset when using online dating platforms. Some required reading requires basic quantitative reasoning. Also enroll in CUHK course# GDRS3001. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31894",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225670",
        "number": "OSPHONGK 77",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "78",
        "title": "A Screen of One's Own: Women and Films",
        "description": "This course examines the rich tradition of feminist film theory and provides students with an understanding of its main concerns and debates. Topics will include the key semiotic and psychoanalytic approaches of the 1970s-1990s, classic films which have inspired feminist debate, avant-garde cinema, local cinema, independent cinema, and postmodern cinema, as well as recent cinematic re-conceptualizations and exploration of gender and sexuality local and abroad. In systems of representation from fine art to mainstream cinema to advertising, women have been constructed and existed as spectacle or passive object &quot;to-be-looked-at&quot;, ? in Laura Mulvey's now often quoted words. Following her trail, feminist critics turned their attention to mainstream films and popular media addressed to female spectators and exposed the contradictions within and between the notion of &quot;women's pictures&quot; and the diversity of female experience. Local cinemas and independent creators also tell their own unique stories of women's lives in dramatically different cultural contexts. Critics from other fields further complicate these images by examining them through lens including race, class, ability, queerness, and more. Mulvey's groundbreaking analysis of gendered looking relations in classical Hollywood cinema has since generated numerous analyses of the place of women as spectacle or passive object in films &quot;cut to the measure of [male] desire.&quot; Critics around the world showed how different groups of women attempt to take control of their positioning through viewing or using texts in their own ways, and by creating their own. What happens when female-identified artists, audiences, and theorists look back, and seek to rebel against such cinematic traditions by experimenting with alternative visual languages and narrative tools? This course starts with the paradigm of narrative film analysis that Mulvey outlined in the 1970s and move on to explore a wider range of questions in feminist film studies, including spectatorship, authorship, popular culture, character stereotypes in genre films, self-representation, (g)local cinema, and new feminist media. Students would be introduced to trailblazing works by female filmmakers worldwide, special focus will be placed onto important works in Hong Kong cinema for critical examination and comparative studies. Through critical reflections on notions such as gender stereotypes, representation, power, diversity, and equality, the course engages directly with the Sustainable Development Goals (SDGs) adopted by all United Nations Member States in 2015 by engaging directly with the SDGs 5 (Gender Equality) and 10 (Reduced Inequalities). Also enroll in CUHK course#GDRS3026. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31610",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225671",
        "number": "OSPHONGK 78",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "80",
        "title": "Sustainable Urban Transport",
        "description": "Sustainability issues are increasingly addressed in the planning and development of urban transport. Our understanding of sustainable development has changed the ways we handle passenger and freight transport. This course will introduce urban transportation issues from the social, economic, and environmental perspectives. Transport policies, programs, and tools for sustainable communities will be introduced. While sustainable mobility and freight movement will be discussed in the course, the focus will be on issues related to personal mobility and accessibility. Also enroll in CUHK course#URSP3300. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31614",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225672",
        "number": "OSPHONGK 80",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "82",
        "title": "Music, Culture and Society",
        "description": "This course explores music as a fundamental human practice, and introduces the study of music as central to broader humanistic inquiry. By engaging with styles and performance practices from various regions and historical eras, students will develop an understanding of the diverse ways in which music intersects with human experience, culture, and history. To this end, the course employs an issue-based approach. The first several class sessions deal with fundamental questions about music, such as: What is music? How do musical sounds communicate meaning? What are the relationships between musical sounds, contexts, listening habits, and human behavior? How and why do scholars study music? The remainder of the semester is devoted to particular case studies that explore music's relationship to other realms including politics, religion, identity, and globalization. The class is structured around interactive lectures, demonstrations, discussion, and in-class group activities. No prior musical background or training is required. Also enroll in CUHK course#MUSC1000. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31611",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225673",
        "number": "OSPHONGK 82",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "88",
        "title": "Meanings of Life",
        "description": "Learn about the processes through which individual meanings of life are formed and negotiated between individuals and their societies; you will learn this through reading and analysis of individual life stories in Japan and the United States. You will also learn about the evolution of senses of meaning indifferent societies across human history, from prehistory up until the present and future. These two areas of learning will enable you to think about societies past and present and about lives lived within these societies from a new perspective. You will also perhaps learn about how to think about your own life and meaning in a deeper and more conscious way; although this course is academic, it transcends the academic, to have a potential impact on your own thinking about your life. Although this course examines meanings of life from an anthropological perspective, no prior knowledge of anthropology is required: you can apply what you learn in this course to a wide range of disciplines and endeavors. Also enroll in CUHK course#ANTH2350. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31473",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Doyle, A.",
                                "sunet": "addoyle"
                            },
                            {
                                "name": "Mathews, G.",
                                "sunet": "ql388n"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224676",
        "number": "OSPHONGK 88",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "89",
        "title": "Ethnic, Groups, Ethnic Relations and Identities",
        "description": "This is an interdisciplinary course aimed at investigating ethnicity and identity in relation to international migration in Hong Kong and globally. The course will offer a broad introduction to key theories and themes in ethnicity and migration situated in ethnographic research and practical experience for students to acquire analytical tools to think critically about where we position ourselves in the world we live in. The course will touch issues related to cross-border mobility, social/ethnic boundaries, and diversity. Asylum, labour, and the urban will be given particular attention, to unpack why ethnicity matters today more than ever.Also enroll in CUHK course#ANTH4210. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31474",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Doyle, A.",
                                "sunet": "addoyle"
                            },
                            {
                                "name": "Vecchio, F.",
                                "sunet": "fvecchio"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224675",
        "number": "OSPHONGK 89",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "90",
        "title": "Application of Vocabulary and Grammar I-Cantonese",
        "description": "An elementary course designed to familiarise students with the use of romanization, basic vocabulary and sentence structure. Vocabulary introduced is based on everyday conversations and daily usage. The focus will be on appropriateness in language use. Also enroll in CUHK course# CLCC1113. You cannot simultaneously enroll in OSPHONGK 50, 51, 52, 53, 54A, 55A, 92. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31612",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225674",
        "number": "OSPHONGK 90",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPHONGK",
        "code": "92",
        "title": "Advanced Communication Skills and Culture I Putonghua",
        "description": "The course is designed to enhance students' language skills in communication, as well as to increase their understanding of Chinese social customs and culture through a series of training, including listening comprehension, special report, group discussion, etc. Also enroll in CUHK course# CLCP4453. You cannot simultaneously enroll in OSPHONGK 50, 51, 52, 53, 54A, 55A, 90. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": "For students participating in the Bing Overseas Studies Program in Hong Kong only.",
                "classId": "31613",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225675",
        "number": "OSPHONGK 92",
        "units": [
            4
        ],
        "totalSections": 1
    }
]