[
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "10",
        "title": "Basic Turkish I",
        "description": "An introduction to the four language skills (listening, speaking, reading and writing) in Turkish, and to the Turkish culture in order to develop basic communication in the target language for beginner learners. Enables students to understand basic greetings and routine phrases; to pick out familiar words and phrases in simple texts; to join in basic conversations; to be able to talk about daily activities and write simple phrases/sentences.KU course # TURK 201",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": null,
                "classId": "31590",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224730",
        "number": "OSPISTAN 10",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "15",
        "title": "History of Modern Turkey",
        "description": "Social, political and cultural history of Modern Turkey from the last decades of the Ottoman Empire in the late 19th century until Today. Themes include transformation from a multi-national empire to a national republic; Islam, secularism and radical modernism; military, bureaucracy and democratic experience; economic development, underdevelopment and class; Istanbul, Ankara and provincial Turkey; socialism, conservatism(s), and Kurdish challenge; Turkey in Europe, the Middle East and Central Asia; geopolitics and Turkey's relation with the US and Russia; rise of populist authoritarianism and democratic opposition",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224407",
        "number": "OSPISTAN 15",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "20",
        "title": "Dealing with Data",
        "description": "Dealing with data is a fundamental skill for the modern world. In this course, we will learn two broad dominant paradigms for how to deal with data. The first way deals with extracting causal relationships from data. The second way focuses on summarizing and describing patterns in data. Building from first principles, we will explain the basic ideas and concepts behind each of these approaches, and explore how they relate to each other. Throughout the course, we will see plenty of examples from across computer science, engineering and economics.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31447",
                "currentClassSize": "0",
                "maxClassSize": "11",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sorkin, I.",
                                "sunet": "sorkin"
                            },
                            {
                                "name": "Wootters, M.",
                                "sunet": "marykw"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR"
        ],
        "objectID": "225123",
        "number": "OSPISTAN 20",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "44",
        "title": "Listening to Istanbul: Music in Context",
        "description": "A musicological survey of Istanbul. From Byzantium to today, the music of various residing cultures, subcultures, and communities will be investigated, including different traditions, performers, styles, and genres. While the main concentration is on music, contextual backgrounds would be reviewed. Scholarly and popular texts from various sources and a rich musical repertoire will be covered.KU course # HUMS 135",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31591",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225685",
        "number": "OSPISTAN 44",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "47",
        "title": "International Conflict and Security",
        "description": "This course examines conflict in the international system. Upon completion of the course, you should have a better understanding of some of the main discussions in the study of violence involving political actors. In addition, you will possess the necessary analytical tools designed to deepen your understanding of past, present, and future violence in world politics as well as to engage in further research.  Our focus will be on understanding peace and war as general political phenomena.  Readings in the course are of two major types. Some of the readings are theoretical explanations for peace and war offered by scholars, which we will discuss and evaluate.  Others use data, in the form of history, as examples of applications of concepts and theory to the real world.  While this course is not intended as a detailed description of violence through history, we will see many forms and examples of violence as well as attempts at addressing violence during the course of the semester. Connections will be made to sustainability where and when appropriate. We will start from rather basic levels but students who have little or no background in international relations and world history should bring this to my attention during the first week of class.  KU Course # INTL 374",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31594",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225686",
        "number": "OSPISTAN 47",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "48",
        "title": "Gender and Politics",
        "description": "This class critically explores a variety of political, social, and economic processes through a gendered perspective. It perceives gender as an analytical category that continues to be shaped and reshaped as part of our everyday realities. Thus, this course is not about women's participation in formal political mechanisms. It considers femininities and masculinities together and conceptualizes politics outside of formal political procedures. The course is divided into three parts. During the first few weeks we begin by reviewing some of the processes through which gender has been constructed and how it can be used today as an analytical category. We specifically investigate complex notions such as gender, sex, femininity, masculinity, intersectionality and apply them to our understanding of politics, political economy and power.  In the second and third parts of the course we use this foundation to explore various intersectional inequalities that govern everyday lives. We revisit various issues of everyday politics and political economy from the perspective of often invisibilized experiences. We analyze a number of contemporary institutions, discourses and practices through themes of nations and states, ideologies of citizenship, labor practices and processes, development, economic globalization and international governance. By the end of this class, you will have the following competencies: (1) a working knowledge of main concepts of gender studies; (2) a mastery of main principles of feminist epistemology and methodology; (3) ability to apply these concepts and principles to political science problems; and (4) capability to analyze our everyday lives and problematize the multi-layered gender inequality problems around us.  This course will begin online. The format will be updated with respect to public and university administration decisions. Lecture videos will not be available. However, PowerPoint slides and any supplementary material used in class will be available via Blackboard at the end of each week. You are encouraged to take this class if and only if you have already successfully completed a minimum of two years of course work toward your BA, and at least 2 of the following: introductory courses in political science, sociology, anthropology, and comparative politics.KU Course # INTL 325",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31595",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225687",
        "number": "OSPISTAN 48",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "56",
        "title": "Introduction to Turkey",
        "description": "This course offers an immersive journey into the rich cultural tapestry, history, geography, and contemporary dynamics of T&iquest;rkiye. Designed to provide a comprehensive understanding of this vibrant country, the course delves into various aspects of T&iquest;rkiye's past and present, enabling participants to gain a deeper appreciation for its diverse society. As the course progresses, students will inquire into T&iquest;rkiye's captivating history and its societal dynamics. The course also examine the diverse cultural heritage of T&iquest;rkiye, exploring its arts, sports, and cuisine. Contemporary T&iquest;rkiye will be a focal point of the course, as students analyze the country's social, political, and economic landscape, while also looking into how the country views its place in the world. By the course's conclusion, students will attain a thorough understanding encompassing T&iquest;rkiye's historical context, cultural intricacies, and modern-day dynamics. They will develop a nuanced understanding of the country's global significance and gain insights into the experiences, challenges, and aspirations of its diverse population.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31596",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225688",
        "number": "OSPISTAN 56",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "61",
        "title": "State and Society in the Middle East",
        "description": "The establishment and development of Middle Eastern political systems; social and political processes including the end of empires, formation of nation-states, and their foreign policies.&quot; This course will provide an overview of the transformation of the Arab Middle East, Iran and Turkey in the 19th-20th century. Focusing on the theme of social and institutional continuity, it will treat the  Ottoman reform period, the disintegration of the Ottoman Empire after World War I, the Arab  awakening and the development of Arab and other nationalisms, the European mandate regimes,  decolonisation, the theory and practice of pan-Arabism, Israel and the Palestinian question,  problems of economic and cultural dependency, and final the processes of democratization and  political Islamism in the Middle East today.KU course # HIST 309",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224684",
        "number": "OSPISTAN 61",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "65",
        "title": "Comparative Political Economy of Emerging Powers",
        "description": "This course offers a political economy account of the rise of emerging powers. Topics to be covered include contemporary debates on the political economy of late industrialization, the relationship between state and the economy, the importance of institutions in the development process and the rise of BRICS and near-BRICs in the changing global order. Theoretical themes are applied to the case studies of China, India, Russia, Brazil, South Africa, Mexico, Argentina, Poland and Turkey. The final part of the course will focus on the role of BRICs and near BRICs in global governance.KU course # INTL 380",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31597",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224692",
        "number": "OSPISTAN 65",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "74",
        "title": "Dreaming of a Cosmopolitan Sea: The Mediterranean in History",
        "description": "This course addresses the relations and interconnectedness between the different Mediterranean cultures from the Early Modern period (16th century) to nowadays. We will analyse the ways in which historians and anthropologists have used the Mediterranean as a privileged terrain to rethink the communication, circulation and exchanges between the Christian and Muslim worlds, often represented as fundamentally antagonistic.  Although violence is pervasive in the Middle Sea's history, we will see that it was not always religiously motivated. We will thus explore other forms of tension such as wars between empires aspiring for global dominion (Spain and the Ottoman Empire), privateering, the exploitation of captive labour force, slave trade and the wars of colonial conquest. A theatre of multiform conflicts, the Mediterranean was also a crossroads where economic, commercial and political interests intersected. We will thus examine the ways in which these interactions contributed to the formation of multi-religious states and favoured religious syncretism and linguistic and cultural hybridizations. We will finally investigate how nationalism and colonialism compartmentalized the Mediterranean space. Aside from scholarly works, our material will include literature and films.  KU course # HIST 319",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31601",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224691",
        "number": "OSPISTAN 74",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "76",
        "title": "Late Antique Byzantine Architecture and Art",
        "description": "Late Antique and Byzantine Architecture and Art looks at the architectural and artistic production from the late Roman times, now known as Late Antiquity, through the end of the Byzantine Empire. The historical period covered goes from the 4th century to the end of the Byzantine empire in 1453.Geographically the course focuses on the Eastern Mediterranean, on Constantinople (modern Istanbul) as the capital city of Byzantium, on some regions of the Western Mediterranean and on particular works of architecture and arts representative of the periods considered.KU course # ARHA 318.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31598",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224695",
        "number": "OSPISTAN 76",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "78",
        "title": "Introduction to Islamic Intellectual History (I): Classical Islamic Thought",
        "description": "It is often claimed that &quot;Western civilization as we know it would not exist without Islamic culture.&quot; But what does that actually mean? What is &quot;Islamic culture&quot;? How does it relate to &quot;Classical Islamic Thought&quot;? When did it come to be, and how? What were its contributions to human societies over time? Which authors, texts and ideas played a leading role in shaping this story?  What do we mean when we speak of Islam as a 'tradition'? What forms of being and knowing does this evoke and promote? How did historical contexts in the lands conquered by Muslims since the middle of the 7th century impact the intercultural transmission of knowledge in the medieval Mediterranean world? And what lasting legacies does this have in our contemporary modern world? How does this history support or confront the multitude of strong and often conflicting opinions about Islam (and indeed religion more broadly) prevalent in our day? Indeed, how might studying the past inform our present? ?  These are just some of the questions that loom behind the subject of this course. The aim is to begin unpacking some of these issues by providing a general survey of Islamic intellectual history focusing on what has been called the 'Classical Period' (the 7th century to c. 1258).  Covering topics in theology, history, philosophy, mysticism, and ethics the course introduces students to some of the key themes, texts, authors, and debates in the Islamic tradition, and how they have been approached in the scholarly literature.  By resituating Islam within the broader world of Late Antiquity, the course also attempts to highlight points of interaction, convergence and divergence with neighbouring religious and intellectual traditions (Hellenic, Ancient Near Eastern, Jewish, Christian etc.) that have historically shaped the parameters of the Islamic intellectual tradition in this period.  Students are encouraged to engage individually and collectively with the assigned primary texts and course materials to adopt a critical and interpretative approach to the topics covered: to understand them both in their own time and terms, as well as for their contemporary resonances. KU course # HIST 353",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31599",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225684",
        "number": "OSPISTAN 78",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "79",
        "title": "Introduction to Turkish-German Film and Literature",
        "description": "In this course we will study the emergence and development of Turkish culture in Germany. How do Turkish-German authors and filmmakers address the discourses on migration, Heimat, integration, intercultural dialogue and multiculturalism? What do they have to say about German history? What is the relevance of their works for the discourses on refugees today? Throughout the course we will explore the intricate relations of aesthetics, political representation and memory across a variety of  genres and media. Readings are in Turkish and English.KU course # LITR 353",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224687",
        "number": "OSPISTAN 79",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "80",
        "title": "Migration & Globalization",
        "description": "This course intends for students to develop critical thinking and analytical reasoning. It invites students to think critically about common sense knowledge on migration and globalization. It will also help students to think about social, political and economic aspects of migration by using social scientific concepts. The course is designed as a reading and discussion course in the form of interactive and vivid sessions. Preparation by reading the texts and participation in discussion is required. This course introduces the main themes, discussions and theoretical frameworks about globalization and migration through sociological lenses. Throughout the course, we will examine immigration in terms of social mobility, poverty, gender, education and identity. We will deal with the questions such as &quot;how are globalization and migration interrelated? &quot;What motives people to migrate across international boundaries?&quot;, &quot;What kind of problems are they faced after arrival&quot; and &quot;what kind of impacts do they have on sending and receiving countries?&quot; This syllabus can be modified and refined in accordance with students' interests.KU course # SOSC 105",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224685",
        "number": "OSPISTAN 80",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "82",
        "title": "Introduction to Electrical and Electronics Engineering",
        "description": "A Brief History of Electrical and Electronics Engineering, Fundamental Concepts in EEE, Introduction to MATLAB Programming, Areas of Expertise and Applications in EEE, EEE Curriculum, Introduction to Communications, Signal Processing and Data Analytics, MEMS, Optoelectronics and Photonics, Bioelectronics and Biomedical Engineering, Internet of Everything, Nanotechnology.KU course # ELEC 100",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224689",
        "number": "OSPISTAN 82",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "84",
        "title": "Introduction to Industrial Engineering",
        "description": "Introduction to industrial engineering concepts. Fundamentals of systems analysis and modelling.  Basics of production and service systems. Computer and programming applications of several industrial engineering topics. Hands-on experience for industrial engineering subjects in team projects.KU course # INDR 100",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224688",
        "number": "OSPISTAN 84",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "85",
        "title": "Introductory Biology",
        "description": "This course is about principles of biochemistry, molecular and cell biology. A general introduction about cell structure and function, genetics, bioenergetics, biotechnology is introduced.KU course # MBGE 200",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224686",
        "number": "OSPISTAN 85",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPISTAN",
        "code": "88",
        "title": "History of Istanbul:  Ancient to Contemporary",
        "description": "This course examines the multi-layered history of Istanbul, focusing primarily on the built environment. In chronological fashion, the course explores changes and continuities in the urban space in relation to the city's political, social and economic history, from the Byzantine imperial capital to its transformation into an Ottoman city, and from an Ottoman into a modern city in the Late Ottoman and Republican periods. Within the chronological framework, topics addressed will include spaces and institutions of political, commercial and religious significance, neighborhood life, intercommunal relations, civic rituals and habits of sociability. Although the main focus of the course is on Byzantine and Ottoman times when the city served as imperial capital, attention will  also be given to the earlier periods of the city as well as to the contemporary megalopolis.KU course # HUMS 114",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31600",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224690",
        "number": "OSPISTAN 88",
        "units": [
            3
        ],
        "totalSections": 1
    }
]