[
    {
        "year": "2023-2024",
        "subject": "VPTL",
        "code": "1",
        "title": "Introduction to Computing at Stanford (CS 1C)",
        "description": "For those who want to learn more about Stanford's computing environment. Topics include: computer maintenance and security, computing resources, Internet privacy, and copyright law. One-hour lecture/demonstration in dormitory clusters prepared and administered weekly by Student Technology. Final project. Not a programming course.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "105604",
        "number": "VPTL 1",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "VPTL",
        "code": "110",
        "title": "Stanford, I Screwed Up!: Becoming a Resilient Learner",
        "description": "Everyone fails at something. Learning from failure, finding meaning or purpose in it, and being able to share it with others, are the cornerstones to building resilience that will support lifelong learning. Using research and literature from the fields of learning sciences, psychology, and creative expression and performance, students will be asked to explore and reflect on their own academic setbacks, how they have come to understand the notions of success and failure, examine their approaches to learning including everything from skills and strategies to issues of self-relevance and motivation. Each student will develop a &quot;failure story&quot; from personal experience that will eventuate to a 5-minute live performance of poetry, spoken-word, storytelling, or song, or other contribution, which will be presented at The Resilience Project's annual &quot;Stanford, I Screwed Up!&quot; the first Thursday of Spring quarter.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "221021",
        "number": "VPTL 110",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "VPTL",
        "code": "196",
        "title": "Computer Consulting (CS 196)",
        "description": "Focus is on Macintosh and Windows operating system maintenance, and troubleshooting through hardware and software foundation and concepts. Topics include operating systems, networking, security, troubleshooting methodology with emphasis on Stanford's computing environment. Final project. Not a programming course.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "105710",
        "number": "VPTL 196",
        "units": [
            2
        ]
    }
]