[
    {
        "year": "2023-2024",
        "subject": "ALP",
        "code": "300",
        "title": "The Founder's Right Hand: From Inspiration to Launch",
        "description": "In this experiential course, you will work in teams to help turn the inspirations of high-potential founders into actual ventures. You will work closely with a founder to understand their inspiration, knowledge, and vision, and then you will work to turn that vision into a venture. You will conduct sprints that will focus on the following, depending on the founder's needs: Understand the founder: Understand the founder's vision, knowledge, insights, and capabilities. - Understand the market: What are the market needs that can be matched by the founder's vision?  Who in the marketplace cares about what the founder can create? - Develop hypotheses: Turn the founder's vision and your understanding of the market into specific hypotheses about the venture - Launch: Launch to test how well the vision meets the market - Fund: Develop a strategy and associated assets (e.g., a pitch) to help the founder launch the venture. This course is part of the GSB's new Action Learning Program, in which you will work on real business challenges under the guidance of faculty.  In this intensive project-based course, you will: Learn research-validated foundations, tools, and practices, Apply these tools and learnings to a real project for an external organization, Create value for the organization by providing insights and deliverables, Be an ambassador to the organization by exposing them to the talent, values, and expertise of the GSB. You will also have the opportunity to: Gain practical industry experience and exposure to the organization, its industry, and the space in which it operates, Build relationships in the organization and industry, and gain an understanding of related career paths",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "222100",
        "number": "ALP 300",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ALP",
        "code": "301",
        "title": "Data-Driven Impact",
        "description": "This is a team-based course where students will work on a project to improve a product using data and experimentation. We will cover key considerations for designing and executing high-quality research for product innovation to drive business outcomes and social impact. Students will have the opportunity to apply methods from machine learning and causal inference to a real-world scenario provided by a partner organization. Topics include designing research and experiments, data analysis, experimental and non-experimental methods for estimating the impact of product features, as well as management consideration for the delivery of actionable research. The course involves three weekly meetings: two lectures and one lab. Lectures will focus on research methods and will provide examples of research outputs for students to discuss and evaluate. Labs will comprise technical training in data analysis and structured team meetings. Students will work in cross-functional teams of 5-6 with milestones throughout the quarter. The final deliverable will be a presentation that highlights the team's work and delivers actionable recommendations that draw from the team's research. The class will include a mix of students with different backgrounds and skills. Each team will have at least one member with significant experience with data analysis. This course is part of the GSB's new Action Learning Program, in which you will work on real business challenges under the guidance of faculty.  In this intensive project-based course, you will: Learn research-validated foundations, tools, and practices, Apply these tools and learnings to a real project for an external organization, Create value for the organization by providing insights and deliverables, Be an ambassador to the organization by exposing them to the talent, values, and expertise of the GSB. You will also have the opportunity to: Gain practical industry experience and exposure to the organization, its industry, and the space in which it operates, Build relationships in the organization and industry, and gain an understanding of related career paths. Prerequisites: Some experience with statistical analysis and the R statistical package. Students with less experience will have an opportunity to catch up through tutorials provided through the course. Non-GSB students are expected to have an advanced understanding of tools and methods from data science and machine learning as well as a strong familiarity with R, Python, SQL, and other similar high-level programming languages. (Cardinal Course certified by the Haas Center)",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "222188",
        "number": "ALP 301",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ALP",
        "code": "302",
        "title": "Designing Solutions for Wicked Problems",
        "description": "The thrust of this course is on designing innovative solutions for wicked problems-problems requiring large-scale sustainable transformations in environments that tend to deeply favor the status-quo. The palette on which the course will anchor on is New Zealand, a country that I have, over the years, developed a deep relationship with. In my mind, New Zealand has always been one of the most innovative and progressive countries in the world, economically, socially and environmentally. This has come from a unique partnership between the government and the private sector, giving rise to several government enabled, private sector led initiatives. Students in this course will work with leaders and entities within New Zealand's primary sector, including key Maori business leaders/entities and the Ministries of Primary Sector and Trade. The projects with deeply integrated interdependencies will feature large-scale challenges that fall in the category of wicked problems. It will involve scaled interventions that will need to simultaneously satisfy economic, social and environmental needs. The course will give students as future leaders with an immersive experience of dealing with highly integrated and holistic solutions that are required to solve the wicked problem of large-scale sustainable transformations. This course is part of the GSB's Action Learning Program, in which you will work on real business challenges under the guidance of faculty. In this intensive project-based course, you will learn research-validated foundations, tools, and practices; apply these tools and learnings to a real project for an external organization; create value for the organization by providing insights and deliverables; and be an ambassador to the organization by exposing them to the talent, values, and expertise of the GSB. You will also have the opportunity to gain practical industry experience and exposure to the organization, its industry, and the space in which it operates; build relationships in the organization and industry; and gain an understanding of related career paths.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "222190",
        "number": "ALP 302",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ALP",
        "code": "303",
        "title": "Analysis and Measurement of Impact",
        "description": "This team-based course, part of the GSB's Action Learning Program, provides students the opportunity to work with organizations that are focused on achieving impact, including impact for-profits, investment funds, and evaluators. Topics include current trends and drivers in the impact space, frameworks for measuring impact, financial instruments and techniques for achieving impact, analysis of impact fundamentals, organizational structures for impact, and challenges in fundraising for impact businesses. Students work on projects to analyze impact investments including private equity and fixed income products, assess the financial viability of an impact business, develop equitable alternative risk assessment metrics, model the economic and social value of outcomes, and evaluate the impacts of an organization. This course provides real-world opportunities for students to learn research-validated foundations, tools, and practices; apply these tools and learnings to a real project for an external organization; create value for the organization by providing insights and deliverables; and be an ambassador to the organization by exposing them to the talent, values, and expertise of the GSB. Students also have the opportunity to gain practical industry experience and exposure to the organization, its industry, and the space in which it operates; build relationships in the organization and industry; and gain an understanding of related career paths.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "All enrolled and waitlisted students are encouraged to attend a pre-course meeting. for more information, see https://mygsb.stanford.edu/programs-centers/action-learning-program. Attendance at this meeting is essential to your success in this course. No Exam. GSB PhD students need instructor permission. Capacity limited to 32 students. P/F Not Allowed. 1 Group Project/Paper. Participation 25% Proj/Papers 50% Assignments 25%. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop.",
                "classId": "31037",
                "currentClassSize": "0",
                "maxClassSize": "32",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Foroughi, J.",
                                "sunet": "jaclynf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223145",
        "number": "ALP 303",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ALP",
        "code": "304",
        "title": "Digital Business Transformation",
        "description": "In this course, students work with businesses to help them develop digital strategies for growth. The businesses they will work with are successful but have gaps in their digital strategy. This could range from the near absence of a digital presence, to gaps in advertising and promotion using digital platforms. The typical business goal will be driving growth through new customer acquisition, serving new markets and customer segments, and the development of existing customers. The course focuses on developing entrepreneurial skills in digital marketing and strategy, and applying those skills to real companies looking to scale. The course is an Action Learning Program (ALP) course and has a cadence of in-class meetings; workshops; and meetings with the clients, project advisors, and team meetings. In this intensive project-based course, you will learn research-validated foundations, tools, and practices, and a scientific and data-oriented approach to making business decisions. You will apply these tools and learnings to a real project for an external organization; create value for the organization by providing insights and deliverables; and be an ambassador to the organization by exposing them to the talent, values, and expertise of the GSB. You will also have the opportunity to gain practical industry experience and exposure to the organization, its industry, and the space in which it operates, build relationships in the organization and industry, and gain an understanding of related career paths.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "See website for more information: https://mygsb.stanford.edu/group/mygsb/programs-centers/action-learning-program. No Exam. P/F Not Allowed. Participation 30% Projects/Papers 70%. 1 Group Project/Paper. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. Capacity limited to 20 students. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop.",
                "classId": "29495",
                "currentClassSize": "19",
                "maxClassSize": "19",
                "schedules": [
                    {
                        "startTime": "1:15:00 PM",
                        "endTime": "2:35:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Davis, S.",
                                "sunet": "srdavis"
                            },
                            {
                                "name": "Narayanan, S.",
                                "sunet": "sridharn"
                            }
                        ],
                        "startTimestamp": 47700.0,
                        "endTimestamp": 52500.0,
                        "days": "Tuesday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223149",
        "number": "ALP 304",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ALP",
        "code": "305",
        "title": "Product Management",
        "description": "In this experiential course, you will develop skills and experience required to be a Product Manager. The course covers important facets of the PM role at different stages in the product life cycle. You will learn and apply tools and methodologies for market research and product strategy (e.g. product requirements, market briefs), early stage execution (e.g. road maps, resource planning, project management), growth (e.g. operational and development practices), and late stage management. In parallel with classroom learning, student teams will work on quarter-long projects in collaboration with sponsor organizations. The nature of the projects and deliverables for each team will vary depending on the stage of the product and needs of the product teams. Projects will be sourced from tech companies; however, the learning from the course and projects can be transferred to other industries. This course is part of the GSB's Action Learning Program, in which you will work on real business challenges under the guidance of faculty.  In this intensive project-based course, you will learn research-validated foundations, tools, and practices; apply these tools and learnings to a real project for an external organization; create value for the organization by providing insights and deliverables; and be an ambassador to the organization by exposing them to the talent, values, and expertise of the GSB.  You will also have the opportunity to gain practical industry experience and exposure to the organization, its industry, and the space in which it operates; build relationships in the organization and industry; and gain an understanding of related career paths.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "See website for more information: https://mygsb.stanford.edu/group/mygsb/programs-centers/action-learning-program. No Exam. P/F Not Allowed. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. Capacity limited to 20 students. Not Open to Non-GSB Students. Participation 19% Proj/Papers 65% Assign. 16%. Workshop.",
                "classId": "1012",
                "currentClassSize": "18",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "8:15:00 AM",
                        "endTime": "9:35:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kelly, A.",
                                "sunet": "akelly4"
                            },
                            {
                                "name": "Feinberg, Y.",
                                "sunet": "yossi"
                            },
                            {
                                "name": "Rodriguez, T.",
                                "sunet": "trod76"
                            }
                        ],
                        "startTimestamp": 29700.0,
                        "endTimestamp": 34500.0,
                        "days": "Monday Wednesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "WKS",
                "notes": "All enrolled and waitlisted students must attend a mandatory pre-course meeting. Students who do not attend this meeting may be dropped from the course. For more information, see https://mygsb.stanford.edu/programs-centers/action-learning-program. No Exam. P/F Not Allowed. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. Capacity limited to 20 students. Not Open to Non-GSB Students. Participation 19% Proj/Papers 65% Assign. 16%. Workshop.",
                "classId": "1013",
                "currentClassSize": "19",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gupta, A.",
                                "sunet": "anneka"
                            },
                            {
                                "name": "Feinberg, Y.",
                                "sunet": "yossi"
                            },
                            {
                                "name": "Rodriguez, T.",
                                "sunet": "trod76"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223601",
        "number": "ALP 305",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ALP",
        "code": "306",
        "title": "Marketing for Measurable Change",
        "description": "Companies and organizations increasingly use tools such as product, price or communication strategies to improve metrics that directly relate to financial performance or progress toward a mission based objective. In this class, students will participate in projects with corporate or organizational sponsors developing strategies to improve these key performance indicators. Project steps and learning objectives may include (I) defining the strategic path that motivates stakeholders to dedicate needed resources, (ii) evaluating the data to identify target customers and associated opportunities, (iii) forming plans and budgets for how to change behavior using one or more marketing strategies/tools and (iv) tracking and reporting progress in ongoing data metrics. We prioritize projects facing challenges in changing behavior, such as when a new product's potential customers are strongly attached to an incumbent or when opportunities for sustainable change exist with those placing low value on sustainability. Students will have the option to source their own projects, following a multistep project development and approval process prior to the course.&nbsp;Who might be interested in taking this course: students interested in entrepreneurship; product management; cross-functional roles linking actions and strategies to performance objectives; and marketing roles that involve communication, product, and pricing strategies.&nbsp;This course is part of the GSB's Action Learning Program, in which you will work on real business challenges under the guidance of faculty.&nbsp; In this intensive project-based course, you will learn research-validated foundations, tools, and practices; apply these tools and learnings to a real project for an external organization; create value for the organization by providing insights and deliverables; and be an ambassador to the organization by exposing them to the talent, values, and expertise of the GSB.&nbsp; You will also have the opportunity to gain practical industry experience and exposure to the organization, its industry, and the space in which it operates; build relationships in the organization and industry; and gain an understanding of related career paths.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223594",
        "number": "ALP 306",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ALP",
        "code": "307",
        "title": "Public Policy Lab: Improving Urban Governance in US Cities",
        "description": "Cities in the United States provide a great variety of services to citizens, including public safety, education, construction and maintenance of infrastructure and more. Across the country, the cost of these and other programs or policies amounted to more than $2.2 trillion in spending by local governments in 2021 according to the US Census. In this 10-week team-based Action Learning Program course, we will partner with 2 different cities with diverse populations. In groups, students will explore one of three local government finance issues in each city: infrastructure, economic development, and workforce development. Teams will assess the efficacy of the cities' existing strategies and propose data-driven, evidence-based recommendations for new policies to benefit all city residents. Students will have the opportunity to engage with an array of city officials and subject matter experts to aid in the preparation of reports that will be presented to local government officials.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "Mandatory attendance. Absences impact grade. All enrolled and waitlisted students must attend a mandatory pre-course meeting (date/time TBD). Students who do not attend this meeting may be dropped from the course. For more information, see https://mygsb.stanford.edu/programs-centers/action-learning-program. No Exam. GSB PhD students need instructor permission. P/F Not Allowed. Participation 30% Projects/Papers 70%. Open to MBA and MSx students. Capacity limited to 30 Students. Mandatory attendance. Absences impact grade. CSI certificate course. 3 Group 3 Individual Projects/Papers. Not Open to Non-GSB Students. Workshop.",
                "classId": "31259",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:15:00 PM",
                        "endTime": "2:35:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rauh, J.",
                                "sunet": "rauh"
                            }
                        ],
                        "startTimestamp": 47700.0,
                        "endTimestamp": 52500.0,
                        "days": "Monday Wednesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223876",
        "number": "ALP 307",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ALP",
        "code": "308",
        "title": "Designing Experiments for Impact",
        "description": "This is a team-based course where students will work on a project to design and carry out an experiment intended to drive social impact in collaboration with a partner organization. The first few weeks will include lectures, hands-on tutorials, and labs designed to guide students through the process of experimental design in the digital context. Special topics include designing and selecting outcome measures that capture the impact of interventions; multi-stage experiments with applications to chatbots; learning how treatment effects vary across subgroups; adaptive experiments using bandits and artificial intelligence; and estimation of policies that target treatments based on subject characteristics. Experiments may be conducted on the customer base of a partner organization through their digital applications or on recruited subjects, such as subjects recruited to interactive chatbots. The teaching team will provide templates and technical assistance for designing and running the experiments. Students from different disciplinary backgrounds will be assigned roles to work in teams on the project. This course is part of the GSB's Action Learning Program, in which you will work on real business challenges under the guidance of faculty. In this intensive project-based course, you will learn research-validated foundations, tools, and practices; apply these tools and learnings to a real project for an external organization; create value for the organization by providing insights and deliverables; and be an ambassador to the organization by exposing them to the talent, values, and expertise of the GSB. You will also have the opportunity to gain practical industry experience and exposure to the organization, its industry, and the space in which it operates; build relationships in the organization and industry; and gain an understanding of related career paths. Prerequisites: Some experience with statistical analysis and the R statistical package. Students with less experience will have an opportunity to catch up through tutorials provided through the course. Non-GSB students are expected to have an advanced understanding of tools and methods from data science and machine learning as well as a strong familiarity with R, Python, SQL, and other similar high-level programming languages. Cardinal Course certified by the Haas Center.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223883",
        "number": "ALP 308",
        "units": [
            4
        ]
    }
]