[
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "1",
        "title": "Introduction to Archaeology (ANTHRO 3)",
        "description": "Aims, methods, and data in the study of human society's development from early hunters through late prehistoric civilizations. Archaeological sites and remains characteristic of the stages of cultural development for selected geographic areas, emphasizing methods of data collection and analysis appropriate to each.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28433",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bauer, A.",
                                "sunet": "ambauer"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-GlobalCom",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "109533",
        "number": "ARCHLGY 1",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "16",
        "title": "Native Americans in the 21st Century: Encounters, Identity, and Sovereignty in Contemporary America (ANTHRO 16, NATIVEAM 16)",
        "description": "What does it mean to be a Native American in the 21st century? Beyond traditional portrayals of military conquests, cultural collapse, and assimilation, the relationships between Native Americans and American society. Focus is on three themes leading to in-class moot court trials: colonial encounters and colonizing discourses; frontiers and boundaries; and sovereignty of self and nation. Topics include gender in native communities, American Indian law, readings by native authors, and Indians in film and popular culture.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-AmerCul"
        ],
        "objectID": "201175",
        "number": "ARCHLGY 16",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "21Q",
        "title": "Eight Great Archaeological Sites in Europe (CLASSICS 21Q)",
        "description": "Preference to sophomores. Focus is on excavation, features and finds, arguments over interpretation, and the place of each site in understanding the archaeological history of Europe. Goal is to introduce the latest archaeological and anthropological thought, and raise key questions about ancient society. The archaeological perspective foregrounds interdisciplinary study: geophysics articulated with art history, source criticism with analytic modeling, statistics interpretation. A web site with resources about each site, including plans, photographs, video, and publications, is the basis for exploring.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "14907",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Shanks, M.",
                                "sunet": "mshanks"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "14460",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Shanks, M.",
                                "sunet": "mshanks"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "Writing 2"
        ],
        "objectID": "202280",
        "number": "ARCHLGY 21Q",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "29A",
        "title": "Race, Indigeneity, and Cultural Heritage in Latin America (ANTHRO 29A, CHILATST 129, CSRE 129A)",
        "description": "This course introduces students to the anthropological study of social difference and inequality in contemporary Latin America. It focuses on the intersections of race, Indigeneity, and cultural heritage. Since European contact, race has been a key category for governing heterogenous populations across the region. In recent decades, institutions have established cultural heritage formation - particularly the cultural heritages of Black and Indigenous peoples - as central to the development of the modern nation-state. At the same time, Black and Indigenous peoples have mobilized around civil and human rights to decolonize racial hierarchies and transform colonial structures of power. Students will first engage current approaches to race, Indigeneity, and cultural heritage. Students will then explore how racial and Indigenous formations converge with the following cultural heritage forms: museums, tourism, archaeological sites, and language.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224233",
        "number": "ARCHLGY 29A",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "30",
        "title": "Greek Archaeology: The Worlds the Greeks Made (CLASSICS 30)",
        "description": "Overview of the archaeology of Greece from the earliest times to today, with a focus on the first millennium BCE. Covers topics from farming and fighting to technology and art, asking why the material cultures created in Greece's archaic, classical, and Hellenistic periods have had a profound impact on the rest of the world.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31222",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "200-217",
                        "instructors": [
                            {
                                "name": "Constantine, N.",
                                "sunet": "nconsta"
                            },
                            {
                                "name": "Morris, I.",
                                "sunet": "imorris"
                            }
                        ],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 48000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225579",
        "number": "ARCHLGY 30",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "34",
        "title": "Animals and Us (ANTHRO 34)",
        "description": "The human-animal relationship is dynamic, all encompassing and durable. Without exception, all socio-cultural groups have evidenced complex interactions with the animals around them, both domesticated and wild. However, the individual circumstances of these interactions are hugely complicated, and involve much more than direct human-animal contact, going far beyond this to incorporate social, ecological and spiritual contexts.This course delves into this complexity, covering the gamut of social roles played by animals, as well as the methods and approaches to studying these, both traditional and scientific. While the notion of `animals as social actors is well acknowledged, their use as proxies for human autecology (the relationship between a species and its environment) is also increasingly recognized as a viable mechanism for understanding our cultural and economic past. It will piece together the breadth of human-animal relationships using a wide geographic range of case studies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "215803",
        "number": "ARCHLGY 34",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "43N",
        "title": "The Archaeological Imagination (CLASSICS 43N)",
        "description": "More than excavating ancient sites and managing collections of old things, Archaeology is a way of experiencing the world: imagining past lives through ruins and remains; telling the story of a prehistoric village through the remains of the site and its artifacts; dealing with the return of childhood memories; designing a museum for a community. The archaeological imagination is a creative capacity mobilized when we experience traces and vestiges of the past, when we gather, classify, conserve and restore, when we work with such remains to deliver stories, reconstructions, accounts, explanations, or whatever. This class will explore such a wide archaeological perspective in novels, poetry, fantasy literature, the arts, movies, online gaming, and through some key debates in contemporary archaeology about human origins, the spread of urban life, the rise and fall of ancient empires.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "31309",
                "currentClassSize": "0",
                "maxClassSize": "14",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "160-321",
                        "instructors": [
                            {
                                "name": "Shanks, M.",
                                "sunet": "mshanks"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221500",
        "number": "ARCHLGY 43N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "47",
        "title": "Introduction to Digital Archaeology (CLASSICS 57)",
        "description": "While the tools of Digital Archaeology frequently change, using digital tools has been part of the discipline for decades.  These tools and approaches provide new forms of research, visualization, and outreach to archaeological investigations.  This course is designed to introduce students of archaeology to the digital research methods useful to the discipline, and provide them with hands-on experience in three types of digital method: digital mapping, visualization, and 3D modeling. The goal of the course is for students to learn about the state of digital archaeology, to become familiar with common methods, and become aware of the resources available for research.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "220086",
        "number": "ARCHLGY 47",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "54N",
        "title": "Archaeology in the Digital Age",
        "description": "Like so many fields, archaeology is being transformed by new opportunities and challenges of technologies inconceivable only a generation ago: online tourist photographs are assisting replication of an arch destroyed by terrorists, detailed scans reveal how tools were manufactured and used 2000 years ago, and excavated remains historically texture lost worlds for games like Assassin&iquest;s Creed. These artifacts and sites allow us to recreate human pasts in different ways, but only if we can make the most of every partial clue that archaeology uncovers. How do approaches like laser scanning and digital modeling help us maximize archaeological documentation and analysis? How will 3D visualization bring archaeological finds to the public in more innovative, immersive, and democratic ways than ever before? How can we put the past into the hands of a global community anywhere and at any time through interactive digital reconstructions and physical replicas? Can 4D approaches integrating time help us understand ancient social processes through digital approaches? What ethical questions of practice, ownership, and display arise as archaeology confronts each of these new opportunities? How do such developments force us to reexamine the complex ways in which technologies are changing our relationship with the human past? This seminar bridges the theoretical and the practical, allowing students to develop hands-on projects&iquest;using 3D analysis of objects on campus&iquest;that ask fundamental questions about how artifacts worked in the past, how they speak in the present, and how new digital tools can transform their voices in the future. Trips to collections on campus and in the area, as well as visits from diverse experts in the field and case studies from the instructor&iquest;s own excavation (a Roman shipwreck of marble architectural materials) allow engagement with emerging technological approaches to the archaeological record.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221496",
        "number": "ARCHLGY 54N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "58",
        "title": "Egypt in the Age of Heresy (AFRICAAM 58A, AFRICAST 58, CLASSICS 58)",
        "description": "Perhaps the most controversial era in ancient Egyptian history, the Amarna period (c.1350-1334 BCE) was marked by great sociocultural transformation, notably the introduction of a new 'religion' (often considered the world's first form of monotheism), the construction of a new royal city, and radical departures in artistic and architectural styles.  This course will introduce archaeological and textual sources of ancient Egypt, investigating topics such as theological promotion, projections of power, social structure, urban design, interregional diplomacy, and historical legacy during the inception, height, and aftermath of this highly enigmatic period.  Students with or without prior background are equally encouraged.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220417",
        "number": "ARCHLGY 58",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "60N",
        "title": "Digging for Answers: 5 Big Questions of Our Time (ANTHRO 60N)",
        "description": "The aim in this course is to explore the archaeological evidence for long-term change with regard to 5 major questions of our time: Where do we come from? Has inequality increased? Have we become more violent? Why do we have so much stuff? What is the relationship between humans and climate change? You will be introduced to recent publications for class debate, and will also be introduced to the ways in which archaeologists use evidence in order to explore the 5 themes. We will go to Stanford&iquest;s archaeological collections so that you can have hands-on experience of artifacts and will be able to problem solve using data from the instructor&iquest;s own excavations. We will also visit labs (archaeological and genomic for example), local museums and local archaeological excavations.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221502",
        "number": "ARCHLGY 60N",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "79",
        "title": "Mediterranean Archaeology Today: Heritage, Ethics, and Practice in a Changing World",
        "description": "While archaeology engages with material remains from the past, it is embedded in and inseparable from contemporary practice. This seminar discusses a wide range of ethical dilemmas raised by archaeology in the 21st century. It aims to develop an acquaintance with legal and ethical codes as well as disciplinary practices that relate to cultural heritage, with a strong focus on the ancient Mediterranean world. Such issues will be approached primarily through discussion and debate of current case studies including: ownership and destruction of cultural property, colonialism and decolonization, ethical responsibilities in scientific practice, and cultural, nationalistic, religious, and popular uses of heritage. By the end of the term, students should be able to apply critical reasoning to a variety of ethical issues related to heritage of the Mediterranean world and beyond, and to articulate (in oral and written form) responses to current controversial topics about the human past.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222380",
        "number": "ARCHLGY 79",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "80",
        "title": "Heritage and Human Rights (ANTHRO 80A)",
        "description": "What does archaeology have to say about human rights? Is there a right to cultural heritage? How can archaeology and heritage help protect rights&iquest;or encroach upon them? Themes we will address in this course include the archaeological investigation of human rights topics; the right to heritage; conflicts of different rights regimes in heritage contexts; and ethical considerations about rights during research and heritage management. These questions will take us to cases as diverse as forensic investigation of the disappeared in Argentina, the archaeology of homelessness in the U.K., the destruction of heritage as cultural genocide in Bosnia and the Middle East, and the rights of indigenous groups in Australia and the U.S. to control cultural heritage.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "220738",
        "number": "ARCHLGY 80",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "81",
        "title": "Introduction to Roman Archaeology (CLASSICS 52)",
        "description": "(Formerly CLASSART 81.)  This course will introduce you to the material culture of the ancient Roman world, from spectacular imperial monuments in the city of Rome to cities and roads around the Mediterranean, from overarching environmental concerns to individual human burials, from elite houses and army forts to the the lives of slaves, freedmen and gladiators.  Key themes will be change and continuity over time; the material, spatial and visual workings of power; how Roman society was materially changed by its conquests and how conquered peoples responded materially to Roman rule.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum"
        ],
        "objectID": "214912",
        "number": "ARCHLGY 81",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "84",
        "title": "Incas, Spaniards, and Africans: Archaeology of the Kingdom of Peru (ANTHRO 84B)",
        "description": "Students are introduced to Andean archaeology from the rise of the Inca empire through the Spanish colonial period. We will explore archaeological evidence for the development of late pre-Hispanic societies in western South America, the Spanish conquest, and the origins of key Spanish colonial institutions in the Andean region: the Church, coerced indigenous labor, and African slavery. Central to this course is an archaeological interrogation of the underpinnings and legacies of colonialism, race, and capitalism in the region. Students will also consider the material culture of daily life and those living on the social margins, both in pre-Hispanic societies and under Spanish rule.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222599",
        "number": "ARCHLGY 84",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "92",
        "title": "Introduction to Greek Art and Archaeology (CLASSICS 92)",
        "description": "This course will introduce students to the art and archaeology of Greece and the Greek world from the Neolithic through Early Roman periods. By integrating both historical and current approaches to the archaeology of Greece, this course aims to supplement the typical chronological narrative of the development of Greek material culture with various thematic explorations (e.g. nationalism in archaeology, social complexity, postcolonial approaches), as well as to critically evaluate mechanisms of interpretation in Greek archaeology over time.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220804",
        "number": "ARCHLGY 92",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "97",
        "title": "Archaeology Internship",
        "description": "Opportunity for students to pursue their specialization in an institutional setting such as a laboratory, clinic, research institute, museums or government agency. May be repeated for credit. Prior instructor consent needed.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "10",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ITR",
                "notes": null,
                "classId": "11719",
                "currentClassSize": "0",
                "maxClassSize": "1",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ITR",
                "notes": "Meets in the Stanford Archaeology Collections.",
                "classId": "12032",
                "currentClassSize": "0",
                "maxClassSize": "1",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ITR",
                "notes": null,
                "classId": "14877",
                "currentClassSize": "0",
                "maxClassSize": "1",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214735",
        "number": "ARCHLGY 97",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "102",
        "title": "Archaeological Methods (ANTHRO 91A)",
        "description": "Methodological issues related to the investigation of archaeological sites and objects. Aims and techniques of archaeologists including: location and excavation of sites; dating of places and objects; analysis of artifacts and technology and the study of ancient people, plants, and animals. How these methods are employed to answer the discipline's larger research questions. Significant work outside of class time is expected of the student for this course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "13739",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Nguot, T.",
                                "sunet": "twal"
                            },
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "205478",
        "number": "ARCHLGY 102",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "102B",
        "title": "Incas and their Ancestors: Peruvian Archaeology (ANTHRO 106, ANTHRO 206A)",
        "description": "The development of high civilizations in Andean S. America from hunter-gatherer origins to the powerful, expansive Inca empire. The contrasting ecologies of coast, sierra, and jungle areas of early Peruvian societies from 12,000 to 2,000 B.C.E. The domestication of indigenous plants which provided the economic foundation for monumental cities, ceramics, and textiles. Cultural evolution, and why and how major transformations occurred.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-GlobalCom",
            "WAY-SI"
        ],
        "objectID": "109560",
        "number": "ARCHLGY 102B",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "103",
        "title": "History of Archaeological Thought (ANTHRO 103B, CLASSICS 170)",
        "description": "Introduction to the history of archaeology and the forms that the discipline takes today, emphasizing developments and debates over the past five decades. Historical overview of culture, historical, processual and post-processual archaeology, and topics that illustrate the differences and similarities in these theoretical approaches. Satisfies Archaeology WIM requirement.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29152",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Trivedi, M.",
                                "sunet": "mudit1"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "201183",
        "number": "ARCHLGY 103",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "103A",
        "title": "Human Osteoarchaeology (ANTHRO 103A, ANTHRO 203A)",
        "description": "The course will cover the methodological and theoretical backgrounds to human osteoarchaeology, introduce the student to the chemical and physical characteristics of bone, and to the functional morphology of the human skeleton. Classes will consist of a taught component that outlines how osteoarchaeologists reconstruct individual life-histories based on age, sex etc.; this is combined with hands-on identification of different skeletal elements and the markers used to inform the analytical methods. Additional scientific methodologies are also introduced that increasingly form a major component of human osteoarchaeology.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "214726",
        "number": "ARCHLGY 103A",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "104",
        "title": "Digital Methods in Archaeology",
        "description": "Archaeologists have long adapted and incorporated available digital tools into their methodological toolkits. The recent explosion in computing power and availability has led to a proliferation of digital apparatus in archaeology and sparked dynamic theoretical and methodological discussions within the discipline. This course provides an overview of digital tools and methods utilized by archaeologists through all stages of research.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221513",
        "number": "ARCHLGY 104",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "104B",
        "title": "Landscapes of Inequality: The Southwestern United (ANTHRO 104B)",
        "description": "Inequality is one of the major social issues of the current moment in the United States. Racial, economic, and gender inequality has been even more pronounced in the fall out of the COVID-19 pandemic around the world. These injustices are identifiable at the individual and institutional level, but they also are enmeshed in the physical landscapes in which we live. What can archaeology (conventionally defined as the study of the past through material traces) help us learn about present day inequalities and landscapes? This course explores novel approaches to archaeological research across time in the Southwestern United States. We begin with material investigations of the experience of crossing the US-Mexico border, which demonstrate how the landscape itself is weaponized. We then move backwards in time to explore the intimate landscape of incarcerated people of Japanese Ancestry during WWII, where gardens were an important practice of persistence and opportunity for survivors to re-engage the past. Finally, we will explore how ancient Chacoan landscapes index the consolidation of power and hierarchy in the past, and are the site of struggles for indigenous sovereignty and environmental justice in the present. This course will introduce you to major themes in landscape studies and archaeology including: place-making, agency, regional analysis and ethics.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223351",
        "number": "ARCHLGY 104B",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "106",
        "title": "The Archaeology of Climate (ANTHRO 103, ANTHRO 203)",
        "description": "This course reviews the long-term relationships between human societies and Earth's climatic systems. It provides a critical review of how archaeologists have approached climate change through various case studies and historical paradigms (e.g., societal 'collapse', resilience, historical ecology) and also addresses feedbacks between past human land use and global climate change, including current debates about the onset of the Anthropocene.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "223048",
        "number": "ARCHLGY 106",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "106W",
        "title": "Ancient Andes: Politics, Economy, and Religion (ANTHRO 106W)",
        "description": "More than 15,000 years ago, the first people settled in the Andes, a diverse landscape consisting of high mountain ranges, super arid deserts, and frigid ocean waters. These communities developed unique cultural, economic, and political strategies to thrive in this sometimes-harsh environmental milieu, creating spectacular adobe cities, intricate artworks, and cultivating the foodstuffs that make up the region's now-world famous cuisine. This seminar examines 3,000 years of Andean history and culture through an archaeological lens. Rather than attempting to review all of Andean history, we will study three salient themes: politics, economy, and religion. By looking at specific case studies from different cultural groups and societies (e.g., Chav&iacute;n, Wari, Inka), we will tease apart how these three themes shaped Andean lifeways over the longue dur&eacute;e. We will study different Andean time periods but will attempt to do so in a way that looks beyond neo-evolutionary frameworks, in order to situate the region within broader anthropological and archaeological discussions. Students are expected to complete assigned reading for the day prior to attending class and be prepared for group discussion. Through discussions of readings alongside written assignments, students will evaluate major debates in the field of Andean archaeology.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "225414",
        "number": "ARCHLGY 106W",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "110",
        "title": "Environmental Archaeology (ANTHRO 110, ANTHRO 210)",
        "description": "This course investigates the field of environmental archaeology. Its goals are twofold: 1) to critically consider the intellectual histories of environmental archaeology, and, 2) to survey the various techniques and methods by which archaeologists assess historical environmental conditions through material proxies. The course will include lab activities.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "218470",
        "number": "ARCHLGY 110",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "111",
        "title": "Emergence of Chinese Civilization from Caves to Palaces (ARCHLGY 211, CHINA 176, CHINA 276)",
        "description": "Introduces processes of cultural evolution from the Paleolithic to the Three Dynasties in China. By examining archaeological remains, ancient inscriptions, and traditional texts, four major topics will be discussed: origins of modern humans, beginnings of agriculture, development of social stratification, and emergence of states and urbanism.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13660",
                "currentClassSize": "0",
                "maxClassSize": "13",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            },
                            {
                                "name": "Shen, J.",
                                "sunet": "jieshen9"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Monday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": "Class meets in 500-106.",
                "classId": "14043",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "2:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            },
                            {
                                "name": "Shen, J.",
                                "sunet": "jieshen9"
                            }
                        ],
                        "startTimestamp": 52200.0,
                        "endTimestamp": 55200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-SI"
        ],
        "objectID": "210933",
        "number": "ARCHLGY 111",
        "units": [
            3,
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "111B",
        "title": "Muwekma: Landscape Archaeology and the Narratives of California Natives (ANTHRO 111C, NATIVEAM 111B)",
        "description": "This course explores the unique history of San Francisco Bay Area tribes with particular attention to Muwekma Ohlone- the descendent community associated with the landscape surrounding and including Stanford University. The story of Muwekma provides a window into the history of California Indians from prehistory to Spanish exploration and colonization, the role of Missionaries and the controversial legacy of Junipero Serra, Indigenous rebellions throughout California, citizenship and land title during the 19th century, the historical role of anthropology and archaeology in shaping policy and recognition of Muwekma, and the fight for acknowledgement of Muwekma as a federally recognized tribe. We will visit local sites associated with this history and participate in field surveys of the landscape of Muwekma.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216476",
        "number": "ARCHLGY 111B",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "112A",
        "title": "Muwekma Community Engaged Learning, Cultural Heritage and Native Plants Garden Field Project (NATIVEAM 112)",
        "description": "This course will allow students interested in working with the Muwekma Ohlone Tribe to engaged in community based participatory research. More specifically students will be creating tending and maintaining a native plants garden in the area surrounding the dish. Students will be required to learn about the biotic community and plants used by California native people in a demonstration and educational garden. Course discussions include food sovereignty in indigenous communities, tribal land trusts,  and working with indigenous and native communities as a form of field based learning, and service learning. Course will emphasize protocols and specific methods  in Indigenous spaces. Cultural heritage and archaeological surveys and mapping may be a a part of this course, depending upon the needs of the Muwekma community. Workdays will be scheduled  Saturdays from 10:00 to 12:30 pm. Other projects may include educational projects for k-12 students, in as well as field trips to archaeological sites in ancestral spaces within the territory of Muwekma Ohlone. Other projects to be determined by local tribal members.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224651",
        "number": "ARCHLGY 112A",
        "units": [
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "113",
        "title": "Culture and Epigenetics: Towards A Non-Darwinian Synthesis (ANTHRO 113, ANTHRO 213)",
        "description": "The course examines the impact of new research in epigenetics on our understanding of long-term cultural change. The course examines the various attempts that have been made over recent decades to find a synthesis between cultural and biological evolution. These approaches, often termed neo-Darwinian, include memes, dual inheritance theory, theories of cultural selection and transmission, niche construction theory and macro-evolutionary approaches. Research in all these areas will be examined, with particular reference to explanations for the origins of agriculture, but also including other transformations, and critiqued. New research in epigenetics offers an alternative non-Darwinian evolutionary perspective that avoids many of the problems and pitfalls in the neo-Darwinian approaches. Cultural evolution comes to be viewed as cumulative, directional and Lamarckian, since heritable epigenetic variation can underlie evolutionary change. Epigenetics opens the way for human cultural entanglements to become the drivers for evolutionary change, thus allowing the full range of social processes studied in the social and cultural sciences to take their place in the study and analysis of long-term change.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217148",
        "number": "ARCHLGY 113",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "114",
        "title": "Rights and Ethics in Heritage (ANTHRO 114, ANTHRO 214)",
        "description": "Heritage is a human thing: made by people and mobilized for their own purposes, it has a range of effects on communities. This course focuses on the human dimension of heritage with special attention to questions of rights and ethics. Where can we locate the intersections of heritage and rights? How do communities and governing structures negotiate control over and participation in heritage, and with what impacts on people? Which ethical challenges arise and how have archaeologists, heritage managers, museums, legislators, community leaders, and others approached these issues?The first half of this seminar course focuses on the theoretical and contextual basis for these discussions. We will address topics such as cultural ownership and participation as well as the global and governing contexts within which heritage is mobilized. Building on this, the second half examines cases in which different rights, needs, and goals come into conflict: museum practice, public memory, upheaval stemming from violence or disaster, and the ethics of the material world itself. Throughout, we will highlight heritage in relation to communities, rights, and responsibilities, all while thinking through ethical modes of heritage research and practice.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222975",
        "number": "ARCHLGY 114",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "115",
        "title": "The Social life of Human Bones (ANTHRO 115, ANTHRO 215)",
        "description": "Skeletal remains serve a primary function of support and protection for the human body. However, beyond this, they have played a range of social roles once an individual is deceased. The processes associated with excarnation, interment, exhumation and reburial all speak to the place that the body, and its parts, play in our cultural as well as physical landscape.This course builds on introductory courses in human skeletal anatomy by adding the social dynamics that govern the way humans treat other humans once they have died. It draws on anthropological, biological and archaeological research, with case studies spanning a broad chronological and spatial framework to provide students with an overview of social practice as it relates to the human body.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "215806",
        "number": "ARCHLGY 115",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "116",
        "title": "Heritage Development in the Global South (ANTHRO 118C)",
        "description": "Heritage is a site of both promise and contestation in the Global South. These nations use it for a wide range of purposes: Peru&iquest;s thriving tourism sector rests on a basis of heritage attractions, South Africa negotiates a post-apartheid identity through heritage, and India places increasing numbers of sites on the World Heritage List. Outlining different modes of heritage production and interpretation, this class investigates heritage regimes on scales ranging from local communities and national governance to international recognition. We will examine the role of heritage in building communities and identity; the place of heritage within economic development; the efforts of Global South countries to negotiate the legacies of colonialism and global inequality through managing their pasts; and the deployment of heritage as part of international power struggles within worldwide structures like UNESCO. Drawing on anthropology, heritage studies, and archaeology, students will gain a deeper understanding of how heritage is used by Global South countries to produce identity, support development, domesticate the past, and build the future.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220919",
        "number": "ARCHLGY 116",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "116A",
        "title": "Eating Culture: An Introduction to the Anthropology of Food",
        "description": "Everyone eats, it's an essential and universal part of human existence. But food is not just about calories and nutrition - it is rich with meaning and memory. In this course, we take a broad view of the social meanings of food, cooking, and eating to think about how food choices create and are produced by individual and group identities. We explore different methods that anthropologists use to study food, from the archaeological to the single ingredient study, and we deconstruct ideas about &quot;natural&quot; and &quot;good&quot; ways of eating by placing them in historical and transnational contexts. Enrollment by instructor consent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224494",
        "number": "ARCHLGY 116A",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "116B",
        "title": "Anthropology of the Environment (ANTHRO 116B, ANTHRO 216B)",
        "description": "This seminar interrogates the history of anthropology's approach to the environment, beginning with early functionalist, structuralist, and Marxist accounts of human-environment relationships. It builds towards more recent developments in the field, focusing on nonhuman and relational ontologies as well as current projects on the intersections of nature, capital, politics, and landscape histories. At the end of this class, students will be familiar with the intellectual histories of environmental anthropology and contemporary debates and tensions around questions of ethics, agency, environment, and historical causality.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "217910",
        "number": "ARCHLGY 116B",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "117",
        "title": "Virtual Italy (CLASSICS 115, ENGLISH 115, HISTORY 238C, ITALIAN 115)",
        "description": "Classical Italy attracted thousands of travelers throughout the 1700s. Referring to their journey as the &quot;Grand Tour,&quot; travelers pursued intellectual passions, promoted careers, and satisfied wanderlust, all while collecting antiquities to fill museums and estates back home. What can computational approaches tell us about who traveled, where and why? We will read travel accounts; experiment with parsing; and visualize historical data. Final projects to form credited contributions to the Grand Tour Project, a cutting-edge digital platform. No prior programming experience necessary.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30061",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220654",
        "number": "ARCHLGY 117",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "118",
        "title": "Engineering the Roman Empire (CLASSICS 168)",
        "description": "Enter the mind, the drafting room, and the building site of the Roman architects and engineers whose monumental projects impressed ancient and modern spectators alike. This class explores the interrelated aesthetics and mechanics of construction that led to one of the most extensive building programs undertaken by a pre-modern state. Through case studies ranging from columns, domes and obelisks to road networks, machines and landscape modification, we investigate the materials, methods, and knowledge behind Roman innovation, and the role of designed space in communicating imperial identity.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "12715",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "4:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Leidwanger, J.",
                                "sunet": "jleidwa"
                            },
                            {
                                "name": "Minney, B.",
                                "sunet": "teminney"
                            },
                            {
                                "name": "Tai, J.",
                                "sunet": "jonastai"
                            },
                            {
                                "name": "Lugardo, J.",
                                "sunet": "jjlugar"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 60600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "214576",
        "number": "ARCHLGY 118",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "119",
        "title": "Zooarchaeology: An Introduction to Faunal Remains (ANTHRO 119, ANTHRO 219)",
        "description": "As regularly noted, whether historic or pre-historic, animal bones are often the most commonly occurring artefacts on archaeological sites. As bioarchaeological samples, they offer the archaeologist an insight into food culture, provisioning, trade and the social aspects of human-animal interactions. The course will be taught through both practical and lecture sessions: the hands-on component is an essential complement to the lectures. The lectures will offer grounding in the main methodological approaches developed, as well as provide case-studies to illustrate where and how the methods have been applied. The practical session will walk students through the skeletal anatomy of a range of species. It will guide students on the identification of different parts of the animal, how to age / sex individuals, as well as recognize taphonomic indicators and what these mean to reconstructing post-depositional modifications.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "213776",
        "number": "ARCHLGY 119",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "121B",
        "title": "\"The Will to Adorn\": An Anthropology of Dress (AFRICAAM 121B, ANTHRO 121B, ANTHRO 221B, ARCHLGY 221B)",
        "description": "This seminar explores sartorial practices as a means for examining formations of identities and structural inequalities across space and time. Building off the definition of dress, pulled from Mary Ellen Roach-Higgins and Joanne B. Eicher, this course examines sartorial practices as social-cultural practices, shaped by many intersecting operations of power and oppression including racism, sexism, and classism, that involve modifications of the corporal form (i.e., scarification, body piercings, and hair alteration) as well as all three-dimensional supplements added to the body (i.e., clothing, hair combs, and jewelry). The emphasis on intersecting operations of power and oppression within this definition of dress draws on Kimberl&eacute; Crenshaw's conceptualization of intersectionality. Through case studies and examples from various parts of the world, we will explore multiple sources of data - documentary, material, and oral - that have come to shape the study of dress. We examine how dress intersects with facets of identity, including race, age, ethnicity, sexuality, and class.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14833",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Flewellen, A.",
                                "sunet": "ayanaf"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224254",
        "number": "ARCHLGY 121B",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "124",
        "title": "Archaeology of Food: production, consumption and ritual (ARCHLGY 224)",
        "description": "This course explores many aspects of food in human history from an archaeological perspective. We will discuss how the origins of agriculture helped to transform human society; how food and feasting played a prominent role in the emergence of social hierarchies and the development of civilization; and how various foodways influenced particular cultures. We will also conduct experimental studies to understand how certain methods of food procurement, preparation, and consumption can be recovered archaeologically.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14164",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            },
                            {
                                "name": "He, Y.",
                                "sunet": "yahuihe"
                            },
                            {
                                "name": "Li, J.",
                                "sunet": "jingboli"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "213737",
        "number": "ARCHLGY 124",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "125",
        "title": "Archaeological Field Survey Methods (ARCHLGY 225, ASNAMST 125A)",
        "description": "Practicum applying a variety of survey techniques to discover, map, and record archaeological sites. Basic cartographic skills for archaeologists and an introduction to GIS tools, GPS instruments, and geophysical techniques. Participants should be able to walk 3 - 4 miles over uneven terrain or make special arrangements with the instructor for transportation.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "211695",
        "number": "ARCHLGY 125",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "126",
        "title": "Archaeobotany (ARCHLGY 226, BIO 186, BIO 286)",
        "description": "Archaeobotany, also known as paleoethnobotany, is the study of the interrelationships of plants and humans through the archaeological record. Knowledge and understanding of Archaeobotany sufficient to interpret, evaluate, and understand archaeobotanical data. Dominant approaches in the study of archaeobotanical remains: plant macro-remains, pollen, phytoliths, and starch grains in the identification of diet and environmental reconstruction.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14028",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Grauer, K.",
                                "sunet": "kcgrauer"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "214924",
        "number": "ARCHLGY 126",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "127",
        "title": "HERITAGE POLITICS (ANTHRO 127D, ARCHLGY 227)",
        "description": "Heritage is a matter of the heart and not the brain, David Lowenthal once said. It does not seek to explore the past, but to domesticate it and enlist it for present causes. From the drafting of the first royal decrees on ancient monuments in the 17th century, political interests have had a hand in deciding which traditions, monuments and sites best represent and best serve the needs of the nation. The sum of these domestication efforts, the laws, institutions and practices established to protect and manage heritage, is what we call heritage governance. In this seminar you will learn about the politics of 21st century heritage governance at national and international level. Students will become familiar with key conventions and learn about the functioning of heritage institutions. We will also examine the hidden practices and current political developments that impact heritage governance: how UNESCO heritage sites become bargaining tools in international relations, how EU heritage policies are negotiated in the corridors of Brussels, and how the current re-nationalization of Western politics can affect what we come to know as our common past.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "221174",
        "number": "ARCHLGY 127",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "128",
        "title": "Europe Before the Romans: Early Complex Societies (CLASSICS 128)",
        "description": "This course will provide a broad introduction to theories of change in early complex societies and polities. Over the course of the quarter, we will examine a series of hotly debated theoretical frameworks. From the beginning, you will develop a case study for your final research paper using an appropriate theoretical framework. The course will look at a series of global case studies but will focus specifically on western Europe&iquest;s protohistoric Iron Age (c.800&iquest;100BCE), a period of technological innovation, rich art and cultural expression, rapidly growing connectivity and trade, alongside rapid social and political change.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30277",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "222967",
        "number": "ARCHLGY 128",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "129",
        "title": "Archaeology of Gender and Sexuality (ANTHRO 111, ANTHRO 211B, FEMGEN 119)",
        "description": "How archaeologists study sex, sexuality, and gender through the material remains left behind by past cultures and communities. Theoretical and methodological issues; case studies from prehistoric and historic archaeology.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28839",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "201459",
        "number": "ARCHLGY 129",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "129C",
        "title": "A Deep Dive Into the Indian Ocean: From Prehistory to the Modern Day (ANTHRO 129C, ANTHRO 229C, OCEANS 129C, OCEANS 229C)",
        "description": "The Indian Ocean has formed an enduring connection between three continents, countless small islands and a multitude of cultural and ethnic groups and has become the focus of increasing interest in this geographically vast and culturally diverse region. This course explores a range of topics and issues, from the nature and dynamics of colonization and cultural development as a way of understanding the human experience in this part of the world, to topics such as religion, disease, and heritage  The course guides studies in the many ways in which research in the Indian Ocean has a direct impact on our ability to compare developments in the Atlantic and Pacific. Significant work outside of class time is expected of the student for this course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31155",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222044",
        "number": "ARCHLGY 129C",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "130",
        "title": "Senior research seminar for Archaeology majors and minors",
        "description": "The aim of this research seminar is to provide an opportunity for students to experience and participate in research projects that bring together various aspects of the archaeology courses taken during the student's time at Stanford. The research projects will be tailored to the specific interests of the individual students involved and will involve individualized and independent research. In some cases the projects will grow out of Honors Theses, or out of fieldwork or internships undertaken. The projects will be individually supervised by the faculty teacher and will be designed to incorporate theory, method as well as particular information from particular regions and time periods. The projects will involve independent problem solving and writing up of results.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29900",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221501",
        "number": "ARCHLGY 130",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "132",
        "title": "Living in Places Studying Spaces: Archlgical and Crit. approaches to Spatial Production and Practice",
        "description": "This class will provide students with an understanding of space as socially constituted in the interactions between people and things. It will explore the multiple scales at which space is constituted and the modalities of this production. This exploration will emphasize the role and constitution of power, and consequently politics, in these interactions. In doing so, it also provides a historical introduction to several theories of space as they have been mobilized to examine spatial relations and explain social relations and change, including environmental adaptation, political relations, and identity and ideology. It also equips students with a body of theoretical tools to examine the spaces and places they find themselves in and might examine academically. As such then this class will equip students with the ability to move beyond perceptions of space as a `container,' within which things, people and practices are located along x,y, and z axes, to instead understand the ways in which places and the relationships between them are constituted, to produce space. Further, in understanding the constitution of space, it will elaborate the relationships between space, ideology, and socio-political order. This attention to the constitution of space, will equip them to both understand and explain why `Landscape (parsed as space in the usage of this class) is politics,' as Smith argues in the introductory reading of this class in week 1.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30380",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "223481",
        "number": "ARCHLGY 132",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "133",
        "title": "EXPERIMENTAL ARCHAEOLOGY (ARCHLGY 233)",
        "description": "This course is designed for graduate students who are interested in experimental study in archaeology. Undergraduates who are not Archaeology Majors will need permission from the instructor. We will discuss the current issues in the discipline, particularly related to archaeological research on food and foodways. We will conduct experimental study and laboratory analyses to investigate ancient human behavior in food fermentation. The archaeological methods include analyses of use-wear on stone tools and various microbotanical remains (starch, phytoliths, fibers, fungi, etc.) on artifacts.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "14079",
                "currentClassSize": "0",
                "maxClassSize": "4",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 42600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "221182",
        "number": "ARCHLGY 133",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "134",
        "title": "Museum Cultures: Exhibiting the African Imaginary (AFRICAST 134, AFRICAST 234, ARCHLGY 234, ARTHIST 284B)",
        "description": "Museums are dynamic spaces with the potential to reinvent, rehabilitate, and recenter marginalized people and collections. This year, our seminar examines and enacts museum stewardship of material cultures of diverse African communities across space, time, and context. Legacies of colonialism inspire debates on restitution, reparation, and reconciliation, alongside actions to 'decolonize' museum practice. In engaging the politics of representation and human-object relationships, our class will challenge problematic imaginaries of Africa and recenter the complexities of cultures in the Horn of Africa spanning Ethiopia, Nubian Egypt, and Sudan. Students will acquire skills in researching, curating, and installing an exhibition based on Stanford's African archeological and ethnographic materials held at the Stanford University Archeology Collections (SUAC). This course will culminate in a student-curated exhibition that opens on Friday May 27, 2022 at the Stanford Archeology Center (Bldg 500) and is planned to feature renowned Somali-Swedish archeologist, Dr. Sada Mire, as the keynote speaker.nnBecause of limited spacing you will need to fill out this form  https://forms.gle/h8F46iv5iSwiX3PY7 and receive consent to enroll in the course from the instructor.  nn3 credits (no final project) or 5 credits (final project). May be repeat for credit",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29480",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "216552",
        "number": "ARCHLGY 134",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "134A",
        "title": "Petroleum Geochemistry in Environmental and Archaeological Studies (ARCHLGY 234A, EPS 134, EPS 234)",
        "description": "(Former GEOLSCI 234) This course focuses on petroleum, including gases, liquids, refined products, and `tar' from seeps used as a binder in archaeological artifacts, such as projectile points or pottery. The course is designed for students of geology, environmental science, and archaeology. It shows how molecular fossils (biomarkers) and other petroleum compounds can be used to identify the origins of contaminants, assist strategies for remediation, deconvolute mixtures, and validate the spatial significance of mapped hydrocarbon distributions. Lectures explain the processes that control petroleum composition in the subsurface, marine or subaerial spills, and archaeological artifacts, e.g., biodegradation, photooxidation, and water washing. Case studies (e.g., Deepwater Horizon, Exxon Valdez, bitumen in Egyptian mummies, seeps and ancient Olmec artifacts) and exercises show how geochemistry and multivariate statistics (chemometrics) can be used in successful forensic or archaeological studies. Change of Department Name: Earth &amp; Planetary Sciences (Formerly Geological Science)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31541",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "8:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "320-241",
                        "instructors": [
                            {
                                "name": "Peters, K.",
                                "sunet": "kepeters"
                            }
                        ],
                        "startTimestamp": 30600.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223595",
        "number": "ARCHLGY 134A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "135",
        "title": "Constructing National History in East Asian Archaeology (ARCHLGY 235, CHINA 175, CHINA 275)",
        "description": "Archaeological studies in contemporary East Asia share a common concern, to contribute to building a national narrative and cultural identity. This course focuses on case studies from China, Korea, and Japan, examining the influence of particular social-political contexts, such as nationalism, on the practice of archaeology in modern times.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14193",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            },
                            {
                                "name": "Shen, J.",
                                "sunet": "jieshen9"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "212071",
        "number": "ARCHLGY 135",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "136",
        "title": "Latin American Pasts: Archaeology and Cultural Heritage (ANTHRO 136C)",
        "description": "Latin America is vast in pre-colonial and colonial monuments. Past societies defined by archaeologists - Aztecas, Chavin, Chinchorro, Inka, Maya, Moche, Nazca, Tiahuanaco, among others - cohabit with Spanish colonial era structures and contemporary human settlements. Most studies on Latin America have focused on monuments, conservation and sustainability, overlooking economic and social struggles related to heritage use and management. Selecting certain case studies of famous archaeological sites, this class will explore the main characteristics of pre-Hispanic cultures from an archaeological perspective as well as from critical heritage studies. Currently, Latin American regions and entire states have adopted some of these 'archaeological cultures' and redefined them as their 'ancestors', adopting archaeological discourses in their daily lives. In addition to learning about these sites archaeologically, this class will analyze native communities&acute; claims, development projects, education narratives, nation-branding documentaries and marketing spots, memes, and other resources. The class will also consider the accelerated urban growth of these areas - a major feature of Latin American and global south countries - and the consequences for the development of heritage and its sustainable conservation in the Spanish-speaking Americas.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223369",
        "number": "ARCHLGY 136",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "137",
        "title": "Political Exhumations. Killing Sites Research in Comparative Perspective (ANTHRO 137D, ARCHLGY 237, DLCL 237, REES 237)",
        "description": "The course discusses the politics and practices of exhumation of individual and mass graves. The problem of exhumations will be considered as a distinct socio-political phenomenon characteristic of contemporary times and related to transitional justice. The course will offer analysis of case studies of political exhumations of victims of the Dirty War in Argentina, ethnic cleansing in former Yugoslavia, the Holocaust, communist violence in Poland, the Rwandan genocide, and the Spanish Civil War. The course will make use of new interpretations of genocide studies, research of mass graves, such as environmental and forensic approaches.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221750",
        "number": "ARCHLGY 137",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "137A",
        "title": "The Archaeology of Africa and African Diaspora History and Culture (AFRICAAM 125, ANTHRO 137A, ANTHRO 237A, ARCHLGY 237A)",
        "description": "In recent decades, there has been a surge in archaeological research related to the African diaspora. What initially began as plantation archaeology and household archaeology to answer questions of African retention and identity, has now developed into an expansive sub-field that draws from collaborations with biological and cultural anthropologists. Similarly, methodological approaches have expanded to incorporate geospatial analysis, statistical analysis, and, more recently, maritime archaeological practices. The growth of African diaspora archaeology has thus pushed new methodological and theoretical considerations within the field of archaeology, and, inversely, added new insights in the field of Africana Studies. This course covers the thematic and methodological approaches associated with the historical archaeology of Africa and the African diaspora. Students interested in Africa and African diaspora studies, archaeology, slavery, and race should find this course useful. In addition to an overview of the development of African diaspora archaeology, students will be introduced to the major debates within the sub-field as well as its articulation with biological and socio-cultural anthropology. The course covers archaeological research throughout the wide geographical breadth of the African diaspora in Latin America, North America, the Caribbean, East, and West Africa, and the Indian Ocean. The themes covered include gender, race, identity, religion, and ethics in relation to the material record. Lectures will be supplemented with documentary films and other multimedia sources.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31220",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "500-106",
                        "instructors": [
                            {
                                "name": "Flewellen, A.",
                                "sunet": "ayanaf"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "225279",
        "number": "ARCHLGY 137A",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "138",
        "title": "Asian American and Settler Colonial Entanglements (ANTHRO 118W, ASNAMST 118, HISTORY 258C)",
        "description": "Today, the subject of decolonization is at the forefront of a wealth of scholarship as scholars, activists, and institutions grapple with the legacies of colonialism that are far from over. For Asian Americans, there are entanglements with colonialism in both the countries of their heritage and in the United States, complicating the scope of what it means to deal with colonialism. In this class we look at some of these relationships, thinking through the impact of various types of colonialism on history of Asian Americans, and their positionality alongside colonial structures in the United States. In doing so we look to unpack the nuances behind these interrelationships and the murky overlapping and underdiscussed dynamics that they create. We start the quarter with a discussion of what settler colonialism is, and key discussions of its intersections with the Asian American experience that emerged with the publication of Asian Settler Colonialism: From Local Governance to the Habits of Everyday Life in Hawai'i. We will then move to read our first two books of the quarter which focus on the intersections of Asian American labor and Indigenous erasure from the construction of the transcontinental railroad to the incarceration of Japanese Americans during WWII. From here we will pivot towards the Pacific and look to two books which seek to understand Asian American involvement with US colonial projects, and the wake of wartime and post-war resettlement. These works look past the North American continent to consider the ways in which transnational connections and diasporas become entangled with settler colonial projects. Throughout the course, students will work to develop their writing in formulating a research paper that they will work on in steps.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224960",
        "number": "ARCHLGY 138",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "139",
        "title": "Archaeology & Disability (ANTHRO 139A, ANTHRO 239A, ARCHLGY 239, FEMGEN 139A)",
        "description": "In this course, we will explore the ways archaeology and disability relate to each other, including both the ways archaeologists interpret disability in the past and how ableism shapes the practice of archaeology in the present. We will examine a variety of theoretical frames drawn from Disability Studies and other disciplines and consider how they can be usefully applied to archaeology. Case studies from a variety of geographic and temporal contexts will provide the basis for imagining an anti-ableist archaeology. By the end of the quarter, students will be able to: 1. Articulate several major ideas from disability studies and apply them to archaeological case studies; 2. Explain how disability studies and disabled self-advocates are reshaping the practice of archaeology; 3. Demonstrate improvement in the research and writing skills that they have chosen to develop through the flexible assignment structure of the course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31145",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "500-106",
                        "instructors": [],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "225411",
        "number": "ARCHLGY 139",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "140",
        "title": "Sicily and the Sea (CLASSICS 155)",
        "description": "Situated in the middle of the Mediterranean Sea, Sicily has for millennia represented a cultural crossroads and hub for the movement of peoples, objects, and ideas. Much of the island's history is reflected in sites and artifacts of maritime life: ancient ports and shipwrecked cargos; traditions and tools of marine resource exploitation; and boats that moved sailors, traders, warriors, fishermen, and displaced peoples across the ages. This course focuses on theoretical and practical engagement with the field, laboratory, and digital methods used by archaeologists to record and understand Sicily's deep cultural heritage along and under the sea. It aims to prepare students for maritime archaeological work and is a prerequisite for participation in the overseas summer field school in Sicily.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13753",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Leidwanger, J.",
                                "sunet": "jleidwa"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223702",
        "number": "ARCHLGY 140",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "141",
        "title": "\"Erotic\" Roman Art from Pompeii and Herculaneum (CLASSICS 141C)",
        "description": "This course explores controversial artworks and artifacts from Pompeii and Herculaneum which have been historically deemed as &quot;erotic&quot; and &quot;pornographic,&quot; from wall paintings displaying sexual intercourse to ornaments in the shape of winged phalluses. Students learn about the early excavations of this material, the invention of the word &quot;pornography,&quot; and the history of the &quot;Secret Cabinet&quot; in the National Archaeological Museum of Naples, where items deemed too sensitive for the public eye were locked away for decades in the nineteenth and twentieth centuries. Through this, we consider and engage with our own changing societal values surrounding such themes and objects. Students also learn and engage with multiple methodological and theoretical approaches that have been used to analyze &quot;erotic&quot; wall paintings and artifacts, including but not limited to psychoanalysis, &quot;male gaze&quot; theory, queer theory, and master-slave narratives.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31217",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "500-106",
                        "instructors": [
                            {
                                "name": "Crosson, S.",
                                "sunet": "sncross"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225600",
        "number": "ARCHLGY 141",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "145",
        "title": "Sailing the Wine-Dark Sea: Maritime Archaeology of the Ancient Mediterranean (CLASSICS 154)",
        "description": "Why do we care about shipwrecks? What can sunken sites and abandoned ports tell us about our past? Focusing primarily on the archaeological record of shipwrecks and harbors, along with literary evidence and contemporary theory, this course examines how and why ancient mariners ventured across the &quot;wine-dark seas&quot; of the Mediterranean for travel, warfare, pilgrimage, and especially commerce. We will explore interdisciplinary approaches to the development of maritime contacts and communication from the Bronze Age through the end of Roman era. At the same time, we will engage with practical techniques of maritime archaeology, which allows us to explore the material record first hand.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "15303",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Leidwanger, J.",
                                "sunet": "jleidwa"
                            },
                            {
                                "name": "Duchesne, M.",
                                "sunet": "duchesne"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-SI"
        ],
        "objectID": "214573",
        "number": "ARCHLGY 145",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "147B",
        "title": "World Heritage in Global Conflict (ANTHRO 147B, ANTHRO 247B)",
        "description": "Heritage is always political, it is typically said. Such a statement might refer to the everyday politics of local stakeholder interests on one end of the spectrum, or the volatile politics of destruction and erasure of heritage during conflict, on the other. If heritage is always political then one might expect that the workings of World Heritage might be especially fraught given the international dimension. In particular, the intergovernmental system of UNESCO World Heritage must navigate the inherent tension between state sovereignty and nationalist interests and the wider concerns of a universal regime. The World Heritage List has over 1000 properties has many such contentious examples, including sites in Iraq, Mali, Syria, Crimea, Palestine and Cambodia. As an organization UNESCO was born of war with an explicit mission to end global conflict and help the world rebuild materially and morally, but has found it&iquest;s own history increasingly entwined with that of international politics and violence.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216965",
        "number": "ARCHLGY 147B",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "148",
        "title": "Ceramic Analysis for Archaeologists (ARCHLGY 248)",
        "description": "The analysis and interpretation of ceramic remains allow archaeologists to accomplish varied ends: establish a time scale, document interconnections between different areas, and suggest what activities were carried out at particular sites. The techniques and theories used to bridge the gap between the recovery of ceramics and their interpretation within archaeological contexts is the focus of this seminar.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "213845",
        "number": "ARCHLGY 148",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "151",
        "title": "Ten Things: An Archaeology of Design (CLASSICS 151)",
        "description": "Connections among science, technology, society and culture by examining the design of a prehistoric hand axe, Egyptian pyramid, ancient Greek perfume jar, medieval castle, Wedgewood teapot, Edison's electric light bulb, computer mouse, Sony Walkman, supersonic aircraft, and BMW Mini. Interdisciplinary perspectives include archaeology, cultural anthropology, science studies, history and sociology of technology, cognitive science, and evolutionary psychology.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14332",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "200-203",
                        "instructors": [
                            {
                                "name": "Shanks, M.",
                                "sunet": "mshanks"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "204608",
        "number": "ARCHLGY 151",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "156",
        "title": "Design of Cities (CLASSICS 156, CLASSICS 256)",
        "description": "Long-term, comparative and archaeological view of urban planning and design. Cities are the fastest changing components of the human landscape and are challenging our relationships with nature. They are the historical loci of innovation and change, are cultural hotspots, and present a tremendous challenge through growth, industrial development, the consumption of goods and materials. We will unpack such topics by tracking the genealogy of qualities of life in the ancient Near Eastern city states and those of Graeco-Roman antiquity, with reference also to prehistoric built environments and cities in the Indus Valley and through the Americas. The class takes an explicitly human-centered view of urban design and one that emphasizes long term processes.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14992",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Shanks, M.",
                                "sunet": "mshanks"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31308",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "McMurtry Art Building 360",
                        "instructors": [
                            {
                                "name": "Shanks, M.",
                                "sunet": "mshanks"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217363",
        "number": "ARCHLGY 156",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "160",
        "title": "The Historical Archaeology of Latin America (CSRE 160A, HISTORY 274A)",
        "description": "How has the study of past material cultures contributed to our comprehension of the Iberian colonial experience in the New World? How has an archaeology of the recent past been presented to the public and made socially relevant in contemporary Latin American nations? This course invites students to address these questions in the light of current Latin American thought, and to gain innovative perspectives on the different processes through which archaeological knowledge participates in the formation and transformation of cultural, social, and racial identities in present-day Latin America. Exploring a wide array of scholarly literature--principally produced in countries such as Argentina, Brazil, Colombia, and Mexico--this course will offer detailed insight into the achievements, limitations, possibilities, and future challenges of Latin American historical archaeology. Through this course, students will be familiarized with some of the main topics that have been approached in Latin America, which range from the study of cultural contact in early colonial settlements to the development of forensic archaeology as a therapeutic instrument facilitating the remembrance of a traumatic past. Class discussions will also delve into rich archaeological evidence testifying to the development of specific social spaces and categories, such as maroons, colonial borderlands, or gentrified households in republican urban centers. The careful analysis of each one of these highly varied topics, as described in local archaeological literature, will contribute to a better understanding of how the politics of cultural heritage plays out across Latin America.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224418",
        "number": "ARCHLGY 160",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "161",
        "title": "The Archaeology of Institutions (ANTHRO 125C, HISTORY 107B)",
        "description": "Modern life is marked by institutions - schools, hospitals, international conglomerates, even prisons - so how did they develop and become so common? Historical archaeology can help us tell a different history of institutions because it combines documents, especially official records, with the material items left behind by the people who lived and worked in the institution. This course uses archaeological case studies to look at the different theoretical frameworks used to explain why institutions exist and how they function. We will also use practical examples to make connections between historical institutions and modern life. For example, what can looking at nineteenth century prison menus tell us about prison or hospital food today? And how can we use the archaeology of institutions to 'read' the Stanford campus? No prior archaeological experience required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224419",
        "number": "ARCHLGY 161",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "163",
        "title": "Movements and Migrations: Understanding the Movements of People (ANTHRO 134C, ASNAMST 163)",
        "description": "Mass movements of people across the world is not a new phenomenon. And yet, in the contemporary moment, the pace of migration from global business networks to displacements from violence and climate change as well as the interconnectivity of social networks is unprecedented. In this discussion seminar class, we will focus on the movements and migrations of people in North America. Though we will focus on the contemporary era, we start with examining the multiple ways that anthropologists understand, document, and make sense of the ways in which people have moved throughout history from bioanthropological, linguistic, archaeological, and ethnographic methodologies. We will further unpack some of the key theoretical discourses around the movement of people, and the frames of analysis that are commonly applied. By considering this topic through multiple lenses we will begin to appreciate the complexities of studying the movement of people and the relevance that these questions have to the present day. In addition to understanding the myriad of debates and case studies around movement and migration, students will develop their own research projects, learning essential skills in executing ethnographic approaches and applying the knowledge we survey throughout the course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224420",
        "number": "ARCHLGY 163",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "165",
        "title": "Roman Gladiators (CLASSICS 164)",
        "description": "In modern America, gladiators are powerful representatives of ancient Rome (Spartacus, Gladiator).  In the Roman world, gladiators were mostly slaves and reviled, barred from certain positions in society and doomed to short and dangerous lives.  A first goal of this course is to analyze Roman society not from the top down, from the perspective of politicians, generals and the literary elite, but from the bottom up, from the perspective of gladiators and the ordinary people in the stands.  A second goal is to learn how work with very different kinds of evidence: bone injuries, ancient weapons, gladiator burials, laws, graffiti written by gladiators or their fans, visual images of gladiatorial combats, and the intricate architecture and social control of the amphitheater.  A final goal is to think critically about modern ideas of Roman bloodthirst. Are these ideas justified, given the ancient evidence?",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "217300",
        "number": "ARCHLGY 165",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "166",
        "title": "African Archive Beyond Colonization (AFRICAAM 187, AFRICAST 117, CLASSICS 186, CLASSICS 286, CSRE 166)",
        "description": "From street names to monuments, the material sediments of colonial time can be seen, heard, and felt in the diverse cultural archives of ancient and contemporary Africa. This seminar aims to examine the role of ethnographic practice in the political agendas of past and present African nations. In the quest to reconstruct an imaginary of Africa in space and time, students will explore these social constructs in light of the rise of archaeology during the height of European empire and colonization. Particularly in the last 50 years, revived interest in African cultural heritage and preservation raises complex questions about the problematic tensions between European, American, and African theories of archaeological and ethnographic practice.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13812",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "50-52H",
                        "instructors": [
                            {
                                "name": "Derbew, S.",
                                "sunet": "sderbew"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "223454",
        "number": "ARCHLGY 166",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "173",
        "title": "Heritage Institutions Inside Out: The Power of Bureaucracies",
        "description": "Anyone interested in how objects, places and customs become heritage should be interested in bureaucracies. Given that dealing with bureaucratic procedures often cause something of an allergic reaction among people, heritage researchers included, it is perhaps no wonder that they have long been neglected as acts of heritage-making; considered less attractive research subjects than archaeological field ventures, World Heritage sites and grass root heritage communities. Yet it is precisely in the everyday practices of regional, national and international bureaucracies in the administrative tasks, paper shuffling and decisions taken across shiny tables that much of the power to define, select and configure the values of heritage lie. nThe main task of this course is to introduce bureaucracies as agents in sustaining and producing heritage regimes, and to discuss how to go about the study of such institutions. Drawing on the research of an emergent group of scholars dealing with UNESCO, the European Union, international corporations and national governments, the first set of seminars will explore the logics of Western bureaucracy and discuss specific examples relating to heritage. The second set of seminars will discuss some methods and analytical approaches to studying heritage bureaucracies, particularly ethnography and Actor Network Theory. Leaning on contemporary research in political anthropology, the points and pitfalls of document analysis, participant observation and interviewing will be covered, as will the challenges of analyzing such knowledge and turning it into academic text.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219121",
        "number": "ARCHLGY 173",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "180",
        "title": "Investigating Ancient Materials (ANTHRO 180B, ANTHRO 280B, ARCHLGY 280, MATSCI 127, MATSCI 227)",
        "description": "If you wish to enroll, please use the linked form to request instructor consent: https://tinyurl.com/AncientMaterials - This course examines how concepts and methods from materials science are applied to the analysis of archaeological artifacts, with a focus on artifacts made from inorganic materials (ceramics and metals). Coverage includes chemical analysis, microscopy, and testing of physical properties, as well as various research applications within anthropological archaeology. Students will learn how to navigate the wide range of available analytical techniques in order to choose methods that are appropriate to the types of artifacts being examined and that are capable of answering the archaeological questions being asked. ----- If you wish to enroll, please use the linked form to request instructor consent: https://tinyurl.com/AncientMaterials For full consideration, this form must be submitted by Monday, September 4th.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "13374",
                "currentClassSize": "0",
                "maxClassSize": "7",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "500-106",
                        "instructors": [
                            {
                                "name": "Chastain, M.",
                                "sunet": "mchast"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI",
            "WAY-SMA"
        ],
        "objectID": "223387",
        "number": "ARCHLGY 180",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "188",
        "title": "Matter and Mattering: Transdisciplinary Thinking about Things (ANTHRO 188, ANTHRO 288, APPPHYS 188)",
        "description": "Things sit at the nexus of cross-cutting heterogeneous processes; tracing the entanglements of any prominent thing or class of things demands a transdisciplinary approach that recruits expertise from the natural sciences, social sciences and humanities.  For example, carbon is a key factor in global warming for reasons that are as much socio-historical as bio-physical, and we could not begin to sketch the full significance of carbon without considering such diverse frames of reference.  Our growing appreciation in the social sciences and humanities of the agency, polyvalence and catalytic role of things has given rise to The New Materialist and Post-Humanist movements, which in turn raise questions about intra-action and observational perspective that are echoed in the modern physical and life sciences.  In this class we will explore these theoretical convergences in considering themes such as `things-in-themselves&iquest;, networks and open systems, assemblages and entanglements.  We will also examine specific examples such as oil, metal (guns), dams, viruses, electricity, mushrooms; each thing will be explored both in terms of its social and ethical entanglements and in terms of its material properties and affordances. There will also be hands-on encounters with objects in labs and a couple of local field trips. The key question throughout will be `why and how does matter matter in society today?",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220403",
        "number": "ARCHLGY 188",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "189",
        "title": "Physical Analysis of Artworks (APPPHYS 189)",
        "description": "Students explore the use of Stanford Nano Shared Facilities (SNSF) for physical analysis of material samples of interest for art conservation, technical art history and archaeology. Weekly SNSF demonstrations will be supplemented by lectures on intellectual context by Stanford faculty/staff and conservators from the Fine Arts Museums of San Francisco (FAMSF). Students will undertake analysis projects derived from ongoing conservation efforts at FAMSF, including training on the use of relevant SNSF instruments and data analysis.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "30142",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "221595",
        "number": "ARCHLGY 189",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "190",
        "title": "Archaeology Directed Reading/Independent Study",
        "description": null,
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29221",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10077",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Morris, I.",
                                "sunet": "imorris"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10569",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Morris, I.",
                                "sunet": "imorris"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "11448",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Shanks, M.",
                                "sunet": "mshanks"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10078",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Shanks, M.",
                                "sunet": "mshanks"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10975",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10995",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Voss, B.",
                                "sunet": "bvoss"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "14985",
                "currentClassSize": "0",
                "maxClassSize": "2",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Trivedi, M.",
                                "sunet": "mudit1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210802",
        "number": "ARCHLGY 190",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 8
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "193A",
        "title": "Archaeology and Environmental Aesthetics (CLASSICS 193, CLASSICS 293)",
        "description": "What do archaeologists have to say about long-term human relationships with the environment? How might archaeology inform our understanding of current concerns with agency and climate change? In this seminar we will explore the key concepts and concerns of a transdisciplinary field of environmental aesthetics. Taking in recent debates about the ontology and temporality of building archaeological knowledge, we will critically interrogate concepts such as land and landscape, nature and culture, dwelling and lifeworld, as a means of developing an archaeology beyond a science-humanities dualism that engages actively with the challenge of changing relationships with the environment.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224540",
        "number": "ARCHLGY 193A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "195",
        "title": "Independent Study/Research",
        "description": "Students conducting independent study and or research with archaeology faculty members.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29278",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10819",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Voss, B.",
                                "sunet": "bvoss"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "13111",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Leidwanger, J.",
                                "sunet": "jleidwa"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10963",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Shanks, M.",
                                "sunet": "mshanks"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "14152",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seetah, K.",
                                "sunet": "kseetah"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10964",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Voss, B.",
                                "sunet": "bvoss"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "14964",
                "currentClassSize": "0",
                "maxClassSize": "2",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chastain, M.",
                                "sunet": "mchast"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "13297",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Leidwanger, J.",
                                "sunet": "jleidwa"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "211754",
        "number": "ARCHLGY 195",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 8
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "198A",
        "title": "Archaeological Geographic Information Systems (ANTHRO 198A, ANTHRO 298A, ARCHLGY 298A)",
        "description": "This advanced undergraduate and graduate seminar will provide students with practical and theoretical training in Geographical Information Systems (GIS) as applied to archaeological research, introducing students to spatial theories and GIS methodological applications to research design and analysis. Topics covered in the course will include: cartographic skills of displaying and visualizing archaeological data, GIS applications to research design and sampling, data acquisition and generation, spatial analyses of artifacts, features, sites, and landscapes, as well as a critical evaluation of the strengths and limitations of GIS spatial analyses and epistemologies. Prerequisites: By instructor consent. Significant work outside of class time is expected of the student in this course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15248",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bauer, A.",
                                "sunet": "ambauer"
                            },
                            {
                                "name": "Engel, C.",
                                "sunet": "cengel"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224368",
        "number": "ARCHLGY 198A",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "199",
        "title": "Honors Independent Study",
        "description": "Independent study with honors faculty adviser.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "6",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29217",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10732",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Morris, I.",
                                "sunet": "imorris"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10614",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Morris, I.",
                                "sunet": "imorris"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11269",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Voss, B.",
                                "sunet": "bvoss"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "12096",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Leidwanger, J.",
                                "sunet": "jleidwa"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "11765",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Leidwanger, J.",
                                "sunet": "jleidwa"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210660",
        "number": "ARCHLGY 199",
        "units": [
            5,
            6
        ],
        "totalSections": 6
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "201",
        "title": "Becoming Muslim: Practice, Assemblage, Tradition (ANTHRO 304)",
        "description": "The growing study of material Islam broadly occupies two distinct fields: first, archaeologies of premodern Islam and material histories and second, ethnographic meditations on the distinctive relation between the materiality of practice and subjectivity in muslim societies. This intensive reading seminar brings major recent studies from both these fields into conversation. We will read archaeological, historical, and ethnographic studies to consider how debates over the materiality of practice from muslim contexts pose problems to social theory. The course will first engage with definitional and theoretical problems in understanding Islam and conversion to Islam. Subsequently, the course considers the following themes: conduct, embodiment, prayer, suffering and care. Through these engagements we will examine the relations between moral and material substance, the place of objects within ethical pursuits, and the salience of material assemblages to the in/disciplines of the body. These explorations will be situated within wider anthropological discussions of agency and volition, becoming, and theorizations of materiality, assemblages, and forms of life.Prerequisite: consent of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223151",
        "number": "ARCHLGY 201",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "211",
        "title": "Emergence of Chinese Civilization from Caves to Palaces (ARCHLGY 111, CHINA 176, CHINA 276)",
        "description": "Introduces processes of cultural evolution from the Paleolithic to the Three Dynasties in China. By examining archaeological remains, ancient inscriptions, and traditional texts, four major topics will be discussed: origins of modern humans, beginnings of agriculture, development of social stratification, and emergence of states and urbanism.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13661",
                "currentClassSize": "0",
                "maxClassSize": "14",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            },
                            {
                                "name": "Shen, J.",
                                "sunet": "jieshen9"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Monday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "14045",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210933",
        "number": "ARCHLGY 211",
        "units": [
            3,
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "221B",
        "title": "\"The Will to Adorn\": An Anthropology of Dress (AFRICAAM 121B, ANTHRO 121B, ANTHRO 221B, ARCHLGY 121B)",
        "description": "This seminar explores sartorial practices as a means for examining formations of identities and structural inequalities across space and time. Building off the definition of dress, pulled from Mary Ellen Roach-Higgins and Joanne B. Eicher, this course examines sartorial practices as social-cultural practices, shaped by many intersecting operations of power and oppression including racism, sexism, and classism, that involve modifications of the corporal form (i.e., scarification, body piercings, and hair alteration) as well as all three-dimensional supplements added to the body (i.e., clothing, hair combs, and jewelry). The emphasis on intersecting operations of power and oppression within this definition of dress draws on Kimberl&eacute; Crenshaw's conceptualization of intersectionality. Through case studies and examples from various parts of the world, we will explore multiple sources of data - documentary, material, and oral - that have come to shape the study of dress. We examine how dress intersects with facets of identity, including race, age, ethnicity, sexuality, and class.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14836",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Flewellen, A.",
                                "sunet": "ayanaf"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224254",
        "number": "ARCHLGY 221B",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "224",
        "title": "Archaeology of Food: production, consumption and ritual (ARCHLGY 124)",
        "description": "This course explores many aspects of food in human history from an archaeological perspective. We will discuss how the origins of agriculture helped to transform human society; how food and feasting played a prominent role in the emergence of social hierarchies and the development of civilization; and how various foodways influenced particular cultures. We will also conduct experimental studies to understand how certain methods of food procurement, preparation, and consumption can be recovered archaeologically.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14165",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            },
                            {
                                "name": "He, Y.",
                                "sunet": "yahuihe"
                            },
                            {
                                "name": "Li, J.",
                                "sunet": "jingboli"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213737",
        "number": "ARCHLGY 224",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "225",
        "title": "Archaeological Field Survey Methods (ARCHLGY 125, ASNAMST 125A)",
        "description": "Practicum applying a variety of survey techniques to discover, map, and record archaeological sites. Basic cartographic skills for archaeologists and an introduction to GIS tools, GPS instruments, and geophysical techniques. Participants should be able to walk 3 - 4 miles over uneven terrain or make special arrangements with the instructor for transportation.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "211695",
        "number": "ARCHLGY 225",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "226",
        "title": "Archaeobotany (ARCHLGY 126, BIO 186, BIO 286)",
        "description": "Archaeobotany, also known as paleoethnobotany, is the study of the interrelationships of plants and humans through the archaeological record. Knowledge and understanding of Archaeobotany sufficient to interpret, evaluate, and understand archaeobotanical data. Dominant approaches in the study of archaeobotanical remains: plant macro-remains, pollen, phytoliths, and starch grains in the identification of diet and environmental reconstruction.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13658",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Grauer, K.",
                                "sunet": "kcgrauer"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214924",
        "number": "ARCHLGY 226",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "227",
        "title": "HERITAGE POLITICS (ANTHRO 127D, ARCHLGY 127)",
        "description": "Heritage is a matter of the heart and not the brain, David Lowenthal once said. It does not seek to explore the past, but to domesticate it and enlist it for present causes. From the drafting of the first royal decrees on ancient monuments in the 17th century, political interests have had a hand in deciding which traditions, monuments and sites best represent and best serve the needs of the nation. The sum of these domestication efforts, the laws, institutions and practices established to protect and manage heritage, is what we call heritage governance. In this seminar you will learn about the politics of 21st century heritage governance at national and international level. Students will become familiar with key conventions and learn about the functioning of heritage institutions. We will also examine the hidden practices and current political developments that impact heritage governance: how UNESCO heritage sites become bargaining tools in international relations, how EU heritage policies are negotiated in the corridors of Brussels, and how the current re-nationalization of Western politics can affect what we come to know as our common past.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221174",
        "number": "ARCHLGY 227",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "229C",
        "title": "A Deep Dive Into the Indian Ocean: From Prehistory to the Modern Day",
        "description": "The Indian Ocean has formed an enduring connection between three continents, countless small islands and a multitude of cultural and ethnic groups and has become the focus of increasing interest in this geographically vast and culturally diverse region. This course explores a range of topics and issues, from the nature and dynamics of colonization and cultural development as a way of understanding the human experience in this part of the world, to topics such as religion, disease, and heritage  The course guides studies in the many ways in which research in the Indian Ocean has a direct impact on our ability to compare developments in the Atlantic and Pacific. Significant work outside of class time is expected of the student for this course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15247",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224797",
        "number": "ARCHLGY 229C",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "233",
        "title": "EXPERIMENTAL ARCHAEOLOGY (ARCHLGY 133)",
        "description": "This course is designed for graduate students who are interested in experimental study in archaeology. Undergraduates who are not Archaeology Majors will need permission from the instructor. We will discuss the current issues in the discipline, particularly related to archaeological research on food and foodways. We will conduct experimental study and laboratory analyses to investigate ancient human behavior in food fermentation. The archaeological methods include analyses of use-wear on stone tools and various microbotanical remains (starch, phytoliths, fibers, fungi, etc.) on artifacts.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "13659",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 42600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221182",
        "number": "ARCHLGY 233",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "234",
        "title": "Museum Cultures: Exhibiting the African Imaginary (AFRICAST 134, AFRICAST 234, ARCHLGY 134, ARTHIST 284B)",
        "description": "Museums are dynamic spaces with the potential to reinvent, rehabilitate, and recenter marginalized people and collections. This year, our seminar examines and enacts museum stewardship of material cultures of diverse African communities across space, time, and context. Legacies of colonialism inspire debates on restitution, reparation, and reconciliation, alongside actions to 'decolonize' museum practice. In engaging the politics of representation and human-object relationships, our class will challenge problematic imaginaries of Africa and recenter the complexities of cultures in the Horn of Africa spanning Ethiopia, Nubian Egypt, and Sudan. Students will acquire skills in researching, curating, and installing an exhibition based on Stanford's African archeological and ethnographic materials held at the Stanford University Archeology Collections (SUAC). This course will culminate in a student-curated exhibition that opens on Friday May 27, 2022 at the Stanford Archeology Center (Bldg 500) and is planned to feature renowned Somali-Swedish archeologist, Dr. Sada Mire, as the keynote speaker.nnBecause of limited spacing you will need to fill out this form  https://forms.gle/h8F46iv5iSwiX3PY7 and receive consent to enroll in the course from the instructor.  nn3 credits (no final project) or 5 credits (final project). May be repeat for credit",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29481",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216552",
        "number": "ARCHLGY 234",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "234A",
        "title": "Petroleum Geochemistry in Environmental and Archaeological Studies (ARCHLGY 134A, EPS 134, EPS 234)",
        "description": "(Former GEOLSCI 234) This course focuses on petroleum, including gases, liquids, refined products, and `tar' from seeps used as a binder in archaeological artifacts, such as projectile points or pottery. The course is designed for students of geology, environmental science, and archaeology. It shows how molecular fossils (biomarkers) and other petroleum compounds can be used to identify the origins of contaminants, assist strategies for remediation, deconvolute mixtures, and validate the spatial significance of mapped hydrocarbon distributions. Lectures explain the processes that control petroleum composition in the subsurface, marine or subaerial spills, and archaeological artifacts, e.g., biodegradation, photooxidation, and water washing. Case studies (e.g., Deepwater Horizon, Exxon Valdez, bitumen in Egyptian mummies, seeps and ancient Olmec artifacts) and exercises show how geochemistry and multivariate statistics (chemometrics) can be used in successful forensic or archaeological studies. Change of Department Name: Earth &amp; Planetary Sciences (Formerly Geological Science)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31542",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "8:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "320-241",
                        "instructors": [
                            {
                                "name": "Peters, K.",
                                "sunet": "kepeters"
                            }
                        ],
                        "startTimestamp": 30600.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223595",
        "number": "ARCHLGY 234A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "235",
        "title": "Constructing National History in East Asian Archaeology (ARCHLGY 135, CHINA 175, CHINA 275)",
        "description": "Archaeological studies in contemporary East Asia share a common concern, to contribute to building a national narrative and cultural identity. This course focuses on case studies from China, Korea, and Japan, examining the influence of particular social-political contexts, such as nationalism, on the practice of archaeology in modern times.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14194",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            },
                            {
                                "name": "Shen, J.",
                                "sunet": "jieshen9"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "212071",
        "number": "ARCHLGY 235",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "237",
        "title": "Political Exhumations. Killing Sites Research in Comparative Perspective (ANTHRO 137D, ARCHLGY 137, DLCL 237, REES 237)",
        "description": "The course discusses the politics and practices of exhumation of individual and mass graves. The problem of exhumations will be considered as a distinct socio-political phenomenon characteristic of contemporary times and related to transitional justice. The course will offer analysis of case studies of political exhumations of victims of the Dirty War in Argentina, ethnic cleansing in former Yugoslavia, the Holocaust, communist violence in Poland, the Rwandan genocide, and the Spanish Civil War. The course will make use of new interpretations of genocide studies, research of mass graves, such as environmental and forensic approaches.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221750",
        "number": "ARCHLGY 237",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "237A",
        "title": "The Archaeology of Africa and African Diaspora History and Culture (AFRICAAM 125, ANTHRO 137A, ANTHRO 237A, ARCHLGY 137A)",
        "description": "In recent decades, there has been a surge in archaeological research related to the African diaspora. What initially began as plantation archaeology and household archaeology to answer questions of African retention and identity, has now developed into an expansive sub-field that draws from collaborations with biological and cultural anthropologists. Similarly, methodological approaches have expanded to incorporate geospatial analysis, statistical analysis, and, more recently, maritime archaeological practices. The growth of African diaspora archaeology has thus pushed new methodological and theoretical considerations within the field of archaeology, and, inversely, added new insights in the field of Africana Studies. This course covers the thematic and methodological approaches associated with the historical archaeology of Africa and the African diaspora. Students interested in Africa and African diaspora studies, archaeology, slavery, and race should find this course useful. In addition to an overview of the development of African diaspora archaeology, students will be introduced to the major debates within the sub-field as well as its articulation with biological and socio-cultural anthropology. The course covers archaeological research throughout the wide geographical breadth of the African diaspora in Latin America, North America, the Caribbean, East, and West Africa, and the Indian Ocean. The themes covered include gender, race, identity, religion, and ethics in relation to the material record. Lectures will be supplemented with documentary films and other multimedia sources.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31221",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "500-106",
                        "instructors": [
                            {
                                "name": "Flewellen, A.",
                                "sunet": "ayanaf"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "225279",
        "number": "ARCHLGY 237A",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "239",
        "title": "Archaeology & Disability (ANTHRO 139A, ANTHRO 239A, ARCHLGY 139, FEMGEN 139A)",
        "description": "In this course, we will explore the ways archaeology and disability relate to each other, including both the ways archaeologists interpret disability in the past and how ableism shapes the practice of archaeology in the present. We will examine a variety of theoretical frames drawn from Disability Studies and other disciplines and consider how they can be usefully applied to archaeology. Case studies from a variety of geographic and temporal contexts will provide the basis for imagining an anti-ableist archaeology. By the end of the quarter, students will be able to: 1. Articulate several major ideas from disability studies and apply them to archaeological case studies; 2. Explain how disability studies and disabled self-advocates are reshaping the practice of archaeology; 3. Demonstrate improvement in the research and writing skills that they have chosen to develop through the flexible assignment structure of the course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31881",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "500-106",
                        "instructors": [],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225411",
        "number": "ARCHLGY 239",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "248",
        "title": "Ceramic Analysis for Archaeologists (ARCHLGY 148)",
        "description": "The analysis and interpretation of ceramic remains allow archaeologists to accomplish varied ends: establish a time scale, document interconnections between different areas, and suggest what activities were carried out at particular sites. The techniques and theories used to bridge the gap between the recovery of ceramics and their interpretation within archaeological contexts is the focus of this seminar.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "213845",
        "number": "ARCHLGY 248",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "280",
        "title": "Investigating Ancient Materials (ANTHRO 180B, ANTHRO 280B, ARCHLGY 180, MATSCI 127, MATSCI 227)",
        "description": "If you wish to enroll, please use the linked form to request instructor consent: https://tinyurl.com/AncientMaterials - This course examines how concepts and methods from materials science are applied to the analysis of archaeological artifacts, with a focus on artifacts made from inorganic materials (ceramics and metals). Coverage includes chemical analysis, microscopy, and testing of physical properties, as well as various research applications within anthropological archaeology. Students will learn how to navigate the wide range of available analytical techniques in order to choose methods that are appropriate to the types of artifacts being examined and that are capable of answering the archaeological questions being asked. ----- If you wish to enroll, please use the linked form to request instructor consent: https://tinyurl.com/AncientMaterials For full consideration, this form must be submitted by Monday, September 4th.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "13682",
                "currentClassSize": "0",
                "maxClassSize": "7",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "500-106",
                        "instructors": [
                            {
                                "name": "Chastain, M.",
                                "sunet": "mchast"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223387",
        "number": "ARCHLGY 280",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "293",
        "title": "Living in Ancient China: A Material Culture History (HISTORY 393B)",
        "description": "(Undergraduates, enroll in 293B; Master's students, enroll in 393B.) This course explores the embodied means and meanings of &quot;living&quot; in ancient China, roughly from 1200 BCE to 220 CE, as a way of understanding the sociocultural history of the period. It discusses the lived, materialized experiences of the groups that originated from different cultural-geographic zones of then China, from the Central Plain and the Mongolian-Manchurian steppe to the coast of the East China Sea and the south of the Nanling Mountains. The material cultures these peoples once created--for the king's court, as well as for urban commoners and farmers--constitute what we will investigate along the way. Topics range widely from contemporary foodways, fashion, violence, and writing practice to cities, palaces, ritual monuments, luxury objects accessed by elites, and religious decorations designed for the afterlife. The weekly meeting is comprised of a mini-lecture and a longer discussion session. Hopefully, students will have a chance to visit Cantor Center for Visual Arts and study closely an assemblage of related artifacts taught in this course. No background knowledge of ancient China (or archaeology) is required or expected.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224005",
        "number": "ARCHLGY 293",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "298A",
        "title": "Archaeological Geographic Information Systems (ANTHRO 198A, ANTHRO 298A, ARCHLGY 198A)",
        "description": "This advanced undergraduate and graduate seminar will provide students with practical and theoretical training in Geographical Information Systems (GIS) as applied to archaeological research, introducing students to spatial theories and GIS methodological applications to research design and analysis. Topics covered in the course will include: cartographic skills of displaying and visualizing archaeological data, GIS applications to research design and sampling, data acquisition and generation, spatial analyses of artifacts, features, sites, and landscapes, as well as a critical evaluation of the strengths and limitations of GIS spatial analyses and epistemologies. Prerequisites: By instructor consent. Significant work outside of class time is expected of the student in this course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15249",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bauer, A.",
                                "sunet": "ambauer"
                            },
                            {
                                "name": "Engel, C.",
                                "sunet": "cengel"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224368",
        "number": "ARCHLGY 298A",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "299",
        "title": "INDEPENDENT STUDY/RESEARCH",
        "description": "nnINDEPENDENT STUDY/RESEARCH",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29582",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10976",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Liu, L.",
                                "sunet": "liliu"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "13025",
                "currentClassSize": "0",
                "maxClassSize": "1",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chastain, M.",
                                "sunet": "mchast"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11891",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Voss, B.",
                                "sunet": "bvoss"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "14291",
                "currentClassSize": "0",
                "maxClassSize": "2",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chastain, M.",
                                "sunet": "mchast"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "211798",
        "number": "ARCHLGY 299",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 5
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "303",
        "title": "Memory, Materiality, and Archaeology (ANTHRO 303X)",
        "description": "This seminar will explore several themes related to memory and material culture  - broadly conceived to include art, architecture, the built environment, and landscapes, through archaeological, historical, and ethnographic lenses. How can we understand the role of socially resonant individual and collective memories through materiality in the past? What is the materiality of memorialization and commemoration, and are they affected by political contestation and power? Additionally, how does material culture through anthropological interpretation aid or transform social memory in the present?This seminar does not attempt to be all-inclusive of the themes and topics generated by intersection of memory and materiality. Rather, the seminar is designed around an introduction to how humanists and social scientists (including sociocultural anthropologists and archaeologists) have approached social and collective memory, and seven specific theoretical or threads for which archaeologists offer unique insight. Some of the works we will read and discuss are established classics of archaeology and related disciplines, while others are more recent works. By putting certain works in conversation through our seminar, the aim is to push our understanding of the potential for thinking through materiality in exploring memory.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223491",
        "number": "ARCHLGY 303",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "367",
        "title": "Mediterranean Networks",
        "description": "The the ancient Mediterranean was highly interconnected is common knowledge, and the idea of integration has become a defining factory in current approaches to Greco-Roman cultural identities. Yet how connectivity functiond, and how we should effectively analyze it, are less well understood. This seminar highlights emerging network approaches--both broad theoretical network paradigms and specific network science methodologies--as conceptual tools for archaeological and historical investigations of cultural interaction (economic, religious, artistic, colonial, etc.) across the Mediterranean world.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "215914",
        "number": "ARCHLGY 367",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ARCHLGY",
        "code": "376",
        "title": "Methods, Theories, and Practice in Chinese Archaeology (CHINA 376)",
        "description": "This course is designed for graduate students who are interested in Chinese archaeology. We will discuss the current issues in the discipline, particularly related to archaeological research on food and foodways. We will conduct experimental study and laboratory analyses to investigate ancient human behavior in food procurement, preparation, and consumption. The archaeological methods include analyses of use-wear on stone tools and various microbotanical remains (starch, phytoliths, etc.) on artifacts.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220027",
        "number": "ARCHLGY 376",
        "units": [
            2,
            3,
            4,
            5
        ]
    }
]