[
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "16N",
        "title": "Behind \"Swingposium:\" Activism in Performing Arts (MUSIC 16N)",
        "description": "Swingposium (https://taiko.org/swingposium) is an immersive theater production, being  presented by San Jose Taiko at Stanford in November. It tells the hidden history of Japanese Americans boosting morale in WWII Incarceration Camps through swing dances with live big band music, and will include student performers from Stanford Jazz Orchestra, Stanford Taiko, Swingtime, and the Asian American Theater Project. This class - through readings and discussion, conversations with artists, and hands-on experience with taiko, theater and swing music/dance - explores foundations of this production: the Japanese American community, North American taiko, African American roots of big band and swing, and immersive and Asian American theater.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224384",
        "number": "ASNAMST 16N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "27SI",
        "title": "Revolution and the Pilipinx Diaspora: Exploring Global Activism in Local Communities (CSRE 27SI)",
        "description": "This course aims to provide students with an opportunity to not only learn about current issues in the local Filipino American community, but also develop their own plans to take action on social justice issues. Through mediums of art and reflection, we will explore themes of diaspora and liberation by focusing on the Filipino experience and the local and vocal histories of activism in the Bay Area. We will be connecting local histories to the current global narrative while also connecting our past to our own identity formation as activists and community leaders. In doing so, we hope to explore the implications of local activism within the greater context of global organizing. The course will expose students to local community leaders and ways in which they can support and plug in to local initiatives.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "214299",
        "number": "ASNAMST 27SI",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "31N",
        "title": "Behind the Big Drums: Exploring Taiko (MUSIC 31N)",
        "description": "Preference to Freshman. Since 1992 generations of Stanford students have heard, seen, and felt the power of taiko, big Japanese drums, at Admit Weekend, NSO, or Baccalaureate. Taiko is a relative newcomer to the American music scene. The contemporary ensemble drumming form, or kumidaiko, developed in Japan in the 1950s. The first North American taiko groups emerged from the Japanese American community shortly after and coincided with increased Asian American activism. In the intervening years, taiko has spread into communities in the UK, Europe, Australia, and South America. What drives the power of these drums? In this course, we explore the musical, cultural, historical, and political perspectives of taiko through readings and discussion, conversations with taiko artists, and learn the fundamentals of playing. With the taiko as our focal point, we find intersections of Japanese music, Japanese American history, and Asian American activism, and explore relations between performance, cultural expression, community, and identity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "29665",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Braun 131",
                        "instructors": [
                            {
                                "name": "Uyechi, L.",
                                "sunet": "uyechi"
                            },
                            {
                                "name": "Sano, S.",
                                "sunet": "sano"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    },
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Braun Rehearsal Hall",
                        "instructors": [
                            {
                                "name": "Uyechi, L.",
                                "sunet": "uyechi"
                            },
                            {
                                "name": "Sano, S.",
                                "sunet": "sano"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "219122",
        "number": "ASNAMST 31N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "90E",
        "title": "Investigating Identity Through Filipinx Fiction (COMPLIT 89, ENGLISH 90E)",
        "description": "This course is both a reading seminar featuring canonical and contemporary Filipinx authors (including Mia Alvar, Carlos Bulosan, Elaine Castillo, Bienvenido Santos, Lysley Tenorio and Jos&eacute; Rizal) and a writing workshop where students generate short stories exploring identity. Rizal's seminal novels Noli Me Tangere and El filibusterismo are &iquest;the earliest artistic expressions of the Asian colonial experience from the point of view of the oppressed&iquest; and through his work and the work of other Filipinx authors, we discover how both national and individual identities are not only challenged by adversity, trauma, violence, and war but also forged and strengthened by them. Note: First priority to undergrads. Students must attend the first class meeting to retain their roster spot.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "221439",
        "number": "ASNAMST 90E",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "91A",
        "title": "Asian American Autobiography/W (AMSTUD 91A, CSRE 91D, ENGLISH 91A)",
        "description": "This is a dual purpose class: a writing workshop in which you will generate autobiographical vignettes/essays as well as a reading seminar featuring prose from a wide range of contemporary Asian-American writers. Some of the many questions we will consider are:  What exactly is Asian-American memoir? Are there salient subjects and tropes that define the literature? And in what ways do our writerly interactions both resistant and assimilative with a predominantly non-Asian context in turn recreate that context? We'll be working/experimenting with various modes of telling, including personal essay, the epistolary form, verse, and even fictional scenarios. First priority to undergrads. Students must attend the first class meeting to retain their roster spot.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "32739",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "5:00:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lee, C.",
                                "sunet": "crlee"
                            }
                        ],
                        "startTimestamp": 61200.0,
                        "endTimestamp": 69600.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "WKS",
                "notes": null,
                "classId": "32750",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE",
            "WAY-EDP"
        ],
        "objectID": "219881",
        "number": "ASNAMST 91A",
        "units": [
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "100",
        "title": "Introduction to Asian American Studies (AMSTUD 100)",
        "description": "What is meant by the term Asian American? How have representations of Asian Americans influenced concepts of US citizenship and belonging? What are the social and political origins of the Asian American community? This course provides a critical introduction to the interdisciplinary field of Asian American studies. Drawing on historical, creative, and scholarly texts, the course examines the history and possibilities of Asian American community. To do this, we place the Asian American experience within a transnational context, paying particular attention to the ways that Asian American lives have been shaped by the legacies of US wars in Asia and by the history of US racism. In the process, we examine the role that representations of Asian Americans have played in shaping the boundaries of US citizenship and belonging. Throughout the course, we utilize our discussions of Asian American racialization and community formation to think critically about the social and political ramifications that the designation Asian American entails.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32735",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dinh, T.",
                                "sunet": "tmdinh"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "221643",
        "number": "ASNAMST 100",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "104",
        "title": "Sexual Violence in Asian America (FEMGEN 116)",
        "description": "The course will make connections across historical and everyday violence on Asian American women to think about why violence against Asian women in wartime is hypervisible, yet everyday sexual violence against Asian American women is invisible. Reading texts from Asian American studies and Black and women of color feminism, we will consider the socialization of sexual violence and rape culture historically and within the present.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32370",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dinh, T.",
                                "sunet": "tmdinh"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224747",
        "number": "ASNAMST 104",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "105",
        "title": "Vietnamese American Cultural Studies (AMSTUD 105B)",
        "description": "What is the role of Vietnamese American cultural production in Asian America? How do we reckon with dominant narratives of gratitude and freedom, or seek alternative histories by centering diasporic memory? And what does the 'post'-war generation have to say? To explore these questions, our class will examine writing and visual art from Vietnamese American cultural producers, including Trinh Mai, Thi Bui, Ocean Vuong, Adele Pham, Tuan Andrew Nguyen, and Soleil Ho. We'll think about connections between Vietnamese American cultural studies and Asian America through issues of abolition, sexual violence, representation, model minority, and more. Assignments will include free writes, discussion posts, a midterm, and a collaborative final project. Students will be encouraged to exercise their creativity and make connections to their everyday lives and communities.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32736",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224654",
        "number": "ASNAMST 105",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "110",
        "title": "The Development of the Southeast Asian American Communities:  A comparative analysis (AMSTUD 110A)",
        "description": "This course will examine the establishment of the Cambodian, Hmong, and Vietnamese communities in the US.  We will focus on the historical events that resulted in their immigration and arrival to the US as well as the similarities and differences in the ways in which they were received.  In addition, the course will focus on issues that impacted in the development of these communities focusing on the social, political, and economic processes by which new immigrant groups are incorporated into the American society.  The second part of the course will be devoted to analyzing contemporary issues including but not limited to: class status, educational attainment, ethnic identity, racialization, second generation, mass media representation, poverty, and economic mobility.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32738",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217604",
        "number": "ASNAMST 110",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "112",
        "title": "History of Asian Americans and the Law (AMSTUD 112, HISTORY 259B)",
        "description": "This course explores the unique role the law has played in Asian American racialization and identity formation while also introducing students to the fundamentals of legal analysis and research. Students will learn how to read legal documents such as case law, legislation, legal reviews, and executive orders alongside other primary sources such as newspaper reporting, oral histories, and cultural texts. In using the law to frame an analysis of Asian Americanness, students will put both the law and race under a critical lens and explore how the historical constructions of both have shaped the Asian American experience.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32972",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wang, Y.",
                                "sunet": "yuhew"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223891",
        "number": "ASNAMST 112",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "118",
        "title": "Asian American and Settler Colonial Entanglements (ANTHRO 118W, ARCHLGY 138, HISTORY 258C)",
        "description": "Today, the subject of decolonization is at the forefront of a wealth of scholarship as scholars, activists, and institutions grapple with the legacies of colonialism that are far from over. For Asian Americans, there are entanglements with colonialism in both the countries of their heritage and in the United States, complicating the scope of what it means to deal with colonialism. In this class we look at some of these relationships, thinking through the impact of various types of colonialism on history of Asian Americans, and their positionality alongside colonial structures in the United States. In doing so we look to unpack the nuances behind these interrelationships and the murky overlapping and underdiscussed dynamics that they create. We start the quarter with a discussion of what settler colonialism is, and key discussions of its intersections with the Asian American experience that emerged with the publication of Asian Settler Colonialism: From Local Governance to the Habits of Everyday Life in Hawai'i. We will then move to read our first two books of the quarter which focus on the intersections of Asian American labor and Indigenous erasure from the construction of the transcontinental railroad to the incarceration of Japanese Americans during WWII. From here we will pivot towards the Pacific and look to two books which seek to understand Asian American involvement with US colonial projects, and the wake of wartime and post-war resettlement. These works look past the North American continent to consider the ways in which transnational connections and diasporas become entangled with settler colonial projects. Throughout the course, students will work to develop their writing in formulating a research paper that they will work on in steps.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224960",
        "number": "ASNAMST 118",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "118S",
        "title": "Critical Family History: Narratives of Identity and Difference (AFRICAAM 118X, AMSTUD 118, CSRE 118S)",
        "description": "This course examines family history as a site for understanding identity, power, and social difference in American society. Focusing in particular on the intersections of race, gender, and sexuality, we approach the family as an archive through which we might write alternative histories to the ones that dominate the national historical consciousness. To do this, we examine memoirs, oral histories, and first-person documentaries as historical texts that can be used to foreground marginalized historical voices. Students will then be asked to apply course readings and theories to their own family histories as a means of better understanding issues of identity and difference.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "220637",
        "number": "ASNAMST 118S",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "125A",
        "title": "Archaeological Field Survey Methods (ARCHLGY 125, ARCHLGY 225)",
        "description": "Practicum applying a variety of survey techniques to discover, map, and record archaeological sites. Basic cartographic skills for archaeologists and an introduction to GIS tools, GPS instruments, and geophysical techniques. Participants should be able to walk 3 - 4 miles over uneven terrain or make special arrangements with the instructor for transportation.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "211695",
        "number": "ASNAMST 125A",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "126",
        "title": "The Labors of Care",
        "description": "Conversations around care have been experiencing a resurgence, particularly as the COVID-19 pandemic, racial and gendered violence, and environmental degradation has exacerbated crises across Black, Indigenous, and immigrant communities. Care has been discussed in multiple ways, from viral social media content on self care; the plight of essential workers; the increasing demands to care for elders, disabled loved ones, and children; to conversations around care in social movement settings, such as practices of mutual aid. In this course, we will be engaging in these conversations around care and care labor as it relates to Asian, Pacific Islander, and Native Hawaiian communities. We will be delving into theoretical conversations around care as it relates to racial capitalism, migration, patriarchy, and white supremacy. We will be analyzing care in its multiple facets, from understanding how care labor has been often relegated to immigrant women and women of color, interrogating self care, to examining how care labor has been performed across Asian, Pacific Islander, and Native Hawaiian communities. Later on in the course, we will move from theories of care to practices of care, particularly looking at the histories of radical care in social movements. We will examine what care looks like in creating a new world rooted in justice and liberation, particularly self care, collective care, and care as it relates to topics such as disability justice, abolition, and decolonization.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32749",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225624",
        "number": "ASNAMST 126",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "131",
        "title": "Trauma, Healing, and Empowerment in Asian America (CSRE 131)",
        "description": "In these perilous times we need places of refuge where we can affirm our humanity and renew our commitment to social justice. Using historical and collective trauma of Asian Americans as a focus, we illuminate our current struggles to find meaning and balance in the face of anti-Asian violence. In a beloved community we gently witness and touch our wounds, finding healing and empowerment. Women elders lead us in healing practices that are experiential, embodied, and creative expression. Our practices are based in Heartfulness, mindfulness, compassion, and responsibility. This self-reflective process uses narrative, oral and written, as a way of becoming whole, healing wounds of home, community, roots, and identity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-CE",
            "WAY-EDP"
        ],
        "objectID": "224089",
        "number": "ASNAMST 131",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "132",
        "title": "Whose Classics? Race and Classical Antiquity in the U.S. (CLASSICS 132, CSRE 132)",
        "description": "Perceived as the privileged inheritance of white European (and later, American) culture, Classics has long been entangled with whiteness. We will examine this issue by flipping the script and decentering whiteness, focusing instead on marginalized communities of color that have been challenging their historic exclusion from classics. We will read classical works and their modern retellings by Black, Indigenous, Chicanx and Asian American intellectual leaders and explore how they critique classics' relationship to racism, nationalism, settler colonialism and imperialism. Readings include Sophocles' Oedipus Rex alongside Rita Dove's The Darker Face of the Earth, Euripides' Medea alongside Luis Alfaro's Mojada, Sophocles' Antigone alongside Beth Piatote's Ant&iacute;kone, and the selections from the Homeric Odyssey alongside Ocean Vuong's Night Sky with Exit Wounds.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "223552",
        "number": "ASNAMST 132",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "139",
        "title": "Refugees, Race and the Greco-Roman World (CLASSICS 139, CSRE 139)",
        "description": "Who is a refugee and who gets to decide? How does race impact who is welcomed into a new community and who is turned away? And what does the Greco-Roman world have to do this? This course will explore these questions by surveying different forms of forced displacement in and beyond antiquity through the lens of Critical Race Theory and Critical Refugee Studies.  We will examine how forcibly displaced people were portrayed and treated in ancient Greece and Rome and investigate how racialization contributed to xenophobic immigration policies as well as imperial agendas. We will then evaluate the impact of ancient discourses of forced displacement on the modern world, with a focus on American immigration policies. Understanding that refugees are not objects of investigation, but are powerful knowledge producers, we will also engage with works created by refugees throughout the course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224508",
        "number": "ASNAMST 139",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "144",
        "title": "Transforming Self and Systems: Crossing Borders of Race, Nation, Gender, Sexuality, and Class (CSRE 144, FEMGEN 144X, LIFE 144)",
        "description": "Exploration of crossing borders within ourselves, and between us and them, based on a belief that understanding the self leads to understanding others. How personal identity struggles have meaning beyond the individual, how self healing can lead to community healing, how the personal is political, and how artistic self expression based in self understanding can address social issues. The tensions of victimization and agency, contemplation and action, humanities and science, embracing knowledge that comes from the heart as well as the mind. Studies are founded in synergistic consciousness as movement toward meaning, balance, connectedness, and wholeness. Engaging these questions through group process, journaling, reading, drama, creative writing, and storytelling. Study is academic and self-reflective, with an emphasis on developing and presenting creative works in various media that express identity development across borders.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-CE",
            "WAY-EDP"
        ],
        "objectID": "212500",
        "number": "ASNAMST 144",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "151D",
        "title": "Migration and Diaspora in American Art, 1800-Present (AMSTUD 151, ARTHIST 151, ARTHIST 351, CSRE 151D)",
        "description": "This lecture course explores American art through the lens of immigration, exile, and diaspora. We will examine a wide range of work by immigrant artists and craftsmen, paying special attention to issues of race and ethnicity, assimilation, displacement, and political turmoil. Artists considered include Emmanuel Leutze, Thomas Cole, Joseph Stella, Chiura Obata, Willem de Kooning, Mona Hatoum, and Julie Mehretu, among many others. How do works of art reflect and help shape cultural and individual imaginaries of home and belonging?",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "219347",
        "number": "ASNAMST 151D",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "153P",
        "title": "Before the Model Minority: South Asians in the US (GLOBAL 253P, HISTORY 253P)",
        "description": "The model minority myth has been used to create a wedge between Asian and Black people in the United States, and masks the histories and lives of itinerant South Asian traders, laborers, and farmers. Beginning in the 1860s, South Asians (mostly male, and often undocumented) traveled to major ports in the US, such as New York City, New Orleans, and the California coast, where they found working-class jobs and married Puerto Rican, African American, Creole, and Mexican women. Some South Asians were double migrants, first brought to British colonies in the Caribbean and South America through indentured servitude, and later migrated to the United States. Their life stories expand to the racial history of the United States by looking beyond a Black/white binary. By juxtaposing immigrant stories with exclusionary US immigration laws, the course touches upon major themes of migration, capitalism, surveillance, race and racism, multiracial couples and communities, resistance, intersectional activism, borderlands and cities in the US, and the formation of national identity. During the quarter, we will seek to connect experiences in the past with contemporary issues of political culture in the United States to engage with the continuing challenge of locating and attaining self-definition, justice, and social progress in a fraught and divided world.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "31631",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "460-126",
                        "instructors": [
                            {
                                "name": "Akhter, M.",
                                "sunet": "makhter"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222772",
        "number": "ASNAMST 153P",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "163",
        "title": "Movements and Migrations: Understanding the Movements of People (ANTHRO 134C, ARCHLGY 163)",
        "description": "Mass movements of people across the world is not a new phenomenon. And yet, in the contemporary moment, the pace of migration from global business networks to displacements from violence and climate change as well as the interconnectivity of social networks is unprecedented. In this discussion seminar class, we will focus on the movements and migrations of people in North America. Though we will focus on the contemporary era, we start with examining the multiple ways that anthropologists understand, document, and make sense of the ways in which people have moved throughout history from bioanthropological, linguistic, archaeological, and ethnographic methodologies. We will further unpack some of the key theoretical discourses around the movement of people, and the frames of analysis that are commonly applied. By considering this topic through multiple lenses we will begin to appreciate the complexities of studying the movement of people and the relevance that these questions have to the present day. In addition to understanding the myriad of debates and case studies around movement and migration, students will develop their own research projects, learning essential skills in executing ethnographic approaches and applying the knowledge we survey throughout the course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224420",
        "number": "ASNAMST 163",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "169D",
        "title": "Contemporary Asian American Stories (ENGLISH 169D)",
        "description": "This course will examine the aesthetics and politics of contemporary Asian American storytellers, with an emphasis on work produced within the past five years. We will investigate the pressures historically placed on Asian Americans to tell a certain kind of story e.g. the immigrant story in a realist mode and the ways writers have found to surprise, question, and innovate, moving beyond those boundaries to explore issues of race, sexuality, science, memory, citizenship, and belonging. Course materials will consist of novels, short stories, graphic narrative, and film, and may include work by Ocean Vuong, Mira Jacobs, Gish Jen, Charles Yu, and Adrian Tomine, as well as Lulu Wangs 2019 film The Farewell. This seminar will feature both analytical and creative components, and students will be encouraged to produce both kinds of responses to the material.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31523",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "260-012",
                        "instructors": [
                            {
                                "name": "Tanaka, S.",
                                "sunet": "stanaka"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "222718",
        "number": "ASNAMST 169D",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "174S",
        "title": "When Half is Whole: Developing Synergistic Identities and Mestiza Consciousness (CSRE 174S, LIFE 174S)",
        "description": "This is an exploration of the ways in which individuals construct whole selves in societies that fragment, label, and bind us in categories and boxes. We examine identities that overcome the destructive dichotomies of us and them, crossing borders of race, ethnicity, culture, nation, sex, and gender. Our focus is on the development of hybrid and synergistic forms of identity and mestiza consciousness in which the whole is greater than the sum of its parts.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "213763",
        "number": "ASNAMST 174S",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "186B",
        "title": "Asian American Art (AMSTUD 186D, ARTHIST 186B)",
        "description": "This lecture course explores the work of artists, craftspeople, and laborers of Asian descent from 1850-present.  Rather than a discrete identity category, we approach 'Asian American' as an expansive, relational term that encompasses heterogenous experiences of racialization and migration.  Key themes include the history of immigration and displacement; diasporic geographies; art, activism, and community; feminist/queer perspectives; and interethnic conflict and solidarity.  The course coincides with the public launch exhibitions of the Asian American Art Initiative (AAAI) at the Cantor Arts Center and includes regular visits to the museum and Stanford Special Collections.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "218017",
        "number": "ASNAMST 186B",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "193F",
        "title": "Psychological Well-Being on Campus: Asian American Perspectives (EDUC 193F)",
        "description": "Topics: the Asian family structure, and concepts of identity, ethnicity, culture, and racism in terms of their impact on individual development and the counseling process. Emphasis is on empathic understanding of Asians in America. Group exercises.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Course meets in Vaden (Second Floor, Education Center, Room 270).",
                "classId": "11581",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lin, O.",
                                "sunet": "oliverl"
                            },
                            {
                                "name": "Hsu, H.",
                                "sunet": "helenhsu"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "101553",
        "number": "ASNAMST 193F",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "200R",
        "title": "Directed Research",
        "description": "May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "201072",
        "number": "ASNAMST 200R",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "200W",
        "title": "Directed Reading",
        "description": "(Staff)",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29148",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10384",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chang, G.",
                                "sunet": "gchang"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10385",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sohn, S.",
                                "sunet": "ssohn"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10905",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbo-Liu, D.",
                                "sunet": "palboliu"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11168",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lee, S.",
                                "sunet": "sslee1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "11205",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wotipka, C.",
                                "sunet": "cwotipka"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "201073",
        "number": "ASNAMST 200W",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 6
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "201",
        "title": "Doing Community History: Asian Americans and the Pandemic (AMSTUD 200R, HISTORY 200R)",
        "description": "Students utilize a community-engaged oral history methodology to produce short video documentaries focused on Asian Americans in the Covid-19 pandemic. In producing these collaborative digital history projects, students learn to evaluate the ways social power influences historical documentation at various levels including the making of sources, the construction of archives, and the telling of historical narratives. We ask: how have race and racism, ethnicity and community, gender and class, shaped the ways that the pandemic has influenced the lives of Asian Americans? To what extent have Asian American experiences with the pandemic been shaped by the recent global protests for racial justice and Black liberation? In studying the pandemic and its relationship to histories of race and racism, how should we understand the place of Asian Americans?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222555",
        "number": "ASNAMST 201",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "224",
        "title": "Asian American Racialization in Education (CSRE 224, EDUC 224)",
        "description": "This course examines how race and other social processes in education have shaped understandings of the racial category of &quot;Asian American.&quot; Students will investigate how education as a social institution makes, remakes, and challenges racial narratives about Asian Americans, as well as implications for the U.S. racial structure. Drawing upon research in Education, Sociology, and Asian American Studies, we interrogate assumptions about Asian Americans' educational success. Selected topics include parental engagement, race/ethnicity intersections, higher education, social class, and community organizing.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "224107",
        "number": "ASNAMST 224",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "254",
        "title": "Anti-Asian Violence in America: A History (HISTORY 254F)",
        "description": "This course places the recent wave of hate violence directed against Asian Americans in historical context.  The recent violence is the latest in a history that began with the arrival of Asian immigrants in America in the mid-19th century and continued into the 21st century.  Themes include anti-Asian racism; fears of a 'yellow peril' and race war; identifying Asians as perpetual foreigners and suspect aliens; race and wars in Asia and the consequences at home; fears of medical contamination; and gendered violence against Asian women.  Asian American responses to hatred are integrated throughout the course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223633",
        "number": "ASNAMST 254",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "261",
        "title": "Introduction to Asian American History (AMSTUD 261W, HISTORY 261E)",
        "description": "This course provides an introduction to the field of Asian American history. Tracing this history between the arrival of the first wave of Asian immigrants to the US in the mid-nineteenth century and the present, we foreground the voices and personal histories of seemingly everyday Asian Americans. In the process, the course disrupts totalizing national historical narratives that center the US nation-state and its political leaders as the primary agents of historical change.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "221717",
        "number": "ASNAMST 261",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "268",
        "title": "Tackling Asian-American Health Challenges (MED 268)",
        "description": "Why do certain diseases like hepatitis B affect Asian/Pacific Islanders (APIs) disproportionately? How can public policy advance health equity among ethnic groups? Weekly lectures examine health challenges endemic to the API community, recognizing underreported health issues in a prevalent ethnic demographic. Students will emerge with an understanding of topics including stigmas attached to traditional medicine, prevalent diseases in APIs, API health politics, and cultural/linguistic barriers that health professionals encounter. Guest speakers include professionals from the Ravenswood Family Health Center, the Santa Clara County Public Health Department, Hep B Free, the Stanford School of Medicine, etc.",
        "repeatable": "true",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31177",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "5:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palaniappan, L.",
                                "sunet": "lathap"
                            },
                            {
                                "name": "Lin, B.",
                                "sunet": "bylin"
                            }
                        ],
                        "startTimestamp": 63000.0,
                        "endTimestamp": 69600.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220083",
        "number": "ASNAMST 268",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "272",
        "title": "Science and History of Traditional Chinese Medicine (CHINA 272, MED 272)",
        "description": "Traditional Chinese medicine (TCM) is a unique system for the diagnosis and treatment of disease, as well as for the cultivation of life-long health and well-being. This course introduces basic TCM theories, practices, and treatment methods including acupuncture, Taichi, and herbal medicine.  We will introduce historical figures and events in the history of Traditional Chinese Medicine and East-West integrative health.  Drawing on science, cultural history, and philosophy, this interdisciplinary approach will help us to understand Traditional Chinese Medicine in its intellectual, social, and cultural context. We will discuss the scientific exploration of TCM and how modern science shapes our understanding of East-West integrative health.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32740",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ring, H.",
                                "sunet": "ring"
                            },
                            {
                                "name": "Lin, B.",
                                "sunet": "bylin"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224733",
        "number": "ASNAMST 272",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "281",
        "title": "Asian Religions in America; Asian American Religions (AMSTUD 281, RELIGST 281, RELIGST 381)",
        "description": "This course will analyze both the reception in America of Asian religions (i.e. of Buddhism in the 19th century), and the development in America of Asian American religious traditions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "214126",
        "number": "ASNAMST 281",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "284",
        "title": "Material Metonymy: Ceramics and Asian America (AMSTUD 284, ARTHIST 284, ARTHIST 484)",
        "description": "This course explores the rich history and contemporary state of ceramic production by Asian American/diasporic makers. It is also about the way history, culture, and emotion are carried by process, technique, and materials. Taught by an art historian and a physicist/ceramist, the course will privilege close examination of works of art at the Cantor Arts Center, and will also include artist studio visits, discussions with curators and conservators, demonstrations of and experimentation with technical processes of studio ceramics. This course is designed for students with interests in making, art history, engineering, intellectual history, and Asian American studies. Limited enrollment with applications due on Wed 8 March 2023; to receive application instructions please email the course instructors.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224303",
        "number": "ASNAMST 284",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "288",
        "title": "Cancer in Asian Americans: Epidemiology and Prevention (CHPR 288)",
        "description": "This course will provide an overview of cancer common or have higher risk (relative to other population) in Asian American populations. This course is designed to advance the understanding and knowledge of cancer etiology and prevention in Asian Americans and to raise awareness of the need of further research in this population to minimize disparity and achieve health equity. This course is relevant for students interested in cancer epidemiology, prevention, and public health.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32646",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224515",
        "number": "ASNAMST 288",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ASNAMST",
        "code": "298",
        "title": "Race, Gender, & Sexuality in Chinese History (CSRE 298G, FEMGEN 298C, HISTORY 298C, HISTORY 398C)",
        "description": "This course examines the diverse ways in which  identities--particularly race, ethnicity, gender and sexuality have been understood and experienced in Chinese societies, broadly defined, from the imperial period to the present day. Topics include changes in women's lives and status, racial and ethnic categorizations, homosexuality, prostitution, masculinity, and gender-crossing.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "220953",
        "number": "ASNAMST 298",
        "units": [
            5
        ]
    }
]