[
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "12SC",
        "title": "An Exploration of Art Materials:  The Intersection of Art and Science",
        "description": "There is growing interest in the intersection of art and science, whether from artists adapting technology to suit their visions or from scientists and engineers seeking to explain various visual effects.  To take advantage of possible creative sparks at the art/science interface, it is necessary for fuzzies and techies to have some knowledge of the language used by the other side. This interface will be explored through examining approaches used by an artist and an engineer in the context of the materials science of cultural objects.  In-class lectures, hands-on studio practice, and field trips will be used to illustrate these different perspectives. At the heart of the scientific approach is the notion that a cultural object, e.g., a painting, is a physical entity comprising materials with different physical properties and different responses to environmental stresses presented by light, heat, and water.  In support of this outlook, in-class lectures and discussions will focus on the basic concepts of color, optics, mechanics, composite structures, and response of the object to environmental stress, and we will visit Bay Area museums to see how artists employ such techniques. The hands-on studio experience is designed to increase students' confidence and develop their appreciation of differences in materials.  It is not necessary to have any artistic training, only a willingness to experiment. The in-class studio projects will include working with line and shadow; color, binders, and mordants; global sources of pigments; substrates and writing; and material failure. Students will make one technical presentation on a topic in one of the five areas relevant to a painting:  color, optics, mechanics, composites, and stress response. In addition, they will prepare one essay on the issues surrounding the intersection of art and science.  Finally, they will complete a project related to one of the thematic areas covered in the hands-on studio sessions and make a final oral presentation describing their project.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "215401",
        "number": "CHEMENG 12SC",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "20",
        "title": "Introduction to Chemical Engineering (ENGR 20)",
        "description": "Overview of chemical engineering through discussion and engineering analysis of physical and chemical processes. Topics: overall staged separations, material and energy balances, concepts of rate processes, energy and mass transport, and kinetics of chemical reactions. Applications of these concepts to areas of current technological importance: biotechnology, energy, production of chemicals, materials processing, and purification. Prerequisite: CHEM 31.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6218",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tarpeh, W.",
                                "sunet": "wtarpeh"
                            },
                            {
                                "name": "Ahn, J.",
                                "sunet": "jennaahn"
                            },
                            {
                                "name": "Miller, D.",
                                "sunet": "millerdm"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 51600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": "The course will meet in the Shriram Undergraduate Research Lab room 114.",
                "classId": "6836",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tarpeh, W.",
                                "sunet": "wtarpeh"
                            },
                            {
                                "name": "Ahn, J.",
                                "sunet": "jennaahn"
                            },
                            {
                                "name": "Miller, D.",
                                "sunet": "millerdm"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-EngrAppSci",
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "104257",
        "number": "CHEMENG 20",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "31N",
        "title": "When Chemistry Meets Engineering",
        "description": "Preference to freshmen. Chemistry and engineering are subjects that are ubiquitous around us. But what happens when the two meet? Students will explore this question by diving into experimental problems that scientists and engineers have to face on a daily basis. Many processes that are taken for granted have been developed by understanding science at a very fundamental level and then applying it to large and important industrial processes. In this seminar, students will explore some of the basic concepts that are important to address chemical engineering problems through experimental work. Students will build materials for energy and environmental applications, understand how to separate mixtures into pure compounds, produce fuels, and will learn to look at the chemical properties of molecules that are part of daily life with a different eye.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "218136",
        "number": "CHEMENG 31N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "55",
        "title": "Foundational Biology for Engineers (ENGR 55)",
        "description": "Biology, physics, and chemistry are the substrates for the modern engineer. Whether you are interested in developing the next generation of medicines or would like the next material or catalyst you design to be inspired by solutions found in Nature, this course will deepen your knowledge of the foundational concepts in biology and enrich your engineering skills. We will introduce the physical principles that underlie the construction and function of living cells, the fundamental building block of life. Emphasis will be on systems, logic, quantitation, and mechanisms of the molecular processes utilized by all life on Earth. This course has no prerequisites, but prior completion of CHEM 31 or equivalent is highly recommended.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6407",
                "currentClassSize": "0",
                "maxClassSize": "26",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Shriram 108",
                        "instructors": [
                            {
                                "name": "Swartz, J.",
                                "sunet": "jswartz"
                            },
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "223464",
        "number": "CHEMENG 55",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "60Q",
        "title": "Environmental Regulation and Policy",
        "description": "Preference to sophomores. How does government, politics and science affect environmental policy? We examine environmental policy including the precautionary principal, acceptable risks, mathematical models, and cost-effectiveness of regulation. You will learn how data is changing environmental regulation and how different administrations mold environmental policy in real-time. We examine the use of science and engineering, its media presentation and misrepresentation, and the effect of public scientific and technical literacy. You will learn how to participate in the process and effect change.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "GER:DB-EngrAppSci",
            "WAY-AQR"
        ],
        "objectID": "202348",
        "number": "CHEMENG 60Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "65Q",
        "title": "Chemical Engineering for Sustainability",
        "description": "Do you want to make the world more sustainable? How will we address the tremendous challenges that climate change brings? How can we reduce carbon emissions and not have huge disruptions in society? This class is for anyone who wants to create sustainable alternatives to what we use every day: engineers, scientists, those in humanities and the arts. Everyone has a role to play in designing our future. We will learn how to make the world more sustainable by exploring the exciting new world of (chemical) engineering sustainability. We will discuss renewable diesel and jet fuels; synthetic meat; compostable plastics; building materials that save energy; direct capture of carbon from the air; biological pharmaceuticals; and advanced recycling operations. The class starts with a brief overview of the deep cuts in carbon emissions and other pollutants that will be needed. Then, we focus on how sustainable (chemical) engineering can provide a solution, visiting four companies who are changing the world. Students will leave the class with an appreciation of how sustainable (chemical) engineering can help address climate change's substantial challenges, and perhaps an internship with one of the companies we visit. High school chemistry (balancing a chemical equation) and high school physics (unit conversions) are recommended for this course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "32526",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "Shriram 108",
                        "instructors": [
                            {
                                "name": "Libicki, S.",
                                "sunet": "slibicki"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR"
        ],
        "objectID": "223679",
        "number": "CHEMENG 65Q",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "90Q",
        "title": "Dare to Care: Compassionate Design",
        "description": "Imagine yourself with your abundant creativity, intellect, and passion, but your ability to move or speak is diminished. How would you face the world, how would you thrive at Stanford, how would you relay to people your ideas and creations? How would you share yourself and your ideas with the world? nThere are more than 50 million individuals in America with at least one disability, and in the current world of design, these differences are often overlooked. How do we as designers empower people of diverse physical abilities and provide them with means of self-expression?nnIn Compassionate Design, students from any prospective major are invited to explore the engineering design process by examining the needs of persons with disabilities. Through invited guests, students will have the opportunity to directly engage people with different types of disabilities as a foundation to design products that address problems of motion and mobility, vision, speech and hearing. For example, in class, students will interview people who are deaf, blind, have cerebral palsy, or other disabling conditions. Students will then be asked, using the design tools they have been exposed to as part of the seminar, to create a particular component or device that enhances the quality of life for that user or users with similar limitations.nnPresentation skills are taught and emphasized as students will convey their designs to the class and instructors. Students will complete this seminar with a compassionate view toward design for the disabled, they will acquire a set of design tools that they can use to empower themselves and others in whatever direction they choose to go, and they will have increased confidence and abilities in presenting in front of an audience.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "5697",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": "Shriram 366",
                        "instructors": [
                            {
                                "name": "Moalli, J.",
                                "sunet": "jmoalli"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "5844",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Shriram 366",
                        "instructors": [
                            {
                                "name": "Moalli, J.",
                                "sunet": "jmoalli"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "218971",
        "number": "CHEMENG 90Q",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "100",
        "title": "Chemical Process Modeling, Dynamics, and Control",
        "description": "Mathematical methods applied to engineering problems using chemical engineering examples. The development of mathematical models to describe chemical process dynamic behavior. Analytical and computer simulation techniques for the solution of ordinary differential equations. Dynamic behavior of linear first- and second-order systems. Introduction to process control. Dynamics and stability of controlled systems. Prerequisite: CME 100 or MATH 51&amp;52 | Corequisite: Chemeng 20",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "7061",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jaramillo, T.",
                                "sunet": "jaramilo"
                            },
                            {
                                "name": "Kamat, G.",
                                "sunet": "gkamat"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "7060",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "8:30:00 AM",
                        "endTime": "9:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jaramillo, T.",
                                "sunet": "jaramilo"
                            },
                            {
                                "name": "Kamat, G.",
                                "sunet": "gkamat"
                            }
                        ],
                        "startTimestamp": 30600.0,
                        "endTimestamp": 33600.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103272",
        "number": "CHEMENG 100",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "105",
        "title": "Applied Mathematics in Chemical Engineering",
        "description": "Applied Mathematics in Chemical Engineering",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30333",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224265",
        "number": "CHEMENG 105",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "110A",
        "title": "Introduction to Chemical Engineering Thermodynamics",
        "description": "Thermodynamics of single-component systems: laws of thermodynamics, thermodynamic properties, equations of state, properties of ideal and real fluids, phase transitions and phase equilibrium, design of thermodynamic processes including refrigeration and power cycles. This course is intended for undergraduate sophomores and juniors in engineering and/or the chemical sciences; first-year students require consent of instructor. Pre-/Corequisites: CHEM 33, PHYS 41, MATH 51 or CME 100.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6408",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Hewlett Teaching Center Rm 101",
                        "instructors": [
                            {
                                "name": "Qin, J.",
                                "sunet": "jianq"
                            },
                            {
                                "name": "Mai, D.",
                                "sunet": "djmai"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221911",
        "number": "CHEMENG 110A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "110B",
        "title": "Multi-Component and Multi-Phase Thermodynamics",
        "description": "Statistical mechanics for mixtures of ideal gases and simple liquids, covering both closed and open ensembles, is introduced. Molecular interactions underlying the non-ideal gaseous and liquid properties and nontrivial equations of states are surveyed. Chemical potential is introduced and emphasized as the essential concept for understanding the cause of solution instability and the criteria for phase equilibria. In particular, the vapor-liquid equilibria for non-ideal mixtures are discussed, and the basic modeling approach for describing the realistic mixture behavior such as azeotrope is explained. The connection of chemical potential with fugacity and activity is discussed. The applications of the established framework to reactive mixtures and to interfacial properties between coexisting phases are explored. Prerequisite: CHEMENG 110A or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "2261",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sagireddy, S.",
                                "sunet": "srikant"
                            },
                            {
                                "name": "Qin, J.",
                                "sunet": "jianq"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103273",
        "number": "CHEMENG 110B",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "120A",
        "title": "Fluid Mechanics",
        "description": "The flow of isothermal fluids from a momentum transport viewpoint. Continuum hypothesis, scalar and vector fields, fluid statics, non-Newtonian fluids, shell momentum balances, equations of motion and the Navier-Stokes equations, creeping and potential flow, parallel and nearly parallel flows, time-dependent parallel flows, boundary layer theory and separation, introduction to drag correlations. Prerequisites: junior in Chemical Engineering or consent of instructor; CHEMENG 100 and CME 102 or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "2265",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ringsby, A.",
                                "sunet": "aringsby"
                            },
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103275",
        "number": "CHEMENG 120A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "120B",
        "title": "Energy and Mass Transport",
        "description": "General diffusive transport, heat transport by conduction, Fourier's law, conduction in composites with analogies to electrical circuits, advection-diffusion equations, forced convection, boundary layer heat transport via forced convection in laminar flow, forced convection correlations, free convection, free convection boundary layers, free convection correlations and application to geophysical flows, melting and heat transfer at interfaces, radiation, diffusive transport of mass for dilute and non-dilute transfer, mass and heat transport analogies, mass transport with bulk chemical reaction, mass transport with interfacial chemical reaction, evaporation. Prerequisite CHEMENG 120A or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "2260",
                "currentClassSize": "0",
                "maxClassSize": "26",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Guzman, K.",
                                "sunet": "kguzman1"
                            },
                            {
                                "name": "Humphrey, N.",
                                "sunet": "nhumphre"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 51600.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103276",
        "number": "CHEMENG 120B",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "130A",
        "title": "Microkinetics - Molecular Principles of Chemical Kinetics",
        "description": "This course will cover the basis of chemical kinetics that are used to design chemical processes and reactor design. Topics include: origin of rate expression in chemical reactions; experimental generation and analysis of kinetic data; relationship between kinetic and thermodynamic quantities; concepts of elementary steps and reaction orders; reactions in parallel and in sequence; branched reactions; collision theory and introduction to transition state theory; heterogeneous catalysis and surface reactions; enzymatic catalysis; applications of kinetics. Prerequisites: Chem 33; CME 100 or Math 51",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "2251",
                "currentClassSize": "0",
                "maxClassSize": "26",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cargnello, M.",
                                "sunet": "mcargn"
                            },
                            {
                                "name": "Shuchi, S.",
                                "sunet": "sbshuchi"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103278",
        "number": "CHEMENG 130A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "130B",
        "title": "Introduction to kinetics and reactor design",
        "description": "Introduction to kinetics and reactor design. Identification and comparison of different reactors. Application of rate laws, pseudo steady-state, quasi-equilibrium, and other non-reactive components to develop mathematical models describing different types of reactor systems. Analysis of reaction kinetics in the context of reactor design, and determination of rate laws and reaction mechanisms. Assessment and troubleshooting of reactors by identifying sources of deviations. Application of concepts of reactor design to questions in different fields such as ecology and epidemiology. Prerequisites: Chemeng 130A or equivalent",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6409",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Shriram 108",
                        "instructors": [
                            {
                                "name": "Gao, X.",
                                "sunet": "xjgao"
                            },
                            {
                                "name": "Cargnello, M.",
                                "sunet": "mcargn"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103287",
        "number": "CHEMENG 130B",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "140X",
        "title": "Micro and Nanoscale Fabrication Engineering (CHEMENG 440)",
        "description": "Survey of fabrication and processing technologies in industrial sectors, such as semiconductor, biotechnology, and energy. Chemistry and transport of electronic and energy device fabrication. Solid state materials, electronic devices and chemical processes including crystal growth, chemical vapor deposition, etching, oxidation, doping, diffusion, thin film deposition, plasma processing. Micro and nanopatterning involving photolithography, unconventional soft lithography and self assembly. Advanced undergraduates register for 170X; graduates register for 470.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30629",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225345",
        "number": "CHEMENG 140X",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "150",
        "title": "Biochemical Engineering (BIOE 150, CHEMENG 250)",
        "description": "Combines biological knowledge and methods with quantitative engineering principles. Quantitative review of biochemistry and metabolism as well as recombinant DNA technology and synthetic biology (metabolic engineering). The course begins with a review of basic cell biology, proceeds to bioprocess design and development, and ends with applied synthetic biology methods and examples. Prerequisite: CHEMENG 181 or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28268",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "28267",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103282",
        "number": "CHEMENG 150",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "170X",
        "title": "Mechanics of Soft Matter: Rheology (CHEMENG 470)",
        "description": "Soft matter comes in many forms and includes polymeric materials, suspensions, emulsions, foams, gels, and living tissue. These materials are characterized by being easily deformed and possessing internal relaxation time spectra. They are viscoelastic with responses that are intermediate between purely viscous liquids and perfectly elastic solids. This course provides an introduction to the subject of rheology, which concerns the deformation and flow of complex liquids and solids. Rheological testing is aimed at determining the relationships between the applied stresses in these materials and the resulting deformations. These are characterized by material functions, such as viscosity (shear and extensional), moduli, and compliances. These functions reflect the microstructure of the material being tested and microstructural models of polymers (single chain theories and reptation-based models), suspensions, emulsions, and foams will be presented. Experimental methods to measure materials subjected to both shearing and elongational deformations will be described. Many soft matter systems are influenced by interfacial phenomena (foams, emulsions, thin films in the human body) and interfacial rheological techniques will be discussed. Advanced undergraduates register for 170X; graduates register for 470. Prerequisites: ChE 120A or its equivalent (concurrent enrollment is permissible)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "213139",
        "number": "CHEMENG 170X",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "174",
        "title": "Environmental Microbiology I (BIO 273A, CEE 274A, CHEMENG 274)",
        "description": "Basics of microbiology and biochemistry. The biochemical and biophysical principles of biochemical reactions, energetics, and mechanisms of energy conservation. Diversity of microbial catabolism, flow of organic matter in nature: the carbon cycle, and biogeochemical cycles. Bacterial physiology, phylogeny, and the ecology of microbes in soil and marine sediments, bacterial adhesion, and biofilm formation. Microbes in the degradation of pollutants. Prerequisites: CHEM 33,CHEM 121 (formerly CHEM 35), and BIOSCI 83, CHEMENG 181, or equivalents.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "103678",
        "number": "CHEMENG 174",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "175X",
        "title": "Electrochemical Water Treatment: Materials and Processes (CEE 271C, CHEMENG 475)",
        "description": "Humans generate teraliters of wastewater every day, of which 80% is discharged without treatment. While societies struggle to manage waste, natural environmental cycles reuse any 'waste' product as starting material elsewhere. Polluted water threatens aquatic ecosystems and exacerbates water scarcity, which a majority of people globally will experience by 2030. Discharging wastewater is an unaffordable luxury for a world facing climate change and resource scarcity. Reframing waste streams as sources of raw materials motivates the design of selective materials and processes capable of converting water pollutants into valuable products. Electrochemical separations exhibit several benefits for wastewater treatment, including their modularity, substitution of chemical inputs with electricity, and fine-tune control over interfacial phenomena. In this course, students will learn the fundamental principles and design rules for electrochemical materials and processes for next-generation water treatment. Assignments will focus on critically reviewing electrochemical water treatment literature, evaluating applications for removing pollutants and creating products from aqueous streams, and contrasting various approaches to address water pollution. Throughout the course, students will build towards final projects proposing novel materials or processes for electrochemical water treatment.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223661",
        "number": "CHEMENG 175X",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "177",
        "title": "Data Science and Machine Learning Approaches in Chemical and Materials Engineering (CHEMENG 277, MATSCI 166, MATSCI 176)",
        "description": "Application of Data Science, Statistical Learning, and Machine Learning approaches to modern problems in Chemical and Materials Engineering. This course develops data science approaches, including their foundational mathematical and statistical basis, and applies these methods to data sets of limited size and precision. Methods for regression and clustering will be developed and applied, with an emphasis on validation and error quantification. Techniques that will be developed include linear and nonlinear regression, clustering and logistic regression, dimensionality reduction, unsupervised learning, neural networks, and hidden Markov models. These methods will be applied to a range of engineering problems, including conducting polymers, water purification membranes, battery materials, disease outcome prediction, genomic analysis, organic synthesis, and quality control in manufacturing. Prerequisites: CS 106A or permission from instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221913",
        "number": "CHEMENG 177",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "180",
        "title": "Chemical Engineering Plant Design",
        "description": "Open to seniors in chemical engineering or by consent of instructor. Application of chemical engineering principles to the design of practical plants for the manufacture of chemicals and related materials. Topics: flow-sheet development from a conceptual design, equipment design for distillation, chemical reactions, heat transfer, pumping, and compression; estimation of capital expenditures and production costs; plant construction.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Courses will be held in ALWAYM206 Computer Lab from 3:00 pm- 4:20 pm on the following dates: April 13, April 20, May 4, May 11, May 18, May 25, and June 1.",
                "classId": "6902",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tarpeh, W.",
                                "sunet": "wtarpeh"
                            },
                            {
                                "name": "Guo, J.",
                                "sunet": "jinyuguo"
                            },
                            {
                                "name": "Bunke, S.",
                                "sunet": "sambunke"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103289",
        "number": "CHEMENG 180",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "181",
        "title": "Biochemistry I (CHEM 181, CHEMENG 281)",
        "description": "Structure and function of major classes of biomolecules, including proteins, carbohydrates and lipids. Mechanistic analysis of properties of proteins including catalysis, signal transduction and membrane transport. Students will also learn to critically analyze data from the primary biochemical literature. Satisfies Central Menu Area 1 for Bio majors. Prerequisites: Chem 121.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Thursday 2:45pm meeting time is for required group tutorial sessions.",
                "classId": "5698",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "STLC 118",
                        "instructors": [
                            {
                                "name": "Cegelski, L.",
                                "sunet": "cegelski"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci"
        ],
        "objectID": "205215",
        "number": "CHEMENG 181",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "183",
        "title": "Biochemistry II (CHEM 183, CHEMENG 283)",
        "description": "Focus on metabolic biochemistry: the study of chemical reactions that provide the cell with the energy and raw materials necessary for life. Topics include glycolysis, gluconeogenesis, the citric acid cycle, oxidative phosphorylation, photosynthesis, the pentose phosphate pathway, and the metabolism of glycogen, fatty acids, amino acids, and nucleotides as well as the macromolecular machines that synthesize RNA, DNA, and proteins. Medical relevance is emphasized throughout. Satisfies Central Menu Area 1 for Bio majors. Prerequisite: CHEM 181 or CHEM 141 or CHEMENG 181/281.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "GER: DB-NatSci"
        ],
        "objectID": "205216",
        "number": "CHEMENG 183",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "185A",
        "title": "Chemical Engineering Laboratory A",
        "description": "Open to seniors in chemical engineering or by consent of instructor. This is the first part of a two-course laboratory sequence that is required for all Chemical Engineering majors. The CHEMENG 185A/B sequence emphasizes the development of critical thinking skills required to characterize, evaluate, and iteratively design an engineered system. These skills will be developed and practiced in CHEMENG 185A through guided lab units with an emphasis on experimental design, data analysis and interpretation, and technical communication. Considerable emphasis will be placed on developing written and oral technical communication skills. Satisfies the Writing in the Major (WIM) requirement. Prerequisite: CHEMENG 55.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": "Students must enroll in one of the two afternoon lab sections (either Wed. or Thur.). The course will meet in the Shriram Undergraduate Research Lab room 132.",
                "classId": "26480",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Guzman, K.",
                                "sunet": "kguzman1"
                            },
                            {
                                "name": "Abu-Remaileh, M.",
                                "sunet": "monther"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": "Students must enroll in one of the two afternoon lab sections (either Wed. or Thur.). The course will meet in the Shriram Undergraduate Research Lab room 130.",
                "classId": "26481",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Guzman, K.",
                                "sunet": "kguzman1"
                            },
                            {
                                "name": "Abu-Remaileh, M.",
                                "sunet": "monther"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 66000.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "LBS",
                "notes": "Students must enroll in one of the two afternoon lab sections (either Wed. or Thur.). The course will meet in the Shriram Undergraduate Research Lab room 132.",
                "classId": "30843",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Guzman, K.",
                                "sunet": "kguzman1"
                            },
                            {
                                "name": "Abu-Remaileh, M.",
                                "sunet": "monther"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 66000.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103292",
        "number": "CHEMENG 185A",
        "units": [
            5
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "185B",
        "title": "Chemical Engineering Laboratory B",
        "description": "Open to seniors in chemical engineering or by consent of instructor. This is the second course in a two-quarter sequence that focuses on critical thinking in experimental aspects of chemical engineering. Students will work in teams to prepare and revise project proposals with an emphasis on analyzing engineered systems to identify key unanswered questions. Students will develop and practice skills related to effective teamwork and communication. Prerequisite: CHEMENG 185A.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LAB",
                "notes": null,
                "classId": "28273",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103293",
        "number": "CHEMENG 185B",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "189",
        "title": "Career Building: Entrepreneurship / Intrapreneurship, People, Innovation, Decision-Making and Impact (CHEMENG 289, ENGR 289, RAD 189, RAD 289)",
        "description": "This course is designed to enable graduate students and advanced undergraduate students in science and engineering to hone strategies for career success. Drawing strongly on entrepreneurial principles and lessons from industry, the course complements the traditional curriculum by focusing on career-building tools that students need to improve their professional prospects and achieve their goals. Relevant for those who plan to pursue careers in academia and industry alike, a central focus will be on managing one's career as if it were a start-up, emphasizing principles that empower individuals to take more control of their futures: investing in yourself, building professional networks, taking intelligent risks, and making uncertainty and volatility work to one's advantage. Through a series of in-classroom presentations and interviews - with professors, entrepreneurs, executives, athletes, investors, and thought leaders from diverse fields and sectors - students will gain important knowledge and practical strategies, with course modules on topics such as ideation and innovation, the skill of self-advocacy, the fundamentals of negotiation, building and managing teams, and effective communication and storytelling. Additional modules will focus on biotechnology and deep tech start-up companies, as well as strategies for cultivating a successful academic career. The idea for this course emerged from the instructor's reflections on 30 years of research, teaching, mentorship, and deep entrepreneurial experiences spanning the gamut of approaches to translational science - academic discovery, invention, conceiving of and leading multi-institutional research centers, building research and business teams, launching and financing start-ups, building business models to advance real-world applications of cutting-edge science, and seeing through research-based companies to success (including growing an idea into a multi-billion dollar company). For this course, students will be expected to complete relevant reading assignments, participate actively in class dialogue, and complete regular writing assignments focused on course topics as they relate to ones own career-building needs and professional aspirations. Students may also have opportunities to lead class discussions on topics of interest.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "7091",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            },
                            {
                                "name": "Driskill, M.",
                                "sunet": "mmfd"
                            },
                            {
                                "name": "Farrell, C.",
                                "sunet": "farrellc"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223468",
        "number": "CHEMENG 189",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "190",
        "title": "Undergraduate Research in Chemical Engineering",
        "description": "Laboratory or theoretical work for undergraduates under the supervision of a faculty member. Research in one of the graduate research groups or other special projects in the undergraduate chemical engineering lab. Students should consult advisers for information on available projects. Course may be repeated.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "6",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28274",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27908",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "4047",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "4003",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "4052",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "4048",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "4004",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "4053",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "6456",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "4005",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "4054",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "4049",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "4006",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "4055",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "5953",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "6252",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Mai, D.",
                                "sunet": "djmai"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "6134",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tarpeh, W.",
                                "sunet": "wtarpeh"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "4007",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "6352",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Abu-Remaileh, M.",
                                "sunet": "monther"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "6460",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gao, X.",
                                "sunet": "xjgao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103294",
        "number": "CHEMENG 190",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6
        ],
        "totalSections": 60
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "190H",
        "title": "Undergraduate Honors Research in Chemical Engineering",
        "description": "For Chemical Engineering majors pursuing a B.S. with Honors degree who have submitted an approved research proposal to the department. Unofficial transcript must document BSH status and at least 9 units of 190H research for a minimum of 3 quarters May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29264",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28954",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "4054",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "4011",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "4059",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "4055",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "4012",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "4060",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "6459",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "4013",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "4061",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "4056",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "4014",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "4062",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "6457",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "4015",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "4063",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "6253",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Mai, D.",
                                "sunet": "djmai"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "6356",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Abu-Remaileh, M.",
                                "sunet": "monther"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "6461",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gao, X.",
                                "sunet": "xjgao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "204246",
        "number": "CHEMENG 190H",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 60
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "191H",
        "title": "Undergraduate Honors Seminar",
        "description": "For Chemical Engineering majors approved for B.S. with Honors research program. Honors research proposal must be submitted and unofficial transcript document BSH status prior to required concurrent registration in 190H and 191H.  May be repeated for credit. Corequisite: 190H",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "4387",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Guzman, K.",
                                "sunet": "kguzman1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "4496",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Guzman, K.",
                                "sunet": "kguzman1"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "4603",
                "currentClassSize": "0",
                "maxClassSize": "7",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Guzman, K.",
                                "sunet": "kguzman1"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "208766",
        "number": "CHEMENG 191H",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "193",
        "title": "Interdisciplinary Approaches to Human Health Research (BIO 193, BIOE 193, CHEM 193)",
        "description": "For undergraduate students participating in the Stanford ChEM-H Undergraduate Scholars Program. This course will expose students to interdisciplinary research questions and approaches that span chemistry, engineering, biology, and medicine. Focus is on the development and practice of scientific reading, writing, and presentation skills intended to complement hands-on laboratory research. Students will read scientific articles, write research proposals, make posters, and give presentations.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "221038",
        "number": "CHEMENG 193",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "196",
        "title": "Creating and Leading New Ventures in Engineering and Science-based Industries (CHEM 196, CHEM 296, CHEMENG 296)",
        "description": "Open to seniors and graduate students interested in the creation of new ventures and entrepreneurship in engineering and science intensive industries such as chemical, energy, materials, bioengineering, environmental, clean-tech, pharmaceuticals, medical, and biotechnology. Exploration of the dynamics, complexity, and challenges that define creating new ventures, particularly in industries that require long development times, large investments, integration across a wide range of technical and non-technical disciplines, and the creation and protection of intellectual property.  Covers business basics, opportunity viability, creating start-ups, entrepreneurial leadership, and entrepreneurship as a career. Teaching methods include lectures, case studies, guest speakers, and individual and team projects.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6345",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rosen, H.",
                                "sunet": "hrosen"
                            },
                            {
                                "name": "Niemann, V.",
                                "sunet": "vniemann"
                            },
                            {
                                "name": "Levy, R.",
                                "sunet": "wng2wng"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213687",
        "number": "CHEMENG 196",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "199",
        "title": "Undergraduate Practical Training",
        "description": "Only for undergraduate students majoring in Chemical Engineering. Students obtain employment in a relevant industrial or research activity to enhance their professional experience. Students submit a concise report detailing work activities, problems worked on, and key results. May be repeated for credit up to 3 units. Prerequisite: qualified offer of employment and consent of department. Prior approval by the Chemical Engineering Department is required; you must contact the Chemical Engineering Department's Student Services staff for instructions before being granted permission to enroll.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "221432",
        "number": "CHEMENG 199",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "250",
        "title": "Biochemical Engineering (BIOE 150, CHEMENG 150)",
        "description": "Combines biological knowledge and methods with quantitative engineering principles. Quantitative review of biochemistry and metabolism as well as recombinant DNA technology and synthetic biology (metabolic engineering). The course begins with a review of basic cell biology, proceeds to bioprocess design and development, and ends with applied synthetic biology methods and examples. Prerequisite: CHEMENG 181 or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28272",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "DIS",
                "notes": null,
                "classId": "28271",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103282",
        "number": "CHEMENG 250",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "274",
        "title": "Environmental Microbiology I (BIO 273A, CEE 274A, CHEMENG 174)",
        "description": "Basics of microbiology and biochemistry. The biochemical and biophysical principles of biochemical reactions, energetics, and mechanisms of energy conservation. Diversity of microbial catabolism, flow of organic matter in nature: the carbon cycle, and biogeochemical cycles. Bacterial physiology, phylogeny, and the ecology of microbes in soil and marine sediments, bacterial adhesion, and biofilm formation. Microbes in the degradation of pollutants. Prerequisites: CHEM 33,CHEM 121 (formerly CHEM 35), and BIOSCI 83, CHEMENG 181, or equivalents.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "103678",
        "number": "CHEMENG 274",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "277",
        "title": "Data Science and Machine Learning Approaches in Chemical and Materials Engineering (CHEMENG 177, MATSCI 166, MATSCI 176)",
        "description": "Application of Data Science, Statistical Learning, and Machine Learning approaches to modern problems in Chemical and Materials Engineering. This course develops data science approaches, including their foundational mathematical and statistical basis, and applies these methods to data sets of limited size and precision. Methods for regression and clustering will be developed and applied, with an emphasis on validation and error quantification. Techniques that will be developed include linear and nonlinear regression, clustering and logistic regression, dimensionality reduction, unsupervised learning, neural networks, and hidden Markov models. These methods will be applied to a range of engineering problems, including conducting polymers, water purification membranes, battery materials, disease outcome prediction, genomic analysis, organic synthesis, and quality control in manufacturing. Prerequisites: CS 106A or permission from instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221913",
        "number": "CHEMENG 277",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "281",
        "title": "Biochemistry I (CHEM 181, CHEMENG 181)",
        "description": "Structure and function of major classes of biomolecules, including proteins, carbohydrates and lipids. Mechanistic analysis of properties of proteins including catalysis, signal transduction and membrane transport. Students will also learn to critically analyze data from the primary biochemical literature. Satisfies Central Menu Area 1 for Bio majors. Prerequisites: Chem 121.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Thursday 2:45pm meeting time is for required group tutorial sessions.",
                "classId": "5147",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "STLC 118",
                        "instructors": [
                            {
                                "name": "Cegelski, L.",
                                "sunet": "cegelski"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "205215",
        "number": "CHEMENG 281",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "283",
        "title": "Biochemistry II (CHEM 183, CHEMENG 183)",
        "description": "Focus on metabolic biochemistry: the study of chemical reactions that provide the cell with the energy and raw materials necessary for life. Topics include glycolysis, gluconeogenesis, the citric acid cycle, oxidative phosphorylation, photosynthesis, the pentose phosphate pathway, and the metabolism of glycogen, fatty acids, amino acids, and nucleotides as well as the macromolecular machines that synthesize RNA, DNA, and proteins. Medical relevance is emphasized throughout. Satisfies Central Menu Area 1 for Bio majors. Prerequisite: CHEM 181 or CHEM 141 or CHEMENG 181/281.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "205216",
        "number": "CHEMENG 283",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "289",
        "title": "Career Building: Entrepreneurship / Intrapreneurship, People, Innovation, Decision-Making and Impact (CHEMENG 189, ENGR 289, RAD 189, RAD 289)",
        "description": "This course is designed to enable graduate students and advanced undergraduate students in science and engineering to hone strategies for career success. Drawing strongly on entrepreneurial principles and lessons from industry, the course complements the traditional curriculum by focusing on career-building tools that students need to improve their professional prospects and achieve their goals. Relevant for those who plan to pursue careers in academia and industry alike, a central focus will be on managing one's career as if it were a start-up, emphasizing principles that empower individuals to take more control of their futures: investing in yourself, building professional networks, taking intelligent risks, and making uncertainty and volatility work to one's advantage. Through a series of in-classroom presentations and interviews - with professors, entrepreneurs, executives, athletes, investors, and thought leaders from diverse fields and sectors - students will gain important knowledge and practical strategies, with course modules on topics such as ideation and innovation, the skill of self-advocacy, the fundamentals of negotiation, building and managing teams, and effective communication and storytelling. Additional modules will focus on biotechnology and deep tech start-up companies, as well as strategies for cultivating a successful academic career. The idea for this course emerged from the instructor's reflections on 30 years of research, teaching, mentorship, and deep entrepreneurial experiences spanning the gamut of approaches to translational science - academic discovery, invention, conceiving of and leading multi-institutional research centers, building research and business teams, launching and financing start-ups, building business models to advance real-world applications of cutting-edge science, and seeing through research-based companies to success (including growing an idea into a multi-billion dollar company). For this course, students will be expected to complete relevant reading assignments, participate actively in class dialogue, and complete regular writing assignments focused on course topics as they relate to ones own career-building needs and professional aspirations. Students may also have opportunities to lead class discussions on topics of interest.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "7092",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            },
                            {
                                "name": "Driskill, M.",
                                "sunet": "mmfd"
                            },
                            {
                                "name": "Farrell, C.",
                                "sunet": "farrellc"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223468",
        "number": "CHEMENG 289",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "296",
        "title": "Creating and Leading New Ventures in Engineering and Science-based Industries (CHEM 196, CHEM 296, CHEMENG 196)",
        "description": "Open to seniors and graduate students interested in the creation of new ventures and entrepreneurship in engineering and science intensive industries such as chemical, energy, materials, bioengineering, environmental, clean-tech, pharmaceuticals, medical, and biotechnology. Exploration of the dynamics, complexity, and challenges that define creating new ventures, particularly in industries that require long development times, large investments, integration across a wide range of technical and non-technical disciplines, and the creation and protection of intellectual property.  Covers business basics, opportunity viability, creating start-ups, entrepreneurial leadership, and entrepreneurship as a career. Teaching methods include lectures, case studies, guest speakers, and individual and team projects.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6346",
                "currentClassSize": "0",
                "maxClassSize": "27",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rosen, H.",
                                "sunet": "hrosen"
                            },
                            {
                                "name": "Niemann, V.",
                                "sunet": "vniemann"
                            },
                            {
                                "name": "Levy, R.",
                                "sunet": "wng2wng"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213687",
        "number": "CHEMENG 296",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "299",
        "title": "Graduate Practical Training",
        "description": "Only for graduate students majoring in Chemical Engineering. Students obtain employment in a relevant industrial or research activity to enhance their professional experience. Students submit a concise report detailing work activities, problems worked on, and key results. May be repeated for credit up to 3 units. Prerequisite: qualified offer of employment and consent of department. Prior approval by the Chemical Engineering Department is required; you must contact the Chemical Engineering Department's Student Services staff for instructions before being granted permission to enroll.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "6262",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "6256",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "6368",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221433",
        "number": "CHEMENG 299",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "300",
        "title": "Applied Mathematics in the Chemical and Biological Sciences (CME 330)",
        "description": "Mathematical solution methods via applied problems including chemical reaction sequences, mass and heat transfer in chemical reactors, quantum mechanics, fluid mechanics of reacting systems, and chromatography. Topics include generalized vector space theory, linear operator theory with eigenvalue methods, phase plane methods, perturbation theory (regular and singular), solution of parabolic and elliptic partial differential equations, and transform methods (Laplace and Fourier). Prerequisites: CME 102/ENGR 155A and CME 104/ENGR 155B, or equivalents.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "5133",
                "currentClassSize": "0",
                "maxClassSize": "52",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Huang Engineering Center 18",
                        "instructors": [
                            {
                                "name": "Shaqfeh, E.",
                                "sunet": "esgs"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "6944",
                "currentClassSize": "0",
                "maxClassSize": "42",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "540-108",
                        "instructors": [
                            {
                                "name": "Shaqfeh, E.",
                                "sunet": "esgs"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103383",
        "number": "CHEMENG 300",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "310",
        "title": "Microhydrodynamics (ME 451D)",
        "description": "Transport phenomena on small-length scales appropriate to applications in microfluidics, complex fluids, and biology. The basic equations of mass, momentum, and energy, derived for incompressible fluids and simplified to the slow-flow limit. Topics: solution techniques utilizing expansions of harmonic and Green's functions; singularity solutions; flows involving rigid particles and fluid droplets; applications to suspensions; lubrication theory for flows in confined geometries; slender body theory; and capillarity and wetting. Prerequisites: CHEMENG 120A, CHEMENG 120B, CHEMENG 300, or equivalents.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "7008",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Shaqfeh, E.",
                                "sunet": "esgs"
                            },
                            {
                                "name": "Zhao, S.",
                                "sunet": "szhao7"
                            },
                            {
                                "name": "Abels, K.",
                                "sunet": "abelsk"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32787",
                "currentClassSize": "0",
                "maxClassSize": "4535",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Shaqfeh, E.",
                                "sunet": "esgs"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "7126",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Shaqfeh, E.",
                                "sunet": "esgs"
                            },
                            {
                                "name": "Zhao, S.",
                                "sunet": "szhao7"
                            },
                            {
                                "name": "Abels, K.",
                                "sunet": "abelsk"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 58800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103384",
        "number": "CHEMENG 310",
        "units": [
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "320",
        "title": "Chemical Kinetics and Reaction Engineering",
        "description": "Theoretical and experimental tools useful in understanding and manipulating reactions mediated by small-molecules and biological catalysts. Theoretical: first classical chemical kinetics and transition state theory; then RRKM theory and Monte Carlo simulations. Experimental approaches include practical application of modern spectroscopic techniques, stopped-flow measurements, temperature-jump experiments, and single-molecule approaches to chemical and biological systems. Both theory and application are framed with regard to systems of particular interest, including industrially relevant enzymes, organometallic catalysts, heterogeneous catalysis, electron transfer reactions, and chemical kinetics within living cells. Prerequisites: CHEMENG 130A and CHEMENG 130B or equivalents.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29515",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210286",
        "number": "CHEMENG 320",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "340",
        "title": "Molecular Thermodynamics",
        "description": "Classical thermodynamics and quantum mechanics. Development of statistical thermodynamics to address the collective behavior of molecules. Establishment of theories for gas, liquid, and solid phases, including phase transitions and critical behavior. Applications include electrolytes, ion channels, surface adsorption, ligand binding to proteins, hydrogen bonding in water, hydrophobicity, polymers, and proteins. Prerequisites: CHEMENG 110A and CHEMENG 110B or equivalents.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "5433",
                "currentClassSize": "0",
                "maxClassSize": "65",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": "Thornton 102",
                        "instructors": [
                            {
                                "name": "Qin, J.",
                                "sunet": "jianq"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "140017",
        "number": "CHEMENG 340",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "345",
        "title": "Fundamentals and Applications of Spectroscopy (PHOTON 345)",
        "description": "Theoretical basis and experimental aspects of atomic and molecular spectroscopy, including spectroscopic transitions, transition probabilities, and selection rules. Applications of rotational, vibrational, and electronic spectroscopies emphasize the use of spectroscopy in modern research. Specific topics include but are not limited to microwave spectroscopy, infrared spectroscopy and Raman scattering, and photoelectron and fluorescence spectroscopies. Prerequisites: CME 104 or an equivalent intro to partial differential equations; CHEMENG 110A or CHEM 171 or an equivalent intro to physical chemistry.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6369",
                "currentClassSize": "0",
                "maxClassSize": "54",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jaramillo, T.",
                                "sunet": "jaramilo"
                            },
                            {
                                "name": "Yap, K.",
                                "sunet": "kyap"
                            },
                            {
                                "name": "Marin, D.",
                                "sunet": "dhm2121"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103386",
        "number": "CHEMENG 345",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "355",
        "title": "Advanced Biochemical Engineering (BIOE 355)",
        "description": "Combines biological knowledge and methods with quantitative engineering principles. Quantitative review of biochemistry and metabolism; recombinant DNA technology and synthetic biology (metabolic engineering). The production of protein pharaceuticals as a paradigm for the application of chemical engineering principles to advanced process development within the framework of current business and regulatory requirements. Prerequisite: CHEMENG 181 (formerly 188) or BIOSCI 41, or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "27910",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "27909",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103388",
        "number": "CHEMENG 355",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "420",
        "title": "Growth and Form",
        "description": "Advanced topics course examining the role of physical forces in shaping living cells, tissues, and organs, making use of D'Arcy Thompson's classic text On Growth and Form. The course begins with a review of relevant physical principles drawn from statistical physics, polymer theory, rheology and materials science. We then examine current knowledge of cellular mechanotransduction pathways, the roles of physical forces in guiding embryonic development, and the contribution of aberrant cellular response to mechanical cues in heart disease and cancer. The course concludes by examining current frontiers in stem cell biology and tissue engineering.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "213134",
        "number": "CHEMENG 420",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "424",
        "title": "Structure and Reactivity of Solid Surfaces",
        "description": "The structure of solid surfaces including experimental methods for determining the structure of single crystal surfaces. The adsorption of molecules on these surfaces including the thermodynamics of adsorption processes, surface diffusion, and surface reactions. Molecular structure of adsorbates. Current topics in surface structure and reactivity, including systems for heterogeneous catalysis and electronic materials.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "103395",
        "number": "CHEMENG 424",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "432",
        "title": "Electrochemical Energy Conversion (ENERGY 432)",
        "description": "Electrochemistry is playing an increasingly important role in renewable energy. This course aims to cover the fundamentals of electrochemistry, and then build on that knowledge to cover applications of electrochemistry in energy conversion. Topics to be covered include fuel cells, solar water-splitting, CO2 conversion to fuels and chemicals, batteries, redox flow cells, and supercapacitors. Prerequisites: CHEM 31AB or 31 M, CHEM 33, CHEMENG 110A/B, CHEMENG 130A/B, or equivalents. Recommended: CHEM 173.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "27636",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Gates B3",
                        "instructors": [
                            {
                                "name": "Jaramillo, T.",
                                "sunet": "jaramilo"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213133",
        "number": "CHEMENG 432",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "440",
        "title": "Micro and Nanoscale Fabrication Engineering (CHEMENG 140X)",
        "description": "Survey of fabrication and processing technologies in industrial sectors, such as semiconductor, biotechnology, and energy. Chemistry and transport of electronic and energy device fabrication. Solid state materials, electronic devices and chemical processes including crystal growth, chemical vapor deposition, etching, oxidation, doping, diffusion, thin film deposition, plasma processing. Micro and nanopatterning involving photolithography, unconventional soft lithography and self assembly. Advanced undergraduates register for 170X; graduates register for 470.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30628",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225345",
        "number": "CHEMENG 440",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "442",
        "title": "Suspension Mechanics",
        "description": "The course will begin with a brief recap of low-Reynolds number hydrodynamics and the analytical foundations for the study of pair-level particle interactions in a Newtonian solvent. Extension to many-body interactions will be covered in detail, with an introductory overview of computational methods. Brownian motion, thermodynamic forces, and other interparticle forces will be discussed, and various approaches for theoretical modeling will be covered, including Fokker-Planck / Smoluchowski analysis and Langevin analysis. Theoretical and computational modeling of material properties via averaging techniques will be studied, in the context of micromechanical and continuum models. Landmark results in the microrheology and rheology of complex fluids will be covered, including sedimentation, non-Newtonian rheology (including shear thinning and thickening; viscoelasticity and memory behaviors; yield-stress behavior; glassy aging; diffusion; normal stress differences).",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "220084",
        "number": "CHEMENG 442",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "443",
        "title": "Principles and practice of heterogeneous catalysis",
        "description": "Principles and practical aspects of heterogeneous catalysis. Preparation of catalytic solids. Techniques for the structural characterization of catalysts, including in-situ and operando. Best practices in both structural and catalytic characterization. Kinetic experiments for the characterization of catalytic activity of materials and the determination of active sites. Examples of industrial catalytic processes utilizing heterogeneous catalysts. Perspectives on the role of heterogeneous catalysis in energy and environmental challenges. Pre-Reqs: UG physical chemistry (171), thermodynamics (110) and kinetics (130) or equivalents.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30240",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222696",
        "number": "CHEMENG 443",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "444",
        "title": "Electronic Structure Theory and Applications to Chemical Kinetics",
        "description": "Fundamentals of electronic structure theory to describe materials properties and chemical reactivity. nLearning objectives:  Understand the basis for modern electronic structure calculations,  understand the relationship between electronic structure,  materials properties, and  chemical kinetics,  be able to read the current literature, be able to do own calculations. nImportant components of the lectures:  An overview of quantum chemical methods, introduction to methods for periodic systems, density functional theory and current approximations to describe exchange and correlation effects, methods to describe excited states, transition state theory and methods to calculate partition functions. nThe Lab:  Leaning to do DFT calculations.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "103396",
        "number": "CHEMENG 444",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "450",
        "title": "Advances in Biotechnology (BIOE 450)",
        "description": "This course provides an overview of cutting-edge advances in biotechnology with a focus on therapeutic, health-related and agricultural topics. We will hear from academic and industrial speakers from a range of areas including novel anti-infectives, AI tools, quantitative microfluidics biotechnology research, new therapies for the treatment of addiction, neurodegenerative diseases like Alzheimer&iquest;s disease, plant bioengineering, immuno-oncology, science journalism, and venture capital investing in biotechnology. This course is designed for students interested in pursuing a career in the biotech industry.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "6040",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Barron, A.",
                                "sunet": "aebarron"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103398",
        "number": "CHEMENG 450",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "454",
        "title": "Synthetic Biology and Metabolic Engineering (BIOE 454)",
        "description": "Principles for the design and optimization of new biological systems. Development of new enzymes, metabolic pathways, other metabolic systems, and communication systems among organisms. Example applications include the production of central metabolites, amino acids, pharmaceutical proteins, and isoprenoids. Economic challenges and quantitative assessment of metabolic performance. Pre- or corequisite: CHEMENG 355 or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "140018",
        "number": "CHEMENG 454",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "456",
        "title": "Microbial Bioenergy Systems (BIO 273B, CEE 274B)",
        "description": "Introduction to microbial metabolic pathways and to the pathway logic with a special focus on microbial bioenergy systems.  The first part of the course emphasizes the metabolic and biochemical principles of pathways, whereas the second part is more specifically directed toward using this knowledge to understand existing systems and to design innovative microbial bioenergy systems for biofuel, biorefinery, and environmental applications. There also is an emphasis on the implications of rerouting of energy and reducing equivalents for the fitness and ecology of the organism. Prerequisites: CHEMENG 174 or 181 and organic chemistry, or equivalents.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28285",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103679",
        "number": "CHEMENG 456",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "459",
        "title": "Frontiers in Interdisciplinary Biosciences (BIO 459, BIOC 459, BIOE 459, CHEM 459, PSYCH 459)",
        "description": "Students register through their affiliated department; otherwise register for CHEMENG 459. For specialists and non-specialists. Sponsored by the Stanford BioX Program. Three seminars per quarter address scientific and technical themes related to interdisciplinary approaches in bioengineering, medicine, and the chemical, physical, and biological sciences. Leading investigators from Stanford and the world present breakthroughs and endeavors that cut across core disciplines. Pre-seminars introduce basic concepts and background for non-experts. Registered students attend all pre-seminars; others welcome. See http://biox.stanford.edu/courses/459.html. Recommended: basic mathematics, biology, chemistry, and physics.",
        "repeatable": "true",
        "grading": "Medical Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "103400",
        "number": "CHEMENG 459",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "460",
        "title": "Interfacial Engineering of Soft Matter",
        "description": "Interfacial engineering is a culmination of a century of interdisciplinary science and engineering. The foundation is provided by the thermodynamics of surface tension, surface chemistry and adsorption, which govern the properties of catalysts, colloids and surfactants. Microminiaturization of soft and hard materials and the growth of nanotechnology have led to dramatic increases in the surface-to-volume ratio. Knowledge of the principles of interfacial engineering can be used in the application domains of microelectronics chips and packaging, polymer composites, advanced ceramics, biomedical implants and bioanalytical devices. This course will cover the fundamentals of interface physics and chemistry, with an emphasis on soft matter, including phospholipids, proteins and synthetic polymers at interfaces. Specific topics will include intermolecular forces and potentials; solvation, structural and hydration forces; particle-particle interactions; interfacial thermodynamics; Poisson-Boltzmann theory of the diffuse electric double layer; electrokinetic phenomena; colloidal aggregation; and molecular assemblies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "140019",
        "number": "CHEMENG 460",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "462",
        "title": "Complex Fluids and Non-Newtonian Flows (ME 455)",
        "description": "Definition of a complex liquid and microrheology. Division of complex fluids into suspensions, solutions, and melts. Suspensions as colloidal and non-colloidal. Extra stress and relation to the stresslet. Suspension rheology including Brownian and non-Brownian fibers. Microhydrodynamics and the Fokker-Planck equation. Linear viscoelasticity and the weak flow limit. Polymer solutions including single mode (dumbbell) and multimode models. Nonlinear viscoelasticity. Intermolecular effects in nondilute solutions and melts and the concept of reptation. Prerequisites: low Reynolds number hydrodynamics or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "205379",
        "number": "CHEMENG 462",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "464",
        "title": "Polymer Chemistry",
        "description": "Polymer material design, synthesis, characterization, and application. Topics include organic and kinetic aspects of polymerization, polymer characterization techniques, and structure and properties of bulk polymers for commercial applications and emerging technologies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "205211",
        "number": "CHEMENG 464",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "466",
        "title": "Polymer Physics",
        "description": "Fundamentals of the equilibrium properties and dynamic behaviors of polymers. Key concepts include single chain conformations, solution thermodynamics, scaling relations, polymer architecture, stress relaxation, and viscoelasticity. These concepts will be considered in the context of polymeric materials including but not limited to solutions and melts, networks (gels and rubbers), glasses, block copolymers, polyelectrolytes, and biopolymers. Prerequisites: Chem 33, Chemeng 110A or Chem 171, and Chemeng 105 or CME 102 and CME 104; or instructor approval.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29068",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "206398",
        "number": "CHEMENG 466",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "469",
        "title": "Solid Structure and Properties of Polymers",
        "description": "Fundamental structure-properties relationships of solid polymers in bulk and thin films. Topics include chain conformations in bulk amorphous polymers, glass transition, crystallization, semi-crystalline morphology, liquid crystalline order, polymer blends, block copolymers, polymer networks/gels, polymers of high current interest, and experimental methods of characterizing polymer structure.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "27700",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Shriram 108",
                        "instructors": [
                            {
                                "name": "Yoon, D.",
                                "sunet": "doyoon"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214479",
        "number": "CHEMENG 469",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "470",
        "title": "Mechanics of Soft Matter: Rheology (CHEMENG 170X)",
        "description": "Soft matter comes in many forms and includes polymeric materials, suspensions, emulsions, foams, gels, and living tissue. These materials are characterized by being easily deformed and possessing internal relaxation time spectra. They are viscoelastic with responses that are intermediate between purely viscous liquids and perfectly elastic solids. This course provides an introduction to the subject of rheology, which concerns the deformation and flow of complex liquids and solids. Rheological testing is aimed at determining the relationships between the applied stresses in these materials and the resulting deformations. These are characterized by material functions, such as viscosity (shear and extensional), moduli, and compliances. These functions reflect the microstructure of the material being tested and microstructural models of polymers (single chain theories and reptation-based models), suspensions, emulsions, and foams will be presented. Experimental methods to measure materials subjected to both shearing and elongational deformations will be described. Many soft matter systems are influenced by interfacial phenomena (foams, emulsions, thin films in the human body) and interfacial rheological techniques will be discussed. Advanced undergraduates register for 170X; graduates register for 470. Prerequisites: ChE 120A or its equivalent (concurrent enrollment is permissible)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "213139",
        "number": "CHEMENG 470",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "475",
        "title": "Electrochemical Water Treatment: Materials and Processes (CEE 271C, CHEMENG 175X)",
        "description": "Humans generate teraliters of wastewater every day, of which 80% is discharged without treatment. While societies struggle to manage waste, natural environmental cycles reuse any 'waste' product as starting material elsewhere. Polluted water threatens aquatic ecosystems and exacerbates water scarcity, which a majority of people globally will experience by 2030. Discharging wastewater is an unaffordable luxury for a world facing climate change and resource scarcity. Reframing waste streams as sources of raw materials motivates the design of selective materials and processes capable of converting water pollutants into valuable products. Electrochemical separations exhibit several benefits for wastewater treatment, including their modularity, substitution of chemical inputs with electricity, and fine-tune control over interfacial phenomena. In this course, students will learn the fundamental principles and design rules for electrochemical materials and processes for next-generation water treatment. Assignments will focus on critically reviewing electrochemical water treatment literature, evaluating applications for removing pollutants and creating products from aqueous streams, and contrasting various approaches to address water pollution. Throughout the course, students will build towards final projects proposing novel materials or processes for electrochemical water treatment.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223661",
        "number": "CHEMENG 475",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "600",
        "title": "Graduate Research in Chemical Engineering",
        "description": "Laboratory and theoretical work leading to partial fulfillment of requirements for an advanced degree. Course may be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28275",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27913",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "2277",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "2412",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "2319",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "2278",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "2413",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "2320",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "2279",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Mai, D.",
                                "sunet": "djmai"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "2414",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "2321",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "2280",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "2415",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "2322",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "6178",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tarpeh, W.",
                                "sunet": "wtarpeh"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "6732",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Mai, D.",
                                "sunet": "djmai"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "6347",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gao, X.",
                                "sunet": "xjgao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "2281",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "2416",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "2323",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103426",
        "number": "CHEMENG 600",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 57
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "699",
        "title": "Colloquium",
        "description": "Weekly lectures by experts from academia and industry in the field of chemical engineering. Course may be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "2232",
                "currentClassSize": "0",
                "maxClassSize": "125",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gao, X.",
                                "sunet": "xjgao"
                            },
                            {
                                "name": "Qin, J.",
                                "sunet": "jianq"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 62400.0,
                        "days": "Monday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "2231",
                "currentClassSize": "0",
                "maxClassSize": "125",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gao, X.",
                                "sunet": "xjgao"
                            },
                            {
                                "name": "Qin, J.",
                                "sunet": "jianq"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "5215",
                "currentClassSize": "0",
                "maxClassSize": "65",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "Y2E2 111",
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            },
                            {
                                "name": "Gao, X.",
                                "sunet": "xjgao"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103427",
        "number": "CHEMENG 699",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "CHEMENG",
        "code": "802",
        "title": "TGR Dissertation",
        "description": null,
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28276",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "27914",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2285",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2420",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "2327",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bao, Z.",
                                "sunet": "zbao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "2286",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "2421",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "2328",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bent, S.",
                                "sunet": "sbent"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "2287",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Mai, D.",
                                "sunet": "djmai"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "2422",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "2329",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "DeSimone, J.",
                                "sunet": "joseph3d"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "2288",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "2423",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "2330",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fuller, G.",
                                "sunet": "ggf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "5239",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cargnello, M.",
                                "sunet": "mcargn"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "6734",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Mai, D.",
                                "sunet": "djmai"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "6349",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Mai, D.",
                                "sunet": "djmai"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "2289",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "2424",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "2331",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Khosla, C.",
                                "sunet": "khosla"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "103429",
        "number": "CHEMENG 802",
        "units": [
            0
        ],
        "totalSections": 58
    }
]