[
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "10SC",
        "title": "The Cult of Happiness: Pursuing the Good Life in America and China (COMPLIT 10SC)",
        "description": "The 2006 film &quot;Pursuit of Happyness&quot;, an unabashed celebration of the American Dream, was enthusiastically embraced by Chinese audiences. It seems that the pursuit of happiness has become truly globalized, even as the American Dream is slipping away for many. Are Americans still convinced that their conception of happiness is a self-evident truth and a universal gospel? Is there anything that Americans might learn about what it means to live a good life from not only the distant past, but also cultures in which happiness is envisioned and sought after very differently? This course takes a multi-disciplinary approach to the question of happiness and invites undergraduate students to reflect on its relationship to wealth, wisdom, health, love, pleasure, virtue, justice, and solidarity. Giving equal weight to Chinese and Western sources, it seeks to defamiliarize some of the most deeply held ideas and values in American society through the lens of cross-cultural inquiry.During the summer, students will read a selection of novels, memoirs, and reflections by philosophers, psychologists, and sociologists. In September, we will review these texts and place them alongside movies, short fiction, news stories, and social commentary while we interrogate the chimera of happiness. In addition, we will experiment with meditation, short-form life writing (including mock-obituaries!), and service-learning.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "216591",
        "number": "CHINA 10SC",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "20",
        "title": "Humanities Core: Dao, Virtue, and Nature -- Foundations of East Asian Thought (HUMCORE 20, JAPAN 20, KOREA 20)",
        "description": "This course explores the values and questions posed in the formative period of East Asian civilizations. Notions of a Dao (&quot;Way&quot;) are common to Confucianism, Daoism, and Buddhism, but those systems of thought have radically different ideas about what that Dao is and how it might be realized in society and an individual's life. These systems of thought appeared first in China, and eventually spread to Korea and Japan. Each culture developed its own ways of reconciling the competing systems, but in each case the comprehensive structure of values and human ideals differs significantly from those that appeared elsewhere in the ancient world. The course examines East Asian ideas about self-cultivation, harmonious society, rulership, and the relation between human and nature with a view toward expanding our understanding of these issues in human history, and highlighting their legacies in Asian civilizations today. The course features selective readings in classics of Confucian, Daoist, and Buddhist texts that present the foundational tenets of Asian thought. N. B. This is the first of three courses in the Humanities Core, East Asian track. These courses show how history and ideas shape our world and future. Take all three to experience a year-long intellectual community dedicated to the life of the mind.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "220552",
        "number": "CHINA 20",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "21",
        "title": "Humanities Core: Love and Betrayal in Asia (HUMCORE 21, JAPAN 21, KOREA 21)",
        "description": "Why are lovers in storybooks East and West always star-crossed? Why do love and death seem to go together? For every Romeo and Juliet, there are dozens of doomed lovers in the Asian literary repertoires, from Genji's string of embittered mistresses, to the Butterfly lovers in early modern China, to the voices of desire in Koryo love songs, to the devoted adolescent cousins in Dream of the Red Chamber, to the media stars of Korean romantic drama, now wildly popular throughout Asia. In this course, we explore how the love story has evolved over centuries of East Asian history, asking along the way what we can learn about Chinese, Japanese, and Korean views of family and community, gender and sexuality, truth and deception, trust and betrayal, ritual and emotion, and freedom and solidarity from canonical and non-canonical works in East Asian literatures. N.B. This is the second of three courses in the East Asian track. These courses offer an unparalleled opportunity to study East Asian history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "219307",
        "number": "CHINA 21",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "21Q",
        "title": "Humanities Core: Love and Betrayal in Asia (HUMCORE 21Q, JAPAN 21Q, KOREA 21Q)",
        "description": "Why are lovers in storybooks East and West always star-crossed? Why do love and death seem to go together? For every Romeo and Juliet, there are dozens of doomed lovers in the Asian literary repertoires, from Genji's string of embittered mistresses, to the Butterfly lovers in early modern China, to the voices of desire in Koryo love songs, to the devoted adolescent cousins in Dream of the Red Chamber, to the media stars of Korean romantic drama, now wildly popular throughout Asia. In this course, we explore how the love story has evolved over centuries of East Asian history, asking along the way what we can learn about Chinese, Japanese, and Korean views of family and community, gender and sexuality, truth and deception, trust and betrayal, ritual and emotion, and freedom and solidarity from canonical and non-canonical works in East Asian literatures. N.B. This is the second of three courses in the East Asian track. These courses offer an unparalleled opportunity to study East Asian history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220549",
        "number": "CHINA 21Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "24",
        "title": "Humanities Core: How to be Modern in East Asia (COMPLIT 44, HUMCORE 133, JAPAN 24, KOREA 24)",
        "description": "Modern East Asia was almost continuously convulsed by war and revolution in the 19th and 20th centuries. But the everyday experience of modernity was structured more profoundly by the widening gulf between the country and the city, economically, politically, and culturally. This course examines literary and cinematic works from China and Japan that respond to and reflect on the city/country divide, framing it against issues of class, gender, national identity, and ethnicity. It also explores changing ideas about home/hometown, native soil, the folk, roots, migration, enlightenment, civilization, progress, modernization, nationalism, cosmopolitanism, and sustainability. All materials are in English. This course is part of the Humanities Core: https://humanitiescore.stanford.edu/",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32663",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Xu, L.",
                                "sunet": "ljxu"
                            },
                            {
                                "name": "Reichert, J.",
                                "sunet": "reichert"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220673",
        "number": "CHINA 24",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "70N",
        "title": "Animal Planet and the Romance of the Species (COMPLIT 70N)",
        "description": "Preference to freshmen.This course considers a variety of animal characters in Chinese and Western literatures as potent symbols of cultural values and dynamic sites of ethical reasoning.  What does pervasive animal imagery tell us about how we relate to the world and our neighbors?  How do animals define the frontiers of humanity and mediate notions of civilization and culture?  How do culture, institutions, and political economy shape concepts of human rights and animal welfare?  And, above all, what does it mean to be human in the pluralistic and planetary 21st century? Note: To be eligible for WAYS credit, you must take course for a Letter Grade.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "210015",
        "number": "CHINA 70N",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "93",
        "title": "The Chinese Empire from the Mongol Invasion to the Boxer Uprising (FEMGEN 93, HISTORY 93)",
        "description": "(Same as HISTORY 193. 93 is 3 units; 193 is 5 units.) A survey of Chinese history from the 11th century to the collapse of the imperial state in 1911. Topics include absolutism, gentry society, popular culture, gender and sexuality, steppe nomads, the Jesuits in China, peasant rebellion, ethnic conflict, opium, and the impact of Western imperialism.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29504",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fu, K.",
                                "sunet": "kellyfu"
                            },
                            {
                                "name": "Sommer, M.",
                                "sunet": "msommer"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "29503",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-SI"
        ],
        "objectID": "209864",
        "number": "CHINA 93",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "105",
        "title": "Beginning Classical Chinese, First Quarter (CHINA 205)",
        "description": "The goal is develop students' reading knowledge of classical Chinese, including basic grammar and commonly used vocabulary. Students will also learn concepts and ideas fundamental in Chinese culture involving family, human relationships, governance, learning, life/death, philosophy, etc. through reading canonical classical Chinese texts. Prerequisite: CHINLANG 23 or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "10980",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "200-105",
                        "instructors": [
                            {
                                "name": "Bartlett, T.",
                                "sunet": "thomasb5"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "200181",
        "number": "CHINA 105",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "106",
        "title": "Beginning Classical Chinese, Second Quarter (CHINA 206)",
        "description": "Continue to develop students' reading knowledge of classical Chinese, including basic grammar and commonly used vocabulary. Students will learn more concepts and ideas fundamental in Chinese culture involving family, human relationships, governance, learning, life/death, philosophy, etc. through reading canonical classical Chinese texts. Prerequisite: CHINA 105/205 or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "7558",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zhou, Y.",
                                "sunet": "yzhou1"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111235",
        "number": "CHINA 106",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "107",
        "title": "Beginning Classical Chinese, Third Quarter (CHINA 207)",
        "description": "Goal is reading knowledge of classical Chinese. Basic grammar and commonly used vocabulary. Students with no background in classical Chinese who are taking 127/207 to satisfy Chinese major requirements must begin with 125/205. Prerequisite: CHINLANG 126/206 or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course will meet in the Knight Building, room K102.",
                "classId": "7456",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zhou, Y.",
                                "sunet": "yzhou1"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "140587",
        "number": "CHINA 107",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "111",
        "title": "Literature in 20th-Century China (CHINA 211)",
        "description": "(Graduate students register for 211.) How modern Chinese culture evolved from tradition to modernity; the century-long drive to build a modern nation state and to carry out social movements and political reforms. How the individual developed modern notions of love, affection, beauty, and moral relations with community and family. Sources include fiction and film clips. WIM course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13418",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "200-219",
                        "instructors": [
                            {
                                "name": "Wang, B.",
                                "sunet": "banwang"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-A-II"
        ],
        "objectID": "111105",
        "number": "CHINA 111",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "112",
        "title": "Tiananmen Square: History, Literature, Iconography (CHINA 212)",
        "description": "Multidisciplinary. Literary and artistic representations of this site of political and ideological struggles throughout the 20th century. Tiananmen-themed creative, documentary, and scholarly works that shed light on the dynamics and processes of modern Chinese culture and politics. No knowledge of Chinese required. Repeat for credit.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "208617",
        "number": "CHINA 112",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "112A",
        "title": "Asian Screen Cultures (CHINA 212A, JAPAN 112A, JAPAN 212A, KOREA 112, KOREA 212)",
        "description": "Asian screen culture, ranging from cinema to online games, has (re)shaped the global and national/regional imaginings of Asia. The Post-Cold War intensification of intra-Asian interactions has precipitated the rise of a Pan-Asian regional identity wherein the nation-state is not yet obsolete. What role does screen culture plays in the border-crossing interplay among languages, ideologies, aesthetics, and affect? How does the converging media of screen culture capture local/global desires and propel the history of transformation of sign systems from the written words to visual moving images in a digital time? How do we understand the aesthetic, storytelling, and politics of Asian screen cultures vis-&agrave;-vis its historical and social context? While exploring these transnational and transdisciplinary questions, this course will deal with topical issues of Pan-Asian identity, (trans)nationalism, (un)translatability, commodity fetishism, locality and globality, technophobia, and politics of gender. Students will learn how to think and write about screen cultures of East Asia in particular and of our world of screens in general.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222258",
        "number": "CHINA 112A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "115",
        "title": "Sex, Gender, and Power in Modern China (CHINA 215, FEMGEN 150, FEMGEN 250)",
        "description": "Investigates how sex, gender, and power are entwined in the Chinese experience of modernity. Topics include anti-footbinding campaigns, free love/free sex, women's mobilization in revolution and war, the new Marriage Law of 1950, Mao's iron girls, postsocialist celebrations of sensuality, and emergent queer politics. Readings range from feminist theory to China-focused historiography, ethnography, memoir, biography, fiction, essay, and film.  All course materials are in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-Gender",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "212062",
        "number": "CHINA 115",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "118",
        "title": "Humanities Core: Everybody Eats: The Language, Culture, and Ethics of Food in East Asia (HUMCORE 22, JAPAN 118, KOREA 118)",
        "description": "Many of us have grown up eating &quot;Asian&quot; at home, with friends, on special occasions, or even without full awareness that Asian is what we were eating. This course situates the three major culinary traditions of East Asia--China, Japan, and Korea--in the histories and civilizations of the region, using food as an introduction to their rich repertoires of literature, art, language, philosophy, religion, and culture. It also situates these seemingly timeless gastronomies within local and global flows, social change, and ethical frameworks. Specifically, we will explore the traditional elements of Korean court food, and the transformation of this cuisine as a consequence of the Korean War and South Korea&iquest;s subsequent globalizing economy; the intersection of traditional Japanese food with past and contemporary identities; and the evolution of Chinese cuisine that accompanies shifting attitudes about the environment, health, and well-being. Questions we will ask ourselves during the quarter include, what is &quot;Asian&quot; about Asian cuisine? How has the language of food changed? Is eating, and talking about eating, a gendered experience? How have changing views of the self and community shifted the conversation around the ethics and ecology of meat consumption?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "Writing 2"
        ],
        "objectID": "219672",
        "number": "CHINA 118",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "146",
        "title": "Political Thought in Modern Asia (CHINA 246, ETHICSOC 146, POLISCI 235N, POLISCI 335N)",
        "description": "The study of political theory in the United States has been accused of being Western-centric: We tend to focus on intellectual traditions from Plato to NATO, while ignoring the vast world of non-Western societies and the ways they think about politics and public life. How do Chinese thinkers conceptualize human rights and good governance? How do Indian intellectuals reconcile democracy and inherited hierarchies in Hinduism? How do Islamic scholars view the relationship between religious authority and secular authority? Should we regard liberal democracy, or Western civilization more broadly, as representing the universal value guiding every society? Or, should we learn from non-Western ideas and values so as to solve problems plaguing Western societies? How can competing visions of good life coexist in a globalized and increasingly pluralistic world? This course aims to answer these questions by exploring three Asian traditions and their perspectives on politics: Confucianism, Hinduism, and Islam. We will focus on the modern period (19th-21st centuries) and the ways intellectuals in these societies respond to the challenge of modernity and Western superiority. Special attention is given to how these intellectuals conceive of the relationship between modernity and their respective traditions: Are they compatible or mutually exclusive? In which ways do intellectuals interpret these traditions so as to render them (in)compatible with modernity? We will read academic articles written by Anglophone scholars as well as original texts written by non-Western thinkers. No knowledge of non-Western languages is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "222622",
        "number": "CHINA 146",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "151",
        "title": "The Use of Classical Antiquity in Modern China (CHINA 251, CLASSICS 143)",
        "description": "This course examines the roles played by classical antiquity--Greek, Roman, and Chinese--in China's modernization process. Central topics of discussion include: the relationship between tradition and modernity, the relationship between China and the West, the politics and techniques of appropriation in the reception of classical heritage, and the evolving and highly contentious nature of the differences among various approaches to classical antiquity. Tackling the most fundamental questions that have confronted an ancient civilization from the turn of the twentieth century to the present, the course investigates how &quot;classics&quot; and &quot;classical tradition&quot; acquire different meanings and functions in changed contexts, and serves as a convenient introduction to key moments and figures in modern Chinese cultural and intellectual history.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223610",
        "number": "CHINA 151",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "151B",
        "title": "The Nature of Knowledge: Science and Literature in East Asia (CHINA 251B, JAPAN 151B, JAPAN 251B, KOREA 151, KOREA 251)",
        "description": "&quot;The Nature of Knowledge&quot; explores the intersections of science and humanities East Asia. It covers a broad geographic area (China, Japan, and Korea) along a long temporal space (14th century - present) to investigate how historical notions about the natural world, the human body, and social order defied, informed, and constructed our current categories of science and humanities. The course will make use of medical, geographic, and cosmological treatises from premodern East Asia, portrayals and uses of science in modern literature, film, and media, as well as theoretical and historical essays on the relationships between literature, science, and society.nnAs part of its exploration of science and the humanities in conjunction, the course addresses how understandings of nature are mediated through techniques of narrative, rhetoric, visualization, and demonstration. In the meantime, it also examines how the emergence of modern disciplinary &quot;science&quot; influenced the development of literary language, tropes, and techniques of subject development. This class will expose the ways that science has been mobilized for various ideological projects and to serve different interests, and will produce insights into contemporary debates about the sciences and humanities.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32671",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zur, D.",
                                "sunet": "dafnaz"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220687",
        "number": "CHINA 151B",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "155",
        "title": "The Culture of Entertainment in China (CHINA 255)",
        "description": "Sophisticated, organized entertainment in China is evident at least as early as the second century B.C. in the court spectacles described in the early histories and in the depictions of jugglers, dancers and acrobats represented in tomb bas-reliefs. The importance attached to entertainment from ancient times both at court and in society at large is manifest not just in the establishment of imperial institutions such as the Music Bureau, but also in the appearance of large entertainment districts within the cities where people would invest extraordinary amount of resources in the pursuit of pleasure, and in small scale gatherings. The representation of play and pleasure in Chinese culture from a variety of sources (art, history, literature and performance) in different periods of Chinese history. The place of pleasure in Chinese culture, as well as ethical, socio-political and economical concerns. Held in old Knight Bldg., 521 Memorial Way, Rm. 102.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "216715",
        "number": "CHINA 155",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "155A",
        "title": "Health, Politics, and Culture of Modern China (ANTHRO 148, ANTHRO 248, CHINA 255A)",
        "description": "One of the most generative regions for medical anthropology inquiry in recent years has been Asia.  This seminar is designed to introduce upper division undergraduates and graduate students to the methodological hurdles, representational challenges, and intellectual rewards of investigating the intersections of health, politics, and culture in contemporary China.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29511",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kohrman, M.",
                                "sunet": "kohrman"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "210079",
        "number": "CHINA 155A",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "155B",
        "title": "Narrative and Storytelling in Premodern China (CHINA 255B)",
        "description": "In premodern China, individuals and groups told stories variously to philosophize and persuade, to commemorate and critique, to educate and entertain, to scandalize and to stimulate. In this class, we will trace the evolution of Chinese narrative storytelling through close readings of some of the most compelling stories in the Chinese tradition, including early philosophical anecdotes and historical accounts, medieval tales and religious performance pieces, and early modern short stories. In the process, we will come to appreciate how Chinese narrative storytelling evolved over time, dwelling on issues such as genre, authorship, textuality, and readership to understand how writers and readers used storytelling to navigate and negotiate the world around them, including issues related to gender and sexuality, social status, and political power.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222257",
        "number": "CHINA 155B",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "157S",
        "title": "Tyranny and Resistance: East Asia's Political Culture and Tradition (JAPAN 157S, KOREA 157S)",
        "description": "What is tyranny? When does political power cease to be legitimate and government become tyrannical? And what can individuals do in the face of tyranny? This course will explore East Asia's long political tradition through the problem of tyranny and its resistance. We will cover a wide range of material. We begin with how seminal political thinkers in East Asia, including Warring States philosophers such as Mencius and Han Feizi, understood the boundary between legitimate and illegitimate authority. We will also look at the strategies used by various political actors, including government officials, cultural or social elites, and common people, when they confronted what they perceived to be the unjust exercise political power, whether in the form of despotic monarchs, corrupt authorities, or general misrule. Our discussions will be wide-ranging. We will pay particular attention to how these historical examples from China, Korea, and Japan&iquest;s past have resonated with modern and contemporary political discussions in contemporary East Asian societies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219305",
        "number": "CHINA 157S",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "159A",
        "title": "Maoism and the Chinese Communist Party (CHINA 259A)",
        "description": "This course offers a comprehensive overview of the history of the Chinese Communist Party with a particular focus on the Mao Zedong Thought and Mao's rise to power. Key topics in this course include the Soviet Union's influence on China, the Yan'an Rectification Campaign, regime consolidation in the early People's Republic of China, and the Cultural Revolution. The goal of this course is to familiarize you with the logic of China's communist revolution and the most important political campaigns launched by the Communist Party. We will devote a substantial amount of time to reading original works of Marx, Lenin, Stalin, and Mao Zedong. This course helps students of Chinese Studies to understand and interpret Mao's writings and thoughts, as well as the basic organizational and managerial structure of the Chinese Communist Party and its unique political language.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223101",
        "number": "CHINA 159A",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "161",
        "title": "Soldiers and Bandits in Chinese Culture (CHINA 261)",
        "description": "Social roles and literary images of two groups on the margins of traditional Chinese society; historical and comparative perspectives.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "208587",
        "number": "CHINA 161",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "163",
        "title": "Chinese Biographies of Women (CHINA 263)",
        "description": "Generic and historical analysis of the two-millennia long biographical tradition inaugurated by Liu Xiang, ca. 79-8 B.C.E. Chinese women's history, intellectual history, historiography, and literary studies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "206330",
        "number": "CHINA 163",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "163A",
        "title": "Looking for the Way (Dao) in East Asia (HUMCORE 113)",
        "description": "This course looks at foundations of East Asian thought, including Confucianism, Daoism, and Buddhism as well as other cultural traditions. The ideologies were first articulated in ancient China (or India) and from there spread to Korea, Japan, and throughout Southeast Asia, where they remain important today. We will read selections from seminal texts including &quot;The Confucian Analects&quot;, &quot;Daode jing&quot;, &quot;Zhuangzi&quot;, and &quot;The Platform Sutra of the Sixth Patriarch&quot;. Attention is also given to other perennial (and often problematic) themes of Asian life and society, including those of conflicting loyalties and violent revenge. Finally, the course examines aesthetic expression in painting and calligraphy that became the embodiment of classical philosophical values and their own articulation of an aestheticized Way, still widely practiced and admired. This course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Mondays you meet in your own course, and on Wednesdays all the HumCore seminars (in session that quarter) meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32298",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Egan, R.",
                                "sunet": "ronegan"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222849",
        "number": "CHINA 163A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "166",
        "title": "The Art Song (Ci): Love and Performance (CHINA 266)",
        "description": "Analysis of the entertainment song (&quot;ci&quot;) in 11th and 12th centuries, known for its treatment of romantic love and the affections. How do male writers represent love as experienced by men and by women in entertainment songs? What happens when a woman writes in this form, dominated by male authors? How does the form change from a low-status entertainment genre, widely viewed as frivolous, into a high literary form that excited writers about its new expressive potential? Prerequisite: Advanced reading knowledge of Chinese.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31086",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Encina West 101",
                        "instructors": [
                            {
                                "name": "Egan, R.",
                                "sunet": "ronegan"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111253",
        "number": "CHINA 166",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "168",
        "title": "The Chinese Family (CHINA 268)",
        "description": "History and literature. Institutional, ritual, affective, and symbolic aspects. Perspectives of gender, class, and social change.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32220",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zhou, Y.",
                                "sunet": "yzhou1"
                            },
                            {
                                "name": "Huang, X.",
                                "sunet": "xiaoyih"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:EC-GlobalCom",
            "WAY-SI"
        ],
        "objectID": "207454",
        "number": "CHINA 168",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "170",
        "title": "Chinese Language, Culture, and Society (CHINA 270)",
        "description": "Functions of languages in Chinese culture and society, origin of the Chinese language, genetic relations with neighboring languages, development of dialects, language contacts, evolution of Chinese writing, language policies in Greater China.  Prerequisite: one quarter of Chinese 1 or 1B or equivalent recommended. This course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "216129",
        "number": "CHINA 170",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "171",
        "title": "Utopia, Dystopia, and Technology in Science Fiction: A Cross-Cultural Perspective (CHINA 271, GLOBAL 200)",
        "description": "This course explores how science fiction (sf) narratives from East and West imagine the future of humanity and human-nature relations. The blind faith in technoscientific power has aggravated class disparity, eroded the social fabric, and undermined the humanist legacy of the Enlightenment. Technological fetishism has given rise to apocalyptic futures of dystopia marked by destructive AI, the digital jungle of existential struggle, environmental degradation, climate disasters, class disparity, and posthuman barbarism. On the other hand, sf narratives keep hopes alive by projecting utopias, exposing the pitfalls of technological 'progress' and keeping faith with human sovereignty in renewing social ecology in balance with natural conditions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224339",
        "number": "CHINA 171",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "174",
        "title": "New Directions in the Study of Poetry and Literary Culture (CHINA 374)",
        "description": "Inquiry into new approaches and interpretations of the poetic tradition in China in the context of cultural history. Readings in recent scholarship and criticism that situate poetry in print history, manuscript culture, gender studies, social history, etc. Readings in English. Reading knowledge of Chinese desirable but not required.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "213285",
        "number": "CHINA 174",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "175",
        "title": "Constructing National History in East Asian Archaeology (ARCHLGY 135, ARCHLGY 235, CHINA 275)",
        "description": "Archaeological studies in contemporary East Asia share a common concern, to contribute to building a national narrative and cultural identity. This course focuses on case studies from China, Korea, and Japan, examining the influence of particular social-political contexts, such as nationalism, on the practice of archaeology in modern times.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "212071",
        "number": "CHINA 175",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "176",
        "title": "Emergence of Chinese Civilization from Caves to Palaces (ARCHLGY 111, ARCHLGY 211, CHINA 276)",
        "description": "Introduces processes of cultural evolution from the Paleolithic to the Three Dynasties in China. By examining archaeological remains, ancient inscriptions, and traditional texts, four major topics will be discussed: origins of modern humans, beginnings of agriculture, development of social stratification, and emergence of states and urbanism.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-SI"
        ],
        "objectID": "210933",
        "number": "CHINA 176",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "178",
        "title": "Lives of Confucius (CHINA 278)",
        "description": "This course examines the transformation of the images of Confucius (551-479 BCE) from his own time to the present day. Major topics include: Confucius and his rivals / critics, the making of Confucius the &quot;Uncrowned King,&quot; his apotheosis as China's cultural symbol and civilization's greatest sage, and twists and turns in his modern fate. Comparisons will be made with the development of images of Socrates, Jesus, and other important cultural figures. NOTE: In order for course to count towards major or minor, undergrads must enroll in a minimum of 3 units or higher.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "219786",
        "number": "CHINA 178",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "183",
        "title": "The Chinese Empire from the Mongol Invasion to the Boxer Uprising (FEMGEN 193, HISTORY 193)",
        "description": "(Same as HISTORY 93. 193 is 5 units; 93 is 3 units.) A survey of Chinese history from the 11th century to the collapse of the imperial state in 1911. Topics include absolutism, gentry society, popular culture, gender and sexuality, steppe nomads, the Jesuits in China, peasant rebellion, ethnic conflict, opium, and the impact of Western imperialism.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29339",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fu, K.",
                                "sunet": "kellyfu"
                            },
                            {
                                "name": "Sommer, M.",
                                "sunet": "msommer"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "DIS",
                "notes": null,
                "classId": "29338",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-SI"
        ],
        "objectID": "205538",
        "number": "CHINA 183",
        "units": [
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "183A",
        "title": "China's Dynastic Founders (CHINA 283)",
        "description": "This course examines the lives of China's dynastic founders, among whom we find the most influential, the most celebrated, the most complicated, and the most controversial rulers in premodern Chinese history. We seek to understand the ideas of leadership and legitimacy, the relationships among statecraft, military might, and moral virtue, and the importance of precedents and exemplars in traditional Chinese political culture. Primary readings are the biographies of the dynastic founders in the official histories, supplemented by the representations of these rulers in other genres of writings.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "215564",
        "number": "CHINA 183A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "185",
        "title": "Literary Translation, Chinese to English (CHINA 285)",
        "description": "A study of the methods and practice of literary translation (broadly conceived, including historical, philosophical, and literary works), including prose and poetry, from Chinese to English, concentrating on premodern Chinese texts. The course will give equal attention to evaluating major published translations (good and not-so-good), and student practice in doing their own translations of a range of different genres, periods, styles of Chinese texts into English.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224830",
        "number": "CHINA 185",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "190",
        "title": "Research in Chinese Linguistics (CHINA 290)",
        "description": "This proseminar course introduces to graduate students and advanced undergraduate students in Chinese linguistics the standard practice in linguistic publications. In preparation for conducting research effectively in their own areas of interest, students are introduced to abstract writing, manual style for linguistic publications, available Chinese corpuses, etc. Students should identify a topic of interest through consultation with the instructor within the first two weeks of class and submit an abstract by the end of the third week. They are expected to present the hypothesis and research plan in class in week 4 and report the relevant research findings in week 10. It should be submitted after revisions as a term paper. May be repeated for credit. Prerequisite: China 191 or consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223517",
        "number": "CHINA 190",
        "units": [
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "191",
        "title": "The Structure of Modern Chinese (CHINA 291)",
        "description": "Introduce to students the basic grammar of Standard Modern Chinese in comparison to English. Students learn about the logic of the Chinese in communicating ideas and events without grammatical markers like plurality, definiteness, tense, subject/object, etc, as well as common uses of verbs and adjectives that are totally different from those in English. Prerequisite: CHINLANG 3 or equivalent, or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12720",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tsai, Y.",
                                "sunet": "ytt"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci"
        ],
        "objectID": "111236",
        "number": "CHINA 191",
        "units": [
            2,
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "192",
        "title": "A History of Sinology (CHINA 392)",
        "description": "A study of major works in the history of Sinology, covering both its 19th century European and 20th century North American branches. This is an introduction to the history of the study of traditional China in the Western world, including all fields (history, literature, philosophy, etc.) and approaches (translation, analysis, close reading, handbooks and reference works). Attention to how the study of China outside of China has evolved through time.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32218",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Egan, R.",
                                "sunet": "ronegan"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223845",
        "number": "CHINA 192",
        "units": [
            2,
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "205",
        "title": "Beginning Classical Chinese, First Quarter (CHINA 105)",
        "description": "The goal is develop students' reading knowledge of classical Chinese, including basic grammar and commonly used vocabulary. Students will also learn concepts and ideas fundamental in Chinese culture involving family, human relationships, governance, learning, life/death, philosophy, etc. through reading canonical classical Chinese texts. Prerequisite: CHINLANG 23 or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "10981",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "200-105",
                        "instructors": [
                            {
                                "name": "Bartlett, T.",
                                "sunet": "thomasb5"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "200181",
        "number": "CHINA 205",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "206",
        "title": "Beginning Classical Chinese, Second Quarter (CHINA 106)",
        "description": "Continue to develop students' reading knowledge of classical Chinese, including basic grammar and commonly used vocabulary. Students will learn more concepts and ideas fundamental in Chinese culture involving family, human relationships, governance, learning, life/death, philosophy, etc. through reading canonical classical Chinese texts. Prerequisite: CHINA 105/205 or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "7559",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zhou, Y.",
                                "sunet": "yzhou1"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111235",
        "number": "CHINA 206",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "207",
        "title": "Beginning Classical Chinese, Third Quarter (CHINA 107)",
        "description": "Goal is reading knowledge of classical Chinese. Basic grammar and commonly used vocabulary. Students with no background in classical Chinese who are taking 127/207 to satisfy Chinese major requirements must begin with 125/205. Prerequisite: CHINLANG 126/206 or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "7457",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zhou, Y.",
                                "sunet": "yzhou1"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "140587",
        "number": "CHINA 207",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "208",
        "title": "Advanced Classical Chinese: Philosophical Texts",
        "description": "Prerequisite: CHINA 107/207 or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32568",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bartlett, T.",
                                "sunet": "thomasb5"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111245",
        "number": "CHINA 208",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "209",
        "title": "Advanced Classical Chinese: Historical Narration",
        "description": "Students must have taken CHINA 107/207, or have received permission from instructor or department to take this course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "111246",
        "number": "CHINA 209",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "211",
        "title": "Literature in 20th-Century China (CHINA 111)",
        "description": "(Graduate students register for 211.) How modern Chinese culture evolved from tradition to modernity; the century-long drive to build a modern nation state and to carry out social movements and political reforms. How the individual developed modern notions of love, affection, beauty, and moral relations with community and family. Sources include fiction and film clips. WIM course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13419",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "200-219",
                        "instructors": [
                            {
                                "name": "Wang, B.",
                                "sunet": "banwang"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111105",
        "number": "CHINA 211",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "212",
        "title": "Tiananmen Square: History, Literature, Iconography (CHINA 112)",
        "description": "Multidisciplinary. Literary and artistic representations of this site of political and ideological struggles throughout the 20th century. Tiananmen-themed creative, documentary, and scholarly works that shed light on the dynamics and processes of modern Chinese culture and politics. No knowledge of Chinese required. Repeat for credit.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "208617",
        "number": "CHINA 212",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "212A",
        "title": "Asian Screen Cultures (CHINA 112A, JAPAN 112A, JAPAN 212A, KOREA 112, KOREA 212)",
        "description": "Asian screen culture, ranging from cinema to online games, has (re)shaped the global and national/regional imaginings of Asia. The Post-Cold War intensification of intra-Asian interactions has precipitated the rise of a Pan-Asian regional identity wherein the nation-state is not yet obsolete. What role does screen culture plays in the border-crossing interplay among languages, ideologies, aesthetics, and affect? How does the converging media of screen culture capture local/global desires and propel the history of transformation of sign systems from the written words to visual moving images in a digital time? How do we understand the aesthetic, storytelling, and politics of Asian screen cultures vis-&agrave;-vis its historical and social context? While exploring these transnational and transdisciplinary questions, this course will deal with topical issues of Pan-Asian identity, (trans)nationalism, (un)translatability, commodity fetishism, locality and globality, technophobia, and politics of gender. Students will learn how to think and write about screen cultures of East Asia in particular and of our world of screens in general.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222258",
        "number": "CHINA 212A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "215",
        "title": "Sex, Gender, and Power in Modern China (CHINA 115, FEMGEN 150, FEMGEN 250)",
        "description": "Investigates how sex, gender, and power are entwined in the Chinese experience of modernity. Topics include anti-footbinding campaigns, free love/free sex, women's mobilization in revolution and war, the new Marriage Law of 1950, Mao's iron girls, postsocialist celebrations of sensuality, and emergent queer politics. Readings range from feminist theory to China-focused historiography, ethnography, memoir, biography, fiction, essay, and film.  All course materials are in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "212062",
        "number": "CHINA 215",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "230",
        "title": "Image and Text in the Arts in China (ARTHIST 230B, ARTHIST 430B, CHINA 430)",
        "description": "An examination of many types of interactions between images and texts in Chinese painting. These include poetic lines inscribed on paintings (as response or as a theme given to the artist to paint), paintings that emulate or transform ancient poetic couplets, or illustrate poetic and literary narratives, and calligraphic inscriptions. Attention will be given both to comparative perspectives and to the special aesthetic and intellectual consequences that the conjunction of the literary and visual modes give to Chinese artistic expression. [Undergraduate enrollment with consent of one of the instructors.]",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221987",
        "number": "CHINA 230",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "246",
        "title": "Political Thought in Modern Asia (CHINA 146, ETHICSOC 146, POLISCI 235N, POLISCI 335N)",
        "description": "The study of political theory in the United States has been accused of being Western-centric: We tend to focus on intellectual traditions from Plato to NATO, while ignoring the vast world of non-Western societies and the ways they think about politics and public life. How do Chinese thinkers conceptualize human rights and good governance? How do Indian intellectuals reconcile democracy and inherited hierarchies in Hinduism? How do Islamic scholars view the relationship between religious authority and secular authority? Should we regard liberal democracy, or Western civilization more broadly, as representing the universal value guiding every society? Or, should we learn from non-Western ideas and values so as to solve problems plaguing Western societies? How can competing visions of good life coexist in a globalized and increasingly pluralistic world? This course aims to answer these questions by exploring three Asian traditions and their perspectives on politics: Confucianism, Hinduism, and Islam. We will focus on the modern period (19th-21st centuries) and the ways intellectuals in these societies respond to the challenge of modernity and Western superiority. Special attention is given to how these intellectuals conceive of the relationship between modernity and their respective traditions: Are they compatible or mutually exclusive? In which ways do intellectuals interpret these traditions so as to render them (in)compatible with modernity? We will read academic articles written by Anglophone scholars as well as original texts written by non-Western thinkers. No knowledge of non-Western languages is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "222622",
        "number": "CHINA 246",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "251",
        "title": "The Use of Classical Antiquity in Modern China (CHINA 151, CLASSICS 143)",
        "description": "This course examines the roles played by classical antiquity--Greek, Roman, and Chinese--in China's modernization process. Central topics of discussion include: the relationship between tradition and modernity, the relationship between China and the West, the politics and techniques of appropriation in the reception of classical heritage, and the evolving and highly contentious nature of the differences among various approaches to classical antiquity. Tackling the most fundamental questions that have confronted an ancient civilization from the turn of the twentieth century to the present, the course investigates how &quot;classics&quot; and &quot;classical tradition&quot; acquire different meanings and functions in changed contexts, and serves as a convenient introduction to key moments and figures in modern Chinese cultural and intellectual history.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223610",
        "number": "CHINA 251",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "251B",
        "title": "The Nature of Knowledge: Science and Literature in East Asia (CHINA 151B, JAPAN 151B, JAPAN 251B, KOREA 151, KOREA 251)",
        "description": "&quot;The Nature of Knowledge&quot; explores the intersections of science and humanities East Asia. It covers a broad geographic area (China, Japan, and Korea) along a long temporal space (14th century - present) to investigate how historical notions about the natural world, the human body, and social order defied, informed, and constructed our current categories of science and humanities. The course will make use of medical, geographic, and cosmological treatises from premodern East Asia, portrayals and uses of science in modern literature, film, and media, as well as theoretical and historical essays on the relationships between literature, science, and society.nnAs part of its exploration of science and the humanities in conjunction, the course addresses how understandings of nature are mediated through techniques of narrative, rhetoric, visualization, and demonstration. In the meantime, it also examines how the emergence of modern disciplinary &quot;science&quot; influenced the development of literary language, tropes, and techniques of subject development. This class will expose the ways that science has been mobilized for various ideological projects and to serve different interests, and will produce insights into contemporary debates about the sciences and humanities.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32668",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zur, D.",
                                "sunet": "dafnaz"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220687",
        "number": "CHINA 251B",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "254A",
        "title": "Shaping the Theater: Two Foundational Plays of Early Chinese Drama (CHINA 354A)",
        "description": "In this class we are going to read the two earliest plays in the Chinese southern dramatic tradition (nanxi) for what they can tell us of the foundation idea of a theater. We will examine Top Graduate Zhang Xie and The Lute, two tales of ambitious families and students, love, betrayal, strained family relations and even attempted murder. We will analyze their structure (music, act division and role organization), as well as the social and moral purpose of drama. Our discussion will focus on what these texts tell us about the purpose of theater, the values it attempts to promote and its social criticism. * Pre-requisite, one year of classical Chinese or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219670",
        "number": "CHINA 254A",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "255",
        "title": "The Culture of Entertainment in China (CHINA 155)",
        "description": "Sophisticated, organized entertainment in China is evident at least as early as the second century B.C. in the court spectacles described in the early histories and in the depictions of jugglers, dancers and acrobats represented in tomb bas-reliefs. The importance attached to entertainment from ancient times both at court and in society at large is manifest not just in the establishment of imperial institutions such as the Music Bureau, but also in the appearance of large entertainment districts within the cities where people would invest extraordinary amount of resources in the pursuit of pleasure, and in small scale gatherings. The representation of play and pleasure in Chinese culture from a variety of sources (art, history, literature and performance) in different periods of Chinese history. The place of pleasure in Chinese culture, as well as ethical, socio-political and economical concerns. Held in old Knight Bldg., 521 Memorial Way, Rm. 102.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "216715",
        "number": "CHINA 255",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "255A",
        "title": "Health, Politics, and Culture of Modern China (ANTHRO 148, ANTHRO 248, CHINA 155A)",
        "description": "One of the most generative regions for medical anthropology inquiry in recent years has been Asia.  This seminar is designed to introduce upper division undergraduates and graduate students to the methodological hurdles, representational challenges, and intellectual rewards of investigating the intersections of health, politics, and culture in contemporary China.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29512",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kohrman, M.",
                                "sunet": "kohrman"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210079",
        "number": "CHINA 255A",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "255B",
        "title": "Narrative and Storytelling in Premodern China (CHINA 155B)",
        "description": "In premodern China, individuals and groups told stories variously to philosophize and persuade, to commemorate and critique, to educate and entertain, to scandalize and to stimulate. In this class, we will trace the evolution of Chinese narrative storytelling through close readings of some of the most compelling stories in the Chinese tradition, including early philosophical anecdotes and historical accounts, medieval tales and religious performance pieces, and early modern short stories. In the process, we will come to appreciate how Chinese narrative storytelling evolved over time, dwelling on issues such as genre, authorship, textuality, and readership to understand how writers and readers used storytelling to navigate and negotiate the world around them, including issues related to gender and sexuality, social status, and political power.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222257",
        "number": "CHINA 255B",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "259A",
        "title": "Maoism and the Chinese Communist Party (CHINA 159A)",
        "description": "This course offers a comprehensive overview of the history of the Chinese Communist Party with a particular focus on the Mao Zedong Thought and Mao's rise to power. Key topics in this course include the Soviet Union's influence on China, the Yan'an Rectification Campaign, regime consolidation in the early People's Republic of China, and the Cultural Revolution. The goal of this course is to familiarize you with the logic of China's communist revolution and the most important political campaigns launched by the Communist Party. We will devote a substantial amount of time to reading original works of Marx, Lenin, Stalin, and Mao Zedong. This course helps students of Chinese Studies to understand and interpret Mao's writings and thoughts, as well as the basic organizational and managerial structure of the Chinese Communist Party and its unique political language.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "223101",
        "number": "CHINA 259A",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "261",
        "title": "Soldiers and Bandits in Chinese Culture (CHINA 161)",
        "description": "Social roles and literary images of two groups on the margins of traditional Chinese society; historical and comparative perspectives.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "208587",
        "number": "CHINA 261",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "263",
        "title": "Chinese Biographies of Women (CHINA 163)",
        "description": "Generic and historical analysis of the two-millennia long biographical tradition inaugurated by Liu Xiang, ca. 79-8 B.C.E. Chinese women's history, intellectual history, historiography, and literary studies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "206330",
        "number": "CHINA 263",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "265",
        "title": "Major Figures in Classical Chinese Poetry (CHINA 365)",
        "description": "This year the course will focus on Su Shi (Su Dongpo), the great 11th century writer. We will look into all the forms he wrote in (3 kinds of poetry, formal prose, informal notes on &quot;things,&quot; miracle tales, letters to family and friends, etc.) to get a sense of the range of his interests and expressive outlets. We will also consider the balance between his private life and public persona, the effects that political persecution had on him, and his exploration of the linkage between poetry and the visual arts (painting, calligraphy).",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "207962",
        "number": "CHINA 265",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "266",
        "title": "The Art Song (Ci): Love and Performance (CHINA 166)",
        "description": "Analysis of the entertainment song (&quot;ci&quot;) in 11th and 12th centuries, known for its treatment of romantic love and the affections. How do male writers represent love as experienced by men and by women in entertainment songs? What happens when a woman writes in this form, dominated by male authors? How does the form change from a low-status entertainment genre, widely viewed as frivolous, into a high literary form that excited writers about its new expressive potential? Prerequisite: Advanced reading knowledge of Chinese.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31087",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Encina West 101",
                        "instructors": [
                            {
                                "name": "Egan, R.",
                                "sunet": "ronegan"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111253",
        "number": "CHINA 266",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "268",
        "title": "The Chinese Family (CHINA 168)",
        "description": "History and literature. Institutional, ritual, affective, and symbolic aspects. Perspectives of gender, class, and social change.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32222",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zhou, Y.",
                                "sunet": "yzhou1"
                            },
                            {
                                "name": "Huang, X.",
                                "sunet": "xiaoyih"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "207454",
        "number": "CHINA 268",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "270",
        "title": "Chinese Language, Culture, and Society (CHINA 170)",
        "description": "Functions of languages in Chinese culture and society, origin of the Chinese language, genetic relations with neighboring languages, development of dialects, language contacts, evolution of Chinese writing, language policies in Greater China.  Prerequisite: one quarter of Chinese 1 or 1B or equivalent recommended. This course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216129",
        "number": "CHINA 270",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "271",
        "title": "Utopia, Dystopia, and Technology in Science Fiction: A Cross-Cultural Perspective (CHINA 171, GLOBAL 200)",
        "description": "This course explores how science fiction (sf) narratives from East and West imagine the future of humanity and human-nature relations. The blind faith in technoscientific power has aggravated class disparity, eroded the social fabric, and undermined the humanist legacy of the Enlightenment. Technological fetishism has given rise to apocalyptic futures of dystopia marked by destructive AI, the digital jungle of existential struggle, environmental degradation, climate disasters, class disparity, and posthuman barbarism. On the other hand, sf narratives keep hopes alive by projecting utopias, exposing the pitfalls of technological 'progress' and keeping faith with human sovereignty in renewing social ecology in balance with natural conditions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224339",
        "number": "CHINA 271",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "272",
        "title": "Science and History of Traditional Chinese Medicine (ASNAMST 272, MED 272)",
        "description": "Traditional Chinese medicine (TCM) is a unique system for the diagnosis and treatment of disease, as well as for the cultivation of life-long health and well-being. This course introduces basic TCM theories, practices, and treatment methods including acupuncture, Taichi, and herbal medicine.  We will introduce historical figures and events in the history of Traditional Chinese Medicine and East-West integrative health.  Drawing on science, cultural history, and philosophy, this interdisciplinary approach will help us to understand Traditional Chinese Medicine in its intellectual, social, and cultural context. We will discuss the scientific exploration of TCM and how modern science shapes our understanding of East-West integrative health.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "33104",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ring, H.",
                                "sunet": "ring"
                            },
                            {
                                "name": "Lin, B.",
                                "sunet": "bylin"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224733",
        "number": "CHINA 272",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "275",
        "title": "Constructing National History in East Asian Archaeology (ARCHLGY 135, ARCHLGY 235, CHINA 175)",
        "description": "Archaeological studies in contemporary East Asia share a common concern, to contribute to building a national narrative and cultural identity. This course focuses on case studies from China, Korea, and Japan, examining the influence of particular social-political contexts, such as nationalism, on the practice of archaeology in modern times.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "212071",
        "number": "CHINA 275",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "276",
        "title": "Emergence of Chinese Civilization from Caves to Palaces (ARCHLGY 111, ARCHLGY 211, CHINA 176)",
        "description": "Introduces processes of cultural evolution from the Paleolithic to the Three Dynasties in China. By examining archaeological remains, ancient inscriptions, and traditional texts, four major topics will be discussed: origins of modern humans, beginnings of agriculture, development of social stratification, and emergence of states and urbanism.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "210933",
        "number": "CHINA 276",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "277",
        "title": "Painting, Poetry, and Calligraphy: Word and Image Studies (CHINA 377)",
        "description": "This course examines the rich interplay of word and image in Chinese culture. Topics include the coexistence of painting, poem, and calligraphy in a single work of art, paintings inspired by poems and visa versa, the ways calligraphy gets written about, and painting criticism. The course serves as an introduction to field of Chinese word and image studies. It will be co-taught by specialists in Chinese literature and art.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219677",
        "number": "CHINA 277",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "278",
        "title": "Lives of Confucius (CHINA 178)",
        "description": "This course examines the transformation of the images of Confucius (551-479 BCE) from his own time to the present day. Major topics include: Confucius and his rivals / critics, the making of Confucius the &quot;Uncrowned King,&quot; his apotheosis as China's cultural symbol and civilization's greatest sage, and twists and turns in his modern fate. Comparisons will be made with the development of images of Socrates, Jesus, and other important cultural figures. NOTE: In order for course to count towards major or minor, undergrads must enroll in a minimum of 3 units or higher.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219786",
        "number": "CHINA 278",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "279",
        "title": "For Love of Country: National Narratives in Chinese Literature and Film (CHINA 379)",
        "description": "Explores the nation as it is constructed, deconstructed, and continuously contested in novels, short stories, films, and other media from the second half of the 20th century in mainland China and Taiwan. Asks how the trope of the nation and the ideology of nationalism mediate the relationships between politics and aesthetics. Explores the nation's internal fault lines of gender, ethnicity, geography, language, and citizenship.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "211107",
        "number": "CHINA 279",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "283",
        "title": "China's Dynastic Founders (CHINA 183A)",
        "description": "This course examines the lives of China's dynastic founders, among whom we find the most influential, the most celebrated, the most complicated, and the most controversial rulers in premodern Chinese history. We seek to understand the ideas of leadership and legitimacy, the relationships among statecraft, military might, and moral virtue, and the importance of precedents and exemplars in traditional Chinese political culture. Primary readings are the biographies of the dynastic founders in the official histories, supplemented by the representations of these rulers in other genres of writings.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "215564",
        "number": "CHINA 283",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "285",
        "title": "Literary Translation, Chinese to English (CHINA 185)",
        "description": "A study of the methods and practice of literary translation (broadly conceived, including historical, philosophical, and literary works), including prose and poetry, from Chinese to English, concentrating on premodern Chinese texts. The course will give equal attention to evaluating major published translations (good and not-so-good), and student practice in doing their own translations of a range of different genres, periods, styles of Chinese texts into English.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224830",
        "number": "CHINA 285",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "288",
        "title": "Modern China Studies: State of the Field (CHINA 388)",
        "description": "This is a survey course designed to acquaint master&iquest;s and doctoral students in East Asian Studies with the latest English-language scholarship on modern China, broadly defined, across the humanities and interpretive social sciences. Each time the course is offered (once every two or three years), the disciplinary/thematic emphasis shifts and the readings are completely different. The course may be repeated up to 3 times.  This year, we focus on innovative scholarship in the &iquest;New Humanities,&iquest; including environmental humanities, health humanities, and digital humanities. Future topics include sinophone studies, film and visual culture, sensory studies, translation studies, genre fiction, queer studies, animal studies, new media and internet literature, world literature, cognitive approaches, literature (&amp; philosophy, law, anthropology, history, psychology, religion, etc.), and so on.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220689",
        "number": "CHINA 288",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "290",
        "title": "Research in Chinese Linguistics (CHINA 190)",
        "description": "This proseminar course introduces to graduate students and advanced undergraduate students in Chinese linguistics the standard practice in linguistic publications. In preparation for conducting research effectively in their own areas of interest, students are introduced to abstract writing, manual style for linguistic publications, available Chinese corpuses, etc. Students should identify a topic of interest through consultation with the instructor within the first two weeks of class and submit an abstract by the end of the third week. They are expected to present the hypothesis and research plan in class in week 4 and report the relevant research findings in week 10. It should be submitted after revisions as a term paper. May be repeated for credit. Prerequisite: China 191 or consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223517",
        "number": "CHINA 290",
        "units": [
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "291",
        "title": "The Structure of Modern Chinese (CHINA 191)",
        "description": "Introduce to students the basic grammar of Standard Modern Chinese in comparison to English. Students learn about the logic of the Chinese in communicating ideas and events without grammatical markers like plurality, definiteness, tense, subject/object, etc, as well as common uses of verbs and adjectives that are totally different from those in English. Prerequisite: CHINLANG 3 or equivalent, or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12721",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tsai, Y.",
                                "sunet": "ytt"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111236",
        "number": "CHINA 291",
        "units": [
            2,
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "292B",
        "title": "Chinese Legal History (HISTORY 292B)",
        "description": "This undergraduate colloquium introduces students to the history of law in imperial China through close reading of primary sources in translation and highlights of Anglophone scholarship. We begin with legal perspectives from the Confucian and Legalist classics and the formation of early imperial legal codes. Then we focus on how law served as a field of interaction between state and society during China's last imperial dynasty, the Qing (1644-1911). Specific topics include autocracy and political crime; evidence, review, and appeals; the regulation of gender and sexual relations; the functioning of local courts; property and contract; and the informal sphere of community regulation outside the official judicial system.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "223894",
        "number": "CHINA 292B",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "295J",
        "title": "Chinese Women's History (FEMGEN 295J, HISTORY 295J)",
        "description": "The lives of women in the last 1,000 years of Chinese history. Focus is on theoretical questions fundamental to women's studies. How has the category of woman been shaped by culture and history? How has gender performance interacted with bodily disciplines and constraints such as medical, reproductive, and cosmetic technologies? How relevant is the experience of Western women to women elsewhere? By what standards should liberation be defined?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "28859",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-Gender",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "201999",
        "number": "CHINA 295J",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "354A",
        "title": "Shaping the Theater: Two Foundational Plays of Early Chinese Drama (CHINA 254A)",
        "description": "In this class we are going to read the two earliest plays in the Chinese southern dramatic tradition (nanxi) for what they can tell us of the foundation idea of a theater. We will examine Top Graduate Zhang Xie and The Lute, two tales of ambitious families and students, love, betrayal, strained family relations and even attempted murder. We will analyze their structure (music, act division and role organization), as well as the social and moral purpose of drama. Our discussion will focus on what these texts tell us about the purpose of theater, the values it attempts to promote and its social criticism. * Pre-requisite, one year of classical Chinese or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219670",
        "number": "CHINA 354A",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "365",
        "title": "Major Figures in Classical Chinese Poetry (CHINA 265)",
        "description": "This year the course will focus on Su Shi (Su Dongpo), the great 11th century writer. We will look into all the forms he wrote in (3 kinds of poetry, formal prose, informal notes on &quot;things,&quot; miracle tales, letters to family and friends, etc.) to get a sense of the range of his interests and expressive outlets. We will also consider the balance between his private life and public persona, the effects that political persecution had on him, and his exploration of the linkage between poetry and the visual arts (painting, calligraphy).",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "207962",
        "number": "CHINA 365",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "369",
        "title": "Late Imperial Chinese Fiction",
        "description": "Primary works examined include Jin Ping Mei, Xingshi yinyuan zhuan, Hongloumeng, Qilu deng, Rulin waishi, and Ernu yingxiong zhuan. Secondary readings focus on social dimensions of the Chinese novel (ca. 1600-1850), but students may explore other aspects of the texts in their presentations and research papers. Comparisons with the English novel, particularly on the rise of the novel and the advent of modernity.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "210912",
        "number": "CHINA 369",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "371",
        "title": "Politics, Aesthetics, Critical Ecology: Artworks and the Environment (COMPLIT 371)",
        "description": "Climate change and environmental crises have given rise to critique and reflection. This class will bring together issues of aesthetics, politics, and artworks around environmental issues. The introductory phase will involve students with key issues in ecocritical literature by reading Timothy Clark's Literature and the Environment. Moving on to the critical ecology of the Frankfurt School, the class will study the critiques of anthropocentrism, the Enlightenment, and capitalist production as the source for domination over nature and over other humans. We will explore Marxist critiques of capitalist production and alienation in John Foster and Brett Clark's writings about metabolic rifts, toxic colonialism, and alienation of labor and nature. A look at ecological thoughts in the ancient Chinese tradition will be enriched by an inquiry into contemporary Chinese eco-critical literature and film, including Chen Qiufan's Waste Tide and Jia Zhangke's Still Life. Chinese is not required. PhD students are required to write a term paper of 20-25 pages. MA and undergraduate students will write short essays in response to the questions from readings and discussion.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course will meet in the Knight Building, room 201.",
                "classId": "14289",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wang, B.",
                                "sunet": "banwang"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111261",
        "number": "CHINA 371",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "374",
        "title": "New Directions in the Study of Poetry and Literary Culture (CHINA 174)",
        "description": "Inquiry into new approaches and interpretations of the poetic tradition in China in the context of cultural history. Readings in recent scholarship and criticism that situate poetry in print history, manuscript culture, gender studies, social history, etc. Readings in English. Reading knowledge of Chinese desirable but not required.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "213285",
        "number": "CHINA 374",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "376",
        "title": "Methods, Theories, and Practice in Chinese Archaeology (ARCHLGY 376)",
        "description": "This course is designed for graduate students who are interested in Chinese archaeology. We will discuss the current issues in the discipline, particularly related to archaeological research on food and foodways. We will conduct experimental study and laboratory analyses to investigate ancient human behavior in food procurement, preparation, and consumption. The archaeological methods include analyses of use-wear on stone tools and various microbotanical remains (starch, phytoliths, etc.) on artifacts.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220027",
        "number": "CHINA 376",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "377",
        "title": "Painting, Poetry, and Calligraphy: Word and Image Studies (CHINA 277)",
        "description": "This course examines the rich interplay of word and image in Chinese culture. Topics include the coexistence of painting, poem, and calligraphy in a single work of art, paintings inspired by poems and visa versa, the ways calligraphy gets written about, and painting criticism. The course serves as an introduction to field of Chinese word and image studies. It will be co-taught by specialists in Chinese literature and art.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219677",
        "number": "CHINA 377",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "379",
        "title": "For Love of Country: National Narratives in Chinese Literature and Film (CHINA 279)",
        "description": "Explores the nation as it is constructed, deconstructed, and continuously contested in novels, short stories, films, and other media from the second half of the 20th century in mainland China and Taiwan. Asks how the trope of the nation and the ideology of nationalism mediate the relationships between politics and aesthetics. Explores the nation's internal fault lines of gender, ethnicity, geography, language, and citizenship.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "211107",
        "number": "CHINA 379",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "380",
        "title": "Survey in Sinophone Literature",
        "description": "A survey of Sinophone novels, short stories, poetry, plays, reportage, and films from the 20th and 21st centuries from mainland China, Hong Kong, Taiwan, and overseas. Emphasis on close reading of original Chinese-language texts. Selections to be determined by seminar instructor and participants. Each year's syllabus is completely different so that a student may repeat the course up to 5 times. In lieu of academic papers, translations with critical introductions are required. Prerequisite: advanced reading knowledge of modern Chinese.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32661",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wang, B.",
                                "sunet": "banwang"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224333",
        "number": "CHINA 380",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "388",
        "title": "Modern China Studies: State of the Field (CHINA 288)",
        "description": "This is a survey course designed to acquaint master&iquest;s and doctoral students in East Asian Studies with the latest English-language scholarship on modern China, broadly defined, across the humanities and interpretive social sciences. Each time the course is offered (once every two or three years), the disciplinary/thematic emphasis shifts and the readings are completely different. The course may be repeated up to 3 times.  This year, we focus on innovative scholarship in the &iquest;New Humanities,&iquest; including environmental humanities, health humanities, and digital humanities. Future topics include sinophone studies, film and visual culture, sensory studies, translation studies, genre fiction, queer studies, animal studies, new media and internet literature, world literature, cognitive approaches, literature (&amp; philosophy, law, anthropology, history, psychology, religion, etc.), and so on.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220689",
        "number": "CHINA 388",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "391",
        "title": "Seminar in Chinese Syntax",
        "description": "May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224285",
        "number": "CHINA 391",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "392",
        "title": "A History of Sinology (CHINA 192)",
        "description": "A study of major works in the history of Sinology, covering both its 19th century European and 20th century North American branches. This is an introduction to the history of the study of traditional China in the Western world, including all fields (history, literature, philosophy, etc.) and approaches (translation, analysis, close reading, handbooks and reference works). Attention to how the study of China outside of China has evolved through time.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32219",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Egan, R.",
                                "sunet": "ronegan"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223845",
        "number": "CHINA 392",
        "units": [
            2,
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "392B",
        "title": "Law and Society in Late Imperial China (HISTORY 392B)",
        "description": "Connections between legal and social history. Ideology and practice, center and periphery, and state-society tensions and interactions. Readings introduce the work of major historians on concepts and problems in Ming-Qing history.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "14912",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "203325",
        "number": "CHINA 392B",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "393",
        "title": "Frontier Expansion and Ethnic Statecraft in the Qing Empire (HISTORY 393)",
        "description": "The legacy of the Qing dynasty in the territorial boundaries claimed by the People's Republic of China including the frontier zones that lie outside China proper. How the Qing acquired and ruled its frontier territories. Growth and migration of the Han Chinese population. How the dynasty's Manchu rulers managed ethnic difference. Consequences of Qing expansionism and ethnic statecraft for subject peoples and for the dynasty itself. At what point and by what processes did the Qing become China.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "29108",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "207605",
        "number": "CHINA 393",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "393A",
        "title": "State, Society, and Economy in Qing Dynasty China (HISTORY 393A)",
        "description": "Historical scholarship on China during the Qing period, including the gentry, civil examinations, and the debate about social mobility; merchants, cities, and the debate about civil society/public sphere; taxation, local security, and famine relief; heterodoxy, collective violence, and rebellion; and rival approaches (neo-Malthusian, neo-conservative, and neo-Marxist) to understanding the high Qing economy.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "208833",
        "number": "CHINA 393A",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "395",
        "title": "Gender and Sexuality in Chinese History (FEMGEN 395J, HISTORY 395J)",
        "description": "Graduate colloquium on gender and sexuality in Chinese history.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "29500",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "209845",
        "number": "CHINA 395",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "430",
        "title": "Image and Text in the Arts in China (ARTHIST 230B, ARTHIST 430B, CHINA 230)",
        "description": "An examination of many types of interactions between images and texts in Chinese painting. These include poetic lines inscribed on paintings (as response or as a theme given to the artist to paint), paintings that emulate or transform ancient poetic couplets, or illustrate poetic and literary narratives, and calligraphic inscriptions. Attention will be given both to comparative perspectives and to the special aesthetic and intellectual consequences that the conjunction of the literary and visual modes give to Chinese artistic expression. [Undergraduate enrollment with consent of one of the instructors.]",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221987",
        "number": "CHINA 430",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "495A",
        "title": "Qing Legal Documents (HISTORY 495A)",
        "description": "(Same as LAW 5037.) How to use Qing legal documents for research. Winter: sample documents that introduce the main genres including: the Qing code and commentaries; magistrates' handbooks and published case collections; and case records from Chinese archives. Spring: class meets occasionally; students complete research papers. Prerequisite: advanced reading ability in Chinese.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "204465",
        "number": "CHINA 495A",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "CHINA",
        "code": "495B",
        "title": "Qing Legal Documents (HISTORY 495B)",
        "description": "How to use Qing legal documents for research. Winter: sample documents that introduce the main genres including: the Qing code and commentaries; magistrates' handbooks and published case collections; and case records from Chinese archives. Spring: class meets occasionally; students complete research papers. Prerequisite: advanced reading ability in Chinese.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "204468",
        "number": "CHINA 495B",
        "units": [
            4,
            5
        ]
    }
]