[
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "1",
        "title": "Contemporary Modern I: Liquid Flow",
        "description": "Students in Liquid Flow will participate in a dance and movement class that teaches the fundamentals of dance technique and addresses the way we already dance through the world. By discovering our own movement signatures, and becoming aware of other people's dance, motion, and energy in space, we will transform the way we inhabit flow states, from the dance studio, into everyday life, and ultimately onto the stage. Accompanied by a live DJ, students will develop technique, articulation, flexibility, and grace, to gain freedom while dancing, and mine dance's potential for social transformation and connection. We will draw from various movement traditions and practices, including contemporary modern, ballet, lyrical, Tai chi and yoga, with opportunities to remix other styles. Designed for all levels, we welcome beginners, student movers from diverse dance traditions, athletes, and advanced dancers, who desire more fluidity in their lives.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "11880",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Hayes, A.",
                                "sunet": "ahayes1"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "13379",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Hayes, A.",
                                "sunet": "ahayes1"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE",
            "way_ce"
        ],
        "objectID": "218442",
        "number": "DANCE 1",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "11",
        "title": "Introduction to Dance Studies (CSRE 11, FEMGEN 11, TAPS 11)",
        "description": "This class is an introduction to dance studies and the complex meanings bodily performances carry both onstage and off. Using critical frames drawn from dance criticism, history and ethnography and performance studies, and readings from cultural studies, dance, theater and critical theory, the class explores how performing bodies make meanings. We will read theoretical and historical texts and recorded dance as a means of developing tools for viewing and analyzing dance and understanding its place in larger social, cultural, and political structures. Special attention will be given to new turns in queer and feminist dance studies. TAPS 11 has been certified to fulfill the Writing in the Major (WIM) requirement.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "221592",
        "number": "DANCE 11",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "17AX",
        "title": "Circa's Leviathan: Art of Circus Movement",
        "description": "Stanford Live will host Circa's internationally-renowned ensemble and a local cast of circus performers, dancers and young people to perform Leviathan, a world premiere circus event. This Arts Intensive class will provide six students experience in movement, dance, and/or circus arts the opportunity to study the legacy of circus and join the rehearsals to ultimately perform in Leviathan with Circa on Sept. 30 &amp; Oct. 1, 2022. Working with Circa's Artistic team and ensemble performers, students will be required to participate in three weeks of rehearsal to learn the show and perform. Students will also work with Circa's Artistic Director, Yaron Lifschitz, during final rehearsals and in season. Aleta Hayes will offer a supportive curriculum exploring the artistic themes of collaboration, movement, and using art to express the human experience. Curriculum will also focus on the emotional and physical aspects of mounting a complex performance.Circus studies within the academic field of performance studies is a heavily under-researched area. The 19th century circus offers fascinating histories of race and gender in performance. The history of the circus is also a history of technology and coincides with the industrial revolution's persistent push to merge the human and the machine - the constant attempt to test and push against the boundaries of humanity's frailties and mortality. Contemporary circus draws from current cultural aesthetics, street vernacular, movement improvisation-- blurring lines between dance, theater and circus. We will look at pioneers of the genre including Cirque Du Soleil, Pickle Family circus, Archaos and more recent examples like the Tiger Lillies, the Lucent dossier Company and others. The art of circus is taken in an exciting new direction as 36 performers hang from a grid suspended in the air and propel themselves across the stage, tumbling, balancing and soaring together. The dramatic power and extreme skill of Circa's trademark acrobatics thrillingly expose the tension between the mass and the individual in this epic theatrical event that is at once deeply moving and physically stunning. In these complex times, Leviathan offers hope by celebrating what can be achieved when we work together. This action-packed show connects the local with the global and the emerging with the visionary and genuinely pushes boundaries in a powerful new circus production. Please note that Arts Intensive and initial rehearsals with Circa will take place September 6-23. Additional evening rehearsals will be scheduled and required leading up to the September 30 and October 1 performances following Arts Intensive period. Students must commit to the full intensive in addition to the final rehearsals and ultimate performances the week of September 24 to October 1.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224074",
        "number": "DANCE 17AX",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "25",
        "title": "Young Choreographers Festival: From Studio to Stage",
        "description": "This course is designed to launch young choreographers and performance makers in the TAPS Department. At the end of Winter Quarter 2023-2024, students will have the opportunity to audition for the inaugural Young Choreographers Festival. Twelve choreographers will be selected to debut new works. To be considered, student choreographers must take a Fall or Winter choreography class, or receive mentorship from one of the Dance Faculty members. Choreographers, performers and production crew can enroll to receive credit for their participation in the festival. Bay Area Dance Exchange @ STANFORD: Saturday, April 6th opportunity to show excerpts and get feedback ? Meet Dance Faculty members and your fellow dance peers, from colleges and universities across the Bay Area. Proposed Festival Dates: Friday, April 19th and Saturday, April 20th. Proposed Festival Location: The Nitery Theater in Old Union",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [
            "way_ce"
        ],
        "objectID": "219606",
        "number": "DANCE 25",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "26",
        "title": "Dancing Theories of Race (CSRE 26, TAPS 26)",
        "description": "What can choreography and movement practice lend a comparative understanding of race studies? Pairing critical theory in race studies with dance performance, this course moves through ten units to scaffold a nuanced orientation toward race and dance that moves beyond questions of representation toward agency, animation, and action. Each week centers one key dance performance alongside one formative text in comparative race studies to allow for close-analysis and critical interpretation, featuring choreographers such as Alvin Ailey, Trisha Brown, Lenora Lee, and Ralph Lemon alongside theorists like Frantz Fanon, Cedric Robinson, Edward Said, Patricia Collins, and Jose Mu&ntilde;oz. Through interdisciplinary modes of knowing, we will pair text and movement through the dancing body to (re)consider the social, historical, and political formations of race and its presentation on and off stage.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224598",
        "number": "DANCE 26",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "27",
        "title": "Faculty Choreography",
        "description": "Collaborative building, rehearsal, filming and editing of unique Spring QTR dance films by TAPS/Dance Faculty choreographers. Culminating films will be screened May 27, 28 &amp; 29, as a TAPS Main Stage production. Casting by Audition &amp; Invitation according to the needs of each choreographer. For detailed project descriptions, casting requirements, and full rehearsal schedules, contact instructors directly. Choreography by Diane Frank (diane.frank.dance@gmail.com); Choreography by Aleta Hayes (ahayes1@stanford.edu): Choreography by Katie Faulkner (khfaulk@stanford.edu). Dancers from diverse dance and movement backgrounds are encouraged to participate. Once cast, enroll under the instructor's individual section for 1-2 units.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [
            "WAY-CE",
            "way_ce"
        ],
        "objectID": "125324",
        "number": "DANCE 27",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "27H",
        "title": "Faculty Choreography: Aleta Hayes (AFRICAAM 27H)",
        "description": "Creation, rehearsal, performance of faculty choreography by Senior Lecturer Aleta Hayes. Casting by audition/invitation.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224602",
        "number": "DANCE 27H",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "27R",
        "title": "Faculty Choreography: Raissa Simpson",
        "description": "Through collaborative and dialogic processes, this course will investigate the real or perceived to be real systems of power as it relates to race, class and gender. Fall/Flight is an intercultural choreographic invention investigating the episteme of aerial dance, contemporary modern exercises - and the questioning of social constructs - as it relates to the body. An audition workshop will take place Jan 9 and 11. For questions please email raiisas@stanford.edu.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224635",
        "number": "DANCE 27R",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "27S",
        "title": "Faculty Choreography: amara tabor-smith",
        "description": "Working in collaboration with the students, amara tabor-smith will create a dance-theater performance piece celebrating the life and work of the prolific writer, educator, feminist and social activist, bell hooks.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224604",
        "number": "DANCE 27S",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "29",
        "title": "Roots Modern I",
        "description": "In this course students will be introduced to a series of contemporary dance warm ups and dance combinations that are drawn from a broad range of modern dance techniques, somatic practices and dance traditions of the African diaspora with a particular focus on Afro Brazilian, Afro Cuban and Haitian dance forms. No prior dance experience is required. Each class will be comprised of a series of warm up exercises and fun dance combinations that express the connection between western contemporary technique with dance traditions of the African diaspora. Dance combinations will consist of dynamic movement patterns that condition the body for strength, flexibility, endurance, musicality and coordination. Through these exercises students learn how to become expressive and dynamic movers and gain a deeper appreciation of the multiple expressions of what is known as contemporary or modern dance.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "218831",
        "number": "DANCE 29",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "30",
        "title": "Contemporary Choreography: Chocolate Heads 'Weather Simulator' Performance Project (AFRICAAM 37)",
        "description": "The Chocolate Heads Movement Band will engage in an interdisciplinary project-based course to develop collaborative choreography and installation art with visual and musical components. How can we attune our senses to perceive the subtleties of our surroundings?  How can we learn to perceive the magic hiding in plain sight? The Autumn '23-'24 project will make use of remixing strategies, deep listening practices, and outdoor exploration to animate these questions in a multisensorial performance piece. We will cultivate an imaginary garden full of wild, surprising, and mysterious entities. Taking inspiration from landscape architecture, textiles, lighting, and projection design, we will bring the outside world in to create a dance and performance ecology. The course will feature collaborations with guest scientists, artists, and somatic practitioners. Our garden is open to all forms of creative expression and all levels of experience; we invite dancers, movers, and emerging creators of all styles and backgrounds. WEEK 1: TU 9/26--Introduction to the Project &amp; CHs Band; THU 9/28--1st Audition Workshop. Contact Aleta Hayes (ahayes1@stanford.edu) for more information.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "11207",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Hayes, A.",
                                "sunet": "ahayes1"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "210637",
        "number": "DANCE 30",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "30S",
        "title": "Chocolate Heads Special Proj.: Interdisciplinary Movement Lab for Choreographers &Performance Makers",
        "description": "This course will be co-taught by two interdisciplinary dance and performance makers: Aleta Hayes, artistic director of the Chocolate Heads Movement Band, and JoAnna Mendl Shaw, visiting guest artist from NYC. Each student will explore choreographic strategies to create an original work by the end of the quarter. The choreographic perspectives offered will include: Hayes' collaborative making process, developed through The Chocolate Heads Movement Band, which draws upon a wide array of academic and physical disciplines to produce contemporary dance; and Mendl Shaw's interspecies lens, developed through The Equus Projects, which uses choreographic scoring to generate performance with dancers and horses. Mendl Shaw's Physical Listening honors our &quot;embodied, physical intelligence&quot; and seeks to enhance &quot;our human capacity for multi-sensory awareness.&quot; At the end of the quarter, students will have the opportunity to audition to debut new works for the inaugural  TAPS Young Choreographers Festival. We invite emerging creators and movement-makers from any and all performance backgrounds to take the course and bring their diverse styles into the choreographic space. All levels of experience are welcome. Contact Aleta Hayes (ahayes1@stanford.edu) for questions.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "14259",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hayes, A.",
                                "sunet": "ahayes1"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "223115",
        "number": "DANCE 30S",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "39",
        "title": "TAPS Production Units: Dance",
        "description": "Credit for dance students participating in a TAPS production. Units determined by instructor. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "225724",
        "number": "DANCE 39",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "45",
        "title": "Dance Improvisation from Freestyle to Hip Hop (AFRICAAM 45)",
        "description": "In this dance improvisation class, we will develop techniques and practices to cultivate an improvisational practice in dance and domains beyond. This class is an arena for physical and artistic exploration to fire the imagination of dance improvisers and to promote collaborative and interactive intelligence. We will draw upon dance styles and gestural vocabularies, including contemporary dance, hip-hop, vogue and more. Students will learn how to apply these improvisational dance ideas to generate and innovate across disciplines. Accompanied by a live DJ, students will practice listening with eyes, ears, and our whole bodies. Open to students from all dance, movement, and athletic backgrounds. Beginners welcome.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "28429",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "125330",
        "number": "DANCE 45",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "45H",
        "title": "Dance Improvisation",
        "description": "This synchronous online course will cover a range of theories and approaches to movement improvisation for all movement levels. Through diverse movement experiences students will familiarize themselves with the process of spontaneous creation in solo, duet, small ensemble and group form. We will explore methods that cultivate greater self-awareness as well as sensitivity to others and will examine personal and established methods of improvisational practice such as Site-Specific response, Chance Methodologies and Action Theater. Working to heighten our capacity for innovative, creative decision-making, we will rigorously strive for full, embodied awareness, presence, listening, humility, intuition, and playfulness in all of our activities. This course will also examine the role of improvisation in the creative, choreographic/compositional process both as a generative tool and a form of performance itself.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "223390",
        "number": "DANCE 45H",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "46",
        "title": "Social Dance I",
        "description": "Introduction to non-competitive social dance. The social dances found in today's popular culture include 3 kinds of swing, 3 forms of waltz, tango, salsa, bachata, cha-cha and nightclub two-step. The course also includes tips for great partnering, enhancing creativity, developing personal style, stress reduction, musicality, and the ability to adapt to changing situations. The emphasis on comfort, partnering and flexibility will enable students to dance with partners whose experience comes from any dance tradition. If the class is filled, register to get on the waitlist.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ACT",
                "notes": null,
                "classId": "11142",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Powers, R.",
                                "sunet": "vintage"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ACT",
                "notes": null,
                "classId": "12127",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Powers, R.",
                                "sunet": "vintage"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ACT",
                "notes": null,
                "classId": "11763",
                "currentClassSize": "0",
                "maxClassSize": "70",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Powers, R.",
                                "sunet": "vintage"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "way_ce"
        ],
        "objectID": "125331",
        "number": "DANCE 46",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "48",
        "title": "Ballet I: Introduction to Ballet",
        "description": "Fundametals of ballet technique including posture, placement, the foundation steps, and ballet terms; emphasis on the development of coordination, balance, flexibility, sense of lines, and sensitivity to rhythm and music. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "28431",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "13716",
                "currentClassSize": "0",
                "maxClassSize": "41",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Pankevich, A.",
                                "sunet": "antosha5"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "14253",
                "currentClassSize": "0",
                "maxClassSize": "46",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Pankevich, A.",
                                "sunet": "antosha5"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE",
            "way_ce"
        ],
        "objectID": "125333",
        "number": "DANCE 48",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "50",
        "title": "Contemporary Choreography",
        "description": "Each day Ketley will develop a new phrase of choreography with the students and use this as the platform for investigation. Consistent lines of inquiry include; sculpting with the body as an emotional, instinctual, and graphic landscape, how the fracturing and the complication of strands of information can feel generative of new ways of moving, discussions around how our use of time is directly correlated to our sense of presence, and the multitude of physical colors available to each of us as artists as we expand our curiosity about movement. Classes will be very physical, trusting that much of our knowledge is contained in the body. For questions please e-mail aketley@stanford.edu.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "29808",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "30897",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Ketley, A.",
                                "sunet": "aketley"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 69600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE",
            "way_ce"
        ],
        "objectID": "217015",
        "number": "DANCE 50",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "58",
        "title": "Hip Hop I: Introduction to Hip Hop",
        "description": "Steps and styling in one of America's 21st-century vernacular dance forms. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "13717",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Reddick, R.",
                                "sunet": "rreddick"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE",
            "way_ce"
        ],
        "objectID": "204522",
        "number": "DANCE 58",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "59",
        "title": "Hip-Hop II",
        "description": "Steps and styling in one of America's 21st-century vernacular dance forms. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "30899",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Reddick, R.",
                                "sunet": "rreddick"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "14257",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Reddick, R.",
                                "sunet": "rreddick"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE",
            "way_ce"
        ],
        "objectID": "202394",
        "number": "DANCE 59",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "71",
        "title": "Introduction to Capoeira: An African Brazilian Art Form (AFRICAAM 71)",
        "description": "Capoeira is an African Brazilian art form that incorporates, dance, music, self-defense and acrobatics. Created by enslaved Africans in Brazil who used this form as a tool for liberation and survival, it has since become a popular art form practiced around the world. In this course students will learn basic movements for both Capoeira Angola and Capoeira Regional, and the history of this rich and physically rigorous art form. Students will learn basic acrobatic skills, be introduced to Capoeira songs, and learn to play rhythms on the drum, pandeiro (tambourine), and the Berimbau -- a single stringed bow instrument. This course will be physically rigorous and fun! No previous experience necessary.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [
            "way_ce"
        ],
        "objectID": "219929",
        "number": "DANCE 71",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "102",
        "title": "Musical Theater Dance Styles (MUSIC 184E)",
        "description": "Students will be able to demonstrate period specificity, character of style through learning different musical theater dances from the early 20th C.to the present. ALL students will participate in an end of quarter showing of the choreography developed and composed in class. Class will be supplemented with the occasional guest, DJ accompaniment and video viewing.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [
            "WAY-CE",
            "way_ce"
        ],
        "objectID": "208417",
        "number": "DANCE 102",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "103I",
        "title": "Interdiscipline: Channeling Impulse into Form",
        "description": "This course is about discovering the wonderment of dance through an interdisciplinary lens. The more disciplines we interface with through dance, the more rich and surprising the outcomes will be. When our primal urges for expression are interfaced with technology (any tool) they become rendered as artifacts, as something `real' in the world. By repurposing those artifacts and folding them back into dance we can significantly deepen the complexity and quality of our dance expression.  This course is a manual for finding more depth, more truthfulness and ultimately honing your excellence in dancing, in order to find meaning and serve purpose for others.This course is designed to radically deconstruct assumptions about Contact Improvisation and contemporary dance, in order to reassemble new possibilities for individual expression. The course will provide a hands-on-opportunity for utilizing exercises rooted in the disciplines of visual art, music, photography, or architecture as they relate to embodied and kinetic experiences in movement. In the process, we will contemplate the phenomenology of performance both inside and outside of the theater, as we are endlessly 'seeing others' and 'being seen by others' out in the world or on stage. The material for this course draws on principles from Steve Paxton, Rudolph Laban, William Forsythe and draws inspiration from Gutai Art Association, Maurice Merleau-Ponty, Devised Theater and other approaches. All are welcome and asked to bring boundless curiosity and an appetite for rigorous focus and sustained play.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224748",
        "number": "DANCE 103I",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "103O",
        "title": "Contact Improvisation; The Onflowing Connection",
        "description": "This course will introduce the students to the fundamentals of Contact Improvisation and its tenets for creativity and personal expression. The focus will be on exploring the potential of the body's primal urge to move, inspired by deep energies released through human interaction. The course will be built on very simple physical principles allowing students to explore their experience of moving and to understand their own bodies more profoundly, which is often experienced as joyful and liberating. At times we will draw from adjacent movement techniques for freeing up the body with greater ease and grace, and to allow the dancing to happen more naturally. We will concentrate on weight release, skeletal structure, floor-work, inversions, and at times utilize facia based bodywork for embodied anatomy analysis as well as for preparing to safely and respectfully partner together. At a fundamental level this form is about being present with the modulation of tone and weight in the body, so that the touch remains alive and creative. Due to the sensitive nature of direct person to person contact, it should be anticipated that direct partnering will be introduced in a measured and controlled way over several sessions at a pace determined by the comfort level of the class. The goals for the course are to enable every student to be proficient at basic partnering, weight sharing, low and high lifts, rolling patterns, cartwheels, handstands and working comfortably in a 360 degree relationship to space. Any level of experience is welcome; please come with curiosity, creativity and desire for play.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224744",
        "number": "DANCE 103O",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "105R",
        "title": "Contemporary Choreography: Choreographic Realization Project",
        "description": "Choreographic Realization Project will focus on the creation of a choreographic work created collaboratively between participating students and the instructor. Student dancers with all levels of choreographic experience will be invited to work in tandem with the instructor on the creation of rigorous and detailed movement statements as material for the larger group work. The course will function both as an introduction to choreographic methods and tools as well as an experiential investigation of collaborative processes. The course will culminate in an informal public showing on the final class day. Dancers of all levels and movement backgrounds are welcome.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "30162",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "221996",
        "number": "DANCE 105R",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "106I",
        "title": "Stanford Dance Community: Inter-Style Choreography Workshop",
        "description": "Designed for adventurous dancers, choreographers and student dance team leaders across Stanford campus. Students will explore a multiplicity of dance styles presented both by peer choreographers, as well as professionals in the field, to create a community of dancers who want to experiment and innovate within their form. The emphasis of the class is on individual growth as a dancer and dance maker through exposure to new and unfamiliar styles. Student dance team leaders and dancers with a strong interest in both choreography and learning different forms are highly encouraged to attend. Interested participants encouraged but not required to contact instructor, Aleta Hayes: ahayes1@stanford.edu. Course will consist of weekly choreography master classes taught by peers, composition intensives facilitated by the instructor, and guest professional master classes, not represented by the class participants.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [
            "way_ce"
        ],
        "objectID": "219607",
        "number": "DANCE 106I",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "108",
        "title": "Hip Hop Choreography: Hip Hop Meets Broadway",
        "description": "What happens when Hip Hop meets &quot;Fosse&quot;, &quot;Aida&quot;, &quot;Dream Girls&quot; and &quot;In the Heights&quot;?nThe most amazing collaboration of Hip Hop styles adapted to some of the most memorable Broadway Productions.nThis class will explore the realm between Hip Hop Dance and the Broadway Stage.  Infusing Acting thru dance movement and exploring the Art of Lip Sync thru Hip Hop Dance styles.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "11953",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Reddick, R.",
                                "sunet": "rreddick"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE",
            "way_ce"
        ],
        "objectID": "209992",
        "number": "DANCE 108",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "109",
        "title": "Choreography: Strategies to Building Movement, Dance, and Time Based Art",
        "description": "A class for students interested in contemporary methods of devising movement for performance. At the forefront of current dance culture hybridity has become the new normal, with movement blended from everyday actions, classical forms, hip-hop, and beyond. The body as a vehicle for expression is an ever expanding landscape and the class will focus on the plethora of ways movement can be derived including; the many ways improvisation can engender movement, how systemic approaches to performance can enhance a creators understanding of the body in space, the ways chaos and ugliness can redefine our notions of beauty, and how environment, sound, music, and context can inform our physical sensibilities. The class is open to all students from any movement background or those new to dance with a curiosity about how the body can be a vibrant and multifaceted artistic tool. For more information please contact choreographer and lecturer Alex Ketley at aketley@stanford.edu.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "220748",
        "number": "DANCE 109",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "114",
        "title": "Movement for Actors/Acting for Dancers: Techniques for the Contemporary Performer",
        "description": "Designed for the performing artist in the contemporary theatrical environment, this class will expose students to various training modalities from contemporary dance, popular dance styles, physical theater, musical theater, Greek theater and  other somatic techniques. Students will undertake various practices such as, but not limited to: Viewpoints, Laban, Gaga, Butoh and Grotowski in a workshop format. Other activities include creating studies from widely sourced prompts as given by the instructor and developing a personal performance preparation playbook. The course will include special guests from the TAPS faculty in Dance, Theater and Performance. In an age where the triple threat performer is in high demand, and movement, text, narrative, production and space are not necessarily treated hierarchically, the well-rounded performer will be better equipped to handle current multi-genre stages. While all levels are welcomed, the committed dance and/or theater student is especially encouraged to apply. Questions? Contact: Aleta Hayes (ahayes1@stanford.edu)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [
            "way_ce"
        ],
        "objectID": "221111",
        "number": "DANCE 114",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "119",
        "title": "Special Topics: Dance, Architecture, Technology",
        "description": "DANCE 119 Special Topics courses feature the annual Mohr Visiting Artist. The Mohr Visiting Artist program brings acclaimed and emerging artists to campus for a one-term period to teach a credited course and provide a presentation, exhibition or performance for the Stanford community and the public.nnIn Winter 2018-19, Mohr Visiting Artist Jonah Bokaer, a celebrated international choreographer, will address his work which expands on the movement lineage of both Merce Cunningham, and Robert Wilson. Bokaer is a Co-Founder of CPR - Center for Performance Research in New York City.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [
            "way_ce"
        ],
        "objectID": "221108",
        "number": "DANCE 119",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "122",
        "title": "Moving the Message: Reading and embodying the works of bell hooks (AFRICAST 202, CSRE 202, ENGLISH 287, FEMGEN 201)",
        "description": "In this course, we will spend time reading, discussing and embodying the work of Black feminist theorist and teacher bell hooks. hook's work focuses on practices rooted in Black feminism, the role of love in revolutionary politics, rescuing ourselves and each other from hegemonic forces, and building the components necessary for a life of liberatory politics. Through a process grounded in movement improvisation, creative writing and expression we will explore how the words and theories of bell hooks can literally move us towards freedom and self recovery. This course is presented by the Institute for Diversity in the Arts, IDA.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224030",
        "number": "DANCE 122",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "123",
        "title": "Choreography: Hot Mess & Deliberate Failure as Practice",
        "description": "A  dance class in how we become the worst dancer possible. The foundation of this class has many parts. One is that, in almost every respect the way we gain insight into anything is to understand more clearly its polarity. As a class we purposely explore chaos, failure, and &quot;bad&quot; dancing, with the hope that then we will have a greater chance to understand and refine our personal notions around beauty. The class also acknowledges that creativity is at times born from the loss of control. Instead of looking at this idea obliquely, Hot Mess looks at this directly by having dancers confront a number of movement and vocal prompts that are literally impossible to execute in any good way. This class embraces and celebrates destabilization, with all the exuberance, fear, and learning that can happen when we accept and practice being lost.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "32744",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Ketley, A.",
                                "sunet": "aketley"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 69600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "219196",
        "number": "DANCE 123",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "124",
        "title": "Danceacution: Performance Practice, Death Row, and the Evolution of Cultural Reform",
        "description": "Danceacution is a unique course in performance practice taught by nationally recognized choreographer Alex Ketley. Creative expression does not exist in a vacuum but is deeply influenced by the societal contexts surrounding it. The class will use the vast breadth of Bill Clark's life experience as the platform to develop their own artwork. Bill Clark is an artist and writer incarcerated on Death Row. This can take the form of writing, film making, dance, music, or theater. Bill is offering some of his most inspiring writing to the class as a foundation for research and will call into the class each week from the prison phone so the students can interact with him directly. Alex Ketley has built theater pieces from numerous creative vantage points and will guide the students in the development of their work. At the end of the quarter there will be a performance that Bill will attend via San Quentin's video conference system where he and Alex will offer feedback to each student. Danceacution is an opportunity for students to engage their creative impulses through the lens of two artists deeply committed to the idea that art has the ability to affect meaningful change in our society. Enrollment is by permission only. Please email the instructor at aketley@stanford.edu to inquire.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "32906",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:50:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Ketley, A.",
                                "sunet": "aketley"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 71400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224641",
        "number": "DANCE 124",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "128",
        "title": "Roots Modern Experience - Mixed Level (AFRICAAM 128)",
        "description": "In this course students will be introduced to a series of Afro-contemporary dance warm ups and dance combinations that are drawn from a broad range of dance traditions of the African diaspora with a particular focus on Afro Brazilian, Afro Cuban and Haitian dance forms, modern dance techniques, and somatic movement practices. Our study of these dance disciplines will inform the movement vocabulary, technical training, class discussions, and choreography we experience in this course. Students will learn more about the dances and rhythms for the Orishas of Brazil and Cuba, and the Loa of Haiti. Dance combinations will consist of dynamic movement patterns that condition the body for strength, flexibility, endurance, musicality and coordination. Through this approach to our warm ups and class choreography, we will deepen our analysis and understanding of how African diaspora movement traditions are inherently embedded in many expressions of the broadly termed form known as contemporary modern dance.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "13891",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Smith, A.",
                                "sunet": "amarats"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "32745",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Smith, A.",
                                "sunet": "amarats"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "way_ce"
        ],
        "objectID": "219930",
        "number": "DANCE 128",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "133",
        "title": "History of the Waltz",
        "description": "Two hundred years of waltzing: Regency era waltz (1816), Vienna in the 1830s, redowa and mazurka waltz variations, waltz in 5/4 time, the Russian Mazurka Quadrille, pivots, 20th-century hesitation waltz, tango waltz, Parisian valse musette, 1930s Boston, 1950s Bandstand-style waltz, swing waltz. Each form is explored for possible adaptation to today's non-competitive social dancing. May be repeated for credit two times.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "203337",
        "number": "DANCE 133",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "140",
        "title": "Contemporary Modern II",
        "description": "This intermediate level course will cover fundamental principles underlying the evolving style of modern/contemporary dance both technical and artistic in nature. Students will perform creative and technical exercises that develop strength, flexibility, musicality, increased range of motion, functional efficiency, and performance quality as a means towards developing more, efficient, expressive, and communicative bodies. The contemporary technique taught in this class prepares the student to perform with clarity and artistry, and with deeper anatomical knowledge and connectivity.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "30902",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Simpson, R.",
                                "sunet": "raiisas"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "28770",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Simpson, R.",
                                "sunet": "raiisas"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "32746",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Simpson, R.",
                                "sunet": "raiisas"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "125345",
        "number": "DANCE 140",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "141",
        "title": "Contemporary Modern III",
        "description": "This advanced level technique course will cover the fundamental principles underlying modern/contemporary dance both technical and artistic in nature. Students will perform technical exercises that develop functional efficiency, strength, flexibility, musicality, range of motion and performance quality as a means towards honing their own artistic expression and physicality. More advanced concepts such as qualitative versatility, phrasing awareness, innovative physical decision-making, and attention to performance will be explored in greater depth. The contemporary technique taught in this class prepares the student to perform with clarity and artistry, and with deeper anatomical knowledge and connectivity. Short written reflections and concert attendance will supplement studio work. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "13722",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "5:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Simpson, R.",
                                "sunet": "raiisas"
                            }
                        ],
                        "startTimestamp": 63000.0,
                        "endTimestamp": 69600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "15171",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "5:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Simpson, R.",
                                "sunet": "raiisas"
                            }
                        ],
                        "startTimestamp": 63000.0,
                        "endTimestamp": 69600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "14452",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "5:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Simpson, R.",
                                "sunet": "raiisas"
                            }
                        ],
                        "startTimestamp": 63000.0,
                        "endTimestamp": 69600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "125346",
        "number": "DANCE 141",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "141S",
        "title": "Contemporary Modern: Advanced Comparative Techniques",
        "description": "Students will take technique classes each week from various, diverse and notable Contemporary Modern Dance Instructors from across the Bay Area and beyond, in order to learn from and be exposed to the scope and breadth of the contemporary dance field.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "223709",
        "number": "DANCE 141S",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "146",
        "title": "Social Dance II",
        "description": "Intermediate non-competitive social ballroom dance. The partner dances found in today's popular culture include Lindy hop, Viennese waltz, hustle, traveling foxtrot, plus intermediate/advanced levels of cross-step waltz and nightclub two-step. The course continues further tips for great partnering, enhancing creativity, developing personal style, stress reduction, musicality, and the ability to adapt to changing situations. Prerequisite: Dance 46. Many students are taken from the waiting list. If the class is filled, register to get on the waitlist.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "32823",
                "currentClassSize": "0",
                "maxClassSize": "160",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Powers, R.",
                                "sunet": "vintage"
                            }
                        ],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 48000.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "way_ce"
        ],
        "objectID": "125351",
        "number": "DANCE 146",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "147",
        "title": "Social Dance History: Living Traditions of Swing",
        "description": "This course will teach all forms of swing dancing from the beginning through today. The original Lindy Hop of the 1920s, 6-count and 8-count Lindy, Shag and Big Apple, Rock 'n' Roll swing, disco Hustle, and West Coast Swing. Since swing dance was constantly changing, this course can also be seen as the Evolution of West Coast Swing. Swing emphasizes personal style, creativity, musicality, collaborative partnering and improvisation. Each form is explored for possible adaptation to today's non-competitive social dancing. Prerequisite: Dance 46. Many students are taken from the waiting list. If the class is filled, register to get on the waitlist.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "28771",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "30905",
                "currentClassSize": "0",
                "maxClassSize": "75",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Powers, R.",
                                "sunet": "vintage"
                            }
                        ],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 48000.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "way_ce"
        ],
        "objectID": "125352",
        "number": "DANCE 147",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "148",
        "title": "Ballet II",
        "description": "Intermediate Ballet at Stanford is designed for students who have done ballet in their past, but maybe have stepped away from the form for awhile. The class focuses on technique, musicality, vocabulary, coordination and artistic choice. The class looks at ballet as an enduring and vibrant movement system that can be used for classical purposes or as a way to strengthen and diversify the movement vocabulary inherent in other dance forms like modern, hip-hop, or social dancing.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "14260",
                "currentClassSize": "0",
                "maxClassSize": "46",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Pankevich, A.",
                                "sunet": "antosha5"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "32824",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Pankevich, A.",
                                "sunet": "antosha5"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "125353",
        "number": "DANCE 148",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "149",
        "title": "Ballet III",
        "description": "Advanced Ballet at Stanford is offered for students who are interested in rigorous, complex, and artistically compelling ballet training.  The class focuses on technique, but in the broad sense of how ballet as a movement system can be used for a wide range of dance disciplines.  The class honors the historical training legacy that defines classical ballet, but is in no way shackled to that history in an antiquated fashion.  The students are encouraged to explore the form as artists, to question its foundations, and find their own sense of agency within classical dance.  Students with a strong background in ballet are encouraged to come, but also students with less ballet training are welcome as long as they have an email dialog with the lecturer beforehand.  Any questions can be directed to Lecturer Alex Ketley at aketley@stanford.edu",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "13718",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Ketley, A.",
                                "sunet": "aketley"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "14254",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Ketley, A.",
                                "sunet": "aketley"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "13741",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Ketley, A.",
                                "sunet": "aketley"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "125354",
        "number": "DANCE 149",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "156",
        "title": "Social Dance III",
        "description": "Intermediate non-competitive social ballroom dance. Intermediate/advanced waltz variations, redowa and Bohemian National Polka are followed by intermediate/advanced tango, cha-cha, salsa and bachata. The course continues further tips for great partnering, enhancing creativity, developing personal style, stress reduction, musicality, and the ability to adapt to changing situations. Prerequisite: Dance 46. Dance 156 may immediately follow Dance 46. Many students are taken from the waiting list. If the class is filled, register to get on the waitlist.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "14255",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "Roble Gymnasium 113",
                        "instructors": [
                            {
                                "name": "Powers, R.",
                                "sunet": "vintage"
                            }
                        ],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 48000.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "way_ce"
        ],
        "objectID": "125357",
        "number": "DANCE 156",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "160J",
        "title": "Conjure Art 101: Performances of Ritual, Spirituality and Decolonial Black Feminist Magic (CSRE 160J)",
        "description": "Conjure Art is a movement and embodied practice course looking at the work and techniques of artists of color who utilize spirituality and ritual practices in their art making and performance work to evoke social change. In this course we will discuss the work of artists who bring spiritual ritual in their art making while addressing issues of spiritual accountability and cultural appropriation. Throughout the quarter we will welcome guest artists who make work along these lines, while exploring movement, writing, singing and visual art making. This class will culminate in a performance ritual co-created by students and instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "27918",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Roble Gymnasium 115",
                        "instructors": [
                            {
                                "name": "Smith, A.",
                                "sunet": "amarats"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "219853",
        "number": "DANCE 160J",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "161P",
        "title": "Dance and the Politics of Movement (LIFE 161P, TAPS 161P, TAPS 361P)",
        "description": "This course examines how the dancing body has been viewed, exhibited, analyzed, and interpreted from the late nineteenth century to the present. We will discuss how ideologies about race, gender, and sexual orientation are mapped onto the body, as well as investigate the body's place in discourses on religion, health, war, performance, and consumer culture. We will explore how people create meaning through dance and how dance, in turn, shapes social norms, political institutions, and cultural practices. The course's structure challenges the Western/non-Western binary by comparing dance forms across the globe.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "221862",
        "number": "DANCE 161P",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "162P",
        "title": "Intersectionality and the Politics of Ballet (FEMGEN 162, TAPS 162P)",
        "description": "Ballet dancers drag a long and conservative history with them each time they step onstage. Yet recently some of the most radical challenges in dance are coming from ballerinas, featuring prosthetic limbs, non-female identifying dancers en pointe, and Ultra-Orthodox Jewish women performing classical repertoire. This seminar uses dance history to reposition ballet as a daring future-facing art form, one where the politics of nationality, religion, class, gender, race, and disability intersect. These issues are provocatively illuminated by classically trained dancers like South African artist Dada Masilo in her gender-bending Swan Lake and Giselle adaptations, Phil Chan's anti-Orientalist restagings, and activist American dancer Alice Sheppard's showcasing of the art of disability partnered by her wheelchair. What can ballet bring to the pressing social issues of equity, inclusion, and diversity when for centuries it has been considered an exemplar of the static imperialist, Western art form and idealized white body? What has shifted to reveal ballet as a vital medium for registering new global identities and social justice challenges? How can an art form built on obedient bodies be politically dangerous?  Exposing limitations of binaries such as masculine/feminine, White/Black, heterosexual/homosexual, and colonial/ colonized histories, we consider how culture is complicated through the ballet repertoire and its techniques for disciplining and gendering bodies. Using live and recorded performances, interviews with practitioners reshaping the field, and close readings of new scholarship, we will see how 21st century politics are being negotiated through ballet in an intersectional frame.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224531",
        "number": "DANCE 162P",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "166",
        "title": "History of Social Dance in Western Culture",
        "description": "NEWLY REVISED COURSE. A survey of movement and historical dance from the past two centuries to today, with the technique and traditions that are distinctive to each era. Partnered dances include Waltz, Tango, Jazz Age and Swing Era dances, 1970s Disco, Latin dances, through today's social dance forms. Renaissance and Baroque dance will no longer be covered, in order to focus on the evolution of today's social dance forms. The course will include techniques for historical dance reconstruction, with students creating their own dance reconstructions. Previous dance experience is not required to take this course.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [
            "WAY-CE",
            "way_ce"
        ],
        "objectID": "202502",
        "number": "DANCE 166",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "190",
        "title": "Special Research",
        "description": "Topics related to the discipline of dance. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28772",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28432",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "14677",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, A.",
                                "sunet": "amarats"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "15183",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, A.",
                                "sunet": "amarats"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "125367",
        "number": "DANCE 190",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 4
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "195D",
        "title": "Queer Caribbean Performance (TAPS 195D, TAPS 395D)",
        "description": "With its' lush and fantastic landscape, fabulous carnivalesque aesthetics, and rich African Diaspora Religious traditions, the Caribbean has long been a setting which New World black artists have staged competing visions of racial and sexual utopia and dystopia. However, these foreigner-authored fantasies have often overshadowed the lived experience and life storytelling of Caribbean subjects. This course explores the intersecting performance cultures, politics, and sensual/sexual practices that have constituted queer life in the Caribbean region and its diaspora. Placing Caribbean queer of color critique alongside key moments in twentieth and twenty-first century performance history at home and abroad, we will ask how have histories of the plantation, discourses of race and nation, migration, and revolution led to the formation of regionally specific queer identifications. What about the idea of the 'tropics' has made it such as fertile ground for queer performance making, and how have artists from the region identified or dis-identified with these aesthetic formations? This class will begin with an exploration of theories of queer diaspora and queer of color critique's roots in black feminisms. We will cover themes of exile, religious rites, and organizing as sights of queer political formation and creative community in the Caribbean.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "223711",
        "number": "DANCE 195D",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "196",
        "title": "Dancing Black: Embodying the African Diaspora in the United States and the Caribbean (TAPS 196, TAPS 396)",
        "description": "What does it mean to dance black? How can studying comparative dance practices across the United States and the Caribbean expose continuities and differences in African diaspora experience? How can we draw strategies from black performance to inform our current movements for social change? This class will explore how dance and writing about performance have shaped notions of what it means to identify or be marked as an African diaspora subject. From the ring shouts of captive Africans to the 20th-century concert dance stage, from New York queer ballroom culture to Tiktok fads, this class will expose students to both historical and ethnographic methods for using dance to study the formation of black community in the New World. Looking beyond the surface of skin, we'll explore how race is experienced in muscle and flesh, and how black performers have historically taken advantage of or disavowed racialized ideas of how they can/should move. We will read theories of diaspora, queer of color critique and black feminist theory, and performance theory. We will search for the common questions and conversations about embodiment, the spectator's gaze, and black belonging that run through all three disciplines. Students will be required to do some movement research (through accessible, at-home dance practice), write weekly journals, and complete short essay projects. Students develop will skills for writing, speaking, and making performance to explore the intersections between race, sexuality, and dance.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30241",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222710",
        "number": "DANCE 196",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "197",
        "title": "Dance in Prison: The Arts, Juvenile Justice, and Rehabilitation in America (AMSTUD 197, TAPS 197)",
        "description": "This class uses the lens of performance, and particularly dance, to explore the aesthetic, cultural, historical, and legal issues in the lives of incarcerated youth. In the process students gain an understanding of incarceration and its cultural dimensions. Class readings and discussions foreground the legal and social contexts surrounding prisons in the U.S.,  Particular attention will be paid to the nexus of art, community, and social action, and how dance might be used to study the performing arts effects on self-construction, perception, experiences of embodiment, and social control for incarcerated teenagers. The class includes guest speakers who bring important perspectives on criminal justice including returned citizens, a juvenile justice attorney, a restorative conferencing facilitator and a dancer who teaches women in prison to be their own dance instructors.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-AmerCul",
            "WAY-EDP"
        ],
        "objectID": "125369",
        "number": "DANCE 197",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "DANCE",
        "code": "224",
        "title": "Physical Listening (SOMGEN 224)",
        "description": "Do you want to deepen your communication skills with patients and colleagues? Are you planning or pursuing a career in healthcare? If so, Physical Listening is the course for you. Non-verbal behaviors and physical presence play a critical role in masterful interpersonal communication. How our bodies move - the energy we project, the force and speed of our movements - informs how we perceive and communicate. The Stanford School of Medicine and Medical Humanities program invite you to join this interdisciplinary course harnessing core competencies at the intersection of medicine and dance, designed to finesse clinically-relevant communication skills through creative inquiry. Through this course, learners will: Explore the concept of &quot;physical embodiment&quot; through interactive exercises, video viewings, clinical cases, and lively discussion;  sharpen skills of kinesthetic awareness, spatial perception, and critical movement analysis; improve their ability both to read and employ non-verbal, physical &quot;language&quot; in daily communication. Taught by faculty/instructors from the School of Medicine, Stanford Healthcare, Stanford Medicine Children's Health, and the Department of Theater and Performance Studies (TAPS). Featured instruction by JoAnna Mendl Shaw - renowned choreographer and former Juilliard and NYU Tisch School of the Arts faculty.  Open to all Stanford undergraduate students (perfect for premedical students!), graduate students and medical students. No prerequisites, no former artistic experience expected.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "225088",
        "number": "DANCE 224",
        "units": [
            2
        ]
    }
]