[
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "8",
        "title": "The Oceans: An Introduction to the Marine Environment (EARTHSYS 8)",
        "description": "The course will provide a basic understanding of how the ocean functions as a suite of interconnected ecosystems, both naturally and under the influence of human activities. Emphasis is on the interactions between the physical and chemical environment and the dominant organisms of each ecosystem. The types of ecosystems discussed include coral reefs, deep-sea hydrothermal vents, coastal upwelling systems, blue-water oceans, estuaries, and near-shore dead zones. Lectures, multimedia presentations, group activities, and tide-pooling day trip.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "217874",
        "number": "ESS 8",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "14",
        "title": "Tropical coastal marine ecosystems: data and analysis methods",
        "description": "This 1-unit course is designed for Stanford undergraduates intending to work remotely or on-site in tropical coastal marine systems of the Indo-Pacific at any time between 2021 and 2022. The course includes learning units on mangroves, seagrass beds, tropical estuaries, and coral reefs. Techniques covered include: satellite observations, in-the-water deployments of biogeochemical and physical monitoring instruments, drone -based visible and infrared imaging, and field ecology observations. Permission of instructor is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "223242",
        "number": "ESS 14",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "14N",
        "title": "Sustainable Adaptation",
        "description": "How do we adapt to the rapid global environmental changes that are happening around us? How do we do so in a way that is sustainable, enhancing human and environmental wellbeing, now and in the future? In this course, we will explore these questions through an interdisciplinary lens, drawing from the social sciences, engineering, and public health. We will focus on people&iquest;s responses to a range of impacts related to global environmental change from sea level rise to extreme weather events. Example responses include changes in fishing practices, taking protective action during wildfires or hurricanes, and migrating to a new location. Often, we will draw case studies from frontline communities, those who experience the &quot;first and worst&quot; of global environmental changes. Through readings, film, and field trips, we will ask what adaptation to global environmental change is, what does it mean to be sustainable, and how can it be sustained.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomores admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "29206",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Shriram 366",
                        "instructors": [
                            {
                                "name": "Wong-Parodi, G.",
                                "sunet": "gwongpar"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225416",
        "number": "ESS 14N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "15N",
        "title": "Fitting Fish into the Food System",
        "description": "There is a growing perception that our global food system is broken. Billions of people around the world lack adequate nutrition for healthy and productive lives, and obesity now exceeds hunger even in poor communities. Agricultural practices add to climate change, biodiversity loss, and other environmental harms, and freshwater and soils are widely depleted. Farmers who produce food in many parts of the world may lack the income to feed their own families. What's missing from this conversation about food and agriculture is fish, or more broadly, 'blue foods', animals and plants cultivated or captured in ocean and freshwater systems worldwide. This seminar will explore the role of blue foods in creating a sustainable and healthy global food system. It will build off The Blue Food Assessment - an international initiative led by Stanford with contributions from over 100 researchers from around the world - to explore the nutrition, environment, justice, equity, and climate dimensions of fish within the global food system. We will probe a wide range of questions, including: Do fish provide a healthier option than meat in all diets?; What is aquaculture all about, and is it sustainable?; Is seaweed the solution for a broken food system?; What is the role of blue foods in decarbonizing the food sector?; Are small-scale fish producers a small part of food systems - or a large part? Is food justice at risk in fisheries and global fish trade? How might the science of blue foods change national food policies? Is there a role for the private sector in developing healthy and sustainable blue foods? The class will be structured around readings, discussions, debates, essay-writing, and role playing as we seek solutions to global food system challenges through blue foods.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224549",
        "number": "ESS 15N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "16N",
        "title": "Island Ecology",
        "description": "Preference to freshmen. How ecologists think about the world. Focus is on the Hawaiian Islands: origin, geology, climate, evolution and ecology of flora and fauna, and ecosystems. The reasons for the concentration of threatened and endangered species in Hawaii, the scientific basis for their protection and recovery. How knowledge of island ecosystems can contribute to ecology and conservation biology on continents.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "31138",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Y2E2 253",
                        "instructors": [
                            {
                                "name": "Vitousek, P.",
                                "sunet": "vitousek"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci"
        ],
        "objectID": "111814",
        "number": "ESS 16N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "38N",
        "title": "The Worst Journey in the World: The Science, Literature, and History of Polar Exploration (EARTHSYS 38N, EPS 38N)",
        "description": "(Formerly GEOLSCI 38N) This course examines the motivations and experiences of polar explorers under the harshest conditions on Earth, as well as the chronicles of their explorations and hardships, dating to the 1500s for the Arctic and the 1700s for the Antarctic. Materials include The Worst Journey in the World by Aspley Cherry-Garrard who in 1911 participated in a midwinter Antarctic sledging trip to recover emperor penguin eggs. Optional field trip into the high Sierra in March. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "28954",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "320-241",
                        "instructors": [
                            {
                                "name": "Dunbar, R.",
                                "sunet": "dunbar"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci"
        ],
        "objectID": "202012",
        "number": "ESS 38N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "40",
        "title": "Approaching Palau:  Preparation and Research Ideation and Development (CEE 40)",
        "description": "This class is a seminar designed to prepare students participating in the 2022 Palau Seminar for possible research activities.  Enrollment by approval of the instructors.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "221313",
        "number": "ESS 40",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "46N",
        "title": "Exploring the Critical Interface between the Land and Monterey Bay: Elkhorn Slough (EARTHSYS 46N)",
        "description": "Preference to freshmen. Field trips to sites in the Elkhorn Slough, a small agriculturally impacted estuary that opens into Monterey Bay, a model ecosystem for understanding the complexity of estuaries, and one of California's last remaining coastal wetlands. Readings include Jane Caffrey's &quot;Changes in a California Estuary: A Profile of Elkhorn Slough&quot;. Basics of biogeochemistry, microbiology, oceanography, ecology, pollution, and environmental management.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "30990",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Y2E2 105",
                        "instructors": [],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "207354",
        "number": "ESS 46N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "61Q",
        "title": "Food and security (EARTHSYS 61Q, INTNLREL 61Q)",
        "description": "The course will provide a broad overview of key policy issues concerning agricultural development and food security, and will assess how global governance is addressing the problem of food security. At the same time the course will provide an overview of the field of international security, and examine how governments and international institutions are beginning to include food in discussions of security.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "212072",
        "number": "ESS 61Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "65N",
        "title": "How to make a tornado (and other flows in the atmosphere and ocean)",
        "description": "In this seminar students explore the physics of atmospheric and oceanic flows experientially using rotating tanks of water on small turntables provided to students in the class. Different flow phenomena from tornado formation, ocean gyres, to hurricane propagation are introduced each week and experiments are designed to simulate them. The experiments, like the oceanic and atmospheric motions they are simulating, can be visually stunning, like pieces of fluid artwork, and the students will learn various visualization techniques to draw out their beauty. The goal is for students to practice the scientific method while gaining an understanding and appreciation for how the ocean and atmosphere work.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "30968",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Shriram 366",
                        "instructors": [
                            {
                                "name": "Thomas, L.",
                                "sunet": "leift"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "223304",
        "number": "ESS 65N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "71",
        "title": "Planet Ocean (BIO 71, OCEANS 71)",
        "description": "Oceans make up the majority of our planet's area and living spaces and are fundamental to biodiversity, climate, food and commerce.This course covers integration of the oceanography and marine biology of diverse ocean habitats such as the deep sea, coral reefs, open ocean, temperate coasts, estuaries and polar seas. Lectures include state of the art knowledge as well as emerging technologies for future exploration. The second section focuses on how the oceans link to the global environment, and how ocean capacity helps determine human sustainability.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16741",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Palumbi, S.",
                                "sunet": "spalumbi"
                            },
                            {
                                "name": "Farah, H.",
                                "sunet": "hfarah"
                            },
                            {
                                "name": "kaholoaa, K.",
                                "sunet": "kaiku"
                            },
                            {
                                "name": "Micheli, F.",
                                "sunet": "micheli"
                            },
                            {
                                "name": "Dunbar, R.",
                                "sunet": "dunbar"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "16742",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "223499",
        "number": "ESS 71",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "86N",
        "title": "The Most Rational People in the World",
        "description": "Humans, broadly construed, emerged as bipedal apes in the African mixed savanna-woodlands approximately two million years ago. From humble beginnings, humans have gone on to be become the ecologically dominant species in most biomes and grown to a global population in excess of seven billion. This dominance arises from a combination of features of the human organism including its extreme degree of behavioral flexibility and flexible social organization. The prima facie evidence of human evolutionary and ecological success raises a paradox with respect to recent work in economics and psychology which increasingly argues for pervasive irrationality in human decision-making in a wide array of behavioral contexts. How is it possible for an organism with such seemingly flawed software supporting decision-making to become the globally dominant species? We will use this contradiction as the launching point for understanding what rationality means in a broad ecological and cross-cultural context. What do we mean by `rationality&iquest;? How do different disciplines conceive of rationality in different ways? Is there such a thing as a rationality that transcends cultural differences or is the very idea of rationality a cultural construction that is used to justify imperialism and other modes of paternalism? Are there systematic factors that promote or impede rational decision-making? The seminar will provide a gentle introduction to the formal approaches of decision theory which we will apply to an unusual array of topics centered on the subsistence and reproductive decisions of hunter-gatherers, horticulturalists, pastoralists, and agrarian peasants, in short, people living in face-to-face, subsistence societies. In addition to doing reading from a broad array of social and natural science disciplines around the topic of rationality, students will regularly engage in exercises to assess their own approaches to decision-making.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "215600",
        "number": "ESS 86N",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "101",
        "title": "Environmental and Geological Field Studies in the Rocky Mountains (EARTHSYS 100)",
        "description": "Three-week, field-based program in the Greater Yellowstone/Teton and Wind River Mountains of Wyoming. Field-based exercises covering topics including: basics of structural geology and petrology; glacial geology; western cordillera geology; paleoclimatology; chemical weathering; aqueous geochemistry; and environmental issues such as acid mine drainage and changing land-use patterns.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "202014",
        "number": "ESS 101",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "102",
        "title": "Scientific Basis of Climate Change (ESS 202)",
        "description": "This course explores the scientific basis of anthropogenic climate change. We will read the original papers that established the scientific foundation for the climate change forecast. Starting with Fourier's description of the greenhouse effect, we trace the history of the key insights into how humanity is perturbing the climate system. The course is based on &quot;The Warming Papers&quot;, edited by David Archer and Raymond Pierrehumbert. Participants take turns presenting and leading a discussion of the papers and of Archer and Pierrehumbert's commentary.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30834",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Y2E2 101",
                        "instructors": [
                            {
                                "name": "Sheshadri, A.",
                                "sunet": "aditis2"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221585",
        "number": "ESS 102",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "103",
        "title": "Rethinking Meat: An Introduction to Alternative Proteins (EARTHSYS 109, EARTHSYS 209, ESS 203, ETHICSOC 107)",
        "description": "How do we feed a growing population in the face of climate change? Will Impossible Burgers become the new norm? Are you curious to learn about a frontier in bio- and chemical-engineering? Are you passionate about animal rights, human health, and sustainable agriculture? Learn about the environmental, ethical, and economic drivers behind the market for meat replacements. We'll take a deep dive into the science and technology used to develop emerging plant, fermentation and cell-based meat alternatives and explore the political challenges and behavioral adaptation needed to decrease meat consumption. Hear from entrepreneurs, researchers, and innovative startups developing sustainable and marketable alternative proteins through weekly guest lectures from industry leaders.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16229",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lobell, D.",
                                "sunet": "dlobell"
                            },
                            {
                                "name": "Press, E.",
                                "sunet": "epress"
                            },
                            {
                                "name": "Fajer, E.",
                                "sunet": "efajer"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223235",
        "number": "ESS 103",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "106",
        "title": "World Food Economy (EARTHSYS 106, EARTHSYS 206, ECON 106, ECON 206, ESS 206)",
        "description": "The World Food Economy is a survey course that covers the economic and political dimensions of food production, consumption, and trade. The course focuses on food markets and food policy within a global context. It is comprised of three major sections: structural features (agronomic, technological, and economic) that determine the nature of domestic food systems; the role of domestic food and agricultural policies in international markets; and the integrating forces of international research, trade, and food aid in the world food economy. This 5-unit course entails a substantial group modeling project that is required for all students. Enrollment is by application only. The application is found at https://economics.stanford.edu/undergraduate/forms. Deadline: March 15, 2022.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28177",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Naylor, R.",
                                "sunet": "roz"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "28176",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "113284",
        "number": "ESS 106",
        "units": [
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "107",
        "title": "Control of Nature (EARTHSYS 107)",
        "description": "Think controlling the earth's climate is science fiction?  It is when you watch Snowpiercer or Dune, but scientists are already devising geoengineering schemes to slow climate change.  Will we ever resurrect the woolly mammoth or even a T. Rex (think Jurassic Park)? Based on current research, that day will come in your lifetime. Who gets to decide what species to save? And more generally, what scientific and ethical principles should guide our decisions to control nature? In this course, we will examine the science behind ways that people alter and engineer the earth, critically examining the positive and negative consequences.  We'll explore these issues first through popular movies and books and then, more substantively, in scientific research.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31046",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jackson, R.",
                                "sunet": "robertj2"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:EC-EthicReas",
            "WAY-ER"
        ],
        "objectID": "216653",
        "number": "ESS 107",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "108",
        "title": "Research Preparation for Undergraduates",
        "description": "For undergraduates planning to conduct research during the summer with faculty through the MUIR and SUPER programs. Readings, oral presentations, proposal development. May be repeated for credit.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "219001",
        "number": "ESS 108",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "109",
        "title": "Biological and Social Networks (ESS 209)",
        "description": "This course introduces the analysis of social and biological networks with a focus on field data collected by interdisciplinary environmental and health scientists. Beginning from the premise that structure emerges from relationships between individual entities, we will concentrate in particular on the measurement of relationships, emphasizing especially practical methodology for mixed-method fieldwork suitable for interdisciplinary biosocial sciences (e.g., earth system science, epidemiology, demography, anthropology, conservation science). Topics include: social relationships in humans and other animals, ecological networks (e.g., trophic and mutualistic interactions), epidemiological networks, research design for collecting relational data,  naturalistic observation, ethnographic network methods, sampling, data quality, missing data, graphs and graph theory, structural measures (e.g., density, centrality and centralization, clustering and community detection, embeddedness), network evolution, network diffusion, emergence, egocentric networks, multi-mode/multi-layer networks, inference for sampled networks. All computation and visualization will be done in R so some familiarity is assumed.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221874",
        "number": "ESS 109",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "111",
        "title": "Biology and Global Change (BIO 117, EARTHSYS 111, EARTHSYS 217)",
        "description": "The biological causes and consequences of anthropogenic and natural changes in the atmosphere, oceans, and terrestrial and freshwater ecosystems. Topics: glacial cycles and marine circulation, greenhouse gases and climate change, tropical deforestation and species extinctions, and human population growth and resource use. Prerequisite: Biology or Human Biology core or BIO 81 or graduate standing.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16368",
                "currentClassSize": "0",
                "maxClassSize": "150",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Vitousek, P.",
                                "sunet": "vitousek"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci",
            "WAY-SMA"
        ],
        "objectID": "111890",
        "number": "ESS 111",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "112",
        "title": "Human Society and Environmental Change (EARTHSYS 112, EARTHSYS 212, HISTORY 103D)",
        "description": "Interdisciplinary approaches to understanding human-environment interactions with a focus on economics, policy, culture, history, and the role of the state. Prerequisite: ECON 1.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "15947",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "200-002",
                        "instructors": [
                            {
                                "name": "Calvo, M.",
                                "sunet": "mcalvob"
                            },
                            {
                                "name": "Fine, J.",
                                "sunet": "jhfine"
                            },
                            {
                                "name": "Frank, Z.",
                                "sunet": "zfrank"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "16048",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "160-328",
                        "instructors": [
                            {
                                "name": "Frank, Z.",
                                "sunet": "zfrank"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "31205",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "160-314",
                        "instructors": [
                            {
                                "name": "Frank, Z.",
                                "sunet": "zfrank"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "DIS",
                "notes": null,
                "classId": "31207",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "160-315",
                        "instructors": [
                            {
                                "name": "Frank, Z.",
                                "sunet": "zfrank"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "DIS",
                "notes": null,
                "classId": "31206",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Econ 139",
                        "instructors": [
                            {
                                "name": "Frank, Z.",
                                "sunet": "zfrank"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "DIS",
                "notes": null,
                "classId": "31208",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "200-013",
                        "instructors": [
                            {
                                "name": "Frank, Z.",
                                "sunet": "zfrank"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "210405",
        "number": "ESS 112",
        "units": [
            4
        ],
        "totalSections": 6
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "115",
        "title": "Approaching Nepal: Coupled Human-Natural Systems of the Solokhumbu (ESS 215)",
        "description": "This class designed to prepare students participating in the 2020 BOSP Nepal Seminar. Through readings, lectures, and class discussions, students will acquire a working knowledge of coupled human-natural system theory and examine case studies of CHNS analysis in the region. We will also provide content on the history of Nepal and the Sherpa people, Buddhist and Hindu thoughts on nature and resources, agricultural systems across Himalayan ecotones, and geology, glaciology, water, and energy issues relevant to the course itinerary. The class will meet weekly through the Spring quarter. We may switch the time to accommodate the schedules of all enrolled students. The class is mandatory for students participating in BOSP Nepal 2020.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222248",
        "number": "ESS 115",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "117",
        "title": "Earth Sciences of the Hawaiian Islands (EARTHSYS 117, SUSTAIN 117)",
        "description": "Progression from volcanic processes through rock weathering and soil-ecosystem development to landscape evolution.  The course starts with an investigation of volcanic processes, including the volcano structure, origin of magmas, physical-chemical factors of eruptions.  Factors controlling rock weathering and soil development, including depth and nutrient levels impacting plant ecosystems, are explored next.  Geomorphic processes of landscape evolution including erosion rates, tectonic/volcanic activity, and hillslope stability conclude the course.  Methods for monitoring and predicting eruptions, defining spatial changes in landform, landform stability, soil production rates, and measuring biogeochemical processes are covered throughout the course. This course is restricted to students accepted into the Earth Systems of Hawaii Program.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "211162",
        "number": "ESS 117",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "118Y",
        "title": "Shaping the Future of the Bay Area (CEE 118Y, CEE 218Y, EPS 118Y, EPS 218Y, ESS 218Y, GEOPHYS 118Y, GEOPHYS 218Y, POLISCI 118Y, PUBLPOL 118Y, PUBLPOL 218Y)",
        "description": "(Formerly GEOLSCI 118Y and 218Y) The complex urban problems affecting quality of life in the Bay Area, from housing affordability and transportation congestion to economic vitality and social justice, are already perceived by many to be intractable, and will likely be exacerbated by climate change and other emerging environmental and technological forces. Reforming urban systems to improve the equity, resilience and sustainability of communities will require new collaborative methods of assessment, goal setting, and problem solving across governments, markets, and communities. It will also require academic institutions to develop new models of co-production of knowledge across research, education, and practice. This XYZ course series is designed to immerse students in co-production for social change. The course sequence covers scientific research and ethical reasoning, skillsets in data-driven and qualitative analysis, and practical experience working with local partners on urban challenges that can empower students to drive responsible systems change in their future careers. The Autumn (X) and Winter (Y) courses are focused on basic and advanced skills, respectively, and completion is a prerequisite for participation in the Spring (Z) practicum quarter, which engages teams in real-world projects with Bay Area local governments or community groups. X and Y are composed of four weekly pedagogical components: (A) lectures; (B) writing prompts linked with small group discussion; (C) lab and self-guided tutorials on the R programming language; and (D) R data analysis assignments. Open to undergraduate and graduate students in any major. For more information, visit http://bay.stanford.edu/education. Cardinal Course certified by the Haas Center. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217232",
        "number": "ESS 118Y",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "118Z",
        "title": "Shaping the Future of the Bay Area (CEE 118Z, CEE 218Z, EPS 118Z, EPS 218Z, ESS 218Z, GEOPHYS 118Z, GEOPHYS 218Z, POLISCI 118Z, PUBLPOL 118Z, PUBLPOL 218Z)",
        "description": "(Formerly GEOLSCI 118Z and 218Z) Students are placed in small interdisciplinary teams (engineers and non-engineers, undergraduate and graduate level) to work on complex design, engineering, and policy problems presented by external partners in a real urban setting. Multiple projects are offered and may span both Winter and Spring quarters; students are welcome to participate in one or both quarters. Students are expected to interact professionally with government and community stakeholders, conduct independent team work outside of class sessions, and submit deliverables over a series of milestones. Prerequisite: the Autumn (X) skills course or approval of instructors. For information about the projects and application process, visit http://bay.stanford.edu. Cardinal Course certified by the Haas Center. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29541",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217231",
        "number": "ESS 118Z",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "122",
        "title": "Microbes and Climate (BIO 105, BIO 205, ESS 222)",
        "description": "Microorganisms drive the cycling of carbon, oxygen, and other nutrients in the earth system. This means that microbes both impact and are impacted by changes in climate. In this reading course, participants will read and present a combination of classic and current papers in the primary literature. Topics will include: the co-evolution of microbial metabolism and the climate system over geological timescales; impacts of current climate change on microbial physiology, community ecology, and ecosystem function; multiple stressors; feedbacks of microbial communities to anthropogenic greenhouse gas emissions; methods for connecting microbial activities to climate dynamics in process models.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224704",
        "number": "ESS 122",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "123",
        "title": "Biosphere-Atmosphere Interactions (EARTHSYS 123A, EARTHSYS 223, ESS 223)",
        "description": "How do ecosystems respond to climate change, and how can ecosystems affect climate? This course describes, quantitatively and qualitatively, the different feedback mechanisms between the land surface and climate at both local and global scales. We will also discuss how these processes can be measured across earth's diverse ecosystems, and how they are represented in earth system models used to study climate change (and models used to track the feasibility of natural climate solutions). Basic familiarity with programming is helpful.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30973",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Shriram 108",
                        "instructors": [
                            {
                                "name": "Konings, A.",
                                "sunet": "konings"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219451",
        "number": "ESS 123",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "125",
        "title": "Introduction to Planetary Science (EPS 124, GEOPHYS 124)",
        "description": "(Formerly GEOLSCI 124) This course provides an introduction to planetary science through the exploration of processes that formed and modified planetary bodies within the Solar System and beyond. Each lecture will be given by an expert in a specific subfield of planetary sciences, with topics ranging from planetary materials and formation, planetary dynamics, planetary structure and tectonics, planetary atmospheres, impact cratering, surface processes, and astrobiology. We will also discuss how scientists investigate planets both near and far through sample analysis, telescopic and orbital remote sensing as well as in situ through robotic instruments. Although there are no prerequisites for this course, it is primarily directed towards undergraduate students who are majoring (or plan to) in the sciences or engineering. A minimum level of mathematics equivalent to high school algebra and introductory calculus will be necessary. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16277",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tikoo, S.",
                                "sunet": "smtikoo"
                            },
                            {
                                "name": "Chaffee, T.",
                                "sunet": "thomc"
                            },
                            {
                                "name": "Schaefer, L.",
                                "sunet": "lkschaef"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "222470",
        "number": "ESS 125",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "132",
        "title": "Evolution of Earth Systems (EARTHSYS 132, EARTHSYS 232, EPS 132, EPS 232, ESS 232)",
        "description": "(Formerly GEOLSCI 132 and 232) This course examines biogeochemical cycles and how they developed through the interaction between the atmosphere, hydrosphere, biosphere, and lithosphere.  Emphasis is on the long-term carbon cycle and how it is connected to other biogeochemical cycles on Earth. The course consists of lectures, discussion of research papers, and quantitative modeling of biogeochemical cycles. Students produce a model on some aspect of the cycles discussed in this course. Grades based on class interaction, student presentations, and the modeling project. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "217608",
        "number": "ESS 132",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "135",
        "title": "Community Leadership",
        "description": "Offered through Residential Education to residents of Castano House, Manzanita Park. Topics include: emotional intelligence, leadership styles, listening, facilitating meetings, group dynamics and motivation, finding purpose, fostering resilience. Students will lead discussions on personal development, relationships, risky behaviors, race, ethnicity, spirituality, integrity.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "214690",
        "number": "ESS 135",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "141",
        "title": "Remote Sensing of the Oceans (EARTHSYS 141, EARTHSYS 241, ESS 241, GEOPHYS 141)",
        "description": "How to observe and interpret physical and biological changes in the oceans using satellite technologies. Topics: principles of satellite remote sensing, classes of satellite remote sensors, converting radiometric data into biological and physical quantities, sensor calibration and validation, interpreting large-scale oceanographic features.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30952",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Y2E2 105",
                        "instructors": [
                            {
                                "name": "Arrigo, K.",
                                "sunet": "arrigo"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci",
            "WAY-AQR"
        ],
        "objectID": "200162",
        "number": "ESS 141",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "143",
        "title": "Molecular Geomicrobiology Laboratory (BIO 142, EARTHSYS 143, ESS 243)",
        "description": "In this course, students will be studying the biosynthesis of cyclic lipid biomarkers, molecules that are produced by modern microbes that can be preserved in rocks that are over a billion years old and which geologist use as molecular fossils. Students will be tasked with identifying potential biomarker lipid synthesis genes in environmental genomic databases, expressing those genes in a model bacterial expression system in the lab, and then analyzing the lipid products that are produced. The overall goal is for students to experience the scientific research process including generating hypotheses, testing these hypotheses in laboratory experiments, and communicating their results through a publication style paper. Prerequisites: BIO83 and CHEM 121 or permission of the instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "219437",
        "number": "ESS 143",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "148",
        "title": "Introduction to Physical Oceanography (CEE 162D, CEE 262D, EARTHSYS 164)",
        "description": "An introduction to what causes the motions in the oceans. Topics include: the physical environment of the ocean; properties of sea water; atmosphere-ocean interactions; conservation of heat, salt, mass, and momentum, geostrophic flows, wind-driven circulation patterns; the Gulf Stream; equatorial dynamics and El Nino; and tides. By the end of the course, students will have physical intuition for why ocean currents look the way they do and a basic mathematical framework for quantifying the motions. Prerequisite: PHYSICS 41",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "GER: DB-NatSci"
        ],
        "objectID": "129098",
        "number": "ESS 148",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "151",
        "title": "Biological Oceanography (EARTHSYS 151, EARTHSYS 251, ESS 251)",
        "description": "Required for Earth Systems students in the oceans track.  Interdisciplinary look at how oceanic environments control the form and function of marine life.  Topics include distributions of planktonic production and abundance, nutrient cycling, the role of ocean biology in the climate system, expected effects of climate changes on ocean biology.  Local weekend field trips.  Designed to be taken concurrently with Marine Chemistry (ESS/EARTHSYS 152/252). **Time slot on Fridays is for mandatory group activities jointly between the ESS 151/251 and ESS 152/252 courses. Even if students are registered for either ESS 152/252 or ESS 152/252, all students from both courses need to be present full-time on Friday.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30972",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Y2E2 105",
                        "instructors": [
                            {
                                "name": "Arrigo, K.",
                                "sunet": "arrigo"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Friday"
                    },
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Y2E2 105",
                        "instructors": [
                            {
                                "name": "Arrigo, K.",
                                "sunet": "arrigo"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "213659",
        "number": "ESS 151",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "152",
        "title": "Marine Chemistry (EARTHSYS 152, EARTHSYS 252, ESS 252, OCEANS 152, OCEANS 252)",
        "description": "Introduction to the interdisciplinary knowledge and skills required to critically evaluate problems in marine chemistry and related disciplines.  Physical, chemical, and biological processes that determine the chemical composition of seawater.  Air-sea gas exchange, carbonate chemistry, and chemical equilibria, nutrient and trace element cycling, particle reactivity, sediment chemistry, and diagenesis.  Examination of chemical tracers of mixing and circulation and feedbacks of ocean processes on atmospheric chemistry and climate.  Designed to be taken concurrently with Biological Oceanography (ESS/EARTHSYS 151/251)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30913",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "30915",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "213658",
        "number": "ESS 152",
        "units": [
            3,
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "155",
        "title": "Science of Soils (EARTHSYS 155)",
        "description": "Physical, chemical, and biological processes within soil systems. Emphasis is on factors governing nutrient availability, plant growth and production, land-resource management, and pollution within soils. How to classify soils and assess nutrient cycling and contaminant fate. Recommended: introductory chemistry and biology.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31045",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fendorf, S.",
                                "sunet": "fendorf"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci",
            "WAY-SMA"
        ],
        "objectID": "129504",
        "number": "ESS 155",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "158",
        "title": "Geomicrobiology (BIO 190, EARTHSYS 158, EARTHSYS 258, ESS 258)",
        "description": "How microorganisms shape the geochemistry of the Earth's crust including oceans, lakes, estuaries, subsurface environments, sediments, soils, mineral deposits, and rocks. Topics include mineral formation and dissolution; biogeochemical cycling of elements (carbon, nitrogen, sulfur, and metals); geochemical and mineralogical controls on microbial activity, diversity, and evolution; life in extreme environments; and the application of new techniques to geomicrobial systems. Recommended: introductory chemistry and microbiology such as CEE 274A.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "204339",
        "number": "ESS 158",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "162",
        "title": "Remote Sensing of Land (EARTHSYS 142, EARTHSYS 242, ESS 262)",
        "description": "The use of satellite remote sensing to monitor land use and land cover, with emphasis on terrestrial changes. Topics include pre-processing data, biophysical properties of vegetation observable by satellite, accuracy assessment of maps derived from remote sensing, and methodologies to detect changes such as urbanization, deforestation, vegetation health, and wildfires.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16317",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Moanga, D.",
                                "sunet": "dianamng"
                            },
                            {
                                "name": "White, E.",
                                "sunet": "eewhite"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR"
        ],
        "objectID": "129516",
        "number": "ESS 162",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "164",
        "title": "Fundamentals of Geographic Information Science (GIS) (EARTHSYS 144)",
        "description": "&quot;Maps tell stories, allow people to see what is, and understand what can be. Throughout history humans have used maps to share what they know, make sense of the world, and navigate the challenges ahead&quot; (ESRI UC, 2022). Our world is a complex and highly interdependent system rapidly changing and evolving, impacted by climate change and anthropogenic activity. The accelerated growth of geospatial data science has integrated many innovations, expanded capabilities, and created new insights which can address the numerous challenges of the twenty-first century. Geographic Information Systems (GIS) provides a powerful platform for imagining and creating solutions, while expanding our ability to identify patterns and relationships to better understand the world around us. This introductory course will explore the principles and practical applications of geospatial data science. Students will learn how to adopt a geographic approach, and gain expertise in spatial analysis and statistics, remote sensing, and cartographic visualization. They will learn to identify, acquire, and modify datasets, which will enable them to design and develop models to solve spatial problems. Course topics will cover local, regional, and even global scale applications of GIS in natural resource management, conservation, urban planning, land systems science, climate change, and environmental monitoring. The course structure consists of weekly lectures, guest speakers, computer lab assignments, midterm and final examinations as well as an individual final project requirement.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "All students are required to attend a weekly lab.All held in Mitchell A-65. Enroll in lab section prior to the start of class.",
                "classId": "15948",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Mitchell Earth Sciences B67",
                        "instructors": [
                            {
                                "name": "Moanga, D.",
                                "sunet": "dianamng"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "31915",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Moanga, D.",
                                "sunet": "dianamng"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "LBS",
                "notes": null,
                "classId": "31916",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Moanga, D.",
                                "sunet": "dianamng"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci",
            "WAY-AQR"
        ],
        "objectID": "129515",
        "number": "ESS 164",
        "units": [
            3,
            4
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "165",
        "title": "Advanced Geographic Information Systems (ESS 265)",
        "description": "Building on the Fundamentals of Geographic Information Systems course, this class delves deeper into geospatial analysis and mapping techniques.  The class is heavily project-based and students are encouraged to bring their own research questions.  Topics include topographic analysis, interpolation, spatial statistics, network analysis, and scripting using Python and Acrpy.  All students are required to attend a weekly lab.  ESS 164 or equivalent is a prerequisite.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "217826",
        "number": "ESS 165",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "170",
        "title": "Analyzing land use in a globalized world (ESS 270)",
        "description": "This course examines the dynamics of land use in relation to globalization. The objective is to understand how the expansion of global trade, and public and private regulations affect land use changes. The course will enable students to better understand how to effectively influence land use change, from different vantage points (government, NGO, corporate actor). The main emphasis is on tropical regions. Lectures introduce theories, practical cases, and evaluation tools to better understand contemporary land use dynamics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "216007",
        "number": "ESS 170",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "171",
        "title": "Climate Models and Data (ESS 271)",
        "description": "Overview of key concepts necessary to develop familiarity with climate modeling and data. Topics covered will include components of the climate system, climate change and global warming, and model mechanics, their evaluation and usability, and predictability. Assessments will involve the use of datasets and model output, so some knowledge of programming is a pre-requisite.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222930",
        "number": "ESS 171",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "181",
        "title": "Urban Agroecology (EARTHSYS 181, EARTHSYS 281, ESS 281, URBANST 181)",
        "description": "Urban agriculture takes many forms in cities around the world and provides significant amounts of food and other resources and benefits for urban communities. This Earth Systems practicum explores the application of agroecological principles to the design and stewardship of urban farms and gardens. Students will explore social and ecological dimensions of urban agriculture including issues of environmental justice while gaining land stewardship and small-scale food production skills at the Stanford Educational Farm and in the community.Course full for spring 2022, will be offered again Winter 2023.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "207917",
        "number": "ESS 181",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "185",
        "title": "Adaptation (EARTHSYS 183)",
        "description": "Adaptation is the process by which organisms or societies become better suited to their environments. In this class, we will explore three distinct but related notions of adaptation. Biological adaptations arise through natural selection, while cultural adaptations arise from a variety of processes, some of which closely resemble natural selection. A newer notion of adaptation has emerged in the context of climate change where adaptation takes on a highly instrumental, and often planned, quality as a response to the negative impacts of environmental change. We will discuss each of these ideas, using their commonalities and subtle differences to develop a broader understanding of the dynamic interplay between people and their environments. Topics covered will include, among others: evolution, natural selection, levels of selection, formal models of cultural evolution, replicator dynamics, resilience, rationality and its limits, complexity, adaptive management.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30970",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jones, J.",
                                "sunet": "jhj1"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "219711",
        "number": "ESS 185",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "202",
        "title": "Scientific Basis of Climate Change (ESS 102)",
        "description": "This course explores the scientific basis of anthropogenic climate change. We will read the original papers that established the scientific foundation for the climate change forecast. Starting with Fourier's description of the greenhouse effect, we trace the history of the key insights into how humanity is perturbing the climate system. The course is based on &quot;The Warming Papers&quot;, edited by David Archer and Raymond Pierrehumbert. Participants take turns presenting and leading a discussion of the papers and of Archer and Pierrehumbert's commentary.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221585",
        "number": "ESS 202",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "203",
        "title": "Rethinking Meat: An Introduction to Alternative Proteins (EARTHSYS 109, EARTHSYS 209, ESS 103, ETHICSOC 107)",
        "description": "How do we feed a growing population in the face of climate change? Will Impossible Burgers become the new norm? Are you curious to learn about a frontier in bio- and chemical-engineering? Are you passionate about animal rights, human health, and sustainable agriculture? Learn about the environmental, ethical, and economic drivers behind the market for meat replacements. We'll take a deep dive into the science and technology used to develop emerging plant, fermentation and cell-based meat alternatives and explore the political challenges and behavioral adaptation needed to decrease meat consumption. Hear from entrepreneurs, researchers, and innovative startups developing sustainable and marketable alternative proteins through weekly guest lectures from industry leaders.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16304",
                "currentClassSize": "0",
                "maxClassSize": "200",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lobell, D.",
                                "sunet": "dlobell"
                            },
                            {
                                "name": "Press, E.",
                                "sunet": "epress"
                            },
                            {
                                "name": "Fajer, E.",
                                "sunet": "efajer"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223235",
        "number": "ESS 203",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "204",
        "title": "Effective Scientific Presentation and Public Speaking (EPS 306, GEOPHYS 205)",
        "description": "(Formerly GEOLSCI 306) The ability to present your research in a compelling, concise, and engaging manner will enhance your professional career. I will work to convince you that the best way to capture an audience and leave a lasting impression is to tell a story, do a demo, or pick a fight. The goal of a talk is not to show people how much work you did, how capable and dedicated you are, or how much you know. Instead, we want to learn something new and important, something that changes our perspective and influences our research. We want to be inspired, shocked, or moved. In the opening minutes of a talk, you must plant your flag and make your case. You are forecasting the arc of your story, rather than introducing your topic. If, for example, your very first words are, &quot;I will argue,&quot; you're on a good path. In these crucial opening minutes, you've either hooked them or lost them. The course is taught as a series of stand-and-deliver exercises with feedback from other students and revisiona on the fly. You'll do exercises on talk openers and closers, physical demos, conference talks, job interviews, press interviews, and funding pitches. We also tackle scientific graphics, focusing on builder slides and posters. Special guests will enrich the course, including a graphic designer, Adobe Illustrator mavens, headhunters, entrepreneurs, and TV reporters. This is a 'flipped' class, so there are no lectures. Instead, students receive Class Notes before each week's classes, and a Postscript Letter afterwards. Grades are completely optional: 70% in-class exercises, 30% final presentation, such as your upcoming conference presentations. My pledge is that everyone will come away a more skilled and confident speaker than they were before. Anonymous 2022 Course Evaluation Comments: &quot;Truly the best course that I have taken in my life. There is simply an incredible amount of wisdom to be gained from this course. To no exaggeration, your life will be changed, and you will forever see presentations differently after this experience of a lifetime. It's also accessible to undergrads as long as you have a research project.&quot; &quot;By far, the best class I've taken at Stanford. Will change your entire perspective on presenting research.&quot; &quot;This is by far the best and most helpful course I have taken in all 5 years at Stanford. This course is really a must for anyone and has given me a huge confidence boost for public speaking in all scenarios. Ross is a fantastic instructor and makes the class a welcoming and collaborative environment.&quot; &quot;Ross is an engaging teacher with years of experience doing public speaking in academic, government, and business settings. This class is well worth the time that it takes to prepare the short talk exercises. Highly recommend this class for anyone looking to improve their speaking skills.&quot; Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31564",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Thornton 208",
                        "instructors": [
                            {
                                "name": "Stein, R.",
                                "sunet": "rstein3"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215676",
        "number": "ESS 204",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "205",
        "title": "Fundamentals of Geobiology (EARTHSYS 205A, EPS 205)",
        "description": "(Former GEOLSCI 205) Lecture and discussion covering key topics in the history of life on Earth, as well as basic principles that apply to life in the universe. Co-evolution of Earth and life; critical intervals of environmental and biological change; geomicrobiology; paleobiology; global biogeochemical cycles; scaling of geobiological processes in space and time. Change of Department Name: Earth &amp; Planetary Sciences (Formerly Geological Science)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28952",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Littlefield 103",
                        "instructors": [
                            {
                                "name": "Sperling, E.",
                                "sunet": "esper"
                            },
                            {
                                "name": "Dekas, A.",
                                "sunet": "dekas"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219553",
        "number": "ESS 205",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "206",
        "title": "World Food Economy (EARTHSYS 106, EARTHSYS 206, ECON 106, ECON 206, ESS 106)",
        "description": "The World Food Economy is a survey course that covers the economic and political dimensions of food production, consumption, and trade. The course focuses on food markets and food policy within a global context. It is comprised of three major sections: structural features (agronomic, technological, and economic) that determine the nature of domestic food systems; the role of domestic food and agricultural policies in international markets; and the integrating forces of international research, trade, and food aid in the world food economy. This 5-unit course entails a substantial group modeling project that is required for all students. Enrollment is by application only. The application is found at https://economics.stanford.edu/undergraduate/forms. Deadline: March 15, 2022.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28181",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "DIS",
                "notes": null,
                "classId": "28180",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "113284",
        "number": "ESS 206",
        "units": [
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "208",
        "title": "Topics in Geobiology (EPS 208)",
        "description": "(Formerly GEOLSCI 208) Reading course addressing current topics in geobiology. Topics will vary from year to year, but will generally cover areas of current debate in the primary literature, such as the origin of life, the origin and consequences of oxygenic photosynthesis, environmental controls on and consequences of metabolic innovations in microbes, the early evolution of animals and plants, and the causes and consequences of major extinction events. Participants will be expected to read and present on current papers in the primary literature. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "212708",
        "number": "ESS 208",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "209",
        "title": "Biological and Social Networks (ESS 109)",
        "description": "This course introduces the analysis of social and biological networks with a focus on field data collected by interdisciplinary environmental and health scientists. Beginning from the premise that structure emerges from relationships between individual entities, we will concentrate in particular on the measurement of relationships, emphasizing especially practical methodology for mixed-method fieldwork suitable for interdisciplinary biosocial sciences (e.g., earth system science, epidemiology, demography, anthropology, conservation science). Topics include: social relationships in humans and other animals, ecological networks (e.g., trophic and mutualistic interactions), epidemiological networks, research design for collecting relational data,  naturalistic observation, ethnographic network methods, sampling, data quality, missing data, graphs and graph theory, structural measures (e.g., density, centrality and centralization, clustering and community detection, embeddedness), network evolution, network diffusion, emergence, egocentric networks, multi-mode/multi-layer networks, inference for sampled networks. All computation and visualization will be done in R so some familiarity is assumed.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221874",
        "number": "ESS 209",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "210",
        "title": "Techniques in Environmental Microbiology (BIO 201)",
        "description": "Fundamentals and application of laboratory techniques to study the diversity and activity of microorganisms in environmental samples, including soil, sediment, and water. Emphasis is on culture-independent approaches, including epifluorescence microscopy, extraction and analysis of major biomolecules (DNA, RNA, protein, lipids), stable isotope probing, and metabolic rate measurements. Format will include lectures, laboratory exercises, and discussions. Students will learn how to collect, analyze, and understand common and cutting-edge datasets in environmental microbiology. Permission from instructor is required to enroll as C/NC or for 1-3 units.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "218692",
        "number": "ESS 210",
        "units": [
            1,
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "211",
        "title": "Fundamentals of Modeling (EARTHSYS 211)",
        "description": "Simulation models are a powerful tool for environmental research, if used properly. The major concepts and techniques for building and evaluating models. Topics include model calibration, model selection, uncertainty and sensitivity analysis, and Monte Carlo and bootstrap methods. Emphasis is on gaining hands-on experience using the R programming language. Prerequisite: Basic knowledge of statistics.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "210449",
        "number": "ESS 211",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "212",
        "title": "Measurements in Earth Systems (EARTHSYS 124)",
        "description": "A classroom, laboratory, and field class designed to provide students familiarity with techniques and instrumentation used to track biological, chemical, and physical processes operating in earth systems, encompassing upland, aquatic, estuarine, and marine environments. Topics include gas and water flux measurement, nutrient and isotopic analysis, soil and water chemistry determination. Students will develop and test hypotheses, provide scientific evidence and analysis, culminating in a final presentation.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "212810",
        "number": "ESS 212",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "213",
        "title": "Global Change and Emerging Infectious Disease (EARTHSYS 114, EARTHSYS 214, HUMBIO 114)",
        "description": "The changing epidemiological environment. How human-induced environmental changes, such as global warming, deforestation and land-use conversion, urbanization, international commerce, and human migration, are altering the ecology of infectious disease transmission, and promoting their re-emergence as a global public health threat. Case studies of malaria, cholera, hantavirus, plague, and HIV.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16146",
                "currentClassSize": "0",
                "maxClassSize": "137",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jones, J.",
                                "sunet": "jhj1"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "204551",
        "number": "ESS 213",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "215",
        "title": "Approaching Nepal: Coupled Human-Natural Systems of the Solokhumbu (ESS 115)",
        "description": "This class designed to prepare students participating in the 2020 BOSP Nepal Seminar. Through readings, lectures, and class discussions, students will acquire a working knowledge of coupled human-natural system theory and examine case studies of CHNS analysis in the region. We will also provide content on the history of Nepal and the Sherpa people, Buddhist and Hindu thoughts on nature and resources, agricultural systems across Himalayan ecotones, and geology, glaciology, water, and energy issues relevant to the course itinerary. The class will meet weekly through the Spring quarter. We may switch the time to accommodate the schedules of all enrolled students. The class is mandatory for students participating in BOSP Nepal 2020.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222248",
        "number": "ESS 215",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "218Y",
        "title": "Shaping the Future of the Bay Area (CEE 118Y, CEE 218Y, EPS 118Y, EPS 218Y, ESS 118Y, GEOPHYS 118Y, GEOPHYS 218Y, POLISCI 118Y, PUBLPOL 118Y, PUBLPOL 218Y)",
        "description": "(Formerly GEOLSCI 118Y and 218Y) The complex urban problems affecting quality of life in the Bay Area, from housing affordability and transportation congestion to economic vitality and social justice, are already perceived by many to be intractable, and will likely be exacerbated by climate change and other emerging environmental and technological forces. Reforming urban systems to improve the equity, resilience and sustainability of communities will require new collaborative methods of assessment, goal setting, and problem solving across governments, markets, and communities. It will also require academic institutions to develop new models of co-production of knowledge across research, education, and practice. This XYZ course series is designed to immerse students in co-production for social change. The course sequence covers scientific research and ethical reasoning, skillsets in data-driven and qualitative analysis, and practical experience working with local partners on urban challenges that can empower students to drive responsible systems change in their future careers. The Autumn (X) and Winter (Y) courses are focused on basic and advanced skills, respectively, and completion is a prerequisite for participation in the Spring (Z) practicum quarter, which engages teams in real-world projects with Bay Area local governments or community groups. X and Y are composed of four weekly pedagogical components: (A) lectures; (B) writing prompts linked with small group discussion; (C) lab and self-guided tutorials on the R programming language; and (D) R data analysis assignments. Open to undergraduate and graduate students in any major. For more information, visit http://bay.stanford.edu/education. Cardinal Course certified by the Haas Center. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217232",
        "number": "ESS 218Y",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "218Z",
        "title": "Shaping the Future of the Bay Area (CEE 118Z, CEE 218Z, EPS 118Z, EPS 218Z, ESS 118Z, GEOPHYS 118Z, GEOPHYS 218Z, POLISCI 118Z, PUBLPOL 118Z, PUBLPOL 218Z)",
        "description": "(Formerly GEOLSCI 118Z and 218Z) Students are placed in small interdisciplinary teams (engineers and non-engineers, undergraduate and graduate level) to work on complex design, engineering, and policy problems presented by external partners in a real urban setting. Multiple projects are offered and may span both Winter and Spring quarters; students are welcome to participate in one or both quarters. Students are expected to interact professionally with government and community stakeholders, conduct independent team work outside of class sessions, and submit deliverables over a series of milestones. Prerequisite: the Autumn (X) skills course or approval of instructors. For information about the projects and application process, visit http://bay.stanford.edu. Cardinal Course certified by the Haas Center. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29542",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217231",
        "number": "ESS 218Z",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "220",
        "title": "Physical Hydrogeology (CEE 260A)",
        "description": "(Formerly GES 230.) Theory of underground water occurrence and flow, analysis of field data and aquifer tests, geologic groundwater environments, solution of field problems,  and groundwater modeling. Introduction to groundwater contaminant transport and unsaturated flow. Lab. Prerequisite: elementary calculus.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28934",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Gates B12",
                        "instructors": [
                            {
                                "name": "Gorelick, S.",
                                "sunet": "gorelick"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "129537",
        "number": "ESS 220",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "221",
        "title": "Contaminant Hydrogeology and Reactive Transport (CEE 260C)",
        "description": "Decades of industrial activity have released vast quantities of contaminants to groundwater, threatening water resources, ecosystems and human health. What processes control the fate and transport of contaminants in the subsurface? What remediation strategies are effective and what are the tradeoffs among them? How are these processes represented in models used for regulatory and decision-making purposes? This course will address these and related issues by focusing on the conceptual and quantitative treatment of advective-dispersive transport with reacting solutes, including modern methods of contaminant transport simulation. Some Matlab programming / program modification required. Prerequisite: Physical Hydrogeology ESS 220 / CEE 260A (Gorelick) or equivalent and college-level course work in chemistry.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30954",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "320-227",
                        "instructors": [
                            {
                                "name": "Gorelick, S.",
                                "sunet": "gorelick"
                            },
                            {
                                "name": "Maher, K.",
                                "sunet": "kmaher"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "129538",
        "number": "ESS 221",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "222",
        "title": "Microbes and Climate (BIO 105, BIO 205, ESS 122)",
        "description": "Microorganisms drive the cycling of carbon, oxygen, and other nutrients in the earth system. This means that microbes both impact and are impacted by changes in climate. In this reading course, participants will read and present a combination of classic and current papers in the primary literature. Topics will include: the co-evolution of microbial metabolism and the climate system over geological timescales; impacts of current climate change on microbial physiology, community ecology, and ecosystem function; multiple stressors; feedbacks of microbial communities to anthropogenic greenhouse gas emissions; methods for connecting microbial activities to climate dynamics in process models.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32459",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Shriram 368",
                        "instructors": [
                            {
                                "name": "Dekas, A.",
                                "sunet": "dekas"
                            },
                            {
                                "name": "Litchman, E.",
                                "sunet": "litchman"
                            },
                            {
                                "name": "Zakem, E.",
                                "sunet": "ezakem"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224704",
        "number": "ESS 222",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "223",
        "title": "Biosphere-Atmosphere Interactions (EARTHSYS 123A, EARTHSYS 223, ESS 123)",
        "description": "How do ecosystems respond to climate change, and how can ecosystems affect climate? This course describes, quantitatively and qualitatively, the different feedback mechanisms between the land surface and climate at both local and global scales. We will also discuss how these processes can be measured across earth's diverse ecosystems, and how they are represented in earth system models used to study climate change (and models used to track the feasibility of natural climate solutions). Basic familiarity with programming is helpful.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30974",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Shriram 108",
                        "instructors": [
                            {
                                "name": "Konings, A.",
                                "sunet": "konings"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219451",
        "number": "ESS 223",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "224",
        "title": "Remote Sensing of Hydrology (CEE 260D)",
        "description": "This class discusses the methods available for remote sensing of the components of the terrestrial hydrologic cycle and how to use them. Topics include the hydrologic cycle, relevant sensor types and the electromagnetic spectrum, active/passive microwave remote sensing (snow, soil moisture, canopy water content, rainfall), thermal sensing of evapotranspiration, gravity and hyperspectral methods, as well as an introduction to data assimilation and calibration/validation approaches for hydrologic variables. Pre-requisite: programming experience. Please complete problem set 0 to ensure pre-requisite programming knowledge is sufficient for success in the course",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30972",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Konings, A.",
                                "sunet": "konings"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219436",
        "number": "ESS 224",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "225",
        "title": "Rivers: The Arteries of Earth's Continents (EPS 224, GEOPHYS 221)",
        "description": "(Formerly GEOLSCI 224) Rivers are the arteries of Earth's continents, conveying water, sediments, and solutes from the headwaters to the oceans. They provide a haven for life and have been at the heart of the world's economy by generating fertile floodplains, human habitats, as well as by facilitating international commerce. This course offers a quantitative examination of rivers, from headwaters to deltas. We will first develop a basic mechanistic understanding of fluvial processes, including flow hydraulics, erosion, sediment transport, and deposition. We will then apply our acquired knowledge through thematic discussions of relevant issues. Possible themes include deltas and climate change, rivers and human activity (damming, sand mining, deforestation), rivers and the evolution of land plants, rivers and biogeochemical cycles, submarine channels, and the alien rivers of Mars and Titan. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222222",
        "number": "ESS 225",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "226",
        "title": "Wastelanding: Indigenous Environmental Justice in the Western US",
        "description": "A connection to land is often central to Native identity and spirituality. The degradation and exploitation of Native lands, then, not only causes physical harm to Native communities, but spiritual harm as well. Through a series of invited speakers, this seminar series explores Indigenous Environmental Justice (IEJ) as distinct from the broader environmental justice movement. Students will learn about IEJ from speakers covering topics such as uranium mining on Navajo and Hopi lands, the Dakota Access Pipeline dispute, and the Yurok Tribe Climate Change Prioritization Project. We will then turn to the importance of self-determination and sovereignty in the IEJ movement, along with the failures of federal and state systems of law and governance. The series will conclude with discussions of how academic researchers can best engage with Native communities, partner with Indigenous scholars and incorporate traditional knowledge into research.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "223983",
        "number": "ESS 226",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "227",
        "title": "Decision Science for Environmental Threats (EARTHSYS 227)",
        "description": "Decision science is the study of how people make decisions. It aims to describe these processes in ways that will help people make better or more well-informed decisions. It is an interdisciplinary field that draws upon psychology, economics, political science, and management, among other disciplines. It is being used in a number of domain areas and for a variety of applications, including managing freshwater resources, designing decision support tools to aid in coastal adaptation to sea-level rise, and creating &quot;nudges&quot; to enhance energy efficiency behaviors. This course covers behavioral theories of probabilistic inference, intuitive prediction, preference, and decision making. Topics include heuristics and biases, risk perceptions and attitudes, strategies for combining different sources of information and dealing with conflicting objectives, and the roles of group and emotional processes in decision making. This course will introduce students to foundational theories of decision science, and will involve applying these theories to understand decisions about environmental threats.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28935",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Y2E2 101",
                        "instructors": [
                            {
                                "name": "Wong-Parodi, G.",
                                "sunet": "gwongpar"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221611",
        "number": "ESS 227",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "228",
        "title": "Advanced survey of current research in climate dynamics",
        "description": "This is a guided reading course that will explore current papers in climate dynamics and climate change, with an emphasis on the large-scale atmospheric and oceanic circulations. Topics include energy balance models, changes in the jet streams and attendant storm tracks, variability in ocean circulations like the Gulf Stream, the polar amplification of warming trends, and how storms like hurricanes and supercell thunderstorms may change under global warming. The structure of the course will include reading one influential peer-reviewed paper each week, accompanied by instruction and problem sets to familiarize students with the fundamental concepts discussed in the papers. Prerequisite: either Earthsys 146A/ESS 246A or Earthsys 146B/ESS 246B or equivalent, or permission of instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223989",
        "number": "ESS 228",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "230",
        "title": "Pursuing Sustainability: Managing Complex Social Environmental Systems (SUST 210)",
        "description": "This course considers and utilizes systems frameworks and models for thinking about and pursuing sustainability (defined by the goal of inclusive intra- and intergenerational well-being) in complex, adaptive, intertwined social-environmental systems. It argues that meeting the goal of sustainability requires drawing on assets (or resources) from five major groups ? human, social, manufactured, natural and knowledge capital assets ? while at the same time building and sustaining them over time. The course illustrates, using lectures, readings, and case study analyses, why analyzing and managing those assets within complex and dynamic integrated systems is challenging, and discusses the characteristics of complex systems that make achieving sustainability goals so challenging. It provides an overview of how to intervene in complex systems to pursue sustainability, including visioning, collaboration, and change theories; governing for sustainability; and strategies, tools, and metrics that assist with the pursuit of sustainability goals. The course draws on readings from one core text (Matson et al. 2016) as well as from a variety of other published literature and case studies. Priority given to SUST students. Enrollment open to seniors and graduate students only. Please contact Bhe Balde (ebalde@stanford.edu) for permission code.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "16069",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Ceras 300",
                        "instructors": [
                            {
                                "name": "Sotnik, G.",
                                "sunet": "gsotnik"
                            },
                            {
                                "name": "Matson, P.",
                                "sunet": "pmatson"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219481",
        "number": "ESS 230",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "232",
        "title": "Evolution of Earth Systems (EARTHSYS 132, EARTHSYS 232, EPS 132, EPS 232, ESS 132)",
        "description": "(Formerly GEOLSCI 132 and 232) This course examines biogeochemical cycles and how they developed through the interaction between the atmosphere, hydrosphere, biosphere, and lithosphere.  Emphasis is on the long-term carbon cycle and how it is connected to other biogeochemical cycles on Earth. The course consists of lectures, discussion of research papers, and quantitative modeling of biogeochemical cycles. Students produce a model on some aspect of the cycles discussed in this course. Grades based on class interaction, student presentations, and the modeling project. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "217608",
        "number": "ESS 232",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "233",
        "title": "Mitigating Climate Change through Soil Management (EARTHSYS 233)",
        "description": "Climate change is one of the greatest crises facing our world. Increasing soil organic carbon storage may be a key strategy for mitigating global climate change, with the potential to offset approximately 20% of annual global fossil fuel emissions. In this course, we will learn about soil carbon cycling, its contribution to the global carbon cycle, how carbon is stored in soil, and land management practices that can increase or decrease soil carbon stocks, thereby mitigating or exacerbating climate change. Although the content is centered on soil carbon, the processes and skills learned in this course can be applied to design solutions to any environmental problem.Prerequisites: Some knowledge of soils, introductory chemistry, and introductory biology would be useful but not necessary. Please email the instructor if you have any concerns or questions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30976",
                "currentClassSize": "0",
                "maxClassSize": "32",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyt, A.",
                                "sunet": "ahoyt"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222672",
        "number": "ESS 233",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "239",
        "title": "Data Science for Geoscience (EARTHSYS 140, EARTHSYS 240, ENERGY 240, EPS 140, EPS 240)",
        "description": "(Formerly GEOLSCI 140 and 240) Overview of some of the most important data science methods (statistics, machine learning &amp; computer vision) relevant for geological sciences, as well as other fields in the Earth Sciences. Areas covered are: extreme value statistics for predicting rare events; compositional data analysis for geochemistry; multivariate analysis for designing data &amp; computer experiments; probabilistic aggregation of evidence for spatial mapping; functional data analysis for multivariate environmental datasets, spatial regression and modeling spatial uncertainty with covariate information (geostatistics). Identification &amp; learning of geo-objects with computer vision. Focus on practicality rather than theory. Matlab exercises on realistic data problems. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "129723",
        "number": "ESS 239",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "240",
        "title": "Advanced Oceanography",
        "description": "For upper-division undergraduates and graduate students in the natural sciences and engineering. Topical issues in marine science/oceanography. Topics vary each year following or anticipating research trends in ocean research and issues. For 2018, the focus is on the Arctic Ocean, including Arctic Oceanography, Ecosystems, Resource Utilization and Geopolitics, and Environmental Change.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "129522",
        "number": "ESS 240",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "241",
        "title": "Remote Sensing of the Oceans (EARTHSYS 141, EARTHSYS 241, ESS 141, GEOPHYS 141)",
        "description": "How to observe and interpret physical and biological changes in the oceans using satellite technologies. Topics: principles of satellite remote sensing, classes of satellite remote sensors, converting radiometric data into biological and physical quantities, sensor calibration and validation, interpreting large-scale oceanographic features.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30953",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Y2E2 105",
                        "instructors": [
                            {
                                "name": "Arrigo, K.",
                                "sunet": "arrigo"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER: DB-NatSci",
            "WAY-AQR"
        ],
        "objectID": "200162",
        "number": "ESS 241",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "242",
        "title": "Antarctic Marine Geology and Geophysics (EARTHSYS 272)",
        "description": "For upper-division undergraduates and graduate students. Intermediate and advanced topics in marine geology and geophysics, focusing on examples from the Antarctic continental margin and adjacent Southern Ocean. Topics: glaciers, icebergs, and sea ice as geologic agents (glacial and glacial marine sedimentology, Southern Ocean current systems and deep ocean sedimentation), Antarctic biostratigraphy and chronostratigraphy (continental margin evolution). Students interpret seismic lines and sediment core/well log data. Examples from a recent scientific drilling expedition to Prydz Bay, Antarctica.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "129523",
        "number": "ESS 242",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "243",
        "title": "Molecular Geomicrobiology Laboratory (BIO 142, EARTHSYS 143, ESS 143)",
        "description": "In this course, students will be studying the biosynthesis of cyclic lipid biomarkers, molecules that are produced by modern microbes that can be preserved in rocks that are over a billion years old and which geologist use as molecular fossils. Students will be tasked with identifying potential biomarker lipid synthesis genes in environmental genomic databases, expressing those genes in a model bacterial expression system in the lab, and then analyzing the lipid products that are produced. The overall goal is for students to experience the scientific research process including generating hypotheses, testing these hypotheses in laboratory experiments, and communicating their results through a publication style paper. Prerequisites: BIO83 and CHEM 121 or permission of the instructor.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "219437",
        "number": "ESS 243",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "244",
        "title": "Marine Ecosystem Modeling",
        "description": "This course will provide the practical background necessary to construct and implement a 2-dimensional (space and time) numerical model of a simple marine ecosystem.  Instruction on computer programming, model design and parameterization, and model evaluation will be provided.  Throughout the 10-week course, each student will develop and refine their own multi-component marine ecosystem model.  Instructor consent required.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "200933",
        "number": "ESS 244",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "245",
        "title": "Advanced Biological Oceanography",
        "description": "For upper-division undergraduates and graduate students. For upper-division undergraduate and graduate students interested in an in-depth look at biological processes in the world's oceans. Themes will vary from year to year but will include such topics as marine bio-optics, marine ecological modeling, phytoplankton primary production, and others.  Hands-on laboratory and computer activities will be an integral part of the course, as will field trips into local waters. May be repeated for credit. Enrollment by instructor consent only.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "201569",
        "number": "ESS 245",
        "units": [
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "246A",
        "title": "Atmosphere, Ocean, and Climate Dynamics: The Atmospheric Circulation (CEE 161I, CEE 261I, EARTHSYS 146A)",
        "description": "Introduction to the physics governing the circulation of the atmosphere and ocean and their control on climate with emphasis on the atmospheric circulation. Topics include the global energy balance, the greenhouse effect, the vertical and meridional structure of the atmosphere, dry and moist convection, the equations of motion for the atmosphere and ocean, including the effects of rotation, and the poleward transport of heat by the large-scale atmospheric circulation and storm systems.  Prerequisites: MATH 51 or CME100 and PHYSICS 41.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28951",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Y2E2 111",
                        "instructors": [
                            {
                                "name": "O'Neill, M.",
                                "sunet": "oneillm"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210448",
        "number": "ESS 246A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "246B",
        "title": "Atmosphere, Ocean, and Climate Dynamics: the Ocean Circulation (CEE 162I, CEE 262I, EARTHSYS 146B)",
        "description": "Introduction to the physics governing the circulation of the atmosphere and ocean and their control on climate with emphasis on the large-scale ocean circulation. This course will give an overview of the structure and dynamics of the major ocean current systems that contribute to the meridional overturning circulation, the transport of heat, salt, and biogeochemical tracers, and the regulation of climate. Topics include the tropical ocean circulation, the wind-driven gyres and western boundary currents, the thermohaline circulation, the Antarctic Circumpolar Current, water mass formation, atmosphere-ocean coupling, and climate variability. Prerequisites: MATH 51 or CME100; and PHYSICS 41; and a course that introduces the equations of fluid motion (e.g. ESS 246A, ESS 148, or CEE 101B).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "210459",
        "number": "ESS 246B",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "247",
        "title": "Tropical Meteorology",
        "description": "Introduction to tropical meteorology and climate. Topics include radiative-convective equilibrium, Hadley and Walker circulations, equatorial waves, El Nino/Southern Oscillation, the Madden-Julian Oscillation, monsoons and tropical cyclones. Prerequisites: Math 51 or CME100; and (concurrent is acceptable) ESS 246A and ESS 246B, or consent of the instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "220674",
        "number": "ESS 247",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "249",
        "title": "Marine Stable Isotopes (OCEANS 249)",
        "description": "This course will provide an introduction to stable isotopes biogeochemistry with emphasis on applications in marine science. We will cover fundamental concepts of nuclear structure and origin of elements and isotopes, and stable isotopic fractionation. We will discuss mass spectrometry techniques, mass independent fractionation, clumped isotopes, mass balance and box models. Applications of these concepts to studies of ocean circulation, marine carbon and nitrogen cycles, primary productivity, and particle scavenging will also be discussed.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "212952",
        "number": "ESS 249",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "251",
        "title": "Biological Oceanography (EARTHSYS 151, EARTHSYS 251, ESS 151)",
        "description": "Required for Earth Systems students in the oceans track.  Interdisciplinary look at how oceanic environments control the form and function of marine life.  Topics include distributions of planktonic production and abundance, nutrient cycling, the role of ocean biology in the climate system, expected effects of climate changes on ocean biology.  Local weekend field trips.  Designed to be taken concurrently with Marine Chemistry (ESS/EARTHSYS 152/252). **Time slot on Fridays is for mandatory group activities jointly between the ESS 151/251 and ESS 152/252 courses. Even if students are registered for either ESS 152/252 or ESS 152/252, all students from both courses need to be present full-time on Friday.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30973",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Y2E2 105",
                        "instructors": [
                            {
                                "name": "Arrigo, K.",
                                "sunet": "arrigo"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Friday"
                    },
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Y2E2 105",
                        "instructors": [
                            {
                                "name": "Arrigo, K.",
                                "sunet": "arrigo"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213659",
        "number": "ESS 251",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "252",
        "title": "Marine Chemistry (EARTHSYS 152, EARTHSYS 252, ESS 152, OCEANS 152, OCEANS 252)",
        "description": "Introduction to the interdisciplinary knowledge and skills required to critically evaluate problems in marine chemistry and related disciplines.  Physical, chemical, and biological processes that determine the chemical composition of seawater.  Air-sea gas exchange, carbonate chemistry, and chemical equilibria, nutrient and trace element cycling, particle reactivity, sediment chemistry, and diagenesis.  Examination of chemical tracers of mixing and circulation and feedbacks of ocean processes on atmospheric chemistry and climate.  Designed to be taken concurrently with Biological Oceanography (ESS/EARTHSYS 151/251)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30914",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "LBS",
                "notes": null,
                "classId": "30916",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213658",
        "number": "ESS 252",
        "units": [
            3,
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "253S",
        "title": "Hopkins Microbiology Course (BIO 274S, CEE 274S, OCEANS 274)",
        "description": "Four-week, intensive. The interplay between molecular, physiological, ecological, evolutionary, and geochemical processes that constitute, cause, and maintain microbial diversity. How to isolate key microorganisms driving marine biological and geochemical diversity, interpret culture-independent molecular characterization of microbial species, and predict causes and consequences. Laboratory component: what constitutes physiological and metabolic microbial diversity; how evolutionary and ecological processes diversify individual cells into physiologically heterogeneous populations; and the principles of interactions between individuals, their population, and other biological entities in a dynamically changing microbial ecosystem. Prerequisites: CEE 274A and CEE 274B, or equivalents. Formerly BIOHOPK 274H.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "12",
        "sections": [],
        "gers": [],
        "objectID": "206173",
        "number": "ESS 253S",
        "units": [
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "255",
        "title": "Microbial Physiology (BIO 180, EARTHSYS 255, EPS 233A)",
        "description": "(Formerly GEOLSCI 233A) Introduction to the physiology of microbes including cellular structure, transcription and translation, growth and metabolism, mechanisms for stress resistance and the formation of microbial communities. These topics will be covered in relation to the evolution of early life on Earth, ancient ecosystems, and the interpretation of the rock record. Recommended: introductory biology and chemistry. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "216005",
        "number": "ESS 255",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "256",
        "title": "Soil and Water Chemistry (EARTHSYS 256)",
        "description": "(Graduate students register for 256.) Practical and quantitative treatment of soil processes affecting chemical reactivity, transformation, retention, and bioavailability. Principles of primary areas of soil chemistry: inorganic and organic soil components, complex equilibria in soil solutions, and adsorption phenomena at the solid-water interface. Processes and remediation of acid, saline, and wetland soils. Recommended: soil science and introductory chemistry and microbiology.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30971",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fendorf, S.",
                                "sunet": "fendorf"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "129501",
        "number": "ESS 256",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "258",
        "title": "Geomicrobiology (BIO 190, EARTHSYS 158, EARTHSYS 258, ESS 158)",
        "description": "How microorganisms shape the geochemistry of the Earth's crust including oceans, lakes, estuaries, subsurface environments, sediments, soils, mineral deposits, and rocks. Topics include mineral formation and dissolution; biogeochemical cycling of elements (carbon, nitrogen, sulfur, and metals); geochemical and mineralogical controls on microbial activity, diversity, and evolution; life in extreme environments; and the application of new techniques to geomicrobial systems. Recommended: introductory chemistry and microbiology such as CEE 274A.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "204339",
        "number": "ESS 258",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "259",
        "title": "Environmental Microbial Genomics",
        "description": "The application of molecular and environmental genomic approaches to the study of biogeochemically-important microorganisms in the environment without the need for cultivation. Emphasis is on meta-omic analysis of microbial DNA, RNA, and protein obtained directly from natural microbial assemblages. Topics include microbial energy generation and nutrient cycling, genome structure, gene function, physiology, phylogenetic and functional diversity, evolution, and population dynamics of uncultured communities.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30978",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Shriram 368",
                        "instructors": [
                            {
                                "name": "Francis, C.",
                                "sunet": "caf"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "204932",
        "number": "ESS 259",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "262",
        "title": "Remote Sensing of Land (EARTHSYS 142, EARTHSYS 242, ESS 162)",
        "description": "The use of satellite remote sensing to monitor land use and land cover, with emphasis on terrestrial changes. Topics include pre-processing data, biophysical properties of vegetation observable by satellite, accuracy assessment of maps derived from remote sensing, and methodologies to detect changes such as urbanization, deforestation, vegetation health, and wildfires.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16305",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Moanga, D.",
                                "sunet": "dianamng"
                            },
                            {
                                "name": "White, E.",
                                "sunet": "eewhite"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "129516",
        "number": "ESS 262",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "264",
        "title": "Poverty, Infrastructure and Climate (CEE 265I)",
        "description": "Lack of access to physical infrastructure such as roads, water supply and electricity is a key element of how 'poverty' is often defined. At the same time, the causal pathways that link infrastructure and economic development are not well understood, and are likely being re-shaped by a changing climate. Students in this course will contribute to a new initiative on poverty, infrastructure and climate change by (1) reviewing and synthesizing literature from relevant scholarly communities, (2) co-creating a conceptual causal model of the ways in which infrastructure (particularly roads and water assets) contributes to poverty alleviation, and (3) contributing to the design of applied research effort on these topics in sub-Saharan Africa. Students who opt for the 3-unit enrollment will have an additional supervised project that could take the form of a review paper, research proposal, or analysis of secondary data. There are no formal pre-requisites for the class; students from all schools and departments are welcome. Enrollment requires permission of the instructors. Interested students are invited to submit an application at https://tiny.cc/EPIC-Stanford.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222355",
        "number": "ESS 264",
        "units": [
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "265",
        "title": "Advanced Geographic Information Systems (ESS 165)",
        "description": "Building on the Fundamentals of Geographic Information Systems course, this class delves deeper into geospatial analysis and mapping techniques.  The class is heavily project-based and students are encouraged to bring their own research questions.  Topics include topographic analysis, interpolation, spatial statistics, network analysis, and scripting using Python and Acrpy.  All students are required to attend a weekly lab.  ESS 164 or equivalent is a prerequisite.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "217826",
        "number": "ESS 265",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "267",
        "title": "Climate Change & Extreme Weather",
        "description": "This course provides a graduate-level overview of current understanding of the relationship between climate change and extreme weather events. Topics include: causes of extreme weather events in the absence of climate change; approaches for quantifying the probability of extreme events in the absence of climate change; mechanisms by which climate change could alter the frequency or intensity of extreme events; approaches for detecting and attributing changes in extreme events in historical observations; approaches for understanding and quantifying potential changes in extreme events in response to future global warming; approaches for quantifying the impacts of past and future changes in extreme events on people and ecosystems. Pre-requisites: graduate standing or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32068",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Diffenbaugh, N.",
                                "sunet": "omramom"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225447",
        "number": "ESS 267",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "268",
        "title": "Empirical Methods in Sustainable Development (INTLPOL 272)",
        "description": "The determinants of human well-being over the short and long-run, including the role of environmental factors in shaping development outcomes. A focus on the empirical literature across both social and natural sciences, with discussion and assignments emphasizing empirical analysis of environment-development linkages, application of methods in causal inference, and data visualization.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220713",
        "number": "ESS 268",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "270",
        "title": "Analyzing land use in a globalized world (ESS 170)",
        "description": "This course examines the dynamics of land use in relation to globalization. The objective is to understand how the expansion of global trade, and public and private regulations affect land use changes. The course will enable students to better understand how to effectively influence land use change, from different vantage points (government, NGO, corporate actor). The main emphasis is on tropical regions. Lectures introduce theories, practical cases, and evaluation tools to better understand contemporary land use dynamics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "216007",
        "number": "ESS 270",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "271",
        "title": "Climate Models and Data (ESS 171)",
        "description": "Overview of key concepts necessary to develop familiarity with climate modeling and data. Topics covered will include components of the climate system, climate change and global warming, and model mechanics, their evaluation and usability, and predictability. Assessments will involve the use of datasets and model output, so some knowledge of programming is a pre-requisite.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222930",
        "number": "ESS 271",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "275",
        "title": "Nitrogen in the Marine Environment (OCEANS 275)",
        "description": "The goal of this seminar course is to explore current topics in marine nitrogen cycle. We will explore a variety of processes, including primary production, nitrogen fixation, nitrification, denitrification, and anaerobic ammonia oxidation, and their controls. We will use the book Nitrogen in the Marine Environment and supplement with student-led discussions of recent literature. A variety of biomes, spatial and temporal scales, and methodologies for investigation will be discussed.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "217631",
        "number": "ESS 275",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "279",
        "title": "The Climate System and The Second Law of Thermodynamics",
        "description": "This course will read and discuss a recent review of the climate system with a focus on modeling the Earth's atmosphere as a heat engine, and quantifying entropy balance and entropy production in the moist atmosphere. The Earth receives a small amount of entropy from the sun, and radiates an enormous amount of entropy out to space. In a steady state climate system, this indicates that the atmosphere and ocean irreversibly produce substantial entropy to remain in balance. How this entropy is produced impacts the mechanical efficiency of the atmosphere. We will construct a detailed entropy budget for a dry and then moist atmosphere, emphasizing the substantial role that moisture plays in an atmospheric heat engine's ability to perform work on itself. We will consider several scales, from tropical cyclones to the full planetary circulation, and then consider how these may change under climate change and on other planets. We will also briefly discuss variational principles that minimize or maximize various quantities in order to understand the statistically steady-state climate system. The weekly class will be a discussion and work-through of the review paper.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "223285",
        "number": "ESS 279",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "281",
        "title": "Urban Agroecology (EARTHSYS 181, EARTHSYS 281, ESS 181, URBANST 181)",
        "description": "Urban agriculture takes many forms in cities around the world and provides significant amounts of food and other resources and benefits for urban communities. This Earth Systems practicum explores the application of agroecological principles to the design and stewardship of urban farms and gardens. Students will explore social and ecological dimensions of urban agriculture including issues of environmental justice while gaining land stewardship and small-scale food production skills at the Stanford Educational Farm and in the community.Course full for spring 2022, will be offered again Winter 2023.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "207917",
        "number": "ESS 281",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "282",
        "title": "Designing Educational Gardens (EARTHSYS 182)",
        "description": "A project-based course emphasizing 'ways of doing 's sustainable agricultural systems based at the new Stanford Educational Farm. Students will work individually and in small groups on the design of a new educational garden and related programs for the Stanford Educational Farm. The class will meet on 6 Fridays over the course of winter quarter. Class meetings will include an introduction to designing learning gardens and affiliated programs, 3 field trips to exemplary educational gardens in the bay area that will include tours and discussions with garden educators, and work sessions for student projects. By application only.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "209365",
        "number": "ESS 282",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "292",
        "title": "Directed Individual Study in Earth System Science",
        "description": "Under supervision of an Earth System Science faculty member on a subject of mutual interest.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "10",
        "sections": [],
        "gers": [],
        "objectID": "212781",
        "number": "ESS 292",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "301",
        "title": "Topics in Earth System Science",
        "description": "Current topics, issues, and research related to interactions that link the oceans, atmosphere, land surfaces and freshwater systems. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "209149",
        "number": "ESS 301",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "305",
        "title": "Climate Change: An Earth Systems Perspective",
        "description": "This is an introductory graduate-level course that is intended to provide an overview of leading-edge research topics in the area of climate change. Lectures introduce the physical, biogeochemical, ecological, and human dimensions of climate change, with emphasis on understanding climate change from an Earth System perspective (e.g., nonlinearities, feedbacks, thresholds, tipping points, resilience, vulnerability, risk). The emphasis is on providing an initial introduction to the process by which researchers pose questions and analyze and interpret results.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28957",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Shriram 104",
                        "instructors": [
                            {
                                "name": "Hoyt, A.",
                                "sunet": "ahoyt"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215642",
        "number": "ESS 305",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "306",
        "title": "From Freshwater to Oceans to Land Systems:  An Earth System Perspective to Global Challenges",
        "description": "Within this class we will have cover Earth System processes ranging from nutrient cycles to ocean circulation.  We will also address global environmental challenges of the twenty-first century that include maintaining freshwater resources, land degradation, health of our oceans, and the balance between food production and environmental degradation.  Weekly readings and problem sets on specific topics will be followed by presentations of Earth System Science faculty and an in-depth class discussion. ESS first year students have priority enrollment.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30969",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "SpilkerEngAppliedSci143",
                        "instructors": [
                            {
                                "name": "White, E.",
                                "sunet": "eewhite"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216373",
        "number": "ESS 306",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "307",
        "title": "Research Proposal Development and Delivery (EPS 307)",
        "description": "(Formerly GEOLSCI 307) In this class students will learn how to write rigorous, high yield, multidisciplinary proposals targeting major funding agencies. The skills gained in this class are essential to any professional career, particularly in research science. Students will write a National Science Foundation style proposal (see guidelines) involving testable hypotheses, pilot data or calculations, and broader impacts.  The proposal will, hopefully, form the core of your Ph.D. proposal. In addition to a full NSF style proposal, students will develop and exercise science communication skills and contribute to broader discussions about academia and research. Students will present their final proposals in a conference-style format at the end of the quarter. While this syllabus is a useful roadmap, we encourage students to provide input on where they&iquest;d like to see the course go. Expect the instructors to reach out for suggestions every other week. Change of Department Name: Earth and Planetary Science (Formerly Geologic Sciences).",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31044",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Welander, P.",
                                "sunet": "welander"
                            },
                            {
                                "name": "Chamberlain, P.",
                                "sunet": "chamb"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216364",
        "number": "ESS 307",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "308",
        "title": "Carbon Dioxide and Methane Removal, Utilization, and Sequestration (EARTHSYS 308, ENERGY 308, ENVRES 295, ME 308)",
        "description": "This is a seminar on carbon dioxide and methane removal, utilization, and sequestration options, and their role in decarbonizing the global energy system. This course will cover topics including the global carbon balance, utilizing atmospheric carbon in engineered solutions, recycling and sequestering fossil-based carbon, and enhancing natural carbon sinks. The multidisciplinary lectures and discussions will cover elements of technology, economics, policy and social acceptance, and will be led by a series of guest lecturers.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "16062",
                "currentClassSize": "0",
                "maxClassSize": "75",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "McCullough 115",
                        "instructors": [
                            {
                                "name": "Field, C.",
                                "sunet": "cfield"
                            },
                            {
                                "name": "Saltzer, S.",
                                "sunet": "ssaltzer"
                            },
                            {
                                "name": "Benson, S.",
                                "sunet": "smbenson"
                            },
                            {
                                "name": "Jackson, R.",
                                "sunet": "robertj2"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222572",
        "number": "ESS 308",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "322B",
        "title": "Seminar in Hydrology",
        "description": "Current topics. May be repeated for credit. Prerequisite: consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30955",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "320-220",
                        "instructors": [
                            {
                                "name": "Gorelick, S.",
                                "sunet": "gorelick"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "129612",
        "number": "ESS 322B",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "323",
        "title": "Stanford at Sea (EARTHSYS 323, OCEANS 182H, OCEANS 323H)",
        "description": "Graduate students register for 323H. Five weeks of marine science including oceanography, marine physiology, policy, maritime studies, conservation, and nautical science at Hopkins Marine Station, followed by five weeks at sea aboard a sailing research vessel in the Pacific Ocean. Shore component comprised of three multidisciplinary courses meeting daily and continuing aboard ship. Students develop an independent research project plan while ashore, and carry out the research at sea. In collaboration with the Sea Education Association of Woods Hole, MA. Only 6 units may count towards the Biology major. Formally BIOHOPK 182H and 323H.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "16",
        "unitsMax": "16",
        "sections": [],
        "gers": [],
        "objectID": "202013",
        "number": "ESS 323",
        "units": [
            16
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "326",
        "title": "Atmospheric Physics",
        "description": "Atmospheric physics refers to the physical behavior of Earth's atmosphere (and those of other planets). The purpose of this course is to introduce the laws of the thermodynamics that drive the changes in temperature, moisture, and the energy conversions, and the physics of aerosols, clouds, and precipitation (also known as &quot;microphysics&quot;). Understanding these processes on multiple time and space scales is crucial to gain insights of the evolution of the Earth's weather and climate systems. The advancement of atmospheric physics is dependent on observations from a variety of platforms (in situ, ground-based, and remote sensing), providing massive amounts of information regarding the evolving state of the atmosphere. These observational data are then fed into numerical models of the atmosphere, which play an increasingly important role in decision-making, from short-term forecasts of hazardous weather to long-term policy implications of global climate change. The course will discuss the state-of-the-art observations and numerical models related with aerosol, cloud, and precipitation.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30933",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Y2E2 253",
                        "instructors": [],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225426",
        "number": "ESS 326",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "328",
        "title": "Environmental Change and Human Resiliency",
        "description": "Unprecedented environmental change increasingly threatens human settlements in the U.S. and around the globe. This environmental change renders communities vulnerable to poor health outcomes, property loss, and displacement. This confluence of interrelated disaster events challenges people&iquest;s ability to adapt, with profound impacts on health and resiliency. This course is designed to help students think broadly about the factors that promote or inhibit individual and community-level adaptation to environmental change through case studies such as the 2018 Camp Fire in Northern California to the 2017 Hurricane Maria in Puerto Rico. Through this process, the class will consider the role of social and behavioral psychology, health, information, state and non-state actors, and the larger climate community on resiliency outcomes.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221586",
        "number": "ESS 328",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "348",
        "title": "Dynamics of the Atmosphere",
        "description": "Overview of large-scale atmospheric dynamics. Topics include the circulation of a zonally symmetric atmosphere, internal gravity waves, Rossby waves, the instability of zonal flows, and the role of eddies in the general circulation of the troposphere and stratosphere. Class participation in terms of summarizing papers and making presentations will be required.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221875",
        "number": "ESS 348",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "358",
        "title": "Polar Climate Dynamics",
        "description": "This course explores some of the key physical processes that govern the climate of cold, high-latitude regions. We will review the fundamental dynamics of the ocean, ice, and atmosphere system in Earth's polar region and examine how these processes have contributed to regional and global climate change. Topics include sea ice dynamics and variability, ice sheet mass balance, deep ocean ventilation and upwelling, modes of polar climate variability, polar amplified warming, and the high-latitude carbon cycle. We will discuss these topics in the context of past, present, and future climate change. Classes will be a mix of lectures and paper discussions. Students will take turns presenting papers and leading discussions. Evaluations will be based on student participation, in-class presentations, and a final report.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32662",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:20:00 PM",
                        "location": "Wilfred Uytengsu TchngCntr112",
                        "instructors": [
                            {
                                "name": "Wilson, E.",
                                "sunet": "earlew"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 51600.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225451",
        "number": "ESS 358",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "360",
        "title": "Social Structure and Social Networks",
        "description": "In this course, we will explore social network analysis, a set of methods and theories used in the analysis of social structure. The fundamental conceit underlying social network analysis is that social structure emerges from relationships between individuals. We will therefore concentrate in particular on the measurement of relationships, emphasizing especially practical methodology for anthropological fieldwork. This is a somewhat unusual course because of its focus on social network research coming out of anthropological and ethological traditions. While most current practitioners of social network analysis are (probably) sociologists, many of both the methodological antecedents and theoretical justifications for the field can be found in these two traditions. A major goal of this course is to understand how the methods and perspectives of social network analysis can be usefully incorporated into contemporary approaches to ethnography and other anthropological modes of investigation. Prerequisite: graduate standing or consent of instructor",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "212881",
        "number": "ESS 360",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "363F",
        "title": "Geophysical Fluid Dynamics (CEE 363F)",
        "description": "The fundamental dynamics of rotating stratified fluids. Topics include inertia-gravity waves, geostrophic and cyclogeostrophic balance, vorticity and potential vorticity dynamics, quasi-geostrophic motions, planetary and topographic Rossby waves, inertial, symmetric, barotropic, and baroclinic instability, Ekman layers, and the frictional spin-down of geostrophic flows. Prerequisites: CEE 262A or a graduate class in fluid mechanics. Recommended math background: vector calculus, ordinary differential equations, and partial differential equations. **Students who wish to enroll in the course should send an email to the instructor to express their interest in the class and to request an enrollment code.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "209403",
        "number": "ESS 363F",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "400",
        "title": "Graduate Research",
        "description": "Independent study and thesis research under the supervision of a faculty member in the Earth System Science department. On registration, students designate faculty member and agreed-upon units. The course involves regular meetings with the faculty advisor both in person and remotely. May be repeated for credit. Prerequisite: consent of instructor",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29266",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Arrigo, K.",
                                "sunet": "arrigo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "29267",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Burke, M.",
                                "sunet": "mburke"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "29268",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "29270",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dekas, A.",
                                "sunet": "dekas"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "29271",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Diffenbaugh, N.",
                                "sunet": "omramom"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "29273",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dunbar, R.",
                                "sunet": "dunbar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "29274",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fendorf, S.",
                                "sunet": "fendorf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "29275",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Field, C.",
                                "sunet": "cfield"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "29277",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Francis, C.",
                                "sunet": "caf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "29278",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gorelick, S.",
                                "sunet": "gorelick"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "11",
                "component": "INS",
                "notes": null,
                "classId": "29279",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jackson, R.",
                                "sunet": "robertj2"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "29281",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jones, J.",
                                "sunet": "jhj1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "13",
                "component": "INS",
                "notes": null,
                "classId": "29282",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Konings, A.",
                                "sunet": "konings"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "14",
                "component": "INS",
                "notes": null,
                "classId": "29283",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lobell, D.",
                                "sunet": "dlobell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "15",
                "component": "INS",
                "notes": null,
                "classId": "29284",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Matson, P.",
                                "sunet": "pmatson"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "16",
                "component": "INS",
                "notes": null,
                "classId": "29285",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Naylor, R.",
                                "sunet": "roz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "17",
                "component": "INS",
                "notes": null,
                "classId": "29286",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "O'Neill, M.",
                                "sunet": "oneillm"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "18",
                "component": "INS",
                "notes": null,
                "classId": "29287",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sheshadri, A.",
                                "sunet": "aditis2"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "19",
                "component": "INS",
                "notes": null,
                "classId": "29288",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Thomas, L.",
                                "sunet": "leift"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "20",
                "component": "INS",
                "notes": null,
                "classId": "29289",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Welander, P.",
                                "sunet": "welander"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "209176",
        "number": "ESS 400",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ],
        "totalSections": 27
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "401",
        "title": "Curricular Practical Training",
        "description": "CPT course required for international students completing degree. Prerequisite: Earth System Science Ph.D. candidate.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "217061",
        "number": "ESS 401",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "801",
        "title": "TGR Project",
        "description": "TGR Project",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [],
        "gers": [],
        "objectID": "209167",
        "number": "ESS 801",
        "units": [
            0
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ESS",
        "code": "802",
        "title": "TGR Dissertation",
        "description": "TGR Dissertation",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29508",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Arrigo, K.",
                                "sunet": "arrigo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "29509",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Burke, M.",
                                "sunet": "mburke"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "29510",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Casciotti, K.",
                                "sunet": "kcasciot"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "31028",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dekas, A.",
                                "sunet": "dekas"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "31029",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Diffenbaugh, N.",
                                "sunet": "omramom"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "31034",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dunbar, R.",
                                "sunet": "dunbar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "31037",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fendorf, S.",
                                "sunet": "fendorf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "31035",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Field, C.",
                                "sunet": "cfield"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "31038",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Francis, C.",
                                "sunet": "caf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "31039",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gorelick, S.",
                                "sunet": "gorelick"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "11",
                "component": "T/D",
                "notes": null,
                "classId": "31040",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jackson, R.",
                                "sunet": "robertj2"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "12",
                "component": "T/D",
                "notes": null,
                "classId": "31041",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jones, J.",
                                "sunet": "jhj1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "13",
                "component": "T/D",
                "notes": null,
                "classId": "31043",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Konings, A.",
                                "sunet": "konings"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "14",
                "component": "T/D",
                "notes": null,
                "classId": "31046",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lobell, D.",
                                "sunet": "dlobell"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "15",
                "component": "T/D",
                "notes": null,
                "classId": "31049",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Maher, K.",
                                "sunet": "kmaher"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "16",
                "component": "T/D",
                "notes": null,
                "classId": "31048",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Matson, P.",
                                "sunet": "pmatson"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "17",
                "component": "T/D",
                "notes": null,
                "classId": "31052",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Naylor, R.",
                                "sunet": "roz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "18",
                "component": "T/D",
                "notes": null,
                "classId": "31053",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "O'Neill, M.",
                                "sunet": "oneillm"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "19",
                "component": "T/D",
                "notes": null,
                "classId": "31054",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sheshadri, A.",
                                "sunet": "aditis2"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "20",
                "component": "T/D",
                "notes": null,
                "classId": "31055",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Thomas, L.",
                                "sunet": "leift"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "209168",
        "number": "ESS 802",
        "units": [
            0
        ],
        "totalSections": 27
    }
]