[
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "12Q",
        "title": "Humanities Core: Great Books, Big Ideas -- Europe, Middle Ages and Renaissance (DLCL 12Q, HUMCORE 12Q, ILAC 12Q)",
        "description": "This three-quarter sequence asks big questions of major texts in the European and American tradition.  What is a good life?  How should society be organized?  Who belongs?  How should honor, love, sin, and similar abstractions govern our actions?  What duty do we owe to the past and future?  The second quarter focuses on the transition from the Middle Ages to Modernity, Europe's re-acquaintance with classical antiquity and its first contacts with the New World. Authors include Dante, Shakespeare, Machiavelli, Cervantes, and Milton. N.B. This is the second of three courses in the European track. These courses offer an unparalleled opportunity to study European history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future. Students who take HUMCORE 11 and HUMCORE 12Q will have preferential admission to HUMCORE 13Q (a WR2 seminar).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220740",
        "number": "FRENCH 12Q",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "13",
        "title": "Humanities Core: Great Books, Big Ideas -- Europe, Modern (HISTORY 239C, HUMCORE 13, PHIL 13)",
        "description": "What is a good life? How should society be organized? Who belongs? How should honor, love, sin, and similar abstractions govern our actions? What duty do we owe to the past and future? This course examines tcourse examines these questions in the modern period, from the rise of revolutionary ideas to the experiences of totalitarianism and decolonization in the twentieth century. Authors include Locke, Mary Shelley, Marx, Nietzsche, Primo Levi, and Frantz Fanon. This course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Mondays you meet in your own course, and on Wednesdays all the HumCore seminars (in session that quarter) meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29615",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "29614",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "218467",
        "number": "FRENCH 13",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "36",
        "title": "Dangerous Ideas (ARTHIST 36, COMPLIT 36A, EALC 36, ENGLISH 71, ETHICSOC 36X, HISTORY 3D, MUSIC 36H, PHIL 36, POLISCI 70, RELIGST 36X, SLAVIC 36, TAPS 36)",
        "description": "Ideas matter. Concepts such as equality, tradition, and Hell have inspired social movements, shaped political systems, and dramatically influenced the lives of individuals. Others, like race and urban renewal, play an important role in contemporary debates in the United States. All of these ideas are contested, and they have a real power to change lives, for better and for worse. In this one-unit class we will examine these &quot;dangerous&quot; ideas. Each week, a faculty member from a different department in the humanities and arts will explore a concept that has shaped human experience across time and space.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "219068",
        "number": "FRENCH 36",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "62N",
        "title": "Art and Healing in the Wake of Covid-19: A Health Humanities Perspective (ITALIAN 62N)",
        "description": "How have artists contributed to healing during the Covid-19 pandemic? How does art shape or express diverse cultural understandings of health and illness, medicine and the body, death and spirituality, in response to crisis? How do such understandings directly impact the physical healing but also the life decisions and emotions of individuals, from caregivers to patients? And finally, how do these affect social transformation as part of healing? This course examines the art of COVID-19, from a contemporary and historical perspective, using the tools of Health Humanities, a relatively new discipline that connects medicine to the arts and social sciences. Materials for this course include art from different media (from poetry and fiction to performance and installation), produced during COVID-19 in mostly Western contexts, in diverse communities and with some forays into the rest of the world and into other historical moments of crisis. They also include some non-fiction readings from the disciplines Health Humanities draws from, such as history of medicine, anthropology, psychology, sociology, cultural history, media studies, art criticism, and medicine itself. We will thus be introduced to basics of Health Humanities and its methods while addressing the pandemic as a world-changing event, aided by the unique insights of artists. The course will culminate in final projects that present a critical and contextual appreciation of a specific art project created in response to COVID-19; such appreciations may be creative art projects as well, or more analytical, scholarly evaluations.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "223602",
        "number": "FRENCH 62N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "75N",
        "title": "Narrative Medicine and Near-Death Experiences (ITALIAN 75N)",
        "description": "Even if many of us don't fully believe in an afterlife, we remain fascinated by visions of it. This course focuses on Near-Death Experiences and the stories around them, investigating them from the many perspectives pertinent to the growing field of narrative medicine: medical, neurological, cognitive, psychological, sociological, literary, and filmic. The goal is not to understand whether the stories are veridical but what they do for us, as individuals, and as a culture, and in particular how they seek to reshape the patient-doctor relationship.  Materials will span the 20th century and come into the present. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "214260",
        "number": "FRENCH 75N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "87N",
        "title": "The New Wave: How The French Reinvented Cinema (FILMEDIA 87N)",
        "description": "When the French New Wave burst onto the stage in 1959, it changed forever the way films are made and the ways we think about cinema. Shooting on location with small crews, light cameras, unknown actors and improvised scripts, a group of young film critics turned filmmakers circumvented the big studios to craft low-budget films that felt fresh, irreverent and utterly modern. In just a few years, the Nouvelle Vague delivered such landmark works as Truffaut's 400 Blows, Godard's Breathless or Resnais' Hiroshima mon amour. Together with Agn&egrave;s Varda, Eric Rohmer and Claude Chabrol, they redefined the essence of cinema as an art form as complex and multi-layered as literature. Yet, after having been hailed as revolutionary, the Nouvelle Vague was soon dismissed as 'rather vague and not all that new. 'Why did these films look so radically fresh? What is their common aesthetics, when each 'auteur' claimed an utterly personal style for him or herself? And what did their immediate success and early fall from grace tell us about France in the early 60s?  This survey course will explore a unique moment in French culture and the history of cinema, when radical politics, youth culture, and jazzy aesthetics coalesced into dazzling experiments on the screen that continue to influence world cinema to this day. Focus is on cultural history, aesthetic analysis, and interpretation of narrative, sound and visual forms. Satisfies Ways AII (Aesthetic and Interpretative Inquiry). Films in French with Subtitles. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "29836",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "217402",
        "number": "FRENCH 87N",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "100",
        "title": "The History of Pirates",
        "description": "TBD",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224382",
        "number": "FRENCH 100",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "103",
        "title": "Literature and Atheism",
        "description": "France, the land of la&iuml;cit&eacute; and the epicenter of the Enlightenment and of Existentialism, has played a central role in the development of modern western atheism. Its philosophical and literary traditions - traditions in which the line between philosophy and literary writing is often blurred - are rich with discussions of the causes and consequences of atheism. From the seventeenth century, when atheism first emerged as a serious possibility, through to the present day, in which the French population is among the most atheist in the world, the trajectory of French history has been profoundly marked by the rejection of religion.  In this course we will focus on texts that foreground questions about what it is like to be an atheist. If one abandons faith in any deity, what does it mean to exist in this universe and in society? What are the moral, psychological and existential implications of disbelief? How does the atheist face death? How does the atheist deal with religion and those who are religious? How has the experience of atheism evolved over time? This course will be taught in French.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224365",
        "number": "FRENCH 103",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "104N",
        "title": "Film and Fascism in Europe",
        "description": "Controlling people's minds through propaganda is an integral part of fascist regimes' totalitarianism. In the interwar, cinema, a relatively recent mass media, was immediately seized upon by fascist regimes to produce aggrandizing national narratives, justify their expansionist and extermination policies, celebrate the myth of the &quot;Leader,&quot; and indoctrinate the people. Yet film makers under these regimes (Rossellini, Renoir) or just after their fall, used the same media to explore and expose how they manufactured conformism, obedience, and mass murder and to interrogate fascism. We will watch films produced by or under European fascist regimes (Nazi Germany, Italy under Mussolini, Greece's Regime of the Colonels) but also against them. The seminar introduces key film analysis tools and concepts, while offering insights into the history of propaganda and cinema. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "30431",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225268",
        "number": "FRENCH 104N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "105E",
        "title": "Five Words that Shaped French Culture",
        "description": "&quot;Libert&eacute;&quot;, &quot;&eacute;galit&eacute;&quot;, &quot;la&iuml;cit&eacute;&quot; but also &quot;&quot;race&quot;&quot; and &quot;&quot;nation&quot;&quot; have shaped France's political history since 1789. The concepts sound familiar, yet their specifically French connotations are often misunderstood and may be untranslatable. Looking at historical archives, scholarly articles, films, and iconographic documents, the course examines their polemical origin, their fluctuating and often-contested meanings, and the contemporary debates that continue to fuel heated controversies over their legacy, relevance, and necessary reformation. A journey through key historical dates of French history, and the tumultuous making of French political identity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225204",
        "number": "FRENCH 105E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "110",
        "title": "French Painting from Watteau to Monet (ARTHIST 110, ARTHIST 310, FRENCH 310)",
        "description": "This course offers a survey of painting in France from 1700 to around 1900. It introduces major artists, artworks, and the concepts used by contemporary observers and later art historians to make sense of this extraordinarily rich period. Overarching themes discussed in the class will include the dueling legacies of coloristic virtuosity and classical formalism, new ways of representing visual perception, the opposing artistic effects of absorption and theatricality, the rise and fall of official arts institutions, and the participation of artists and artworks in political upheaval and social change. The course ends with an interrogation of the concept of modernity and its emergence out of dialogue and conflict with artists of the past. Students will learn and practice formal analysis of paintings, as well as interpretations stressing historical context.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220313",
        "number": "FRENCH 110",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "118",
        "title": "Literature and the Brain (COMPLIT 138, COMPLIT 238, ENGLISH 118, ENGLISH 218, FRENCH 218, PSYC 126, PSYCH 118F)",
        "description": "How does fiction make us better at reading minds? Why do some TV shows get us to believe two contradictory things at once? And can cognitive biases be a writer's best friend? We'll think about these and other questions in the light of contemporary neuroscience and experimental psychology, with the help of Song of Solomon (Toni Morrison), Madame Bovary (Gustave Flaubert), season 1 of Westworld (Lisa Joy / Jonathan Nolan), and short readings from writers like Louise Gl&uuml;ck, Jorge Luis Borges, Virginia Woolf, and Marcel Proust. We'll also ask what we see when we read; whether the language we speak affects the way we think; and why different people react differently to the same book. Plus: is free will a fiction, or were you just forced to say that?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14445",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            },
                            {
                                "name": "Eagleman, D.",
                                "sunet": "deagle"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "15203",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "212065",
        "number": "FRENCH 118",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "120",
        "title": "Coffee and Cigarettes: The Making of French Intellectual Culture",
        "description": "Examines a quintessential French figure &quot;l'intellectuel&quot; from a long-term historical perspective. We will observe how this figure was shaped over time by such other cultural types as the writer, the artist, the historian, the philosopher, and the moralist. Proceeding in counter-chronological order, from the late 20th to the 16th century, we will read a collection of classic French works. As this course is a gateway for French studies, special emphasis will be placed on oral proficiency.  Taught in French; readings in French.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29248",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edmondson, C.",
                                "sunet": "cmhse14"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "211231",
        "number": "FRENCH 120",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "120E",
        "title": "Introduction to the Medical Humanities (ANTHRO 120H, DLCL 120, ITALIAN 120)",
        "description": "Medical Humanities is a humanistic and interdisciplinary approach to medicine. It explores the experience of health and illness as captured through the expressive arts (painting, music, literature), across historical periods and in different cultures, as interpreted by scholars in the humanities and social sciences as well as in medicine and policy. Its goal is to give students an opportunity to explore a more holistic and meaning-centered perspective on medical issues. It investigates how medicine is an art form as well as a science, and the way institutions and culture shape the way illness is identified, experienced and treated.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31233",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wittman, L.",
                                "sunet": "lwittman"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225237",
        "number": "FRENCH 120E",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "121",
        "title": "Jean-Jacques Rousseau: Politics, Philosophy, and Literature (FRENCH 221A)",
        "description": "&quot;Man is born free, and everywhere he is in chains.&quot; This seminar explores the work of one of the most important and enigmatic thinkers about the problems of modern society: Jean-Jacques Rousseau. Students will read a selection of his most important works in dialogue with other important thinkers of his time. They will grapple with Rousseau's political philosophy in his critique of modernity and his vision for remaking politics, as well as his moral philosophy and influential fictional visions of education and love. We will discuss not only Rousseau's landmark contributions to debates about authenticity, transparency, and self-interest, but also his troubling views on gender. The class will conclude with Rousseau's autobiography and its profound meditation on the formation of selfhood. Taught in French.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220736",
        "number": "FRENCH 121",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "129",
        "title": "Camus (COMPLIT 229B, CSRE 129, HISTORY 235F)",
        "description": "&quot;The admirable conjunction of a man, of an action, and of a work&quot; for Sartre, &quot;the ideal husband of contemporary letters&quot; for Susan Sontag, reading &quot;Camus's fiction as an element in France's methodically constructed political geography of Algeria&quot; for Edward Said, Camus embodies the very French figure of the &quot;intellectuel engag&eacute;,&quot; or public intellectual. From his birth in 1913 into a poor European family in Algeria to the Nobel Prize in Literature in 1957, from the Mediterranean world to Paris, Camus engaged in the great ethical and political battles of his time, often embracing controversial positions. Through readings and films, we will explore his multiple legacies. Readings from Albert Camus, Jean-Paul Sartre, Assia Djebar, Kamel Daoud, Mouloud Feraoun, Alice Kaplan, Edward Said, Edwidge Danticat. Students will work on their production of written French, in addition to speaking French and reading comprehension. Taught in French. Students are highly encouraged to complete FRENLANG 124 or to successfully test above this level through the Language Center. This course fulfills the Writing in the Major (WIM) requirement.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29840",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "217403",
        "number": "FRENCH 129",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "130",
        "title": "Introduction to Medieval and Renaissance French Literature",
        "description": "In this introductory course, we will read some key texts of literature written in French between 1100 and 1600, paying special attention to how gender, cultural difference and love played a role in the doing and undoing of communities. What does it mean to be a woman writer when most things were written by men? What does it mean to be a man, at court or at war? What did people learn when traveling to Asia or to the New Continent, and how did it impact the way people conceived of ethnicity? How did people think of ethnic difference in their midst? How can love strengthen an empire, and how can one be sincere when copying a love-poem? These cultural questions will be answered with special attention to literary form. Different genres might have yielded different possibilities to not just represent, but also imagine ways of living together; perhaps the very structure of a sentence allows one to construe one's own identity. While the course will be taught in French, no knowledge of Old French, Latin, or Occitan is required. All readings will be done in modern French or English translation. Heavy emphasis will be placed on improving writing and formal speech. Students can expect guidance, feedback, and opportunities to improve in a low-stakes environment. Students are highly encouraged to complete FRENLANG 124 or to successfully test above this level through the Language Center. This course fulfils WAY-AII (Aesthetic Inquiry) and GER-DB-Hum (Disciplinary Breadth in the Humanities) requirements. Assignments and discussions are all in French.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "26780",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": "240-202",
                        "instructors": [
                            {
                                "name": "Edmondson, C.",
                                "sunet": "cmhse14"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "117997",
        "number": "FRENCH 130",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "131",
        "title": "Absolutism, Enlightenment, and Revolution in 17th- and 18th-Century France",
        "description": "The literature, culture, and politics of France from Louis XIV to Olympe de Gouges. How this period produced the political and philosophical foundations of modernity. Readings may include Corneille, Moli&egrave;re, Racine, Lafayette, Voltaire, Diderot, Rousseau, Beaumarchais, and Gouges. Taught in French. Students are highly encouraged to complete FRENLANG 124 or to successfully test above this level through the Language Center. This course fulfills the Writing in the Major (WIM) requirement.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28597",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edmondson, C.",
                                "sunet": "cmhse14"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "117998",
        "number": "FRENCH 131",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "132",
        "title": "Literature, Revolutions, and Changes in 19th- and 20th-Century France",
        "description": "This course explores central texts of 19th- and 20th-Century French literature, following the evolution of important literary movements during those centuries of cultural and social transformation. We will study texts in all major genres (prose, poetry, theater, film) related to movements such as Romanticism, Realism, Naturalism, Surrealism, Theater of the Absurd, and the Nouveau Roman. We will regularly relate literature and film to developments in other arts, such as painting and music. Authors and filmmakers include Chateaubriand, Stendhal, Balzac, Flaubert, Maupassant, Baudelaire, Rimbaud, Apollinaire, Proust, Ionesco, Varda, Godard, Sarraute, and Ernaux. All readings, discussion, and assignments are in French. Students are highly encouraged to complete FRENLANG 124 or to successfully test above this level through the Language Center.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28286",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "117999",
        "number": "FRENCH 132",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "133",
        "title": "Literature and Society in Africa and the Caribbean (AFRICAAM 133, AFRICAST 132, COMPLIT 133, COMPLIT 233A, CSRE 133E, JEWISHST 143)",
        "description": "This course provides students with an introductory survey of literature and cinema from Francophone Africa and the Caribbean in the 20th and 21st centuries. Students will be encouraged to consider the geographical, historical, and political connections between the Maghreb, the Caribbean, and Sub-Saharan Africa. This course will help students improve their ability to speak and write in French by introducing students to linguistic and conceptual tools to conduct literary and visual analysis. While analyzing novels and films, students will be exposed to a diverse number of topics such as national and cultural identity, race and class, gender and sexuality, orality and textuality, transnationalism and migration, colonialism and decolonization, history and memory, and the politics of language. Readings include the works of writers and filmmakers such as Aim&eacute; C&eacute;saire, Albert Memmi, Ousmane Semb&egrave;ne, Le&iuml;la Sebbar, Mariama B&acirc;, Maryse Cond&eacute;, Dany Laferri&egrave;re, Mati Diop, and special guest L&eacute;onora Miano. Taught in French. Students are encouraged to complete FRENLANG 124 or successfully test above this level through the Language Center.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Fulfills Writing in the Major (WIM) requirement for 2021-22.",
                "classId": "13412",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "213802",
        "number": "FRENCH 133",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "140",
        "title": "Paris: Capital of the Modern World (FRENCH 340, HISTORY 230C, URBANST 184)",
        "description": "This course explores how Paris, between the eighteenth and twentieth centuries, became the political, cultural, and artistic capital of the modern world. It considers how the city has both shaped and been shaped by the tumultuous events of modern history- class conflict, industrialization, imperialism, war, and occupation. It will also explore why Paris became the major world destination for intellectuals, artists and writers. Sources will include films, paintings, architecture, novels, travel journals, and memoirs. Course taught in English with an optional French section.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "213087",
        "number": "FRENCH 140",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "148",
        "title": "Cinema and the Real: Italian Neo-Realism and the French New Wave (FRENCH 248, ITALIAN 148, ITALIAN 248)",
        "description": "Between the 1940s and 1960s, in Italy and France, a handful of movie directors revolutionized the art of cinema. In the wake of World War II they entirely re-defined the aesthetics of the 7th art in films such as &quot;Bicycle Thieves,&quot; &quot;400 Blows,&quot; &quot;Rome Open City,&quot; and &quot;Breathless.&quot; These works shared an aesthetic and a philosophy of &quot;the real&quot; - they eschewed big studios and sets in favor of natural light, on-location shooting, and non-professional actors to capture the present moment. This survey course will explore how the dialogue between Italian neo-realism and the French New Wave has yielded some of the most revolutionary filmic masterpieces of both traditions, while raising theoretical and philosophical questions about form, time, space, fiction, representation, and reality. Films: Roberto Rossellini, Vittorio de Sica, Luchino Visconti, Federico Fellini, Fran&ccedil;ois Truffaut, Jean-Luc Godard, Alain Resnais and Agn&egrave;s Varda.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222486",
        "number": "FRENCH 148",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "149",
        "title": "Love at First Sight: Visual Desire, Attraction, and the Pleasures of Art (ARTHIST 119, ARTHIST 319, FRENCH 349, ITALIAN 149, ITALIAN 349)",
        "description": "Why do dating sites rely on photographs? Why do we believe that love is above all a visual force? How is pleasure, even erotic pleasure, achieved through looking? While the psychology of impressions offers some answers, this course uncovers the ways poets, songwriters, and especially artists have explored myths and promoted ideas about the coupling of love and seeing. Week by week, we will be reflecting on love as political critique, social disruption, and magical force. And we will do so by examining some of the most iconic works of art, from Dante's writings on lovesickness to Caravaggio's Narcissus, studying the ways that objects have shifted from keepsakes to targets of our cares. While exploring the visual roots and evolutions of what has become one of life's fundamental drives, this course offers a passionate survey of European art from Giotto's kiss to Fragonard's swing that elicits stimulating questions about the sensorial nature of desire and the human struggle to control emotions.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220546",
        "number": "FRENCH 149",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "153",
        "title": "Liberté, Égalité, Fraternité: French Political Myths and Concepts (FRENCH 353)",
        "description": "&quot;Libert&eacute;, &eacute;galit&eacute;, fraternit&eacute;,&quot; but also &quot;la&iuml;cit&eacute;,&quot; &quot;diversit&eacute;,&quot; &quot;parit&eacute;,&quot; &quot;universalisme&quot; : the French have forged over the last two centuries key political concepts that are articulated together in a unique way and shape the political consciousness, modes of engagements, aspirations and current debates of what has been called &quot;the most political nation in the world.&quot; Along with mythologies such as the People, the Nation, the providential Leader, or the &quot;enemy from within,&quot; they are at the centre of semantic and political battles, tugged over by the Left, the Right, populist movements, activists and counter-cultures. How did they emerge? How do they apply today? How does theory compare to practices, principles to day-to-day realities? An introduction through case-studies, films, paintings, cartoons, and texts from political theory, history, politics and literature. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221736",
        "number": "FRENCH 153",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "154",
        "title": "Film & Philosophy (COMPLIT 154A, ENGLISH 154F, ITALIAN 154, PHIL 193C, PHIL 293C)",
        "description": "What makes you the individual you are? Should you plan your life, or make it up as you go along? Is it always good to remember your past? Is it always good to know the truth? When does a machine become a person? What do we owe to other people?  Is there always a right way to act? How can we live in a highly imperfect world? And what can film do that other media can't? We'll think about all of these great questions with the help of films that are philosophically stimulating, stylistically intriguing, and, for the most part, gripping to watch: Do The Right Thing (Lee), The Dark Knight (Nolan), Eternal Sunshine of the Spotless Mind (Kaufman), Arrival (Villeneuve), My Dinner with Andr&eacute; (Malle), Blade Runner (Scott), La Jet&eacute;e (Marker), Fight Club (Fincher), No Country for Old Men (Coen), The Seventh Seal (Bergman), and Memento (Nolan). Attendance at weekly screenings is mandatory; and fun. We will not be using the waitlist on Axess - if you would like to enroll and the course is full/closed please email us to get on the waitlist!",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29645",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "DIS",
                "notes": null,
                "classId": "29644",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "213463",
        "number": "FRENCH 154",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "154E",
        "title": "Film & Philosophy CE (ITALIAN 154E, PHIL 193E, PHIL 293E)",
        "description": "Issues of authenticity, morality, personal identity, and the value of truth explored through film; philosophical investigation of the filmic medium itself. Screenings to include Blade Runner (Scott), Do The Right Thing (Lee), The Seventh Seal (Bergman), Fight Club (Fincher), La Jet&eacute;e (Marker), Memento (Nolan), and Eternal Sunshine of the Spotless Mind (Kaufman). Taught in English. Satisfies the WAY CE.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "220282",
        "number": "FRENCH 154E",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "155",
        "title": "10 French Women Who Changed History",
        "description": "In this class we'll explore the lives of 10 extraordinary French women who changed the course of French history. Eleanor of Aquitaine and Joan of Arc will teach us how to win wars and hearts to one's cause; Olympe de Gouges and George Sand will revolutionize our understanding of  &quot;universal&quot; rights and freedom; Coco Chanel and Edith Piaf will refine our artistic and musical senses; Simone de Beauvoir and Simone Veil will show us that political and social reforms are in our hands; and so forth. To understand these women and their lives, we will read historical texts and fictional works written by them and about them, both modern and ancient; we will also watch documentaries (original and contemporary), movie excerpts and dramatic representations. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30410",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223592",
        "number": "FRENCH 155",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "159",
        "title": "French Kiss: The History of Love and the French Novel (FRENCH 256, HISTORY 236F)",
        "description": "The history of the French novel is also the history of love. How did individuals experience love throughout history? How do novels reflect this evolution of love through the ages? And, most significantly, how have French novels shaped our own understanding of and expectations for romantic love today? The course will explore many forms of love from the Ancien R&iquest;gime to the 20th century. Sentiment and seduction, passion and desire, the conflict between love and society: students will examine these themes from a historical perspective, in tandem with the evolution of the genre of the novel (the novella, the sentimental novel, the epistolary novel, the 19th-century novel, and the autobiographical novel). Some texts will be paired with contemporary films to probe the enduring relevance of love &quot;&iquest; la fran&iquest;aise&quot; in the media today. Readings include texts by Lafayette, Pr&iquest;vost, Laclos, Dumas fils, Flaubert, Colette, Yourcenar, and Duras. This is an introductory course to French Studies, with a focus on cultural history, literary history, interpretation of narrative, thematic analysis, and close reading. Undergraduate students should enroll for FRENCH159, while graduate students may enroll for FRENCH256. Readings and discussion in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14407",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": "240-201",
                        "instructors": [
                            {
                                "name": "Edmondson, C.",
                                "sunet": "cmhse14"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "223836",
        "number": "FRENCH 159",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "163",
        "title": "A Brief History of Now: Song and Poetry from Sappho to SZA (COMPLIT 163)",
        "description": "What techniques do singers share between traditions from antiquity to the present? How do they produce a sense of a moment to be seized, a contrast between hope and despair, and here and now? Transhistorical, comparative analysis of lyric modes and conventions such as apostrophe, the desire to sing and uselessness of doing so, when and where they diverge in different lyric genres and traditions. Poets and songwriters include Catullus, Sappho, Li Qingzhao, troubadours, Dante, Lab&eacute;, Donne, Swift, Bob Dylan, SZA. Each week, students will enrich the discussion by introducing to the class their own suggestions of relevant works.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30414",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            },
                            {
                                "name": "Carter, H.",
                                "sunet": "harrycar"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225219",
        "number": "FRENCH 163",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "173",
        "title": "Couture Culture (ARTHIST 273, ARTHIST 473, FRENCH 373)",
        "description": "Fashion, art, and representation in Europe and the US between 1860 and today. Beginning with Baudelaire, Impressionism, the rise of the department store and the emergence of haute couture,  culminating in the spectacular fashion exhibitions mounted at the Metropolitan and other major art museums in recent years. Students participate actively in class discussion and pursue related research projects.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220383",
        "number": "FRENCH 173",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "175",
        "title": "CAPITALS: How Cities Shape Cultures, States, and People (COMPLIT 100, DLCL 100, GERMAN 175, HISTORY 206E, ILAC 175, ITALIAN 175, URBANST 153)",
        "description": "This course takes students on a trip to major capital cities, at different moments in time: Renaissance Florence, Golden Age Madrid, Colonial Mexico City, Enlightenment and Romantic Paris, Existential and Revolutionary St. Petersburg, Roaring Berlin, Modernist Vienna, and bustling Buenos Aires. While exploring each place in a particular historical moment, we will also consider the relations between culture, power, and social life. How does the cultural life of a country intersect with the political activity of a capital? How do large cities shape our everyday experience, our aesthetic preferences, and our sense of history? Why do some cities become cultural capitals? Primary materials for this course will consist of literary, visual, sociological, and historical documents (in translation); authors we will read include Boccaccio, Dante, Sor Juana, Montesquieu, Baudelaire, Gogol, Irmgard Keun, Freud, and Borges. Note: To be eligible for WAYS credit, you must take the course for a Letter Grade.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29891",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            },
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "32417",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "6:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 66600.0,
                        "endTimestamp": 69600.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "29890",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "218539",
        "number": "FRENCH 175",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "178",
        "title": "The Haitian Revolution: Slavery, Freedom, and the Atlantic World (AFRICAAM 178S, HISTORY 78S)",
        "description": "How did the French colony of Saint-Domingue become Haiti, the world's first Black-led republic? What did Haiti symbolize for the African diaspora and the Americas at large? What sources and methods do scholars use to understand this history? To answer these questions, this course covers the Haitian story from colonization to independence during the eighteenth and nineteenth centuries. Our course will center Africans and people of African descent, both enslaved and free, as they negotiated and resisted systems of racial and economic oppression in the French Caribbean. Our inquiry will critically engage with conceptions and articulations of human and civil rights as they relate to legal realities and revolutionary change over time, as well as the interplay between rights and racial thinking. Tracing what historian Julius Scott called the &quot;common wind&quot; of the Haitian Revolution, we will also investigate how the new nation's emergence built on the American and French Revolutions while also influencing national independence movements elsewhere in the Atlantic World. Priority given to history majors and minors; no prerequisites and all readings are in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223642",
        "number": "FRENCH 178",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "181",
        "title": "Philosophy and Literature (CLASSICS 42, COMPLIT 181, ENGLISH 81, GERMAN 181, ILAC 181, ITALIAN 181, PHIL 81, SLAVIC 181)",
        "description": "Can novels make us better people? Can movies challenge our assumptions? Can poems help us become who we are? We'll think about these and other questions with the help of writers like Toni Morrison, Marcel Proust, Jordan Peele, Charlie Kaufman, Rachel Cusk, William Shakespeare, and Samuel Beckett, plus thinkers like Nehamas, Nietzsche, Nussbaum, Plato, and Sartre. We'll also ask whether a disenchanted world can be re-enchanted; when, if ever, the truth stops being the most important thing; why we sometimes choose to read sad stories; whether we ever love someone for who they are; who could possibly want to live their same life over and over again; what it takes to make ourselves fully moral; whether it's ever good to be conflicted; how we can pull ourselves together; and how we can take ourselves apart. (This is the required gateway course for the Philosophy and Literature major tracks. Majors should register in their home department.)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13435",
                "currentClassSize": "0",
                "maxClassSize": "93",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "McMurtry Art Building Oshman",
                        "instructors": [
                            {
                                "name": "Peacocke, A.",
                                "sunet": "peacocke"
                            },
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "204034",
        "number": "FRENCH 181",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "185",
        "title": "Texts and Contexts: French-English Translation (COMPLIT 285, CSRE 285, FRENCH 285)",
        "description": "This course introduces students to the ways in which translation has shaped the image of France and the Francophone world. What texts and concepts were translated, how, where, and to what effect? Students will work on a translation project throughout the quarter and translate texts from French to English and English to French. Topics may include the role of translation in the development of cultures; the political dimension of translation, translation in the context of migration, and the socio-cultural frameworks that shape translations. Case studies: Camus, Chamoiseau, Djebar, Fanon, Sow Fall, Proust. Prior knowledge of French language required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "221744",
        "number": "FRENCH 185",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "186",
        "title": "The Art of Self-Portraits (COMPLIT 186A, FEMGEN 186, ITALIAN 186)",
        "description": "What is a self-portrait? The simple answer is that it is a portrait of the self. The complex answer is: anything that a person finds relevant to one's identity. Sometimes self-portraits are built around a positive idea, sometimes around a sense of loss; sometimes they are constructed as a shield or as a weapon, and turn into a manifesto of the self; sometimes they include a physical representation, sometimes they deny legitimacy to the body; sometimes gender or race (or both) are at the core of the identity, sometimes they are hidden; they are, however, never neutral and are always meaningful. In this class we will learn how to disentangle these multiple layers and will work on deconstructing them: we will focus on how each facet shapes and determines the representation and will appreciate the tactics and strategies used by the artists and authors in our syllabus (Frida Kahlo, Pablo Picasso, Simone de Beauvoir, Jin Min Lee, Alison Bechdel, Jhumpa Lahiri, among others). The class is taught in English and will have creative as well as critical assignments.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30411",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "223593",
        "number": "FRENCH 186",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "187",
        "title": "Sex, Gender, and Violence: French and Francophone Women Writers Today (FEMGEN 187X, FEMGEN 287X, FEMGEN 387X, FRENCH 287, FRENCH 387)",
        "description": "Long before the 2017 #Metoo campaign, French women writers have explored through powerful fictions and autobiographies the different shades of economic, social, psychological, physical, or sexual violence that is exerted against, but also by and between, women. How does literature - the power of words - address, deconstruct or comfort power dynamics (during sex and between the sexes) that are usually silenced, taboo or unspeakable? Themes explored: sex and gender, sex and power, rape culture, sexual and moral taboos (incest, abortion, pornography, infanticide, lesbianism), the body as social stigma or source of meaning. Special attention given to narrative and descriptive strategies designed to avert, expose, deconstruct or account for specifically feminine experiences (rape, orgasm, pregnancy). Authors include Nobel Prize Annie Ernaux, Virginie Despentes, Marie Darrieusecq, Christine Angot, Marie NDiaye, Leonora Miano, Leila Slimani, Vanessa Springora along with feminist theory. Discussion in English. Readings in French or English, students choice",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32301",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "219565",
        "number": "FRENCH 187",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "188",
        "title": "Women, Wheat, and Weather? Lessons from Italy and the Global South for the 21st Century (COMPLIT 188A, COMPLIT 288, FRENCH 288, ITALIAN 188, ITALIAN 288)",
        "description": "The Global South - a symbolic Mediterranean stretching from the Caribbean to India - lures the civilized man with the promise of excellent weather, voluptuous women, and good food. Already in antiquity, Sicily, the southernmost province of what is today modern Italy, was known as &quot;the granary of Rome,&quot; supplying the Empire with wheat. Still today, the South is associated with vacation, underdevelopment, superstition, the mafia, la dolce vita: &quot;The South is the problem; the North the solution,&quot; Boaventura de Sousa Santos succinctly puts it. In this course, we will move beyond the three W's by focusing on Italy from the point of view of &quot;Southern Thought&quot; (&quot;pensiero meridiano&quot;). We will read 20th/21st-century literary, philosophical, anthropological, and sociological texts from the Global South (Franco Cassano, Roberto M. Dainotto, Salman Rushdie, Gayatri Spivak, de Sousa Santos, Frantz Fanon, Homi Bhabha, Achille Mbembe, Carla Lonzi) to discuss such relevant topics as community and belonging (Elena Ferrante), technology and globalization (Luigi Pirandello; Fernando Pessoa), virus and contagion (Albert Camus), as well as race and gender (Igiaba Scego) from a Southern critical perspective. What counterhegemonic, non-binary, and renewable alternatives do the south of Italy and the Global South in general offer to understand these issues, and to the Western and Northern European emphasis on reason (the Cartesian &quot;cogito&quot;), individualism, and objectivity? We will have guest speakers from the Council of the EU and USAID specialized in international development, as well as conversations with authors. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223590",
        "number": "FRENCH 188",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "192",
        "title": "Women in Contemporary French Cinema (FEMGEN 192, FILMEDIA 112, FRENCH 392)",
        "description": "Women as objects and subjects of the voyeuristic gaze inherent to cinema. The evolution of female characters, roles, actresses, directors in the French film industry from the sexual liberation to #metoo. Women as archetypes, icones, images, or as agents and subjects. Emphasis on filmic analysis: framing, point of view, narrative, camera work as ways to convey meaning. Themes include: sexualization and desire; diversity and intersectionality in films; new theories of the female gaze; gender, ethnicity and class. Filmmakers include Roger Vadim, Agn&egrave;s Varda, Luis Bu&ntilde;uel, Claude Chabrol, Colline Serreau, Elena Rossi, Tonie Marshall, Houda Benyamina, El&eacute;onore Pourriat, C&eacute;line Sciamma. VISIT BY FILM DIRECTORS Elena Rossi and Sciamma (pending).nnFilms in French with subtitles; Discussion in English; 3 units, 4 units or 5 units.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "219396",
        "number": "FRENCH 192",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "199",
        "title": "Individual Work",
        "description": "Restricted to French majors with consent of department. Normally limited to 4-unit credit toward the major. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27663",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29659",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29369",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10484",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "31235",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "31002",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "31236",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "31003",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10485",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "31237",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10486",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11082",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "31238",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10487",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "11083",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "31239",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "11084",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "31240",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10488",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "31241",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213803",
        "number": "FRENCH 199",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 28
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "205",
        "title": "Songs of Love and War: Gender, Crusade, Politics (FEMGEN 205, FRENCH 305, ITALIAN 205, ITALIAN 305)",
        "description": "The course examines the medieval love lyric tradition, including the troubadours, trouv&egrave;res, and the Italian dolce stil nuovo. Focus on how to understand this tradition in the context of other non-Western lyric and its performative and material contexts such as manuscripts. Study of female lyrics, secondary readings on voice, lyric theory, and medieval textuality. Will be taught in English.  FRENCH 205 fulfills DLCL 121: Performing in the Middle Ages core course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:EC-Gender",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "214149",
        "number": "FRENCH 205",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "212",
        "title": "Giambattista Vico (COMPLIT 221, FRENCH 321, ITALIAN 221, ITALIAN 321)",
        "description": "An intensive reading of Vico's book - New Science.  Emphasis will be on Vico's philosophy of history and theories of poetic wisdom, myth, and language.  Vico will be put in dialogue with Ren&eacute; Descartes, Rousseau, Auguste Compte, Claude L&eacute;vi Strauss, and Paul Feyerabend, whose ideas about myth and science converge in striking ways with Vico's.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220703",
        "number": "FRENCH 212",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "212E",
        "title": "Curing the Institutions with Francesc Tosquelles: Politics and exile, disalienation and outsider art (ARTHIST 212A, DLCL 212, ILAC 212)",
        "description": "In the occupied France of the 1940s, Catalan psychiatrist Francesc Tosquelles used culture (amateur cinema, theater, and literature) and politics (self-management, cooperatives, and anti-Stalinist communism) to &quot;cure&quot; the institutions rather than patients. In his work he engaged with avantgarde poets like Paul &Eacute;luard, Antonin Artaud and Tristan Tzara, the post-colonial philosopher and psychiatrist Frantz Fanon and philosopher F&eacute;lix Guattari. His project was shaped by radical politics in Catalonia during the 1930s and his own practice of treating the therapeutic community rather than the patients themselves. Tosquelles worked with people outside the medical profession: musicians, writers, lawyers and even prostitutes. These experiences resonate in the book he wrote on poet Gabriel Ferrater and the Spanish Civil War. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30859",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "20-21B",
                        "instructors": [],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225264",
        "number": "FRENCH 212E",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "213E",
        "title": "Culture and Revolution in Africa (COMPLIT 213)",
        "description": "This course examines African cultural productions in the era of decolonization. We will explore novels, poems, songs, films, memoirs, and photographs from different parts of the continent. Course taught in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30432",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225269",
        "number": "FRENCH 213E",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "214",
        "title": "Pirandello, Sartre, and Beckett (COMPLIT 281E, COMPLIT 381E, FRENCH 314, ITALIAN 214, ITALIAN 314)",
        "description": "In this course we will read the main novels and plays of Pirandello, Sartre, and Beckett, with special emphasis on the existentialist themes of their work. Readings include The Late Mattia Pascal, Six Characters in Search of an Author, Henry IV; Nausea, No Exit, &quot;Existentialism is a Humanism&quot;; Molloy, Endgame, Krapp's Last Tape, Waiting for Godot. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "215495",
        "number": "FRENCH 214",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "217",
        "title": "Love, Death and the Afterlife in the Medieval West (FRENCH 317, HISTORY 217D, HISTORY 317D, ITALIAN 217, ITALIAN 317)",
        "description": "Romantic love, it is often claimed, is an invention of the High Middle Ages. The vocabulary of sexual desire that is still current in the twenty-first century was authored in the twelfth and thirteenth, by troubadours, court poets, writers like Dante; even by crusaders returning from the eastern Mediterranean. How did this devout society come to elevate the experience of sensual love? This course draws on primary sources such as medieval songs, folktales, the &quot;epic rap battles&quot; of the thirteenth century, along with the writings of Boccaccio, Saint Augustine and others, to understand the unexpected connections between love, death, and the afterlife from late antiquity to the fourteenth century. Each week, we will use a literary or artistic work as an interpretive window into cultural attitudes towards love, death or the afterlife. These readings are analyzed in tandem with major historical developments, including the rise of Christianity, the emergence of feudal society and chivalric culture, the crusading movement, and the social breakdown of the fourteenth century.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "31875",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "80-115",
                        "instructors": [
                            {
                                "name": "Phillips, J.",
                                "sunet": "jennarp"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "224545",
        "number": "FRENCH 217",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "218",
        "title": "Literature and the Brain (COMPLIT 138, COMPLIT 238, ENGLISH 118, ENGLISH 218, FRENCH 118, PSYC 126, PSYCH 118F)",
        "description": "How does fiction make us better at reading minds? Why do some TV shows get us to believe two contradictory things at once? And can cognitive biases be a writer's best friend? We'll think about these and other questions in the light of contemporary neuroscience and experimental psychology, with the help of Song of Solomon (Toni Morrison), Madame Bovary (Gustave Flaubert), season 1 of Westworld (Lisa Joy / Jonathan Nolan), and short readings from writers like Louise Gl&uuml;ck, Jorge Luis Borges, Virginia Woolf, and Marcel Proust. We'll also ask what we see when we read; whether the language we speak affects the way we think; and why different people react differently to the same book. Plus: is free will a fiction, or were you just forced to say that?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14448",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            },
                            {
                                "name": "Eagleman, D.",
                                "sunet": "deagle"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "15204",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "212065",
        "number": "FRENCH 218",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "219",
        "title": "Sex, Gender and the Body in Renaissance France (FRENCH 319)",
        "description": "The Renaissance (14-16th c.) was a period of intense exploration: outwards, with the &quot;discovery&quot; and conquest of &quot;new&quot; continents and people; back in time, with the unearthing of Classical texts from antiquity; and inwards, with the first human dissections and the rise of gynecology. From all these experiences emerged multiple models and definitions of gender, conflicting norms of sexualities, and shifting accounts of sexual difference. Bodies became objects of constant scrutiny, speculation, and representation.Scientists, philosophers, writers, theologians, explorers discussed and documented hermaphrodites and animal-human hybrids, trans-gendering, vagrant uterus, male and female cosmic attributes, sexual drives, while poets dabbled in proto-pornography and subverted gender roles.We will look at scientific, literary, and artistic documents from 16th century France to investigate how gender, sex, race, and sexuality intersected in the age of the anatomical gaze.Readings from medical treatises, philosophy, novels (Rabelais), poetry (Sc&egrave;ve, Ronsard, Lab&eacute;), essays (Montaigne), and emblem literature. Taught in French.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29473",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "208575",
        "number": "FRENCH 219",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "220",
        "title": "Rethinking Francophonie in the 21st Century",
        "description": "This course is a critical examination of literature from the Francophone world of the 20th and 21st centuries. Students will travel through time and space with a selection of novels, poems, epics, memoirs, essays, manifestos and short stories. In this historical and cultural journey through Sub-Saharan Africa, North Africa, the Caribbean, Canada, Vietnam and Mauritius, our objective will be to provide a reassessment, of what &quot;Francophonie&quot; means in the 21st century. While exploring francophone societies we will examine several canonical texts together with more recent works and consider their engagement with the historical and political contexts in which they were produced. Topics discussed in the course will include: race and representation, national and cultural identity, immigration and nationalism, transnationalism and diaspora, litt&eacute;rature-monde, language politics, postcolonialism and universalism. Readings will include the works of: Aim&eacute; C&eacute;saire, Lyonnel Trouillot, Edouard Glissant, Boubacar Boris Diop, Alain Mabanckou, Kim Th&uacute;y, Ananda Devi, Fatou Diome, Simone Swartz-Bart, Abdelkader Khatibi, among others. Taught in French.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221735",
        "number": "FRENCH 220",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "221A",
        "title": "Jean-Jacques Rousseau: Politics, Philosophy, and Literature (FRENCH 121)",
        "description": "&quot;Man is born free, and everywhere he is in chains.&quot; This seminar explores the work of one of the most important and enigmatic thinkers about the problems of modern society: Jean-Jacques Rousseau. Students will read a selection of his most important works in dialogue with other important thinkers of his time. They will grapple with Rousseau's political philosophy in his critique of modernity and his vision for remaking politics, as well as his moral philosophy and influential fictional visions of education and love. We will discuss not only Rousseau's landmark contributions to debates about authenticity, transparency, and self-interest, but also his troubling views on gender. The class will conclude with Rousseau's autobiography and its profound meditation on the formation of selfhood. Taught in French.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220736",
        "number": "FRENCH 221A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "228",
        "title": "Science, Technology, and Society and the Humanities in the Face of Looming Disaster (ITALIAN 228, POLISCI 233F)",
        "description": "How STS and the Humanities can together help think out the looming catastrophes that put the future of humankind in jeopardy.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "213654",
        "number": "FRENCH 228",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "228E",
        "title": "Getting Through Proust",
        "description": "Selections from all seven volumes of &quot;In Search of Lost Time&quot;. Focus on issues of personal identity (perspective, memory, life-narrative); interpersonal relations (friendship, love, homosexuality, jealousy, indirect expression); knowledge (objective truth, subjective truth, necessary illusions); redemption (enchantment, disenchantment, re-enchantment); aesthetics (music, painting, fiction); and Proust's own style (narrative sequence, sentence structure, irony, metaphor, metonymy, metalepsis). Taught in English; readings in French or English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29689",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 69600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "214081",
        "number": "FRENCH 228E",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "236",
        "title": "Casablanca - Algiers - Tunis : Cities on the Edge (COMPLIT 236A, CSRE 140S, FRENCH 336, HISTORY 245C, JEWISHST 236A, URBANST 140F)",
        "description": "Casablanca, Algiers and Tunis embody three territories, real and imaginary, which never cease to challenge the preconceptions of travelers setting sight on their shores. In this class, we will explore the myriad ways in which these cities of North Africa, on the edge of Europe and of Africa, have been narrated in literature, cinema, and popular culture. Home to Muslims, Christians, and Jews, they are an ebullient laboratory of social, political, religious, and cultural issues, global and local, between the nineteenth and twenty-first centuries. We will look at mass images of these cities, from films to maps, novels to photographs, sketching a new vision of these magnets as places where power, social rituals, legacies of the Ottoman and French colonial pasts, and the influence of the global economy collude and collide. Special focus on class, gender, and race.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "220414",
        "number": "FRENCH 236",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "238",
        "title": "Art and the Market (ARTHIST 238C)",
        "description": "This course examines the relationship between art and the market, from Renaissance artisans to struggling Impressionist painters to the globalized commercial world of contemporary art and NFTs. Using examples drawn from France, this course explores the relationship between artists and patrons, the changing status of artists in society, patterns of shifting taste, and the effects of museums on making and collecting art. Students will read a mixture of historical texts about art and artists, fictional works depicting the process of artistic creation, and theoretical analyses of the politics embedded in artworks. They will examine individual artworks, as well as the market structures in which such artworks were produced and bought. The course will be taught in English, with the option of readings in French for departmental majors.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29883",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "218463",
        "number": "FRENCH 238",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "239",
        "title": "The Afterlife of the Middle Ages (FRENCH 339)",
        "description": "Literary works that evoke a medieval past in contrast to a historical present, and critical texts that treat aspects of the medieval or medievalism. How does the concept of medievalism emerge and evolve through the ages? Topics include periodization, philology, critical theory, the study of Gothic architecture, and the use of the term medieval in modern political discourse and postcolonial studies. Authors include Burckhardt, Camille, Chateaubriand, Chr&eacute;tien de Troyes, Didi-Huberman, Jauss, Michelet, Panofsky, Pound, films by Dreyer and Bergman, and contemporary poetry. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "219392",
        "number": "FRENCH 239",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "243",
        "title": "Letter Writing in 17th - and 18th - Century France: A Media Revolution (HISTORY 243F)",
        "description": "This interdisciplinary course examines the evolution of letter-writing practices in seventeenth- and eighteenth-century France through the lens of a media revolution, and highlights the historical roots of contemporary media issues. We will read primary sources such as epistolary manuals, letters by notable early modern letter writers (S&eacute;vign&eacute;, Voltaire, and Catherine the Great), and epistolary novels, as well as secondary scholarship from the fields of cultural history, literary studies, and media studies. Topics include, but are not limited to, innovations to the postal system, the rise of social norms of letter writing, image management, the Republic of Letters and the Enlightenment, social activism through letter writing, the birth of media celebrities, surveillance, and privacy. Readings and discussions in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224402",
        "number": "FRENCH 243",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "246",
        "title": "Body over Mind (FRENCH 346, ITALIAN 346)",
        "description": "How does modern fiction, aided by modern philosophy, give the lie to Descartes' famous &quot;I think therefore I am&quot;? And how does writing convey the desire for a different, perhaps stronger, integration of mind and body? Does the body speak a particular truth that we must learn to hear, that the mind is not always connected to? How do modern metaphors for the mind-body connection shape our experience? These questions will be explored via the works of major French and Italian writers and thinkers, including Pirandello, Calvino, Camus, Houellebecq, Sartre, and Agamben.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "218133",
        "number": "FRENCH 246",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "248",
        "title": "Cinema and the Real: Italian Neo-Realism and the French New Wave (FRENCH 148, ITALIAN 148, ITALIAN 248)",
        "description": "Between the 1940s and 1960s, in Italy and France, a handful of movie directors revolutionized the art of cinema. In the wake of World War II they entirely re-defined the aesthetics of the 7th art in films such as &quot;Bicycle Thieves,&quot; &quot;400 Blows,&quot; &quot;Rome Open City,&quot; and &quot;Breathless.&quot; These works shared an aesthetic and a philosophy of &quot;the real&quot; - they eschewed big studios and sets in favor of natural light, on-location shooting, and non-professional actors to capture the present moment. This survey course will explore how the dialogue between Italian neo-realism and the French New Wave has yielded some of the most revolutionary filmic masterpieces of both traditions, while raising theoretical and philosophical questions about form, time, space, fiction, representation, and reality. Films: Roberto Rossellini, Vittorio de Sica, Luchino Visconti, Federico Fellini, Fran&ccedil;ois Truffaut, Jean-Luc Godard, Alain Resnais and Agn&egrave;s Varda.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222486",
        "number": "FRENCH 248",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "249",
        "title": "The Algerian Wars (CSRE 249, HISTORY 239G, JEWISHST 249)",
        "description": "From Algiers the White to Algiers the Red, Algiers, the Mecca of the Revolutionaries in the words of Amilcar Cabral, this course offers to study the Algerian Wars since the French conquest of Algeria (1830-) to the Algerian civil war of the 1990s. We will revisit the ways in which the war has been narrated in literature and cinema, popular culture, and political discourse. A special focus will be given to the Algerian War of Independence (1954-1962). The course considers the racial representations of the war in the media, the continuing legacies surrounding the conflict in France, Africa, and the United States, from Che Guevara to the Black Panthers. A key focus will be the transmission of collective memory through transnational lenses, and analyses of commemorative events and movies. nReadings from James Baldwin, Assia Djebar, Albert Camus, Frantz Fanon, Mouloud Feraoun. Movies include &quot;The Battle of Algiers,&quot; &quot;Days of Glory,&quot; and  &quot;Viva Laldj&eacute;rie.&quot; nTaught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:EC-GlobalCom",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "218406",
        "number": "FRENCH 249",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "250",
        "title": "The Oceanic Novel: Woolf, Conrad, Duras, Tournier, Condé, Ortese (COMPLIT 250B, COMPLIT 350B, FRENCH 350, ITALIAN 250, ITALIAN 350)",
        "description": "This course will examine novels situated by, on, or in the sea.  Its guiding questions: how do the immense breadth and depth of the sea relate to human interiority, self-discovery, and the shadow world of dreams?  Does the sea mark a boundary, or a dissolution of that boundary?  Novels include 'To The Lighthouse,' 'The Secret Sharer,' 'The Sailor from Gibraltar,' 'Friday,' 'Crossing the Mangrove,' and 'The Iguana.'",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223370",
        "number": "FRENCH 250",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "251",
        "title": "Writing, Memory, and the Self (FRENCH 351, ITALIAN 251, ITALIAN 351)",
        "description": "Recent work in psychology and neuroscience emphasizes the narrative quality of the self, as we create it and recreate it through language and writing, shaping memories both personal and historical. This process is circular: we grow into the stories we tell about ourselves, and we tell different stories to fit our changing life experiences. What is the self in the midst of all this? How does it relate to other selves and to the world? This course examines the nature of self, combining the insights of fiction writers (including Luigi Pirandello, Anna Banti, Michel Tournier, Alain Robbe-Grillet, Peter N&aacute;das) with works from philosophy, psychology, medical humanities, and neuroscience (including Edith Wyschogrod, Alexander Nehamas, Ruth Leys, Oliver Sacks). Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "213634",
        "number": "FRENCH 251",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "252",
        "title": "Art and Power: From Royal Spectacle to Revolutionary Ritual (ARTHIST 252A)",
        "description": "From the Palace of Versailles to grand operas to Jacques-Louis David's portraits of revolutionary martyrs, rarely have the arts been so powerfully mobilized by the State as in early modern France. This course examines how the arts were used from Louis XIV to the Revolution in order to broadcast political authority across Europe. We will also consider the resistance to such attempts to elicit shock-and-awe through artistic patronage. By studying music, architecture, garden design, the visual arts, and theater together, students will gain a new perspective on works of art in their political contexts. But we will also examine the libelous pamphlets and satirical cartoons that turned the monarchy&iquest;s grandeur against itself, ending the course with an examination of the new artistic regime of the French Revolution. The course will be taught in English with the option of French readings for departmental majors.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "219350",
        "number": "FRENCH 252",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "254",
        "title": "Animism, Gaia, and Alternative Approaches to the Environment (ANTHRO 254C, HISTORY 254B, HISTORY 354B, REES 254)",
        "description": "Indigenous knowledges have been traditionally treated as a field of research for anthropologists and as mistaken epistemologies, i.e., un-scientific and irrational folklore. However, within the framework of environmental humanities, current interest in non-anthropocentric approaches and epistemic injustice, animism emerged as a critique of modern epistemology and an alternative to the Western worldview. Treating native thought as an equivalent to Western knowledge will be presented as a (potentially) decolonizing and liberating practice. This course may be of interest to anthropology, archaeology and literature students working in the fields of ecocriticism and the environmental humanities/social sciences, students interested in the Anthropocene, geologic/mineral, bio-, eco- and geosocial collectives, symbiotic life-forms and non-human agencies. The course is designed as a research seminar for students interested in theory of the humanities and social sciences and simultaneously helping students to develop their individual projects and thesis.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220631",
        "number": "FRENCH 254",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "256",
        "title": "French Kiss: The History of Love and the French Novel (FRENCH 159, HISTORY 236F)",
        "description": "The history of the French novel is also the history of love. How did individuals experience love throughout history? How do novels reflect this evolution of love through the ages? And, most significantly, how have French novels shaped our own understanding of and expectations for romantic love today? The course will explore many forms of love from the Ancien R&iquest;gime to the 20th century. Sentiment and seduction, passion and desire, the conflict between love and society: students will examine these themes from a historical perspective, in tandem with the evolution of the genre of the novel (the novella, the sentimental novel, the epistolary novel, the 19th-century novel, and the autobiographical novel). Some texts will be paired with contemporary films to probe the enduring relevance of love &quot;&iquest; la fran&iquest;aise&quot; in the media today. Readings include texts by Lafayette, Pr&iquest;vost, Laclos, Dumas fils, Flaubert, Colette, Yourcenar, and Duras. This is an introductory course to French Studies, with a focus on cultural history, literary history, interpretation of narrative, thematic analysis, and close reading. Undergraduate students should enroll for FRENCH159, while graduate students may enroll for FRENCH256. Readings and discussion in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28404",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": "240-201",
                        "instructors": [
                            {
                                "name": "Edmondson, C.",
                                "sunet": "cmhse14"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "223836",
        "number": "FRENCH 256",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "257",
        "title": "Simone Weil, Simone de Beauvoir, Hannah Arendt, and Adriana Cavarero (COMPLIT 257, COMPLIT 357A, FEMGEN 257X, FEMGEN 357X, FRENCH 357, ITALIAN 257, ITALIAN 357)",
        "description": "What does it mean to say the personal is the political, or, in the case of Arendt, that the personal is not political, especially if you are a woman?  This course explores how Weil, De Beauvoir, Arendt, and Caverero contend with the question of personhood, in its variegated social, political, ethical, and gendered dimensions. Particular attention will be given to a philosophy of social change and personal transformation, and to the enduring relevance of these women's thought to issues of our day. Texts include selections from &quot;Gravity and Grace,&quot; &quot;The Second Sex,&quot; &quot;The Ethics of Ambiguity,&quot; &quot;The Human Condition,&quot; &quot;Between Past and Future,&quot; &quot;Stately Bodies,&quot; and &quot;Relating Narratives.&quot;",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217319",
        "number": "FRENCH 257",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "260A",
        "title": "Transcultural Perspectives of South-East Asian Music and Arts (COMPLIT 148, COMPLIT 267, MUSIC 146N, MUSIC 246N)",
        "description": "This course will explore the links between aspects of South-East Asian cultures and their influence on modern and contemporary Western art and literature, particularly in France; examples of this influence include Claude Debussy (Gamelan music), Jacques Charpentier (Karnatak music), Auguste Rodin (Khmer art) and Antonin Artaud (Balinese theater). In the course of these interdisciplinary analyses - focalized on music and dance but not limited to it - we will confront key notions in relation to transculturality: orientalism, appropriation, auto-ethnography, nostalgia, exoticism and cosmopolitanism. We will also consider transculturality interior to contemporary creation, through the work of contemporary composers such as Tran Kim Ngoc, Chinary Ung and T&ocirc;n-Th&acirc;t Ti&ecirc;t. Viewings of sculptures, marionette theater, ballet, opera and cinema will also play an integral role. To satisfy a Ways requirement, this course must be taken for at least 3 units. WIM credit in Music at 4 units and a letter grade.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14267",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Braun 105",
                        "instructors": [],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220852",
        "number": "FRENCH 260A",
        "units": [
            2,
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "261",
        "title": "War and Peace: Writings by and about Veterans in the 20th and 21st Centuries (FRENCH 361, ITALIAN 261, ITALIAN 361)",
        "description": "Since the aftermath of World War One, and with increasing urgency in contemporary America, stories about and by veterans are assigned a double role: that of exposing the horror of war yet also defending the possibility of a just war, and that of healing both veterans themselves and the society they return to. Key questions for this course are: Given the current practice of using writing and the hero&iquest;s journey as a model for healing veterans and making their voices heard in our culture, can we look back to post-World-War-One culture and see if writing fulfills a similar function? And given how many post-World-War-One veterans became famous writers, how do we assess the interplay between literature, poetry, memoir, journalism, personal letters, photo accounts? Is there a connection between artistic innovation and the capacity to heal?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219348",
        "number": "FRENCH 261",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "262",
        "title": "Symbolism in Literature and the Arts (FRENCH 362, ITALIAN 262, ITALIAN 362)",
        "description": "This course will deal with the some of the 19th and 20th century authors and artists  associated with Symbolism. We will focus on some key theoretical essays about the symbol, as well as on symbolist poetry, novels, visual arts, cinema, and music. In reading authors such as Coleridge, Blake, Poe, Baudelaire, Rimbaud, Verlaine, Mallarm&eacute;, Val&eacute;ry, Pascoli, Campana, d&iquest;Annunzio, and Savinio, we will explore the nature and uses of the symbol in art.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220706",
        "number": "FRENCH 262",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "264E",
        "title": "Global Black Diaspora Studies (AFRICAAM 264, COMPLIT 264, CSRE 265)",
        "description": "Taking a plural and comparative hemispheric approach to understanding relations among historical and contemporary constructions of diasporas in the Caribbean, Latin America, Europe, and the United States as well as Black experiences across different cultures and contexts, this course serves as a foundation work in AAAS.  Through examinations of hemispheric and other Black histories, literatures, cultural practices, and philosophies, and societies, students will reconsider borders imposed upon geographies, the dynamics of migration and settlement, the reality of m&eacute;tissage and Third Culture Kids, languages, and demographics, as well as how, out of necessity, Afrodescendant populations have forged lives beyond these various contexts. Topics include comparative colonialisms and imperialisms, modernity and empire, migration and diaspora, feminist and queer movements, and political struggle and revolution.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14201",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "221748",
        "number": "FRENCH 264E",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "265",
        "title": "The Problem of Evil in Literature, Film, and Philosophy (POLISCI 338E)",
        "description": "Conceptions of evil and its nature and source, distinctions between natural and moral evil, and what belongs to God versus to the human race have undergone transformations reflected in literature and film. Sources include Rousseau's response to the 1755 Lisbon earthquake; Hannah Arendt's interpretation of Auschwitz; G&uuml;nther Anders' reading of Hiroshima; and current reflections on looming climatic and nuclear disasters. Readings from Rousseau, Kant, Dostoevsky, Arendt, Anders, Jonas, Camus, Ricoeur, Houellebeck, Girard. Films by Lang, Bergman, Losey, Hitchcock.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "208628",
        "number": "FRENCH 265",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "269",
        "title": "Transfigurative Lyric: Baudelaire and Mallarmé",
        "description": "What happens when injustice runs rampant, when democracy fails, and when it's no longer possible to believe in ancient forms of faith? Can lyric poetry console? Can it inspire? Can it re-enchant a disenchanted world? Together we'll read some of the most powerful poetry from late-nineteenth-century France, including what may possibly be the greatest 100-word sonnet ever written. (Poems to be read in French; discussion to be held in English.) We'll think about what modernity is, how &quot;modernist&quot; forms were born, when writers turned away from nature and toward artifice, why poets started trying to outdo music, whether it's possible to fool oneself knowingly, who's left when a lyric poet strives for &quot;impersonality,&quot; and which poems have the greatest chance of saving our lives. The class may even serve as our own little haven, twice a week, from the growing chaos around us.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224256",
        "number": "FRENCH 269",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "272",
        "title": "Body Doubles: From the Fantastic Short Story to Science-Fiction (FRENCH 372, ITALIAN 272, ITALIAN 372)",
        "description": "How do we imagine our bodies through language, at times almost completely refashioning a physical double, be it idealized or abject? How do such body doubles intersect with our sense of self, defining or redefining sexual identity, spiritual aspirations, illness and recovery, and the senses themselves, as our window into reality? This course focuses on short stories from the late 19th- and early 20th-century fantastic genre, and science fiction stories from the following turn of the century, 100 years later: in these revealing instances, body doubles often seem to acquire a will of their own, overwhelming normal physical identity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219349",
        "number": "FRENCH 272",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "279",
        "title": "How the French Reinvented Cinema: The New Wave (FRENCH 379)",
        "description": "Focus on the French New Wave's cinematic revolution of 1959-1962. In a few years, the Nouvelle Vague delivered landmark works such as Truffaut's 400 Blows, Godard's Breathless, Chabrol's The Cousins or Resnais' Hiroshima mon amour, and changed forever the way we make and think about movies. Why did these films look so radically fresh? What do they say about France's youth culture in the early 60s? How is the author's theory behind them still influencing us today? Focus is on cultural history, aesthetic analysis, interpretation of narrative, sound and visual forms. Graduate and Junior/Senior level. Taught in English. NOTE: Class meets Thursday 1:30-4:20pm; film screenings Monday 6:00-8:50pm in room 540-108",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220717",
        "number": "FRENCH 279",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "281",
        "title": "Women in Africa and the Caribbean: Tales of Agency",
        "description": "This course explores forms of women&iquest;s agency in African and Caribbean cultural productions. Drawing on literature, visual art and feminist theory we will grapple with the concept of agency in different socio-historical and economic contexts while examining texts and films at the intersection of race, gender and agency. In addition to considering the acts of subversion, negotiation, resistance and transgression, throughout the semester, our investigations of gendered agency will pay particular attention to creativity as a tool to challenge power relations specific to each context explored. Topics include race, class, nationalism, m&eacute;tissage, oral tradition, Afro-Caribbean religions, sexuality, marriage, food and the body. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222498",
        "number": "FRENCH 281",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "285",
        "title": "Texts and Contexts: French-English Translation (COMPLIT 285, CSRE 285, FRENCH 185)",
        "description": "This course introduces students to the ways in which translation has shaped the image of France and the Francophone world. What texts and concepts were translated, how, where, and to what effect? Students will work on a translation project throughout the quarter and translate texts from French to English and English to French. Topics may include the role of translation in the development of cultures; the political dimension of translation, translation in the context of migration, and the socio-cultural frameworks that shape translations. Case studies: Camus, Chamoiseau, Djebar, Fanon, Sow Fall, Proust. Prior knowledge of French language required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "221744",
        "number": "FRENCH 285",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "286",
        "title": "Poetry and Philosophy (FRENCH 386, ITALIAN 286, ITALIAN 386)",
        "description": "When and why do philosophers resort to poetry?nWhat is the relationship between poetic metaphor and philosophical argumentation?nWhy is the poetic often associated with empathy - recently touted as an essential human characteristic -  whereas philosophy is considered more objective?nWhat is poetry's role in the pursuit of wisdom or the good life?nAuthors include Nietzsche, Heidegger, Bataille, Agamben, Ricoeur, Derrida, Irigaray, Wyschogrod, and Cavarero.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220716",
        "number": "FRENCH 286",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "287",
        "title": "Sex, Gender, and Violence: French and Francophone Women Writers Today (FEMGEN 187X, FEMGEN 287X, FEMGEN 387X, FRENCH 187, FRENCH 387)",
        "description": "Long before the 2017 #Metoo campaign, French women writers have explored through powerful fictions and autobiographies the different shades of economic, social, psychological, physical, or sexual violence that is exerted against, but also by and between, women. How does literature - the power of words - address, deconstruct or comfort power dynamics (during sex and between the sexes) that are usually silenced, taboo or unspeakable? Themes explored: sex and gender, sex and power, rape culture, sexual and moral taboos (incest, abortion, pornography, infanticide, lesbianism), the body as social stigma or source of meaning. Special attention given to narrative and descriptive strategies designed to avert, expose, deconstruct or account for specifically feminine experiences (rape, orgasm, pregnancy). Authors include Nobel Prize Annie Ernaux, Virginie Despentes, Marie Darrieusecq, Christine Angot, Marie NDiaye, Leonora Miano, Leila Slimani, Vanessa Springora along with feminist theory. Discussion in English. Readings in French or English, students choice",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29345",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "200-201",
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "219565",
        "number": "FRENCH 287",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "288",
        "title": "Women, Wheat, and Weather? Lessons from Italy and the Global South for the 21st Century (COMPLIT 188A, COMPLIT 288, FRENCH 188, ITALIAN 188, ITALIAN 288)",
        "description": "The Global South - a symbolic Mediterranean stretching from the Caribbean to India - lures the civilized man with the promise of excellent weather, voluptuous women, and good food. Already in antiquity, Sicily, the southernmost province of what is today modern Italy, was known as &quot;the granary of Rome,&quot; supplying the Empire with wheat. Still today, the South is associated with vacation, underdevelopment, superstition, the mafia, la dolce vita: &quot;The South is the problem; the North the solution,&quot; Boaventura de Sousa Santos succinctly puts it. In this course, we will move beyond the three W's by focusing on Italy from the point of view of &quot;Southern Thought&quot; (&quot;pensiero meridiano&quot;). We will read 20th/21st-century literary, philosophical, anthropological, and sociological texts from the Global South (Franco Cassano, Roberto M. Dainotto, Salman Rushdie, Gayatri Spivak, de Sousa Santos, Frantz Fanon, Homi Bhabha, Achille Mbembe, Carla Lonzi) to discuss such relevant topics as community and belonging (Elena Ferrante), technology and globalization (Luigi Pirandello; Fernando Pessoa), virus and contagion (Albert Camus), as well as race and gender (Igiaba Scego) from a Southern critical perspective. What counterhegemonic, non-binary, and renewable alternatives do the south of Italy and the Global South in general offer to understand these issues, and to the Western and Northern European emphasis on reason (the Cartesian &quot;cogito&quot;), individualism, and objectivity? We will have guest speakers from the Council of the EU and USAID specialized in international development, as well as conversations with authors. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223590",
        "number": "FRENCH 288",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "290",
        "title": "Magic, Science, and Religion (COMPLIT 290A, COMPLIT 390A, FRENCH 390, ITALIAN 290, ITALIAN 390)",
        "description": "With the rise of the human sciences in the later nineteenth century, &quot;magic,&quot; &quot;science,&quot; and &quot;religion&quot; came to be understood as entirely separate domains, with different versions of truth and divergent methods of inquiry. But how has this division broken down in the past 150 years? How is it, for example, that other people's religion is &quot;merely magic&quot;? How does science still draw on religious categories, in particular to claim the universe is meaningful? How have new forms of magic shaped new age, global culture? We will examine these questions by pairing literary texts with readings from anthropology, history of science, religious studies, and cultural criticism. This course is taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221747",
        "number": "FRENCH 290",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "291",
        "title": "Women in Contemporary French and Francophone Cinema (FRENCH 391)",
        "description": "Women as objects and subjects of the voyeuristic gaze inherent to cinema. The evolution of female characters, roles, actresses, directors in the French film industry from the sexual liberation to #metoo. Women as archetypes, icones, images, or as agents and subjects. Emphasis on filmic analysis: framing, point of view, narrative, camera work as ways to convey meaning. Themes include: sexualization and desire; diversity and intersectionality in films; new theories of the female gaze; gender, ethnicity and class. Filmmakers include Roger Vadim, Agn&egrave;s Varda, Luis Bu&ntilde;uel, Claude Chabrol, Colline Serreau, Elena Rossi, Tonie Marshall, Houda Benyamina, El&eacute;onore Pourriat, C&eacute;line Sciamma, Mati Diop. VISIT BY FILM DIRECTORS Elena Rossi and Sciamma (pending). Films in French with subtitles; discussion in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223368",
        "number": "FRENCH 291",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "292",
        "title": "Romancing the Stone: Crystal Media from Babylon to Superman (ARTHIST 292, ARTHIST 492, FRENCH 392)",
        "description": "This seminar investigates the importance of rock crystal and its imitations as material, medium, and metaphor from antiquity until modernity. The objects examined include rings, reliquaries, lenses, and the Crystal Aesthetic in early twentieth-century architecture and even Superman's Fortress of Solitude. The texts range from Pliny to Arabic Poetry to Romance Literature to modern manifestos.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221414",
        "number": "FRENCH 292",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "305",
        "title": "Songs of Love and War: Gender, Crusade, Politics (FEMGEN 205, FRENCH 205, ITALIAN 205, ITALIAN 305)",
        "description": "The course examines the medieval love lyric tradition, including the troubadours, trouv&egrave;res, and the Italian dolce stil nuovo. Focus on how to understand this tradition in the context of other non-Western lyric and its performative and material contexts such as manuscripts. Study of female lyrics, secondary readings on voice, lyric theory, and medieval textuality. Will be taught in English.  FRENCH 205 fulfills DLCL 121: Performing in the Middle Ages core course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "214149",
        "number": "FRENCH 305",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "307A",
        "title": "Proust and His World (COMPLIT 307)",
        "description": "This course is a chance to read together Proust's &lt;e&gt;A la recherche du temps perdu&lt;/e&gt;.  This seven-volume novel is a stylistic tour de force, a brilliant meditation on defining elements of modernity, and an eccentric meander through art, history and the self.  We will look closely at Proust's narrative edifice, and its poetic achievements.  We will augment our reading of the novel with secondary selections that enable us to explore the many themes and questions raised by the work, ranging from fashion as a serious mode of modern expression to the phenomenology of memory to the decadence of French culture on the eve of the First World War.  We'll look at the importance of Proust for structuralist and post-structuralist critics of the 1960s-1980s, whose paradigms continue to resonate today.  We'll also consider together the interest and limits of a single-author course, and the value of absorptive, &quot;slow&quot; reading in our multi-tasking era. Supplementary readings might include selections from Charles Baudelaire, John Ruskin, Henri Bergson, G&eacute;rard Genette, Gilles Deleuze, Eve Sedgwick, Maurice Samuels, and Caroline Weber.  Reading knowledge of French strongly recommended.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221508",
        "number": "FRENCH 307A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "310",
        "title": "French Painting from Watteau to Monet (ARTHIST 110, ARTHIST 310, FRENCH 110)",
        "description": "This course offers a survey of painting in France from 1700 to around 1900. It introduces major artists, artworks, and the concepts used by contemporary observers and later art historians to make sense of this extraordinarily rich period. Overarching themes discussed in the class will include the dueling legacies of coloristic virtuosity and classical formalism, new ways of representing visual perception, the opposing artistic effects of absorption and theatricality, the rise and fall of official arts institutions, and the participation of artists and artworks in political upheaval and social change. The course ends with an interrogation of the concept of modernity and its emergence out of dialogue and conflict with artists of the past. Students will learn and practice formal analysis of paintings, as well as interpretations stressing historical context.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220313",
        "number": "FRENCH 310",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "314",
        "title": "Pirandello, Sartre, and Beckett (COMPLIT 281E, COMPLIT 381E, FRENCH 214, ITALIAN 214, ITALIAN 314)",
        "description": "In this course we will read the main novels and plays of Pirandello, Sartre, and Beckett, with special emphasis on the existentialist themes of their work. Readings include The Late Mattia Pascal, Six Characters in Search of an Author, Henry IV; Nausea, No Exit, &quot;Existentialism is a Humanism&quot;; Molloy, Endgame, Krapp's Last Tape, Waiting for Godot. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "215495",
        "number": "FRENCH 314",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "317",
        "title": "Love, Death and the Afterlife in the Medieval West (FRENCH 217, HISTORY 217D, HISTORY 317D, ITALIAN 217, ITALIAN 317)",
        "description": "Romantic love, it is often claimed, is an invention of the High Middle Ages. The vocabulary of sexual desire that is still current in the twenty-first century was authored in the twelfth and thirteenth, by troubadours, court poets, writers like Dante; even by crusaders returning from the eastern Mediterranean. How did this devout society come to elevate the experience of sensual love? This course draws on primary sources such as medieval songs, folktales, the &quot;epic rap battles&quot; of the thirteenth century, along with the writings of Boccaccio, Saint Augustine and others, to understand the unexpected connections between love, death, and the afterlife from late antiquity to the fourteenth century. Each week, we will use a literary or artistic work as an interpretive window into cultural attitudes towards love, death or the afterlife. These readings are analyzed in tandem with major historical developments, including the rise of Christianity, the emergence of feudal society and chivalric culture, the crusading movement, and the social breakdown of the fourteenth century.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "31876",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "80-115",
                        "instructors": [
                            {
                                "name": "Phillips, J.",
                                "sunet": "jennarp"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224545",
        "number": "FRENCH 317",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "319",
        "title": "Sex, Gender and the Body in Renaissance France (FRENCH 219)",
        "description": "The Renaissance (14-16th c.) was a period of intense exploration: outwards, with the &quot;discovery&quot; and conquest of &quot;new&quot; continents and people; back in time, with the unearthing of Classical texts from antiquity; and inwards, with the first human dissections and the rise of gynecology. From all these experiences emerged multiple models and definitions of gender, conflicting norms of sexualities, and shifting accounts of sexual difference. Bodies became objects of constant scrutiny, speculation, and representation.Scientists, philosophers, writers, theologians, explorers discussed and documented hermaphrodites and animal-human hybrids, trans-gendering, vagrant uterus, male and female cosmic attributes, sexual drives, while poets dabbled in proto-pornography and subverted gender roles.We will look at scientific, literary, and artistic documents from 16th century France to investigate how gender, sex, race, and sexuality intersected in the age of the anatomical gaze.Readings from medical treatises, philosophy, novels (Rabelais), poetry (Sc&egrave;ve, Ronsard, Lab&eacute;), essays (Montaigne), and emblem literature. Taught in French.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31487",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "208575",
        "number": "FRENCH 319",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "321",
        "title": "Giambattista Vico (COMPLIT 221, FRENCH 212, ITALIAN 221, ITALIAN 321)",
        "description": "An intensive reading of Vico's book - New Science.  Emphasis will be on Vico's philosophy of history and theories of poetic wisdom, myth, and language.  Vico will be put in dialogue with Ren&eacute; Descartes, Rousseau, Auguste Compte, Claude L&eacute;vi Strauss, and Paul Feyerabend, whose ideas about myth and science converge in striking ways with Vico's.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220703",
        "number": "FRENCH 321",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "324",
        "title": "Before the Global South: The Avant-Garde and the Quest for New Knowledges in the Premodern (COMPLIT 324)",
        "description": "Contemporary Brazilian, Caribbean, European, and American writers and artists who engage with media, forms, and temporalities of premodern cultures as they develop new epistemologies of the Global South. Readings include Augusto de Campos, Roberto Dainotto, Edouard Glissant, Ezra Pound, Boaventura de Sousa Santos, Zrinka Stahuljak, Eliot Weinberger.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223479",
        "number": "FRENCH 324",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "328",
        "title": "Literature, Narrative, and the Self (COMPLIT 328, ITALIAN 328)",
        "description": "It is often said that &quot;life is a narrative,&quot; or that &quot;we live our lives in stories.&quot; But is this true? Do we always live our lives as narratives? Could we fail to live our lives as narratives? Could we choose not to live our lives as narratives? Even for those who do see their life as a story, will any old narrative do, or is there something special about the examples provided by the literary tradition? How does literary genre factor in? What is closure? And why are middles what they are? Readings from Appiah, Aristotle, Camus, Hume, Nietzsche, Simmel, G. Strawson, Velleman; Brooks, Woloch; Kahneman, Sacks; Shakespeare, Balzac, Sartre, Beckett, Calvino, Levi, Morrison. Films by Ephron, Kaufman, Polley. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32295",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214160",
        "number": "FRENCH 328",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "329",
        "title": "Rethinking Francophone Literature in the 21st Century (CSRE 329)",
        "description": "This course is a critical examination of literature from the Francophone world of the 20th and 21st centuries. Students will travel through time and space with a selection of novels, poems, essays, and short stories. In this historical and cultural journey through Sub-Saharan Africa, North Africa, the Caribbean, Canada, Vietnam and Mauritius, our objective will be to provide a reassessment of what Francophone studies mean in the 21st century. Topics discussed in the course will include race and representation, national and cultural identity, immigration and nationalism, transnationalism and diaspora, &quot;litt&eacute;rature-monde,&quot; the politics of language, postcolonialism and universalism. Readings will include the works of Dani Laferri&egrave;re, Bessora, Ken Bugul, Alain Mabanckou, Kim Th&uacute;y, Ananda Devi, Abdourahman Waberi, V&eacute;ronique Tadjo and Abdelkebir Khatibi. Taught in French.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222488",
        "number": "FRENCH 329",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "336",
        "title": "Casablanca - Algiers - Tunis : Cities on the Edge (COMPLIT 236A, CSRE 140S, FRENCH 236, HISTORY 245C, JEWISHST 236A, URBANST 140F)",
        "description": "Casablanca, Algiers and Tunis embody three territories, real and imaginary, which never cease to challenge the preconceptions of travelers setting sight on their shores. In this class, we will explore the myriad ways in which these cities of North Africa, on the edge of Europe and of Africa, have been narrated in literature, cinema, and popular culture. Home to Muslims, Christians, and Jews, they are an ebullient laboratory of social, political, religious, and cultural issues, global and local, between the nineteenth and twenty-first centuries. We will look at mass images of these cities, from films to maps, novels to photographs, sketching a new vision of these magnets as places where power, social rituals, legacies of the Ottoman and French colonial pasts, and the influence of the global economy collude and collide. Special focus on class, gender, and race.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220414",
        "number": "FRENCH 336",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "338",
        "title": "The Gothic in Literature and Culture (COMPLIT 338)",
        "description": "This course examines the Gothic as a both a narrative subgenre and an aesthetic mode, since its 18th century invention. Starting with different narrative genres of Gothic expression such as the Gothic novel, the ghost tale, and the fantastic tale by writers such as Walpole, Radcliffe, Sade, Poe, and E.T.A. Hoffmann, the course goes on to ask how the Gothic sensibility permeates a wide range of 19th century cultural phenomena that explore the dark side of Enlightenment, from Romantic poetry and art to melodrama, feuilleton novels, popular spectacles like the wax museum and the morgue.  If time permits, we will also ask how the Gothic is updated into our present in popular novels and cinema.  Critical readings will examine both the psychology of the Gothic sensibility and its social context, and might be drawn from theorists such as Benjamin,  Freud, Lacan, Kristeva, and Zizek.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29396",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214439",
        "number": "FRENCH 338",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "339",
        "title": "The Afterlife of the Middle Ages (FRENCH 239)",
        "description": "Literary works that evoke a medieval past in contrast to a historical present, and critical texts that treat aspects of the medieval or medievalism. How does the concept of medievalism emerge and evolve through the ages? Topics include periodization, philology, critical theory, the study of Gothic architecture, and the use of the term medieval in modern political discourse and postcolonial studies. Authors include Burckhardt, Camille, Chateaubriand, Chr&eacute;tien de Troyes, Didi-Huberman, Jauss, Michelet, Panofsky, Pound, films by Dreyer and Bergman, and contemporary poetry. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219392",
        "number": "FRENCH 339",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "340",
        "title": "Paris: Capital of the Modern World (FRENCH 140, HISTORY 230C, URBANST 184)",
        "description": "This course explores how Paris, between the eighteenth and twentieth centuries, became the political, cultural, and artistic capital of the modern world. It considers how the city has both shaped and been shaped by the tumultuous events of modern history- class conflict, industrialization, imperialism, war, and occupation. It will also explore why Paris became the major world destination for intellectuals, artists and writers. Sources will include films, paintings, architecture, novels, travel journals, and memoirs. Course taught in English with an optional French section.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "213087",
        "number": "FRENCH 340",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "346",
        "title": "Body over Mind (FRENCH 246, ITALIAN 346)",
        "description": "How does modern fiction, aided by modern philosophy, give the lie to Descartes' famous &quot;I think therefore I am&quot;? And how does writing convey the desire for a different, perhaps stronger, integration of mind and body? Does the body speak a particular truth that we must learn to hear, that the mind is not always connected to? How do modern metaphors for the mind-body connection shape our experience? These questions will be explored via the works of major French and Italian writers and thinkers, including Pirandello, Calvino, Camus, Houellebecq, Sartre, and Agamben.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "218133",
        "number": "FRENCH 346",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "349",
        "title": "Love at First Sight: Visual Desire, Attraction, and the Pleasures of Art (ARTHIST 119, ARTHIST 319, FRENCH 149, ITALIAN 149, ITALIAN 349)",
        "description": "Why do dating sites rely on photographs? Why do we believe that love is above all a visual force? How is pleasure, even erotic pleasure, achieved through looking? While the psychology of impressions offers some answers, this course uncovers the ways poets, songwriters, and especially artists have explored myths and promoted ideas about the coupling of love and seeing. Week by week, we will be reflecting on love as political critique, social disruption, and magical force. And we will do so by examining some of the most iconic works of art, from Dante's writings on lovesickness to Caravaggio's Narcissus, studying the ways that objects have shifted from keepsakes to targets of our cares. While exploring the visual roots and evolutions of what has become one of life's fundamental drives, this course offers a passionate survey of European art from Giotto's kiss to Fragonard's swing that elicits stimulating questions about the sensorial nature of desire and the human struggle to control emotions.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220546",
        "number": "FRENCH 349",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "350",
        "title": "The Oceanic Novel: Woolf, Conrad, Duras, Tournier, Condé, Ortese (COMPLIT 250B, COMPLIT 350B, FRENCH 250, ITALIAN 250, ITALIAN 350)",
        "description": "This course will examine novels situated by, on, or in the sea.  Its guiding questions: how do the immense breadth and depth of the sea relate to human interiority, self-discovery, and the shadow world of dreams?  Does the sea mark a boundary, or a dissolution of that boundary?  Novels include 'To The Lighthouse,' 'The Secret Sharer,' 'The Sailor from Gibraltar,' 'Friday,' 'Crossing the Mangrove,' and 'The Iguana.'",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223370",
        "number": "FRENCH 350",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "351",
        "title": "Writing, Memory, and the Self (FRENCH 251, ITALIAN 251, ITALIAN 351)",
        "description": "Recent work in psychology and neuroscience emphasizes the narrative quality of the self, as we create it and recreate it through language and writing, shaping memories both personal and historical. This process is circular: we grow into the stories we tell about ourselves, and we tell different stories to fit our changing life experiences. What is the self in the midst of all this? How does it relate to other selves and to the world? This course examines the nature of self, combining the insights of fiction writers (including Luigi Pirandello, Anna Banti, Michel Tournier, Alain Robbe-Grillet, Peter N&aacute;das) with works from philosophy, psychology, medical humanities, and neuroscience (including Edith Wyschogrod, Alexander Nehamas, Ruth Leys, Oliver Sacks). Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "213634",
        "number": "FRENCH 351",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "353",
        "title": "Liberté, Égalité, Fraternité: French Political Myths and Concepts (FRENCH 153)",
        "description": "&quot;Libert&eacute;, &eacute;galit&eacute;, fraternit&eacute;,&quot; but also &quot;la&iuml;cit&eacute;,&quot; &quot;diversit&eacute;,&quot; &quot;parit&eacute;,&quot; &quot;universalisme&quot; : the French have forged over the last two centuries key political concepts that are articulated together in a unique way and shape the political consciousness, modes of engagements, aspirations and current debates of what has been called &quot;the most political nation in the world.&quot; Along with mythologies such as the People, the Nation, the providential Leader, or the &quot;enemy from within,&quot; they are at the centre of semantic and political battles, tugged over by the Left, the Right, populist movements, activists and counter-cultures. How did they emerge? How do they apply today? How does theory compare to practices, principles to day-to-day realities? An introduction through case-studies, films, paintings, cartoons, and texts from political theory, history, politics and literature. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221736",
        "number": "FRENCH 353",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "355",
        "title": "The French-Speaking World: Literature, Culture, and Translation (COMPLIT 355)",
        "description": "A survey of literatures and cultures of the French speaking world outside of Europe. We will examine a variety of literary genres as we explore works from the Caribbean, the Maghreb, West Africa, North America, Asia, and the Indian Ocean. Topics include: the politics of language, the making of literary classics, world literature and translation, decolonization, nationalism, gender, sexuality, race, and identity. Taught in French.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30534",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224985",
        "number": "FRENCH 355",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "357",
        "title": "Simone Weil, Simone de Beauvoir, Hannah Arendt, and Adriana Cavarero (COMPLIT 257, COMPLIT 357A, FEMGEN 257X, FEMGEN 357X, FRENCH 257, ITALIAN 257, ITALIAN 357)",
        "description": "What does it mean to say the personal is the political, or, in the case of Arendt, that the personal is not political, especially if you are a woman?  This course explores how Weil, De Beauvoir, Arendt, and Caverero contend with the question of personhood, in its variegated social, political, ethical, and gendered dimensions. Particular attention will be given to a philosophy of social change and personal transformation, and to the enduring relevance of these women's thought to issues of our day. Texts include selections from &quot;Gravity and Grace,&quot; &quot;The Second Sex,&quot; &quot;The Ethics of Ambiguity,&quot; &quot;The Human Condition,&quot; &quot;Between Past and Future,&quot; &quot;Stately Bodies,&quot; and &quot;Relating Narratives.&quot;",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217319",
        "number": "FRENCH 357",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "361",
        "title": "War and Peace: Writings by and about Veterans in the 20th and 21st Centuries (FRENCH 261, ITALIAN 261, ITALIAN 361)",
        "description": "Since the aftermath of World War One, and with increasing urgency in contemporary America, stories about and by veterans are assigned a double role: that of exposing the horror of war yet also defending the possibility of a just war, and that of healing both veterans themselves and the society they return to. Key questions for this course are: Given the current practice of using writing and the hero&iquest;s journey as a model for healing veterans and making their voices heard in our culture, can we look back to post-World-War-One culture and see if writing fulfills a similar function? And given how many post-World-War-One veterans became famous writers, how do we assess the interplay between literature, poetry, memoir, journalism, personal letters, photo accounts? Is there a connection between artistic innovation and the capacity to heal?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219348",
        "number": "FRENCH 361",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "362",
        "title": "Symbolism in Literature and the Arts (FRENCH 262, ITALIAN 262, ITALIAN 362)",
        "description": "This course will deal with the some of the 19th and 20th century authors and artists  associated with Symbolism. We will focus on some key theoretical essays about the symbol, as well as on symbolist poetry, novels, visual arts, cinema, and music. In reading authors such as Coleridge, Blake, Poe, Baudelaire, Rimbaud, Verlaine, Mallarm&eacute;, Val&eacute;ry, Pascoli, Campana, d&iquest;Annunzio, and Savinio, we will explore the nature and uses of the symbol in art.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220706",
        "number": "FRENCH 362",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "365",
        "title": "The Problem of Evil in Philosophy, Literature, and Film",
        "description": "This workshop will explore how the existence of evil in the world has been perceived, felt, analyzed, conceptualized, and dealt with over time, from the 1755 Lisbon earthquake and tsunami to our post-Auschwitz, post-Hiroshima era. We'll take it for granted that &quot;the problem of evil is the guiding force of modern thought&quot; (Susan Neiman, Evil in Modern Thought.) We'll ask why this is apparently no longer the case. Such philosophers as Rousseau, Voltaire, Diderot, Leibniz, Kant, Heidegger, Hannah Arendt, G&uuml;nther Anders, Hans Jonas and Ivan Illich will be our guides. One could argue, however, that theology, metaphysics or moral philosophy are not up to the task of making sense of evil if they are not aided by literature and, today, film. Fiction can often articulate ideas that escape the grasp of philosophy. NOTE: Enrollment is capped and limited to graduate students:  To be considered for enrollment in this course, please submit by March 13, 2020 a letter of motivation fleshing out the state of your own research or reflections in this domain. This letter should be sent to the instructor at jpdupuy@stanford.edu",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221746",
        "number": "FRENCH 365",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "367",
        "title": "Introduction to Apocalyptic Thinking (COMPLIT 376, POLISCI 237R, POLISCI 337R)",
        "description": "At the time of the European Enlightenment, the talk about the end of the world was taken to be a remnant of religious beliefs or the domain of insane people. The rational mind knew how to eliminate those obstacles to continuous scientific and technological progress. Today the situation has radically changed. Science and technology are the places where the end of the world is predicted. Apocalypse is looming. This seminar will explore various fields where this transformation is taking place. The following menaces will be considered: nuclear war, climate change, gene editing, synthetic biology, advanced artificial intelligence. Among the philosophies that will be summoned: the post-Heideggerian critique of technoscience (Hannah Arendt and G&uuml;nther Anders), Hans Jonas' Ethics of the Future, the concept of existential risk (Nick Bostrom) and the instructor's concept of Enlightened Doomsaying. Appeal to literary works and films will be part of the program",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30350",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224366",
        "number": "FRENCH 367",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "368A",
        "title": "Imagining the Oceans (COMPLIT 368A, ENGLISH 368A)",
        "description": "How has Western culture constructed the world's oceans since the beginning of global ocean exploration? How have imaginative visions of the ocean been shaped by marine science, technology, exploration, commerce and leisure? Primary authors read might include Cook, Banks, Equiano, Ricketts, and Steinbeck; Defoe, Cooper, Verne, Conrad, Woolf and Hemingway; Coleridge, Baudelaire, Moore, Bishop and Walcott. Critical readings include Schmitt, Rediker and Linebaugh, Baucom, Best, Corbin, Auden, Sontag and Heller-Roazen. Films by Sekula, Painlev&eacute; and Bigelow. Seminar coordinated with a 2015 Cantor Arts Center public exhibition. Visits to the Cantor; other possible field trips include Hopkins Marine Station and SF Maritime Historical Park.  Open to graduate students only.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216413",
        "number": "FRENCH 368A",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "369",
        "title": "Introduction to the Profession of Literary Studies (COMPLIT 369, DLCL 369, GERMAN 369, ITALIAN 369)",
        "description": "A survey of how literary theory and other methods have been made institutional since the nineteenth century. The readings and conversation are designed for entering Ph.D. students in the national literature departments and comparative literature.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13728",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "300-303",
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "117816",
        "number": "FRENCH 369",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "372",
        "title": "Body Doubles: From the Fantastic Short Story to Science-Fiction (FRENCH 272, ITALIAN 272, ITALIAN 372)",
        "description": "How do we imagine our bodies through language, at times almost completely refashioning a physical double, be it idealized or abject? How do such body doubles intersect with our sense of self, defining or redefining sexual identity, spiritual aspirations, illness and recovery, and the senses themselves, as our window into reality? This course focuses on short stories from the late 19th- and early 20th-century fantastic genre, and science fiction stories from the following turn of the century, 100 years later: in these revealing instances, body doubles often seem to acquire a will of their own, overwhelming normal physical identity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219349",
        "number": "FRENCH 372",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "373",
        "title": "Couture Culture (ARTHIST 273, ARTHIST 473, FRENCH 173)",
        "description": "Fashion, art, and representation in Europe and the US between 1860 and today. Beginning with Baudelaire, Impressionism, the rise of the department store and the emergence of haute couture,  culminating in the spectacular fashion exhibitions mounted at the Metropolitan and other major art museums in recent years. Students participate actively in class discussion and pursue related research projects.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220383",
        "number": "FRENCH 373",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "377",
        "title": "Medieval Lyric: How Lyric Moves (COMPLIT 377, ITALIAN 377)",
        "description": "Through the study of various vernacular premodern traditions, this graduate level course examines the qualities that make texts &quot;lyric&quot; and place them into conversation with contemporary theories of lyric. The course will situate medieval lyric within the critical discourse of poetics, the Global South, the archive, and anachrony. We will consider the movement of verse within and among various material contexts (song, manuscript, artworks, objects, tombstones). Poets considered: troubadours, trouv&egrave;res, Galician-Portugese cantigas d'amigo, Stilnovists, Dante, Petrarchan poetry, Jean Renart, Charles d'Orl&eacute;ans, Villon, Pound, Brazilian Concrete Poetry.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222489",
        "number": "FRENCH 377",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "379",
        "title": "How the French Reinvented Cinema: The New Wave (FRENCH 279)",
        "description": "Focus on the French New Wave's cinematic revolution of 1959-1962. In a few years, the Nouvelle Vague delivered landmark works such as Truffaut's 400 Blows, Godard's Breathless, Chabrol's The Cousins or Resnais' Hiroshima mon amour, and changed forever the way we make and think about movies. Why did these films look so radically fresh? What do they say about France's youth culture in the early 60s? How is the author's theory behind them still influencing us today? Focus is on cultural history, aesthetic analysis, interpretation of narrative, sound and visual forms. Graduate and Junior/Senior level. Taught in English. NOTE: Class meets Thursday 1:30-4:20pm; film screenings Monday 6:00-8:50pm in room 540-108",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220717",
        "number": "FRENCH 379",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "380",
        "title": "Critical Poetics",
        "description": "After recent critiques of &quot;close&quot; methods of literary criticism and reading practices, what claims can we make today about the literary object? Can we ever return to broad and general categories of poetics that were formulated by the major syncretic works of twentieth-century literary criticism by figures such as Auerbach, Curtius, and Frye? This course will discuss recent debates around literariness and concepts of poetics that move past a hermeneutic of suspicion and embrace the productive energies of form and affect produced by literary texts, including new methods of data analysis and concepts of genres in historical time.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220730",
        "number": "FRENCH 380",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "386",
        "title": "Poetry and Philosophy (FRENCH 286, ITALIAN 286, ITALIAN 386)",
        "description": "When and why do philosophers resort to poetry?nWhat is the relationship between poetic metaphor and philosophical argumentation?nWhy is the poetic often associated with empathy - recently touted as an essential human characteristic -  whereas philosophy is considered more objective?nWhat is poetry's role in the pursuit of wisdom or the good life?nAuthors include Nietzsche, Heidegger, Bataille, Agamben, Ricoeur, Derrida, Irigaray, Wyschogrod, and Cavarero.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220716",
        "number": "FRENCH 386",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "387",
        "title": "Sex, Gender, and Violence: French and Francophone Women Writers Today (FEMGEN 187X, FEMGEN 287X, FEMGEN 387X, FRENCH 187, FRENCH 287)",
        "description": "Long before the 2017 #Metoo campaign, French women writers have explored through powerful fictions and autobiographies the different shades of economic, social, psychological, physical, or sexual violence that is exerted against, but also by and between, women. How does literature - the power of words - address, deconstruct or comfort power dynamics (during sex and between the sexes) that are usually silenced, taboo or unspeakable? Themes explored: sex and gender, sex and power, rape culture, sexual and moral taboos (incest, abortion, pornography, infanticide, lesbianism), the body as social stigma or source of meaning. Special attention given to narrative and descriptive strategies designed to avert, expose, deconstruct or account for specifically feminine experiences (rape, orgasm, pregnancy). Authors include Nobel Prize Annie Ernaux, Virginie Despentes, Marie Darrieusecq, Christine Angot, Marie NDiaye, Leonora Miano, Leila Slimani, Vanessa Springora along with feminist theory. Discussion in English. Readings in French or English, students choice",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219565",
        "number": "FRENCH 387",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "390",
        "title": "Magic, Science, and Religion (COMPLIT 290A, COMPLIT 390A, FRENCH 290, ITALIAN 290, ITALIAN 390)",
        "description": "With the rise of the human sciences in the later nineteenth century, &quot;magic,&quot; &quot;science,&quot; and &quot;religion&quot; came to be understood as entirely separate domains, with different versions of truth and divergent methods of inquiry. But how has this division broken down in the past 150 years? How is it, for example, that other people's religion is &quot;merely magic&quot;? How does science still draw on religious categories, in particular to claim the universe is meaningful? How have new forms of magic shaped new age, global culture? We will examine these questions by pairing literary texts with readings from anthropology, history of science, religious studies, and cultural criticism. This course is taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221747",
        "number": "FRENCH 390",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "391",
        "title": "Women in Contemporary French and Francophone Cinema (FRENCH 291)",
        "description": "Women as objects and subjects of the voyeuristic gaze inherent to cinema. The evolution of female characters, roles, actresses, directors in the French film industry from the sexual liberation to #metoo. Women as archetypes, icones, images, or as agents and subjects. Emphasis on filmic analysis: framing, point of view, narrative, camera work as ways to convey meaning. Themes include: sexualization and desire; diversity and intersectionality in films; new theories of the female gaze; gender, ethnicity and class. Filmmakers include Roger Vadim, Agn&egrave;s Varda, Luis Bu&ntilde;uel, Claude Chabrol, Colline Serreau, Elena Rossi, Tonie Marshall, Houda Benyamina, El&eacute;onore Pourriat, C&eacute;line Sciamma, Mati Diop. VISIT BY FILM DIRECTORS Elena Rossi and Sciamma (pending). Films in French with subtitles; discussion in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223368",
        "number": "FRENCH 391",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "392",
        "title": "Romancing the Stone: Crystal Media from Babylon to Superman (ARTHIST 292, ARTHIST 492, FRENCH 292)",
        "description": "This seminar investigates the importance of rock crystal and its imitations as material, medium, and metaphor from antiquity until modernity. The objects examined include rings, reliquaries, lenses, and the Crystal Aesthetic in early twentieth-century architecture and even Superman's Fortress of Solitude. The texts range from Pliny to Arabic Poetry to Romance Literature to modern manifestos.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221414",
        "number": "FRENCH 392",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "392",
        "title": "Women in Contemporary French Cinema (FEMGEN 192, FILMEDIA 112, FRENCH 192)",
        "description": "Women as objects and subjects of the voyeuristic gaze inherent to cinema. The evolution of female characters, roles, actresses, directors in the French film industry from the sexual liberation to #metoo. Women as archetypes, icones, images, or as agents and subjects. Emphasis on filmic analysis: framing, point of view, narrative, camera work as ways to convey meaning. Themes include: sexualization and desire; diversity and intersectionality in films; new theories of the female gaze; gender, ethnicity and class. Filmmakers include Roger Vadim, Agn&egrave;s Varda, Luis Bu&ntilde;uel, Claude Chabrol, Colline Serreau, Elena Rossi, Tonie Marshall, Houda Benyamina, El&eacute;onore Pourriat, C&eacute;line Sciamma. VISIT BY FILM DIRECTORS Elena Rossi and Sciamma (pending).nnFilms in French with subtitles; Discussion in English; 3 units, 4 units or 5 units.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219396",
        "number": "FRENCH 392",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "395",
        "title": "Philosophical Reading Group (COMPLIT 359A, ITALIAN 395)",
        "description": "Discussion of one contemporary or historical text from the Western philosophical tradition per quarter in a group of faculty and graduate students. For admission of new participants, a conversation with Professor Robert Harrison is required. May be repeated for credit. Taught in English.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "126249",
        "number": "FRENCH 395",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "398",
        "title": "Intensive Reading in French/Italian (ITALIAN 398)",
        "description": "Enrollment is limited to French/Italian Ph.D. students.  Course is designed for French/Italian Ph.D. students to prepare for department milestone exams.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "10",
        "unitsMax": "10",
        "sections": [],
        "gers": [],
        "objectID": "215173",
        "number": "FRENCH 398",
        "units": [
            10
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "399",
        "title": "Individual Work",
        "description": "For students in French working on special projects or engaged in predissertation research.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29660",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29370",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10387",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "13661",
                "currentClassSize": "0",
                "maxClassSize": "4",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "31005",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "14832",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "31006",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "15620",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11483",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10388",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11489",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "31250",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10389",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "12087",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "31251",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10390",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "31252",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "31007",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "31253",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "10391",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213804",
        "number": "FRENCH 399",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 29
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "680",
        "title": "Curricular Practical Training",
        "description": "CPT course required for international students completing degree. Prerequisite: French Ph.D. candidate.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224469",
        "number": "FRENCH 680",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "801",
        "title": "TGR Project",
        "description": null,
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [],
        "gers": [],
        "objectID": "214456",
        "number": "FRENCH 801",
        "units": [
            0
        ]
    },
    {
        "year": "2023-2024",
        "subject": "FRENCH",
        "code": "802",
        "title": "TGR Dissertation",
        "description": "Doctoral students who have been admitted to candidacy, completed all required courses and degree requirements other than the University oral exam and dissertation, completed 135 units or 10.5 quarters of residency (if under the old residency policy), and submitted a Doctoral Dissertation Reading Committee form, may request Terminal Graduate Registration status to complete their dissertations.",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "27665",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29661",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29371",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "13187",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "10450",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "13188",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "13189",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "13190",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "11087",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "10451",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "13191",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "11088",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "10452",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "11089",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "31257",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "10453",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "13192",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wittman, L.",
                                "sunet": "lwittman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "14394",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "11090",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "10454",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213807",
        "number": "FRENCH 802",
        "units": [
            0
        ],
        "totalSections": 29
    }
]