[
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "13Q",
        "title": "Humanities Core: Great Books, Big Ideas -- Europe, Modern (DLCL 13Q, HUMCORE 13Q)",
        "description": "This three-quarter sequence asks big questions of major texts in the European and American tradition. What is a good life? How should society be organized? Who belongs? How should honor, love, sin, and similar abstractions govern our actions? What duty do we owe to the past and future? This third and final quarter focuses on the modern period, from the rise of revolutionary ideas to the experiences of totalitarianism and decolonization in the twentieth century. Authors include Locke, Mary Shelley, Marx, Nietzsche, Freud, Weber, Primo Levi, and Frantz Fanon. N.B. This is the third of three courses in the European track. These courses offer an unparalleled opportunity to study European history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future. Students who take HUMCORE 11 and HUMCORE 12Q will have preferential admission to HUMCORE 13Q (a WR2 seminar). **NOTE** This class meets Monday and Wednesday in room 20-22K and Fridays in room 260-113 to attend a lecture along with the other two HUMCORE courses this quarter.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "Writing 2"
        ],
        "objectID": "220691",
        "number": "GERMAN 13Q",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "57N",
        "title": "Nietzsche and the Search for Meaning",
        "description": "Many of us have heard his declarations of the death of God, the arrival of the Superman, and the need to live beyond good and evil.  But what, beyond such sound bites, did Nietzsche actually teach?  How can his writings be understood in the context of their own time?  And what significance might they hold for us today? Taught in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "28057",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "160-323",
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221645",
        "number": "GERMAN 57N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "60N",
        "title": "German Crime",
        "description": "Crime is as old as humanity, as old as storytelling. Cain's murder of Abel, Antigone's burial of Polynices, Robin Hood's robbing from the rich: all of these testify to the ongoing fascination with crime and criminality, and to literature's role in policing, and probing, the boundaries of social legitimacy. This is a course about murders, break-ins, betrayals, sexual infidelity and violence, and crimes against humanity, and the ways those crimes, sometimes moral, sometimes legal, and sometimes not really even exactly criminal, teach us about German and German literature in recent centuries. Course material will include modern and classical crime fiction (Friedrich Glauser, Friedrich D&uuml;rrenmatt, Jakob Arjouni, Thomas Glavinic), crime in novelistic, theatrical and poetic genres (Anna Seghers, Bertolt Brecht, Heinrich von Kleist, Friedrich Schiller), and German-language television and film (Fritz Lang's &quot;M,&quot;Carol Reed's &quot;The Third Man,&quot; &quot;Tatort&quot;). nThis course is for students with good knowledge of German. Students without German can participate in a special section with English language material.nGerman Studies Assistant Professor Lea Pao will teach this course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "219268",
        "number": "GERMAN 60N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "68N",
        "title": "Franz Kafka: Literature and the Modern Human Condition",
        "description": "This class will address major works by Franz Kafka and consider Kafka as a modernist writer whose work reflects on modernity. We will also examine the role of Kafka's themes and poetics in the work of contemporary writers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221649",
        "number": "GERMAN 68N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "75N",
        "title": "Famous Last Words",
        "description": "What would you say if you knew it would be the last thing you would ever say? Who would you want to hear your words? Would you want to inspire somebody? Terrify them? Shout your defiance or your love in their direction?nThis is a course about last words the final utterances left as legacies for the world in the face of revolution, war, betrayal, heartbreak, or that simplest of endings, death. We will look at a wide variety of last words, including last words codified as genres&iquest;quotations, suicide notes, epitaphs, dying declarations, Japanese death poems, confessions, and the like as literary devices (last sentences, envois, punch lines, epilogues), and as forms of social or cultural practice (the making of heroes, idols, and martyrs in religious, political, and popular culture). We will look at fictional last words, real last words, last words spoken by heroes, gods, and ordinary people. And we will end the course, each of us, by writing out our own last words imagining what we each would write, if we had to sum up what mattered most to us, and if we wanted some small selection of signs to stand in, as it has for many of the authors we will read, for our life and the legacy of it.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220496",
        "number": "GERMAN 75N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "97",
        "title": "10 Poems That Will Change Your Life",
        "description": "This course is for anyone who has ever been afraid of poetry, anyone who has ever thought that poems are too difficult to understand, a course for anyone who has fallen in love with poetry before, and for anyone who has used a poem to make a difference in someone's life. You will learn how to read, understand, and if you don't already like poetry. We will read poems from different centuries, different kinds of writers, and different media (paper, computer screens, and even DNA); they will be about loss and love and war and loyalty and bacteria. Some of them will be about you. You will develop interpretive skills that come with this range of poetic forms and structures and will learn how to think about what it means for something to be poetic, whether it is a poem, a Leonard Cohen song, a last minute field goal, or a toilet. Can the poems in this class really change your life? (What would that even mean? We'll discuss.) Maybe; maybe not. But they're certainly going to try.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220518",
        "number": "GERMAN 97",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "101",
        "title": "Germany in 5 Words",
        "description": "This course explores German history, culture and politics by tracing five (largely untranslatable) words and exploring the debates they have engendered in Germany over the past 200 years. This course is intended as preparation for students wishing to spend a quarter at the Bing Overseas Studies campus in Berlin, but is open to everyone. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "216218",
        "number": "GERMAN 101",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "106",
        "title": "Turkish-German Literature, Cinema, and Theater (GERMAN 206)",
        "description": "One in five people in Germany now has, as it is termed, a background of migration. Immigration from Turkey is probably the most prominent not only in terms of its massiveness and demographic consequences, but also for its significant role in changing Germany's overall cultural, social, and economic landscape. In this course, through analyzing selected literary works, films, and plays produced by Turkish-German writers and artists, we will discuss complex ideas like migration, ethnicity, race, religion, gender, and class, resorting not to oversimplifications and binary thinking but instead to relevant literary concepts and formative historical moments which have shaped the Turkish-German experience. Taught in English and German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30070",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Deniz, M.",
                                "sunet": "mdeniz"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222887",
        "number": "GERMAN 106",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "109",
        "title": "The End of Europe (as we know it) - Germany and the Future of the European Union",
        "description": "Europe is struggling with the impact of the sovereign debt crisis of the Eurozone, mass migration, political extremism and xenophobia, external and internal security challenges, as well as political and social needs for reform to mention only some of the most pressing problems. The European Union, a project of an ever closer union of European states with currently 28 members started with the promise to provide peace, stability and prosperity. This narrative attracted new members in five enlargement rounds since the 1970s while today Eurosceptic parties, separatist movements as well as internal and external critics of the EU question the European integration project as such. nnThe course starts with the narrative of the success story of European integration and its achievements. This is followed by an analysis of current crises and future problems. In a third step we will discuss consequences and strategies to deal with challenges for Europe as a whole, as well as the EU and its members in particular. The course will follow ongoing debates within and outside of the EU. It includes global reflections on the state European situation and it makes comparisons with responses to similar challenges in other parts of the world.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "218128",
        "number": "GERMAN 109",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "111",
        "title": "The End of the Western World (as we know it): German Responses to Global Challenges",
        "description": "Germany defines its foreign policy being based on two pillars: being a part of an integrated Europe and belonging to the Western World. For decades, America and Europe have remained closely connected politically, economically, and culturally. This close working relationship, however, now risks coming to an end, or getting substantially weakened. When asked to identify his &quot;biggest foe globally right now,&quot; President Trump put the European Union on the list, along with China and Russia. Not only deeds but already words have far reaching consequences for Germany in a number of respects. The course addresses the question whether &quot;The Western World&quot; is coming to an end and discusses root causes and possible implications. As the course unfolds, we will cover a number of timely topics, including the future of NATO and why multilateralism matters, how an open society can survive the rising tide of populism, how migration is changing demographics and politics on both sides of the Atlantic, and the prospects for finding political solutions to climate change. We will even address German and European approaches to dealing with digitization and the protection of private data. The course will be discussion based, and include a number of illuminating studies; our goal is to increase students' understanding of the major challenges facing the decades-old American-European alliance and how Germany is dealing with them. Students will need no prior knowledge of Germany and the European Union. Knowledge of the American perspective is welcome but not required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220803",
        "number": "GERMAN 111",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "113",
        "title": "German History Through Cinema",
        "description": "Films create historical imaginaries, while themselves also being historical artifacts. This interdisciplinary course investigates how recent German-language cinema (since c. 2000) has thematized and reimagined 20th- and 21st-century German history. How have filmmakers tackled topics such as World War II, the postwar years, divided Germany, reunification, national identity, social inequality and injustice, the experience of migration, and European unity? Directors' approaches to depicting history are diverse, surprising, and often deeply personal. This class provides you with the opportunity to learn about the past and present in Germany, while reflecting on the relationship between film and history. Possible directors to include: Fatih Akin, Ruth Beckermann, Rainer Werner Fassbinder, Florian Henckel von Donnersmarck, Alexander Kluge, Caroline Link, Christian Petzold, Margarethe von Trotta, and Wim Wenders. Taught in German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28538",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "120-314",
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225220",
        "number": "GERMAN 113",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "114",
        "title": "Multicultural Germany in Contemporary Texts",
        "description": "Multiculturalism has become a defining characteristic of contemporary societies, and Germany is one of the most multicultural countries in the world today. This course provides an overview of how immigration has shaped the multicultural landscape of contemporary Germany by looking at written, digital, and audio &quot;texts.&quot; We will read stories and essays; watch films and plays; and listen to pop, rock, rap, and hip-hop by German-speaking musicians with diverse backgrounds and identities. Comparative conversations about multiculturalism in other countries and cultures are welcome.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30569",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Deniz, M.",
                                "sunet": "mdeniz"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225214",
        "number": "GERMAN 114",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "115",
        "title": "The Queer 20th Century: German LGBTQ Literature and Film (FEMGEN 115A, FEMGEN 215A, GERMAN 215)",
        "description": "What was it like to be queer in 20th-century Germany? This course examines the rich and sometimes surprising LGBTQ culture of 20th-century Germany, featuring stories that are often left out of traditional seminars. Through literature and film, we will learn about pioneering gay rights activists, persecution under National Socialism, emancipation movements under capitalism and socialism, and debates that are shaping queer life in contemporary Germany. Taught in English; students of all backgrounds are very welcome.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30075",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "222892",
        "number": "GERMAN 115",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "116",
        "title": "Writing About Germany: New Topics, New Genres",
        "description": "Writing about various topics in German Studies.  Topics based on student interests: current politics, economics, European affairs, start-ups in Germany. Intensive focus on writing. Students may write on their experience at Stanford in Berlin or their internship. Fulfills the WIM requirement for German Studies majors. Taught in English and German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Meeting times by arrangement with professor.",
                "classId": "14360",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Deniz, M.",
                                "sunet": "mdeniz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29653",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Deniz, M.",
                                "sunet": "mdeniz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213567",
        "number": "GERMAN 116",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "120",
        "title": "Contemporary Politics in Germany",
        "description": "This course provides an opportunity to engage with issues and actors, politicians and parties in contemporary Germany, while building German language abilities. We will work with current events texts, news reports, speeches and websites. Course goals include building analytic and interpretive capacities of political topics in today's Europe, including the European Union, foreign policy, and environmentalism. Differences between US and German political culture are a central topic. At least one year German language study required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:EC-GlobalCom",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "217436",
        "number": "GERMAN 120",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "120A",
        "title": "Berlin: Literature and Culture in the 20th Century and Beyond",
        "description": "For much of the twentieth century Berlin has been at the epicentre of geopolitics, the Berlin Wall standing as the physical manifestation of a fragile world order. Huge social and political upheavals in the city have inspired much cultural production. Through novels, poetry, films, speeches and more we will examine the Golden Era of Weimar Berlin, the National Socialist period, the Cold War division, reunification, and the contemporary city. Authors include Keun, D&ouml;blin, Fallada, Schernikau, Wolf, Brussig, Erpenbeck. Taught in German. Prerequisite: GERLANG 3 or permission of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "219336",
        "number": "GERMAN 120A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "120B",
        "title": "Fairy Tales",
        "description": "Fairy tales loom largely in our lives. They are 'weird,' but not shallow or irrelevant: they tell the 'extraordinary' in different traditions and facilitate cross-and transcultural dialogues between them. In this course, we will read German fairy tales from the Grimm Brothers, Novalis, Tieck, Bettina von Arnim, E.T.A. Hoffmann, etc., focus on their connections to the stories in other traditions, and explore their transformations in various media from oral storytelling to films, comic books, and music videos. We will reinterpret these fairy tales by using methodologies derived from psychoanalysis, folklore, gender, and race studies and open a creative environment for your own tales. Taught in German. Prerequisite: GERLANG 3 or permission of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "219682",
        "number": "GERMAN 120B",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "120C",
        "title": "German in Public: 99 German Songs",
        "description": "Germany is the land of Beethoven and Brahms, but has also given the world Marlene Dietrich, Nena, and Rammstein. This course aims to introduce you to a variety of music repertories, and a range of ways through popular songs to think and talk about 200 years of German history, art, culture, and politics. While we explore some of the great &iquest;classics&iquest; of the musical canon in the German speaking countries, we will also discover the social, critical, and political impacts expressed and triggered by folksongs, rock, punk, hip-hop, techno, and heavy metal music. Our focus will be on particular German genres and obsessions by listening not only good songs but also bad ones, very goofy and entertaining pieces. A class to hum along to! Taught in German. Prerequisite: One year of German or permission of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "219662",
        "number": "GERMAN 120C",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "120D",
        "title": "The German Graphic Novel",
        "description": "This course is an introduction to the history, theory, and social life of German graphic novels. We will look at early examples of text-and-image (Sebastian Brant's &quot;Ship of Fools,&quot; a satire published in 1497, Heinrich Hoffmann's &quot;Der Struwwelpeter,&quot; an 1845 children's book detailing various forms of misbehavior in spine-chilling visual detail, or Wilhelm Busch's 1895 tale of the mischievous brothers &quot;Max und Moritz&quot;) and modern and contemporary comics, political caricatures, and graphic novels from Swiss, German, and Austrian artists (Nicolas Mahler, Gerhard Haderer, Manfred Deix, Ulli Lust, Max Goldt, or Anke Feuchtenberger). No prior knowledge of the topic is required. You will develop your German reading, speaking, and writing skills through a variety of short creative assignments and in-class discussions, develop critical reading skills as they attend to specific formal features, and improve your abilities to think historically about the emergence and development of aesthetic forms. Taught in German. Prerequisite: GERLANG 3 or permission of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221646",
        "number": "GERMAN 120D",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "125",
        "title": "Nietzsche: Life as Performance (GERMAN 325, TAPS 152L, TAPS 325)",
        "description": "Nietzsche famously considered that &quot;there is no 'being' behind the deed, its effect, and what becomes of it; the 'doer' is invented as an afterthought - the doing is everything.&quot;  How should we understand this idea of a deed without a doer, how might it relate to performance, and what influence has it had on modern culture?  In order to answer these questions, we will consider Nietzsche's writings alongside some of the artworks that influenced Nietzsche or were influenced by him.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221657",
        "number": "GERMAN 125",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "130",
        "title": "Rainer Maria Rilke: Poetry and the Meaning of Life (COMPLIT 240, GERMAN 233)",
        "description": "One of the greatest poets of the modern era, Rilke offers in his poetry lasting images of nature, love, and aesthetic beauty. At the same time, Rilke's poetry is a unique form of human thought. Many of his poems are poetic meditations on the meaning of human life in a world of great uncertainties. Other poems express poetic wisdom regarding the human condition of finitude, spiritual orientation, and our ability to persevere in the face of pain and loss. This course will serve as an introduction to Rilke's poetry and its place in the modernist canon while discussing its capacity to offer insight, comfort, and hope. NOTE: Enrollment requires Professor Eshel's consent. Please complete the following form to be considered for the class. https://forms.gle/znuNUNhHwpf5pb2EA. Enrollment is limited to 20 students. Students will be notified about their acceptance by March 20th and given a permission code. UPDATE 3/2/23 - There was a problem with the original form. Please edit your response to include your name.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224395",
        "number": "GERMAN 130",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "130A",
        "title": "A History of German Opera",
        "description": "When we think of opera, and perhaps especially German opera, a list of stereotypes immediately springs to mind: tenors who refuse to die, horned helmets and blond braids, an artform so elite that it has lost all relevance in the contemporary world. While not discounting those images, this course will position opera at the center of Germany's historical and cultural development over the past three centuries - from early discussions about the country's place between the more culturally hegemonic Italy and France, to its struggle for unification in the 19th century, to the Third Reich's co-opting of all 'German' forms of expression to serve its ends. We will discuss German opera's link to movements like Romanticism and Expressionism, and to philosophers like Schopenhauer and Nietzsche. Along the way, we will learn how to listen to and talk about this very strange genre, and gain fluency in a range of musical styles and periods. No musical expertise required; taught in German. Prerequisite: GERLANG 21 or instructor permission.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "223502",
        "number": "GERMAN 130A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "131",
        "title": "What is German Literature?",
        "description": "How have migration and minority discourses changed the German literary and cultural tradition? What is German literature today, and how does it differ from the traditional notion of Germany as the land of &quot;Dichter und Denker?&quot; We will read texts by Goethe, Novalis, Annette von Droste-H&uuml;lshoff, Thomas Mann, Kafka, Anna Seghers, Brecht, Christa Wolf, Emine Sevgi &Ouml;zdamar, Yoko Tawada, and Sasha Marianna Salzmann, and discuss such topics as identity formation, race, ethnicity, gender, sexuality, religion, class, and ecocriticism. Taught in German. GERLANG 3 or equivalent required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29129",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "208354",
        "number": "GERMAN 131",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "132",
        "title": "Politics in 20th Century German Literature",
        "description": "Is there a difference between art and propaganda? How do writers express their political values? Who gets to decide what counts as literature? Or who counts as German? This introductory course will focus on these questions and more as we discuss works of prose, poetry, theater, and film from the German-speaking world in the context of 20th century political developments, including the World Wars and the Holocaust, the Cold War and German Reunification, and the rise of multiculturalism. Course materials in the original German include selections from Franz Kafka, Bertolt Brecht, Ingeborg Bachmann, May Ayim, and others. Taught in German. GERLANG 3 or equivalent required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "211523",
        "number": "GERMAN 132",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "133",
        "title": "Marx, Nietzsche, Freud",
        "description": "We read and discuss selections from works by the key master thinkers who have exerted a lasting influence by debunking long-cherished beliefs. Do these authors uphold or repudiate Enlightenment notions of rationality, autonomy and progress? How do they assess the achievements of civilization? How do their works illuminate the workings of power in social and political contexts? Readings and discussion in German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "213827",
        "number": "GERMAN 133",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "134",
        "title": "Migration and Nation in Contemporary Literature",
        "description": "This course focuses on representations of migration in contemporary German-language literature. As a result of the ongoing war in Ukraine, Europe is currently witnessing the largest displacement of humans in a century--and this not far on the heels of 2015, which the UNHCR had previously termed Europe's year of the so-called &quot;refugee crisis.&quot; Yet Germany has a long, painful, and varied history of migration in the twentieth and twenty-first centuries, a history this course explores through three themes: forced migration, labor migration, and political migration. How does literature chronicle experiences of migration, displacement, and resettlement? How does it work to archive, critique, and reimagine German national identity in an age of profound sociopolitical transformation? In addition to shorter texts, we will read a complete novel and also consider the role that recent theater and performance art play in thematizing migration. Authors/artists to include: Irmgard Keun, Hannah Arendt, G&uuml;ney Dal, Herta M&uuml;ller, Rafik Schami, Wladimir Kaminer, Emine Sevgi &Ouml;zdamar, Christoph Schlingensief, Melinda Nadj Abonji, Yoko Tawada, Jenny Erpenbeck, Elfriede Jelinek, Vladimir Vertlib, Ilija Trojanow, and Abbas Khider.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224394",
        "number": "GERMAN 134",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "135",
        "title": "German Conversation (GERMAN 235)",
        "description": "This small, individualized course will offer students the chance to work on their spoken expression and critical thinking, in German. Topics will change each quarter but will span contemporary politics and culture, film, literature, and visual arts. The focus will be on speaking German in small groups, as opposed to formal presentations or written assignments. Students will have the opportunity to pursue topics of personal interest, as well as work collaboratively and individually on projects intended to foster advanced communicative skills.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14299",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Deniz, M.",
                                "sunet": "mdeniz"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14398",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "160-322",
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13710",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222581",
        "number": "GERMAN 135",
        "units": [
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "137",
        "title": "Green Germany",
        "description": "Since the unification of modern Germany in 1871, the history of German environmental movements has been beset with political, cultural, and racial tension. Some of the earliest environmental activists, such as the composer and conservationist Ernst Rudorff, explicitly conceived of conservation as Heimatschutz; or, protection of the homeland. While Rudorff opposed jews and women from participating in the founding of his Heimatschutz organization, the creator of the modern Umwelt concept, the theoretical biologist Jakob von Uexkill, became an early supporter of the Nazi regime. How do we interrogate this disturbing alliance between racial purity, environmental protection, and nation? What does the history of concepts such as Uexkill's Umwelt or Alexander von Humboldt's natural monument, or Naturdenkmal, have to teach policymakers and intellectuals today in the face of environmental crisis? How does does the relationship between race and environment inform current issues about conservation and energy policy in the present? Taught in English with some readings in German.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28537",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Lathrop 190",
                        "instructors": [
                            {
                                "name": "Norton, B.",
                                "sunet": "brnorton"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "225217",
        "number": "GERMAN 137",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "140",
        "title": "German Sports Culture and History",
        "description": "The course highlights specificities and societal contexts of sports in Germany and thus provides a unique point of access for understanding German culture in past and present. Concepts of competition and performance will be examined, as well as the relationships between sports and politics in different periods of modern German history. Special attention will be given to soccer but other spectator sports (cycling, gymnastics (Turnen), etc.) will be studied as well. Materials will include theoretical, literary and journalistic texts in English and German, media representations of athletic contests. To improve writing skills students can write a weekly essay on related themes. Language: German, requirement: one year of college German or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216193",
        "number": "GERMAN 140",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "141",
        "title": "The Magic Mountain: Your Travel Guide to a Great Novel",
        "description": "In this course, students will read their way through one of the great German novels, Thomas Mann's The Magic Mountain (Der Zauberberg, 1924) an epic stock-taking of European thought and sensibility between the world wars. Students will meet and discuss the novel weekly, each time under the guidance of a different tour guide Stanford faculty, superfans and professors from other institutions. No final paper, no readings other than the novel required. All readings in German (though an English translation will be made available), class discussion in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "220797",
        "number": "GERMAN 141",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "141A",
        "title": "Mephisto: Your Travel Guide to a Great Novel",
        "description": "In this course, students will read their way through one of the most disputed German novels in the postwar Federal Republic, Klaus Mann's &quot;Mephisto&quot; (1936 published in exile in Amsterdam) a satirical novel about opportunism and the German theater scene during the NS-Regime. Students will meet and discuss the novel weekly, each time under the guidance of a different tour guide Stanford faculty and professors from other institutions. No final paper, no readings other than the novel required. All readings in German (though an English translation will be made available), class discussion in English. NOTE: This course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221666",
        "number": "GERMAN 141A",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "141C",
        "title": "Gottfried's \"Tristan and Isolde\" - Your Travel Guide to a Great Novel",
        "description": "Does true love have to break with the rules and norms of society? Gottfried's &quot;Tristan and Isolde,&quot; a masterpiece of medieval epic poetry, follows this question through its portrayal of a tragic romance. The course will close-read, analyze and discuss this milestone of German literature, focusing in particular on its notions of love, loyalty, fate, and honor. Later sessions will also include modern adaptations of the Tristan story. Contributions by invited guest speakers and experts will provide different perspectives for us to discuss.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222580",
        "number": "GERMAN 141C",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "142",
        "title": "Feminist Avant Garde (GERMAN 342)",
        "description": "Feminist Avant Garde",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222350",
        "number": "GERMAN 142",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "144",
        "title": "German Media Theory (FILMEDIA 270, FILMEDIA 470, GERMAN 344)",
        "description": "In this seminar, we will interrogate major currents in media-theoretical work from the German-speaking world from the 1980s to today. Starting from the surprisingly controversial term 'German media theory' itself, which has been described as 'neither a theory nor really centered on media, [while] its Germanness is a contested issue' - we will consider the characteristics that nevertheless make this a recognizable, if internally heterogeneous, category for thinking about media, mediation, and culture. We will pay special attention to the foundational work of Friedrich Kittler, which ranges across literature, film, philosophy, and computers, before turning to the current differentiation into a technology-focused 'media archaeology' (Wolfgang Ernst) and the differently inflected formation of 'cultural techniques' (Bernhard Siegert), as well as recent articulations of 'media philosophy' and other developments in contemporary theory. We will also examine the often absent and/or fraught role of gender, race, and class in this field, as well as attempts to address these issues by such theorists as Ute Holl, Cornelia Vissman, Astrid Deuber-Mankowsky, Annette Bitsch, and Sybille Kr&auml;mer. Readings will be in English translation. Knowledge of German is therefore not required, but readers of German will find plenty of research opportunities among the many as yet untranslated texts that make up the field of German media theory.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223569",
        "number": "GERMAN 144",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "147",
        "title": "The Conservative Revolution (GERMAN 347)",
        "description": "Rapid modernization in early twentieth-century Germany elicited various conservative criticisms, which became particularly acute after the First World War. The thinkers of the Conservative Revolution gave voice to post-Nietzschean concerns about cultural transformation, combining traditionalist and anti-traditionalist positions. Its legacy anticipates current discussions regarding post-modernity, post-democracy, and the impact of technological change. Texts by authors such as: J&uuml;nger, Heidegger, Hofmannsthal, Borchardt, Mann, Arendt, Marcuse. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219326",
        "number": "GERMAN 147",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "149",
        "title": "Babylon Berlin",
        "description": "Berlin, 1929. A police inspector and his unlikely partner, a typist and aspiring homicide detective, turn up the case of a lifetime: a far-reaching political conspiracy in the capital of a democracy on the edge. Part noir detective thriller, part historical drama, the blockbuster German television series Babylon Berlin (2017) will serve as our springboard to understand the culture, politics, and society of the Weimar Republic (1918,1933), a fifteen-year experiment in democracy that preceded the rise of the Third Reich. From corruption and criminality to sociopolitical upheaval and a remarkable arts scene: Berlin of the Roaring Twenties, a study in contrasts and conflicts, had it all. Does the Netflix hit harbor, almost eerie parallels to the present, as one German newspaper recently suggested?  Weekly viewings of the complete seasons one and two will be accompanied by close study of the era's literature, cinema, and visual arts. Readings will include texts by Alfred D&ouml;blin, Hans Fallada, Erich K&auml;stner, Mascha Kal&eacute;ko, Irmgard Keun, Siegfried Kracauer, Gabriele Tergit, and Kurt Tucholsky. Throughout the term we will also pay careful attention to the media-theoretical implications of the series: What is 'quality TV?' How does seriality influence storytelling and viewing? In what ways does Babylon Berlin reflect on film as a medium? What role do montage and collage play? Assessment will be based on active class participation; a series of short viewing and reading reflections; a midterm scene analysis assignment; and a final research project that will delve into specific historical intertexts (figures, sites, objects) taken up in Babylon Berlin.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224403",
        "number": "GERMAN 149",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "150",
        "title": "Masterpieces: Kafka (COMPLIT 114, JEWISHST 145)",
        "description": "This class will address major works by Franz Kafka and consider Kafka as a modernist writer whose work reflects on modernity. We will also examine the role of Kafka's themes and poetics in the work of contemporary writers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216217",
        "number": "GERMAN 150",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "153",
        "title": "Marx: Politics and Culture (GERMAN 335)",
        "description": "Few thinkers can lay claim to the level of sustained impact Karl Marx has achieved. From eco-socialist movements to contemporary investigations of digital capitalism, Marx's grip on the political and cultural imagination has only been further solidified in recent years. While seeking to come to terms with such relevance, this course turns first and foremost to the writings of Marx himself in order to gain insight into how he responded to the pressing issues of his own day. How does Marx deal with topics related to identity and nation in &quot;On the Jewish Question,&quot; for example? How does Marx theorize new forms of value creation enabled by automation in the &quot;Fragment on Machines&quot;? In order to properly appreciate Marx's contemporary relevance, this course seeks to suggest, we must first understand his writings as a product of their own time and place. Readings will be available in both German and English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224392",
        "number": "GERMAN 153",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "157",
        "title": "What kind of Information is Poetry (GERMAN 357)",
        "description": "&quot;Only a fool reads poetry for facts&quot;: To read a poem with the same fact-seeking attention required by using a dictionary, reading a newspaper article, or following a recipe is, perhaps, foolish. But if it is, it is so only because it means the reader has not understood what a poem is supposed to do. Consider Wittgenstein's famous warning: &quot;Do not forget that a poem, even though it is composed in the language of information, is not used in the language-game of giving information.&quot; A poem, even though it is made of the same (kinds of) words as information, ought not to be treated as information (the sentence seems to say). Distinct in their respective functions, poetry and information form two ends of an opposition: one for the creative possibilities for human expression, the other for the practical and mechanical tasks of everyday life.nBut what really &quot;is&quot; information? Has poetry not, since the beginning of time, also functioned as vehicle for storing, quantifying, and communicating things&iquest;from historical events, the law, to agricultural manuals, just as &quot;informational&quot; texts do?  How has the emergence of technological media in our so-called Information Age altered, reinforced, or revolutionized the place of poetry in the realm of human communication?nThese questions will motivate this course, which is also a general introduction to poetry and poetics. We will closely read German texts from the Musipilli to digital-born poetry, and secondary material from thinkers and theorists such as Schlegel, Schleiermacher, Benjamin, Wittgenstein, Flusser, and Bense, to learn how various methods of reading and literary criticism - from formalism and structuralism to Digital Humanities approaches - have developed alongside something like &quot;information&quot; as literary quality and social form.nAssistant Professor Lea Pao will teach this course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219546",
        "number": "GERMAN 157",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "174",
        "title": "The Poem as Medium (GERMAN 374)",
        "description": "Since Marshall McLuhan formulated his theory of &quot;media&quot; as &quot;extensions of ourselves,&quot; we've come to understand the history of human communication in terms of its physical carriers, tools, and technologies. From cuneiform, hieroglyphs, and logographic writing systems, to the alphabet, to algorithms; from clay tablets, to papyrus, to LED screens; from scrolls, to books, to the gramophone, to DNA - the medium and the message shape how we store and communicate information. Poetry's place in this history of media has been both elusive and strangely consistent. In media theory, the poem, which Hans Magnus Enzensberger once called an &quot;archaic medium&quot; and Niklas Luhman a &quot;paradoxical form of communication,&quot; often serves as an example of the non-ordinary, of opacity, untranslatability, self-mediation, or hypermediacy. We will read (often lesser known) texts by media theorists (McLuhan, Kittler, Flusser, Benjamin, Luhmann, Siegfried J. Schmidt, Hayles) and a selection of pre-media theory texts on the mediality and mediacy of poetry (Lessing, Hegel, Herder Schleiermacher, Hamburger), as well as one poem each week as we explore the relation between medium and message, content and form. Taught in German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221662",
        "number": "GERMAN 174",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "175",
        "title": "CAPITALS: How Cities Shape Cultures, States, and People (COMPLIT 100, DLCL 100, FRENCH 175, HISTORY 206E, ILAC 175, ITALIAN 175, URBANST 153)",
        "description": "This course takes students on a trip to major capital cities, at different moments in time: Renaissance Florence, Golden Age Madrid, Colonial Mexico City, Enlightenment and Romantic Paris, Existential and Revolutionary St. Petersburg, Roaring Berlin, Modernist Vienna, and bustling Buenos Aires. While exploring each place in a particular historical moment, we will also consider the relations between culture, power, and social life. How does the cultural life of a country intersect with the political activity of a capital? How do large cities shape our everyday experience, our aesthetic preferences, and our sense of history? Why do some cities become cultural capitals? Primary materials for this course will consist of literary, visual, sociological, and historical documents (in translation); authors we will read include Boccaccio, Dante, Sor Juana, Montesquieu, Baudelaire, Gogol, Irmgard Keun, Freud, and Borges. Note: To be eligible for WAYS credit, you must take the course for a Letter Grade.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29895",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            },
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "29894",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "6:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 66600.0,
                        "endTimestamp": 69600.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "32419",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "218539",
        "number": "GERMAN 175",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "181",
        "title": "Philosophy and Literature (CLASSICS 42, COMPLIT 181, ENGLISH 81, FRENCH 181, ILAC 181, ITALIAN 181, PHIL 81, SLAVIC 181)",
        "description": "Can novels make us better people? Can movies challenge our assumptions? Can poems help us become who we are? We'll think about these and other questions with the help of writers like Toni Morrison, Marcel Proust, Jordan Peele, Charlie Kaufman, Rachel Cusk, William Shakespeare, and Samuel Beckett, plus thinkers like Nehamas, Nietzsche, Nussbaum, Plato, and Sartre. We'll also ask whether a disenchanted world can be re-enchanted; when, if ever, the truth stops being the most important thing; why we sometimes choose to read sad stories; whether we ever love someone for who they are; who could possibly want to live their same life over and over again; what it takes to make ourselves fully moral; whether it's ever good to be conflicted; how we can pull ourselves together; and how we can take ourselves apart. (This is the required gateway course for the Philosophy and Literature major tracks. Majors should register in their home department.)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13701",
                "currentClassSize": "0",
                "maxClassSize": "93",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "McMurtry Art Building Oshman",
                        "instructors": [
                            {
                                "name": "Peacocke, A.",
                                "sunet": "peacocke"
                            },
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "13702",
                "currentClassSize": "0",
                "maxClassSize": "99",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "204034",
        "number": "GERMAN 181",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "185",
        "title": "Understanding International Politics Today: From the German Philosophers to Modern Social Science",
        "description": "This course is being offered in collaboration with Stanford in Berlin, Bing Overseas Study Program. International politics is beset by problems. States go to war. The global economy is volatile and unequal. The human community is divided into multiple nation-states. Some states dominate others. People commit acts of evil. Luckily, we are not the first people to have noticed that international politics is not characterized exclusively by peace and harmony. War, capitalism, racism, and totalitarianism have all been subjects about which German thinkers - many based in Berlin - have made profound contributions over the last two centuries. Do their ideas and arguments stand up in the cold light of modern social science? What can we learn from them - and what do we need to discard? This course will introduce students to perennial problems in international politics from two perspectives: those of key German political thinkers, and those of modern social science. It is structured around five core questions: Why do states go to war and what could be the basis for a lasting peace? If war is unavoidable, what is the role of morality in war? How can/should the world be governed in the absence of a world state? How has international politics been transformed by capitalism? What role has been and is played by race and racism in international politics?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "223144",
        "number": "GERMAN 185",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "188",
        "title": "In Search of the Holy Grail: Percival's Quest in Medieval Literature (COMPLIT 188, COMPLIT 388, GERMAN 388)",
        "description": "This course focuses on one of the most famous inventions of the Middle Ages: the Holy Grail. The grail - a mysterious vessel with supernatural properties - is first mentioned in Chr&eacute;tien de Troyes' &quot;Perceval,&quot; but the story is soon rewritten by authors who alter the meaning of both the grail and the quest. By reading three different versions, we will explore how they respond differently to major topics in medieval culture and relevant to today: romantic love, family ties, education, moral guilt, and spiritual practice. The texts are: Chr&eacute;tien de Troyes' &quot;Perceval,&quot; Wolfram von Eschenbach's &quot;Parzival,&quot; and the anonymous &quot;Queste del Saint Graal.&quot; All readings will be available in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220690",
        "number": "GERMAN 188",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "189",
        "title": "KRUPP-FLEX: Work-Life Balance in Today's Germany",
        "description": "This class is being offered in collaboration with Stanford in Berlin, Bing Overseas Studies Program. This course will accompany and deepen the experience of Krupp Interns living and working in German cities and towns in summer 2021. Their participant observations in the workplace and in Germany's rich leisure culture, as well as critical consideration of their own assumptions and experiences in the context of cultural exploration, will be recorded in a reflective Arbeitsjournal (critical journal -- genre and language at the discretion of the student). These reflections will be informed by regular reading of the German press (print or online) around themes on which students choose to focus -- be that the history behind the extensive rights and social services that support labor in Germany; or habits, mores and modes of personal interaction in and outside the workplace; or attitudes toward diversity, gender, class in contemporary German culture; or topics of immediate socio-political concern that lend themselves to comparative reflection with home-country culture (e.g. immigration and asylum, structure of systemic and social responses to COVID 19, environmental awareness, vocational training); or religion, or sport culture, or indeed the specific professional sector of the internship itself. Students will submit their completed journals with an annotated reading list at the end of the summer and will give a short presentation during the mandatory Internship Seminar in late August of 2021. Permission code required. You will receive a permission code from Cornelia Kastelan - ckastelan@stanford.edu. This course is restricted to Krupp Internship students in the Program for Stanford Students in Germany.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223102",
        "number": "GERMAN 189",
        "units": [
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "191",
        "title": "German Capstone Project",
        "description": "Each student participates in a capstone interview and discussion with a panel of the German Studies faculty on topics related to German cultural and literary analysis. In prepration for the interview/discussion, students submit written answers to a set of questions based on several authentic cultural texts in German. The written answers, normally in English, should be well-formed and coherent. Within the interview/discussion, students must demonstrate a further understanding of the topic(s) posed, through cogent argument.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "27695",
                "currentClassSize": "0",
                "maxClassSize": "1",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "COL",
                "notes": "Contact professor to enroll.",
                "classId": "11821",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214416",
        "number": "GERMAN 191",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "199",
        "title": "Individual Work",
        "description": "Repeatable for Credit.  Instructor Consent Required",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "31161",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10463",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "30912",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10464",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "11293",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "11068",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10465",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11294",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11069",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11295",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11070",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "31162",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "30925",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "11296",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "30926",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10466",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "11071",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "29189",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "11297",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "29190",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213808",
        "number": "GERMAN 199",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 21
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "206",
        "title": "Turkish-German Literature, Cinema, and Theater (GERMAN 106)",
        "description": "One in five people in Germany now has, as it is termed, a background of migration. Immigration from Turkey is probably the most prominent not only in terms of its massiveness and demographic consequences, but also for its significant role in changing Germany's overall cultural, social, and economic landscape. In this course, through analyzing selected literary works, films, and plays produced by Turkish-German writers and artists, we will discuss complex ideas like migration, ethnicity, race, religion, gender, and class, resorting not to oversimplifications and binary thinking but instead to relevant literary concepts and formative historical moments which have shaped the Turkish-German experience. Taught in English and German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30071",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Deniz, M.",
                                "sunet": "mdeniz"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222887",
        "number": "GERMAN 206",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "213",
        "title": "Medieval Germany, 900-1250 (GERMAN 313, HISTORY 213F, HISTORY 313F)",
        "description": "(Undergraduates may sign up for German 213 or History 213F, graduate students should sign up for German 313 or History 313F. This course may be taken for variable units. Check the individual course numbers for unit spreads.) This course will provide a survey of the most important political, historical, and cultural events and trends that took place in the German-speaking lands between 900 and 1250. Important themes include the evolution of imperial ideology and relations with Rome, expansion along the eastern frontier, the crusades, the investiture controversy, the rise of powerful cities and civic identities, monastic reform and intellectual renewal, and the flowering of vernacular literature. This course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "29766",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220254",
        "number": "GERMAN 213",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "214",
        "title": "Literature of Immigration and Refugees",
        "description": "Literary accounts of immigrants and refugees in contemporary German-speaking Europe, with a particular emphasis on authors from Africa and the Middle East. Documents of multicultural literature in Germany, as well as the background of German exile literature. Distinctive narrative structures and authorial voices in these fields of writing.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28536",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "200-201",
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225216",
        "number": "GERMAN 214",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "215",
        "title": "The Queer 20th Century: German LGBTQ Literature and Film (FEMGEN 115A, FEMGEN 215A, GERMAN 115)",
        "description": "What was it like to be queer in 20th-century Germany? This course examines the rich and sometimes surprising LGBTQ culture of 20th-century Germany, featuring stories that are often left out of traditional seminars. Through literature and film, we will learn about pioneering gay rights activists, persecution under National Socialism, emancipation movements under capitalism and socialism, and debates that are shaping queer life in contemporary Germany. Taught in English; students of all backgrounds are very welcome.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30076",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "222892",
        "number": "GERMAN 215",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "217",
        "title": "Multilingualism in German-speaking Contexts",
        "description": "This seminar focuses on bilingualism/multilingualism research connected to German either as a native or as a second language and reveals the influence of relevant extra-linguistic factors shaping contemporary German culture. A formal presentation is required.  This is a block seminar that will meet on T/Th for 80 minutes each day on January 9,  11, 16, 18,  23,  25, and 30. Taught in English with readings in English and German",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30568",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225213",
        "number": "GERMAN 217",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "222",
        "title": "Myth and Modernity (COMPLIT 222A, GERMAN 322, JEWISHST 242G, JEWISHST 342)",
        "description": "Masters of German 20th- and 21st-Century literature and philosophy as they present aesthetic innovation and confront the challenges of modern technology, social alienation, manmade catastrophes, and imagine the future. Readings include Nietzsche, Freud, Rilke, Musil, Brecht, Kafka, Doeblin, Benjamin, Juenger, Arendt, Musil, Mann, Adorno, Celan, Grass, Bachmann, Bernhardt, Wolf, and Kluge. Taught in English. Note for German Studies grad students: GERMAN 322 will fulfill the grad core requirement since GERMAN 332 is not being offered this year. NOTE: Enrollment requires Professor Eshel's consent. Please complete the following form to be considered for the class: https://forms.gle/zq3EwGWc1Ff7xn7T9. Enrollment is limited to 20 students. Students will be notified about their acceptance by March 20th and given a permission code. UPDATE 3/2/23 - There was a problem with the original form. Please edit your response to include your name.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "213572",
        "number": "GERMAN 222",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "230",
        "title": "German Literature (800-1700) (GERMAN 330)",
        "description": "This course surveys different different genres and periods of premodern German literature, including mysticism, Romance, heroic epic, lyric poetry, and drama. Taught in German.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14375",
                "currentClassSize": "0",
                "maxClassSize": "23",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "STLC 119",
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218165",
        "number": "GERMAN 230",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "231",
        "title": "German Literature (1700-1900) (GERMAN 331)",
        "description": "How the literature of the period between 1750 and 1900 gives voice to new conceptions of selfhood and articulates the emergent self-understanding of modernity. Responses to unprecedented historical experiences such as the French Revolution and the ensuing wars, changes in the understanding of nature, the crisis of foundations, and the persistence of theological motifs. Lessing, Herder, Goethe, Schiller, Holderlin, Kleist, Heine, Buchner, Keller, and Fontane. Taught in English, readings in German.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14995",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218164",
        "number": "GERMAN 231",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "232",
        "title": "German Literature 3: Modernity and the Unspeakable (GERMAN 332)",
        "description": "Masterpieces of German literature, drama, and film from the first half of the 20th century.  Particular focus on modernism and the crisis of language.  What urgent truths (whether psychological, political, spiritual, or sexual) cannot be expressed, and how do art and dreams attempt to speak the unspeakable?  Readings and viewings include works by Hofmannsthal, Schnitzler, Freud, Wedekind, Mann, Musil, Kafka, Toller, H&ouml;ch, Rilke, Schoenberg, Riefensthal, Benjamin, and Brecht.  Taught in English.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30918",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218163",
        "number": "GERMAN 232",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "233",
        "title": "Rainer Maria Rilke: Poetry and the Meaning of Life (COMPLIT 240, GERMAN 130)",
        "description": "One of the greatest poets of the modern era, Rilke offers in his poetry lasting images of nature, love, and aesthetic beauty. At the same time, Rilke's poetry is a unique form of human thought. Many of his poems are poetic meditations on the meaning of human life in a world of great uncertainties. Other poems express poetic wisdom regarding the human condition of finitude, spiritual orientation, and our ability to persevere in the face of pain and loss. This course will serve as an introduction to Rilke's poetry and its place in the modernist canon while discussing its capacity to offer insight, comfort, and hope. NOTE: Enrollment requires Professor Eshel's consent. Please complete the following form to be considered for the class. https://forms.gle/znuNUNhHwpf5pb2EA. Enrollment is limited to 20 students. Students will be notified about their acceptance by March 20th and given a permission code. UPDATE 3/2/23 - There was a problem with the original form. Please edit your response to include your name.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224395",
        "number": "GERMAN 233",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "234",
        "title": "Media Theory and the Sea (FILMEDIA 234, GERMAN 334)",
        "description": "This seminar serves as an introduction to media theory by turning to the sea as a medium. Designed for third- and fourth-year German majors, the course explores the way the ocean has served as a constant vehicle for poetic and philosophical reflection throughout history, from Homer's Odyssey to Paul Valery's Cemetery by the Sea. Combining theoretical studies of seafaring by Hans Blumenberg and Bernard Siegert with literary writings from Franz Kafka and Friedrich H&ouml;lderlin, this course highlights the way nautical activity becomes a theater of political and poetic concerns when our engagement with the ocean is viewed as a metaphor or a cultural technique. In recent years, the sea has also become a flashpoint for environmental concerns due to rising sea levels, leading to calls to take the material status of the ocean itself seriously. The sea, when viewed through the lens of environmental media, continues to serve as a canvas for the projection of human hopes and fears while opening up further questions about the relationship between nature, cultural practices, and theoretical texts. Readings for this course will be in German and English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224389",
        "number": "GERMAN 234",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "235",
        "title": "German Conversation (GERMAN 135)",
        "description": "This small, individualized course will offer students the chance to work on their spoken expression and critical thinking, in German. Topics will change each quarter but will span contemporary politics and culture, film, literature, and visual arts. The focus will be on speaking German in small groups, as opposed to formal presentations or written assignments. Students will have the opportunity to pursue topics of personal interest, as well as work collaboratively and individually on projects intended to foster advanced communicative skills.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14546",
                "currentClassSize": "0",
                "maxClassSize": "8",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Deniz, M.",
                                "sunet": "mdeniz"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14399",
                "currentClassSize": "0",
                "maxClassSize": "7",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "160-322",
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14268",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222581",
        "number": "GERMAN 235",
        "units": [
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "236",
        "title": "German Philosophy and Theory After 1945",
        "description": "&quot;To write poetry after Auschwitz is barbaric,&quot; Theodor Adorno wrote after the end of World War II, casting doubt on the poet's ability to capture the horrors of the third Reich. But what about theory or philosophy? Is philosophy better equipped to meet the social and cultural demands of life in postwar Germany? In this course, we will explore the wide range of philosophical movements and topics taken up by German thinkers after 1945, from post-war existentialism and the Frankfurt school to the philosophical Anthropology of Arnold Gehlen and Peter Sloterdijk. How does meaning making relate to the writing of history in Hannah Arendt and Hans Jonas? What role does history play in Gadamer's hermeneutics or Blumenberg's metaphorology? How do Martin Heidegger, Friedrich Kittler, and Niklas Luhmann respond to the development of new technology? And how do these analyses relate to the myriad cultural and political concerns that emerged in a rapidly complexifying society? Taught in German and English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30412",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            },
                            {
                                "name": "Norton, B.",
                                "sunet": "brnorton"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225209",
        "number": "GERMAN 236",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "237",
        "title": "Fascism after Fascism (COMPLIT 237)",
        "description": "When World War II ended, most of the states that described themselves as &quot;fascist&quot; ended with it. Nevertheless, fascism haunted postwar democracy as an ever-present threat. The question of what exactly had characterized fascism, and what parts of it persisted within liberal democracies themselves, were continuously and contentiously debated. This question has emerged all the more forcefully in recent years as &quot;illiberal,&quot; or &quot;right-wing populist,&quot; movements and governments have begun to question the basic premises of liberal democracy. What was fascism, and what would it mean for it to return? This course considers writings by philosophers, historians, journalists and writers, and moves from early anti-fascist writings to critiques of online movements and neo-reactionaries.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222551",
        "number": "GERMAN 237",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "238",
        "title": "Ratzinger, Reason and Religion",
        "description": "A discussion of select writings of Joseph Ratzinger, especially the cultural criticism and his understanding of modernity; his dialogue with J&uuml;rgen Habermas; his treatment of the &quot;West&quot; in the Regensburg Address;  his standing within German Catholicism; comparisons with thinkers such as Guardini, B&ouml;ckenf&ouml;rde and others. No auditors permitted. Taught in English with readings in English and German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30567",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 60600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225212",
        "number": "GERMAN 238",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "239",
        "title": "Queer Theory (COMPLIT 239, FEMGEN 239)",
        "description": "Do we really need a theory in order to be queer? Queer Theory emerged in response to feminist thought, and the study of the history of sexuality, building on their insights, but also uncovering their blind spots. Without Queer Theory, few of the discourses around desire, power and gender identity that we take for granted on college campuses today would exist. Yet there is also a real risk that reality has left the theory behind. In this course, we will try to answer the question: What do we need queer theory for? Do we still need it? And if so, of what kind? The course  is designed to introduce students to core texts of queer theory, and to connect them to current debates, be this around trans rights, the representation of homosexuality or the fight against campus sexual assault.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217337",
        "number": "GERMAN 239",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "240",
        "title": "Route-Place-Object: Re-defining \"Cultural Landscape\" in Medieval Germany (GERMAN 340, HISTORY 213G)",
        "description": "In modern perception, the definition of Germany's various cultural landscapes often follows narratives of regional remoteness and aesthetic coherency. Today's Bundesland (federal state) of Hesse makes a case in point. Ever since the Brothers Grimm collected many of their fairy tales there, its image is defined by ideas of small picturesque towns with half-timbered houses and impressive castles on hilltops. However, a closer look clearly reveals that Hesse's countryside was and is rather heterogeneous and diverse in its architectural and artistic heritage, just like in many other &quot;typical&quot; German regions. In this class, we invite students to study the rich artistic heritage of medieval Hesse with us in order to re-define a scholarly concept of &quot;cultural landscape&quot; as a dynamic interaction of route, place, and object. Rather than being a remote region, Hesse was determined by important trans-European routes enabling the transfer of objects and ideas. Along these passages, a dynamic network of micro-landscapes around certain places like towns, abbeys, castles but also bridges with partly distinct political and religious connotations could both develop and transform over a long period. It is our aim to create a better understanding for a historically grounded diversity of German cultural landscapes.NO CLASS during the first week. Class will begin 10/5.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224142",
        "number": "GERMAN 240",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "253",
        "title": "Hannah Arendt: Facing Totalitarianism (COMPLIT 353B, GERMAN 353, JEWISHST 243A)",
        "description": "Like hardly any other thinker of the modern age, Hannah Arendt's thought offers us timeless insights into the fabric of the modern age, especially regarding the perennial danger of totalitarianism. This course offers an in-depth introduction to Arendt's most important works in their various contexts, as well as a consideration of their reverberations in contemporary philosophy and literature. Readings include Arendt's &lt;em&gt;The Origin of Totalitarianism&lt;/em&gt;, &lt;em&gt;The Human Condition, Between Past and Future&lt;/em&gt;, &lt;em&gt;Men in Dark Times&lt;/em&gt;, &lt;em&gt;On Revolution&lt;/em&gt;,&lt;em&gt;Eichmann in Jerusalem&lt;/em&gt;, and &lt;em&gt;The Life of the Mind&lt;/em&gt;, as well as considerations of Hannah Arendt's work by Max Frisch, J&uuml;rgen Habermas, Seyla Benhabib, Judith Butler, Giorgio Agamben, and others. Special attention will be given to Arendt's writings on literature with an emphasis on Kafka, Brecht, Auden, Sartre, and Camus. This course will be synchronously conducted, but will also use an innovative, Stanford-developed, online platform called Poetic Thinking. Poetic Thinking allows students to share both their scholarly and creative work with each other. Based on the newest technology and beautifully designed, it greatly enhances their course experience.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220959",
        "number": "GERMAN 253",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "255",
        "title": "Speaking Medieval: Ecologies of Inscribed Objects (ENGLISH 255)",
        "description": "This class presents a survey of medieval German vernaculars and their documentation in manuscripts and on material objects. The languages include Gothic, Old Norse, Old Frisian, Old Saxon, Old English, and Old High German. Readings will include runic inscriptions, magic charms, proverbs and riddles, apocalyptic visions, heroic lays, and sermons and prayers. (This course must be taken for a letter grade and a minimum of 3 units to satisfy a Ways requirement.)Please note this course meets MW 1:30-2:50 and is taught by Professors Kathryn Starkey and Elaine Treharne.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29878",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "218390",
        "number": "GERMAN 255",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "256",
        "title": "Thomas Bernhard (GERMAN 356)",
        "description": "This is a course about the Austrian writer Thomas Bernhard, his work, and his time.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220681",
        "number": "GERMAN 256",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "261",
        "title": "Theorie des Erzählens (GERMAN 361)",
        "description": "This course approaches the history of narrative theory from the German perspective: we will read canonical and foundational texts that have shaped the way we read and study narrative - from the usual suspects (Gerard Genette, Yuri Lotman, Tzvetan Todorov, Algirdas Julien Greimas) to the (here) lesser known German theorists of narrative forms and literary theory (Frank K. Stanzel, K&auml;te Hamburger, Monika Fludernik, Siegfried J. Schmidt). Alongside these theoretical approaches, we will read two German novels, which we'll use as experimental playground to better test and understand how and why literary theory can help us construct models of reading, world-making, human experience, and storytelling. Towards the end of the course, we'll switch to the open questions and future of narrative theory: what media of long-form storytelling come after the novel? What do they have in common with, say, the novels of J.W. Goethe, Adalbert Stifter, Lou Andreas-Salom&eacute;, or Ingeborg Bachmann? How would we expand narrative theory to include today's most important and engaging sites of storytelling (like video games or serial television)? Taught in German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222584",
        "number": "GERMAN 261",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "263",
        "title": "Paul Celan: The Poetic Event (COMPLIT 263B, GERMAN 363, JEWISHST 263)",
        "description": "Paul Celan (1920-1970) is one of the greatest poets of our time. Touching on philosophy, history, our relation to nature, and love, his poetry is a profound meditation on the modern human condition. This course will present some of Celan's best work and will discuss significant contributions to Celan scholarship. Readings include Heidegger, Gadamer, Nelly Sachs, Bachmann, Derrida, Szondi, and Anne Carson, among others.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30382",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223493",
        "number": "GERMAN 263",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "265",
        "title": "Middle High German",
        "description": "Middle High German (MHG), a form of German spoken in the High Middle Ages c. 1050&iquest;1350, constitutes one of the most important medieval languages of Europe. Numerous fundamental classics of European literature were originally composed in MHG, among them the Nibelungenlied, Wolfram von Eschenbach&iquest;s Parzival, and Meister Eckhart&iquest;s German Sermons. Reading skills in this language will thus allow literary scholars and historians to both appreciate well-known texts in their original form and access a range of untranslated literary works and sources. Working with different textual examples, students will learn how to read and translate MHG texts. They will additionally gain an overview of the history of the German language. Focusing on reading comprehension, this course will take a hands-on approach to key methods and concepts of historical linguistics (etymology, dialectology, historical semantics, phonetic history, premodern Germanic morphology and syntax). Additionally, students will learn how to work with printed and digital tools for translating MHG texts (lexical databases, dictionaries, historical grammars). German skills of intermediate level or higher are required. Assignments include weekly translation exercises.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222291",
        "number": "GERMAN 265",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "266",
        "title": "Questions of Political Theology (GERMAN 366)",
        "description": "How does theology inform culture and politics in our age of high technology?  Are there religious underpinnings in the contemporary world to categories of creativity, charisma and community? This course explores theoretical approaches to the ongoing resonance of theology through readings by Max Weber, Carl Schmitt, Leo Strauss, Oswald Spengler,  Ren&eacute; Girard and others and through regular visits by Peter Thiel. To be considered for enrollment in this course, please complete and submit this short application by October 19, 2022, 11:59pm PST. Students accepted to participate in this course will be notified on October 26, 2022 by 6:00pm. Auditors are not permitted.  Please use this url to fill out the application: https://forms.gle/PM2mTYot6eGnNPpL8",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224396",
        "number": "GERMAN 266",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "267",
        "title": "Prospects for Transatlantic Relations: What Holds the West Together? (GERMAN 367)",
        "description": "This seminar treats contemporary transatlantic relations including 1) the green transformation: economic policy,  energy imports and costs of energy generation; 2) the 'Zeitenwende' in defense policy; future German-Russian relations; Germany and  China (decoupling versus derisking);  NATO and transatlantic security; 3) demographic changes between immigration and aging populations.  Meeting times: This block seminar meets from 9:00am to 11:00am in room 260-252 on Monday, November 6, Wednesday, November 8, and Friday, November 10, 2023, as well as other occasional meetings TBD. Taught in English with readings in German and English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "1. This seminar will meet from 9:00am to 11:00am in room 260-252 Nov. 7, Nov. 9, and Nov. 11.",
                "classId": "13234",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Huether, M.",
                                "sunet": "huether"
                            },
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219466",
        "number": "GERMAN 267",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "268",
        "title": "Socialism: Theory, Literature, Practice (COMPLIT 268)",
        "description": "The prospect of socialism has circulated in the cultural and political programs of many countries, and socialist programs have informed the real governance structures in some. This course examines some of the theoretical texts that have described socialism as well as critical responses. In addition, the treatment of socialism in literature will be discussed as well as considerations of the outcomes of institutionalized programs. Readings will include texts by authors such as Marx, Lenin, Hayek, Friedman, Koestler, Steinbeck, Wolf, Brauenig, Wright and others.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222353",
        "number": "GERMAN 268",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "270",
        "title": "Sovereignty and the Limits of Globalization and Technology",
        "description": "Current opposition to globalization is emerging in many countries in the various forms of populism, restrictive trade policies, protest parties and localism, accompanied by appeals to national interests and cultural traditions. At stake is the reassertion of state sovereignty against market processes and internationalist claims. This seminar explores the tensions between state and market, their cultural contexts, new technologies, and the importance of community belonging. Readings include texts by authors such as Marx, Nietzsche, Schmitt, Strauss, Girard, Lasch, Bloom, Appiah. Student research projects on contemporary topics. NOTE: To be considered for enrollment in this course, please complete and submit this short application by October 19, 2018, 11:59pm PST. Students accepted to participate in this course will be notified on October 26, 2018 by 6:00pm. Auditors are not permitted.nLink to application: http://web.stanford.edu/~conorato/german270.fb",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220680",
        "number": "GERMAN 270",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "274",
        "title": "Wonder: The Event of Art and Literature (COMPLIT 374)",
        "description": "What falls below, or beyond, rational inquiry? How do we write about the awe we feel in front of certain works of art, in reading lines of poetry or philosophy, or watching a scene in a film without ruining the feeling that drove us to write in the first place? In this course, we will focus on a heterogeneous series of texts, artworks, and physical locations to discuss these questions. Potential topics include The Book of Exodus, the poetry of Friedrich H&ouml;lderlin and of Elizabeth Bishop, the location of Harriet Tubman's childhood, the poetry and drawings of Else Lasker-Sch&uuml;ler, the philosophy of Martin Heidegger, the art of James Turrell, and the films of Luchino Visconti.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224328",
        "number": "GERMAN 274",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "275",
        "title": "Outer Space Exploration in Germany in the Twentieth Century (HISTORY 237G)",
        "description": "Since the nineteenth century, Germans, like their counterparts around the world, have considered the meaning and the role of humanity in outer space. As space travel developed from a dream to a reality, and as Germany changed borders and political systems among empires, dictatorships, socialist states, and capitalist states, German interest in spaceflight remained, although the meaning found in the stars changed dramatically. This course considers Germans' dreams of and predictions for outer space travel alongside German technological developments in spaceflight. It includes the different German states throughout the century, including Weimar Germany, National Socialism, East Germany, and West Germany. The course looks at science fiction films and novels, newspaper reports, scientific developments, and German space engineering projects, which together demonstrate how and why space travel often found high levels of support in Germany. Students will engage in historical and cultural analysis through course readings, discussions, and assignments.nNOTE: To be eligible for WAYS credit, you must take this course for a minimum of 3 units and a letter grade.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "219344",
        "number": "GERMAN 275",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "276",
        "title": "Martin Heidegger: Off the Beaten Track (COMPLIT 266, COMPLIT 363)",
        "description": "Martin Heidegger is one of the most influential and contested philosophers of the modern era. This seminar will offer close readings of Heidegger's first book following the Second World War: Martin Heidegger: Off the Beaten Track (Holzwege). We will discuss Heidegger's aesthetic theory (&quot;The Origin of the Work of Art&quot;), his reaction to Hegel's notion of experience, Nietzsche's dictum &quot;God is dead,&quot; and Heidegger's unique understanding of poetry, poetics and poetic thinking in &quot;Why Poets?&quot; The seminar will also explore how some of Heidegger's ideas have left a lasting mark in contemporary discussions regarding truth, experience, art, and literature.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224413",
        "number": "GERMAN 276",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "277",
        "title": "Technology and Culture Between Stagnation or Progress",
        "description": "Examination of relations between technology and culture through a series of conversations with Peter Thiel, concerning the conditions and limits of progress. How does creativity happen? What gets in the way of change? Discussions of innovation with reference to cultural theory and in light of contemporary developments, through readings by authors such as Leo Strauss, Oswald Spengler, Carl Schmitt, Ernst J&uuml;nger, Hannah Arendt as well as Ross Douthat, Joan Didion, and Christopher Caldwell. Taught in English. NOTE: To be considered for enrollment in this course, please complete and submit this short application by August 23, 2021 at 11:59pm PST. Students accepted to participate in this course will be notified on August 30, 2021 by 6:00pm. Auditors are not permitted. Link to application: https://forms.gle/Z9A4uWqyNMe7ixdY6",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222032",
        "number": "GERMAN 277",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "280",
        "title": "Feminist Avant-Garde Art in Germany and Beyond (1968-2019) (ARTHIST 272, ARTHIST 472, FEMGEN 280)",
        "description": "In &quot;Woman's Art: A Manifesto&quot; (1972), the artist, performer and filmmaker Valie Export (1940) proposed the transfer of women's experience into an art context and considered the body &quot;a signal bearer of meaning and communication.&quot; In reconceptualizing and displaying &quot;the&quot; body (her body) as an aesthetic sign, Export's groundbreaking work paves the way towards questioning the concepts of a &quot;female aesthetic&quot; and a &quot;male gaze&quot; (L. Mulvey). Beginning with Export, we will discuss art informed by and coalescing with feminism(s): the recent revival of the 1970s in all-women group shows, the dialectic of feminist revolution, the breakdown of stable identities and their representations, point(s) of absorption of commodified femininities. Particular attention will be paid to German-language theory and its medial transfer into art works. For students of German Studies, readings and discussions in German are possible. Online discussions will be organized with contemporary artists and curators. Emphasis will be on: the relationship between (female?) aesthetics and (gender) politics, between private and public spheres, between housework and artwork; conceptions of identity (crises) and corporeality in visual culture and mass media; categories of the artist&acute;s self in relation to the use of media (video, photography, film, collage, installation art). This course will be taught by Professor Elena Zanichelli, a Berlin-based art historian, critic, and curator. She is junior professor for Art History and Aesthetic Theory at IKFK (Institute for Art History - Film History - Art Education) at the University of Bremen.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30184",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223492",
        "number": "GERMAN 280",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "281",
        "title": "G.W.F. Hegel: System, History, Dialectics",
        "description": "This course is intended to introduce students to the study of G.W.F. Hegel. The seminar will read several of Hegel's central works and discuss his reception in the later 19th and 20th century.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220679",
        "number": "GERMAN 281",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "283",
        "title": "Directed Reading: Second Language Acquisition",
        "description": "This Directed Reading focuses on key works in the research area of second-language acquisition with a specific emphasis on German language learning, by permission only.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224612",
        "number": "GERMAN 283",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "284",
        "title": "Directed Reading: Academic Writing in German",
        "description": "This course focuses on writing elegant and interesting academic texts in German to enable better collaboration with German-speaking academics.  It entails practice with text production in German through practical tips and helpful phrases and familiarity with the German scientific style and academic conventions in writing scientific papers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "14756",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224714",
        "number": "GERMAN 284",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "285",
        "title": "Post-Colonial and Post-Shoah Readings: The Conundrums of Memory Politics (HISTORY 234G, JEWISHST 285)",
        "description": "In April of 2020, amidst the COVID-19 pandemic, a huge controversy erupted in Germany on the relation between Postcolonial and Holocaust Studies. Previously, in 2012, Judith Butler on the occasion of being awarded the Adorno Prize was assailed for her support of the Boycott, Divestment and Sanctions (BDS) movement. This time, the philosopher Achille Mbembe, from Cameroon, the former German colony, was accused of antisemitism. His comparison of Israel with the apartheid state in South Africa and his critique of Palestine's occupation as a form of settler colonialism is condemned for relativizing the Holocaust and questioning the Israeli state's right to exist. The allegation of &quot;postcolonial antisemitism&quot; resurfaced in 2022 in the context of the Documenta 15 in Kassel. The curators, ruangrupa, an Indonesian art collective, are accused of antisemitism, of supporting BDS and of the &quot;silent boycott&quot; of Jewish-Israeli artists.These controversies confront us with the challenge of how to think together antisemitism and racism. In this class, we will engage with critical scholarship to address the conundrums of memory politics and to engage with the &quot;unfinished conversations&quot; between Jewish and Postcolonial Studies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224172",
        "number": "GERMAN 285",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "286",
        "title": "Forming the world: Pragmatism and Aesthetics (COMPLIT 286)",
        "description": "This course will explore key pragmatist philosophical and theoretical approaches to literature, the visual arts, and music. How are human lives mediated by and through aesthetic experience, in the realm of the private as well as the public. Rather than positing a metaphysical idea of beauty, the thinkers and artists we engage ask how texts and artworks render us sensitive to our multifaceted contingencies, and how we may speak and write about them. Readings and viewings include R. W. Emerson, Friedrich Nietzsche, Emily Dickinson, Martin Heidegger, John Dewey, T. W. Adorno, Hannah Arendt, Richard Rorty, Terrence Malick, J. M. Coetzee, Bruno Latour, Marilynne Robinson, Nancy Fraser, Rita Felski, Tania Bruguera, Yivve Citton, Richard Moose, Cheryl Misak, and Shannon Sullivan, among others.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222352",
        "number": "GERMAN 286",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "287",
        "title": "Hope in the Modern Age (COMPLIT 287, JEWISHST 287)",
        "description": "Immanuel Kant famously considered &quot;What may I hope?&quot; to be the third and final question of philosophy. This course considers the thinkers, from Immanuel Kant to Judith Butler, who have attempted to answer this question from within the context of modernity. Has revolution replaced religion as the object of our hope? Has Enlightenment lived up to its promises? These topics and more will be discussed, with readings from thinkers including Hegel, Marx, Nietzsche, Benjamin, Adorno, and Arendt, alongside the literature of writers such as Kafka, Celan, Nelly Sachs, among others, and with particular focus on the question of hope within the German-Jewish tradition.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "223391",
        "number": "GERMAN 287",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "289",
        "title": "Directed Reading: The Role of Metaphor in Language Learning.",
        "description": "This course reviews the research literature on metaphor with a particular emphasis on literary comprehension.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224855",
        "number": "GERMAN 289",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "311",
        "title": "German Poetry, Global Poetics",
        "description": "The goal of this seminar is twofold: first, we will closely read German poems through the ages - from the 15th century folk ballad &quot;Die K&ouml;nigskinder&quot; to Anja Utler's poetic monologue &quot;kommen sehen,&quot; published in 2020. This selection of poetry will be a mix of canonical poems we will read anew and unknown poems we will discover for the first time. With each poem we will practice different modes of interpretation, close reading methods, and reading techniques; and we will think about the cultural status of writing, reading, and sharing poetry. Second, we will also spend time reading texts written about poetry, its purposes, uses, histories, and developments. The retellings of Greek myths, the Klopstockian rejection of Latin hexameter, the experimentation with forms like the Alexandrine, the madrigal or the pantoum, the poetry of climate change: all make clear how German poetry exists within the context of a global poetics. What this global angle changes about how we read and think about German poetry and poetics will be our guiding question throughout the quarter. Taught in German.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28535",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "50-52E",
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225215",
        "number": "GERMAN 311",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "313",
        "title": "Medieval Germany, 900-1250 (GERMAN 213, HISTORY 213F, HISTORY 313F)",
        "description": "(Undergraduates may sign up for German 213 or History 213F, graduate students should sign up for German 313 or History 313F. This course may be taken for variable units. Check the individual course numbers for unit spreads.) This course will provide a survey of the most important political, historical, and cultural events and trends that took place in the German-speaking lands between 900 and 1250. Important themes include the evolution of imperial ideology and relations with Rome, expansion along the eastern frontier, the crusades, the investiture controversy, the rise of powerful cities and civic identities, monastic reform and intellectual renewal, and the flowering of vernacular literature. This course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "29767",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220254",
        "number": "GERMAN 313",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "319",
        "title": "Modern Theatre (TAPS 119, TAPS 319)",
        "description": "Modern theatre in Europe and the US, with a focus on the most influential works from roughly 1880 to the present.  What were the conventions of theatrical practice that modern theatre displaced?  What were the principal innovations of modern playwriting, acting, stage design, and theatrical architecture?  How did modern theatrical artists wrestle with the revolutionary transformations of the modern age?  Plays by B&uuml;chner, Ibsen, Strindberg, Shaw, Chekhov, Wilde, Wedekind, Treadwell, Pirandello, Brecht, O&iquest;Neill, Beckett, Smith, Parks, and Nottage.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "218131",
        "number": "GERMAN 319",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "322",
        "title": "Myth and Modernity (COMPLIT 222A, GERMAN 222, JEWISHST 242G, JEWISHST 342)",
        "description": "Masters of German 20th- and 21st-Century literature and philosophy as they present aesthetic innovation and confront the challenges of modern technology, social alienation, manmade catastrophes, and imagine the future. Readings include Nietzsche, Freud, Rilke, Musil, Brecht, Kafka, Doeblin, Benjamin, Juenger, Arendt, Musil, Mann, Adorno, Celan, Grass, Bachmann, Bernhardt, Wolf, and Kluge. Taught in English. Note for German Studies grad students: GERMAN 322 will fulfill the grad core requirement since GERMAN 332 is not being offered this year. NOTE: Enrollment requires Professor Eshel's consent. Please complete the following form to be considered for the class: https://forms.gle/zq3EwGWc1Ff7xn7T9. Enrollment is limited to 20 students. Students will be notified about their acceptance by March 20th and given a permission code. UPDATE 3/2/23 - There was a problem with the original form. Please edit your response to include your name.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "213572",
        "number": "GERMAN 322",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "325",
        "title": "Nietzsche: Life as Performance (GERMAN 125, TAPS 152L, TAPS 325)",
        "description": "Nietzsche famously considered that &quot;there is no 'being' behind the deed, its effect, and what becomes of it; the 'doer' is invented as an afterthought - the doing is everything.&quot;  How should we understand this idea of a deed without a doer, how might it relate to performance, and what influence has it had on modern culture?  In order to answer these questions, we will consider Nietzsche's writings alongside some of the artworks that influenced Nietzsche or were influenced by him.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221657",
        "number": "GERMAN 325",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "330",
        "title": "German Literature (800-1700) (GERMAN 230)",
        "description": "This course surveys different different genres and periods of premodern German literature, including mysticism, Romance, heroic epic, lyric poetry, and drama. Taught in German.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14374",
                "currentClassSize": "0",
                "maxClassSize": "9",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "STLC 119",
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218165",
        "number": "GERMAN 330",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "331",
        "title": "German Literature (1700-1900) (GERMAN 231)",
        "description": "How the literature of the period between 1750 and 1900 gives voice to new conceptions of selfhood and articulates the emergent self-understanding of modernity. Responses to unprecedented historical experiences such as the French Revolution and the ensuing wars, changes in the understanding of nature, the crisis of foundations, and the persistence of theological motifs. Lessing, Herder, Goethe, Schiller, Holderlin, Kleist, Heine, Buchner, Keller, and Fontane. Taught in English, readings in German.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14994",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218164",
        "number": "GERMAN 331",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "332",
        "title": "German Literature 3: Modernity and the Unspeakable (GERMAN 232)",
        "description": "Masterpieces of German literature, drama, and film from the first half of the 20th century.  Particular focus on modernism and the crisis of language.  What urgent truths (whether psychological, political, spiritual, or sexual) cannot be expressed, and how do art and dreams attempt to speak the unspeakable?  Readings and viewings include works by Hofmannsthal, Schnitzler, Freud, Wedekind, Mann, Musil, Kafka, Toller, H&ouml;ch, Rilke, Schoenberg, Riefensthal, Benjamin, and Brecht.  Taught in English.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14691",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218163",
        "number": "GERMAN 332",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "334",
        "title": "Media Theory and the Sea (FILMEDIA 234, GERMAN 234)",
        "description": "This seminar serves as an introduction to media theory by turning to the sea as a medium. Designed for third- and fourth-year German majors, the course explores the way the ocean has served as a constant vehicle for poetic and philosophical reflection throughout history, from Homer's Odyssey to Paul Valery's Cemetery by the Sea. Combining theoretical studies of seafaring by Hans Blumenberg and Bernard Siegert with literary writings from Franz Kafka and Friedrich H&ouml;lderlin, this course highlights the way nautical activity becomes a theater of political and poetic concerns when our engagement with the ocean is viewed as a metaphor or a cultural technique. In recent years, the sea has also become a flashpoint for environmental concerns due to rising sea levels, leading to calls to take the material status of the ocean itself seriously. The sea, when viewed through the lens of environmental media, continues to serve as a canvas for the projection of human hopes and fears while opening up further questions about the relationship between nature, cultural practices, and theoretical texts. Readings for this course will be in German and English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224389",
        "number": "GERMAN 334",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "335",
        "title": "Marx: Politics and Culture (GERMAN 153)",
        "description": "Few thinkers can lay claim to the level of sustained impact Karl Marx has achieved. From eco-socialist movements to contemporary investigations of digital capitalism, Marx's grip on the political and cultural imagination has only been further solidified in recent years. While seeking to come to terms with such relevance, this course turns first and foremost to the writings of Marx himself in order to gain insight into how he responded to the pressing issues of his own day. How does Marx deal with topics related to identity and nation in &quot;On the Jewish Question,&quot; for example? How does Marx theorize new forms of value creation enabled by automation in the &quot;Fragment on Machines&quot;? In order to properly appreciate Marx's contemporary relevance, this course seeks to suggest, we must first understand his writings as a product of their own time and place. Readings will be available in both German and English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224392",
        "number": "GERMAN 335",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "340",
        "title": "Route-Place-Object: Re-defining \"Cultural Landscape\" in Medieval Germany (GERMAN 240, HISTORY 213G)",
        "description": "In modern perception, the definition of Germany's various cultural landscapes often follows narratives of regional remoteness and aesthetic coherency. Today's Bundesland (federal state) of Hesse makes a case in point. Ever since the Brothers Grimm collected many of their fairy tales there, its image is defined by ideas of small picturesque towns with half-timbered houses and impressive castles on hilltops. However, a closer look clearly reveals that Hesse's countryside was and is rather heterogeneous and diverse in its architectural and artistic heritage, just like in many other &quot;typical&quot; German regions. In this class, we invite students to study the rich artistic heritage of medieval Hesse with us in order to re-define a scholarly concept of &quot;cultural landscape&quot; as a dynamic interaction of route, place, and object. Rather than being a remote region, Hesse was determined by important trans-European routes enabling the transfer of objects and ideas. Along these passages, a dynamic network of micro-landscapes around certain places like towns, abbeys, castles but also bridges with partly distinct political and religious connotations could both develop and transform over a long period. It is our aim to create a better understanding for a historically grounded diversity of German cultural landscapes.NO CLASS during the first week. Class will begin 10/5.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224142",
        "number": "GERMAN 340",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "342",
        "title": "Feminist Avant Garde (GERMAN 142)",
        "description": "Feminist Avant Garde",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222350",
        "number": "GERMAN 342",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "343",
        "title": "World War Two: Place, Loss, History (ARTHIST 401)",
        "description": "A consideration of how the Second World War still goes on today in the form of haunted absences and vivid representations. Studying literature and art in detail, the seminar will center on some of the places where those absences and representations gather: Portbou, Pearl Harbor, Auschwitz, Guadalcanal, London, Berlin, Hamburg, Rome, Omaha Beach, Peleliu, Monte Cassino, Hollywood. Writers and artists include: James Jones, Georges Didi-Huberman, Walter Benjamin, Eduardo Cadava, W.G. Sebald, Rachel Whiteread, Ingeborg Bachman, Wis&iquest;awa Szymborska, Eugene Sledge, Hans Erich Nossack, Jorie Graham, Gerhard Richter, Dani Karavan, Tom Lea, W. Eugene Smith, Val Lewton, and Terrence Malick.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220312",
        "number": "GERMAN 343",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "344",
        "title": "German Media Theory (FILMEDIA 270, FILMEDIA 470, GERMAN 144)",
        "description": "In this seminar, we will interrogate major currents in media-theoretical work from the German-speaking world from the 1980s to today. Starting from the surprisingly controversial term 'German media theory' itself, which has been described as 'neither a theory nor really centered on media, [while] its Germanness is a contested issue' - we will consider the characteristics that nevertheless make this a recognizable, if internally heterogeneous, category for thinking about media, mediation, and culture. We will pay special attention to the foundational work of Friedrich Kittler, which ranges across literature, film, philosophy, and computers, before turning to the current differentiation into a technology-focused 'media archaeology' (Wolfgang Ernst) and the differently inflected formation of 'cultural techniques' (Bernhard Siegert), as well as recent articulations of 'media philosophy' and other developments in contemporary theory. We will also examine the often absent and/or fraught role of gender, race, and class in this field, as well as attempts to address these issues by such theorists as Ute Holl, Cornelia Vissman, Astrid Deuber-Mankowsky, Annette Bitsch, and Sybille Kr&auml;mer. Readings will be in English translation. Knowledge of German is therefore not required, but readers of German will find plenty of research opportunities among the many as yet untranslated texts that make up the field of German media theory.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223569",
        "number": "GERMAN 344",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "345",
        "title": "Psycholinguistics of Multilingualism",
        "description": "This course examines the neuro-cognitive mechanism and processes fundamental in language processing in the bilingual mind.  It highlights code-switching as well as the mental lexicon.  An individual written research overview is required. This is a block course that will meet on T/Th for 80 minutes on February 1, 6,  8, 13, 15, 20, 22, and 27. Taught in German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30566",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225211",
        "number": "GERMAN 345",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "347",
        "title": "The Conservative Revolution (GERMAN 147)",
        "description": "Rapid modernization in early twentieth-century Germany elicited various conservative criticisms, which became particularly acute after the First World War. The thinkers of the Conservative Revolution gave voice to post-Nietzschean concerns about cultural transformation, combining traditionalist and anti-traditionalist positions. Its legacy anticipates current discussions regarding post-modernity, post-democracy, and the impact of technological change. Texts by authors such as: J&uuml;nger, Heidegger, Hofmannsthal, Borchardt, Mann, Arendt, Marcuse. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219326",
        "number": "GERMAN 347",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "353",
        "title": "Hannah Arendt: Facing Totalitarianism (COMPLIT 353B, GERMAN 253, JEWISHST 243A)",
        "description": "Like hardly any other thinker of the modern age, Hannah Arendt's thought offers us timeless insights into the fabric of the modern age, especially regarding the perennial danger of totalitarianism. This course offers an in-depth introduction to Arendt's most important works in their various contexts, as well as a consideration of their reverberations in contemporary philosophy and literature. Readings include Arendt's &lt;em&gt;The Origin of Totalitarianism&lt;/em&gt;, &lt;em&gt;The Human Condition, Between Past and Future&lt;/em&gt;, &lt;em&gt;Men in Dark Times&lt;/em&gt;, &lt;em&gt;On Revolution&lt;/em&gt;,&lt;em&gt;Eichmann in Jerusalem&lt;/em&gt;, and &lt;em&gt;The Life of the Mind&lt;/em&gt;, as well as considerations of Hannah Arendt's work by Max Frisch, J&uuml;rgen Habermas, Seyla Benhabib, Judith Butler, Giorgio Agamben, and others. Special attention will be given to Arendt's writings on literature with an emphasis on Kafka, Brecht, Auden, Sartre, and Camus. This course will be synchronously conducted, but will also use an innovative, Stanford-developed, online platform called Poetic Thinking. Poetic Thinking allows students to share both their scholarly and creative work with each other. Based on the newest technology and beautifully designed, it greatly enhances their course experience.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220959",
        "number": "GERMAN 353",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "356",
        "title": "Thomas Bernhard (GERMAN 256)",
        "description": "This is a course about the Austrian writer Thomas Bernhard, his work, and his time.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220681",
        "number": "GERMAN 356",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "357",
        "title": "What kind of Information is Poetry (GERMAN 157)",
        "description": "&quot;Only a fool reads poetry for facts&quot;: To read a poem with the same fact-seeking attention required by using a dictionary, reading a newspaper article, or following a recipe is, perhaps, foolish. But if it is, it is so only because it means the reader has not understood what a poem is supposed to do. Consider Wittgenstein's famous warning: &quot;Do not forget that a poem, even though it is composed in the language of information, is not used in the language-game of giving information.&quot; A poem, even though it is made of the same (kinds of) words as information, ought not to be treated as information (the sentence seems to say). Distinct in their respective functions, poetry and information form two ends of an opposition: one for the creative possibilities for human expression, the other for the practical and mechanical tasks of everyday life.nBut what really &quot;is&quot; information? Has poetry not, since the beginning of time, also functioned as vehicle for storing, quantifying, and communicating things&iquest;from historical events, the law, to agricultural manuals, just as &quot;informational&quot; texts do?  How has the emergence of technological media in our so-called Information Age altered, reinforced, or revolutionized the place of poetry in the realm of human communication?nThese questions will motivate this course, which is also a general introduction to poetry and poetics. We will closely read German texts from the Musipilli to digital-born poetry, and secondary material from thinkers and theorists such as Schlegel, Schleiermacher, Benjamin, Wittgenstein, Flusser, and Bense, to learn how various methods of reading and literary criticism - from formalism and structuralism to Digital Humanities approaches - have developed alongside something like &quot;information&quot; as literary quality and social form.nAssistant Professor Lea Pao will teach this course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219546",
        "number": "GERMAN 357",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "358",
        "title": "Seminar in Medieval German Studies",
        "description": "In this weekly seminar we will read primary materials, and important scholarship, and discuss ongoing debates and trends in medieval studies. The reading list will be determined in consultation with the participants; students will be invited to share their own work with the group. All graduate students working in medieval studies or interested in deepening their familiarity with medieval studies are encouraged to participate. This course will be taught by Visiting Professor Sarah Bowden (King's College London).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30084",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222940",
        "number": "GERMAN 358",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "361",
        "title": "Theorie des Erzählens (GERMAN 261)",
        "description": "This course approaches the history of narrative theory from the German perspective: we will read canonical and foundational texts that have shaped the way we read and study narrative - from the usual suspects (Gerard Genette, Yuri Lotman, Tzvetan Todorov, Algirdas Julien Greimas) to the (here) lesser known German theorists of narrative forms and literary theory (Frank K. Stanzel, K&auml;te Hamburger, Monika Fludernik, Siegfried J. Schmidt). Alongside these theoretical approaches, we will read two German novels, which we'll use as experimental playground to better test and understand how and why literary theory can help us construct models of reading, world-making, human experience, and storytelling. Towards the end of the course, we'll switch to the open questions and future of narrative theory: what media of long-form storytelling come after the novel? What do they have in common with, say, the novels of J.W. Goethe, Adalbert Stifter, Lou Andreas-Salom&eacute;, or Ingeborg Bachmann? How would we expand narrative theory to include today's most important and engaging sites of storytelling (like video games or serial television)? Taught in German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222584",
        "number": "GERMAN 361",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "363",
        "title": "Paul Celan: The Poetic Event (COMPLIT 263B, GERMAN 263, JEWISHST 263)",
        "description": "Paul Celan (1920-1970) is one of the greatest poets of our time. Touching on philosophy, history, our relation to nature, and love, his poetry is a profound meditation on the modern human condition. This course will present some of Celan's best work and will discuss significant contributions to Celan scholarship. Readings include Heidegger, Gadamer, Nelly Sachs, Bachmann, Derrida, Szondi, and Anne Carson, among others.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30383",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223493",
        "number": "GERMAN 363",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "366",
        "title": "Questions of Political Theology (GERMAN 266)",
        "description": "How does theology inform culture and politics in our age of high technology?  Are there religious underpinnings in the contemporary world to categories of creativity, charisma and community? This course explores theoretical approaches to the ongoing resonance of theology through readings by Max Weber, Carl Schmitt, Leo Strauss, Oswald Spengler,  Ren&eacute; Girard and others and through regular visits by Peter Thiel. To be considered for enrollment in this course, please complete and submit this short application by October 19, 2022, 11:59pm PST. Students accepted to participate in this course will be notified on October 26, 2022 by 6:00pm. Auditors are not permitted.  Please use this url to fill out the application: https://forms.gle/PM2mTYot6eGnNPpL8",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224396",
        "number": "GERMAN 366",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "367",
        "title": "Prospects for Transatlantic Relations: What Holds the West Together? (GERMAN 267)",
        "description": "This seminar treats contemporary transatlantic relations including 1) the green transformation: economic policy,  energy imports and costs of energy generation; 2) the 'Zeitenwende' in defense policy; future German-Russian relations; Germany and  China (decoupling versus derisking);  NATO and transatlantic security; 3) demographic changes between immigration and aging populations.  Meeting times: This block seminar meets from 9:00am to 11:00am in room 260-252 on Monday, November 6, Wednesday, November 8, and Friday, November 10, 2023, as well as other occasional meetings TBD. Taught in English with readings in German and English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13235",
                "currentClassSize": "0",
                "maxClassSize": "8",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Huether, M.",
                                "sunet": "huether"
                            },
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219466",
        "number": "GERMAN 367",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "369",
        "title": "Introduction to the Profession of Literary Studies (COMPLIT 369, DLCL 369, FRENCH 369, ITALIAN 369)",
        "description": "A survey of how literary theory and other methods have been made institutional since the nineteenth century. The readings and conversation are designed for entering Ph.D. students in the national literature departments and comparative literature.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13729",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "300-303",
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "117816",
        "number": "GERMAN 369",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "374",
        "title": "The Poem as Medium (GERMAN 174)",
        "description": "Since Marshall McLuhan formulated his theory of &quot;media&quot; as &quot;extensions of ourselves,&quot; we've come to understand the history of human communication in terms of its physical carriers, tools, and technologies. From cuneiform, hieroglyphs, and logographic writing systems, to the alphabet, to algorithms; from clay tablets, to papyrus, to LED screens; from scrolls, to books, to the gramophone, to DNA - the medium and the message shape how we store and communicate information. Poetry's place in this history of media has been both elusive and strangely consistent. In media theory, the poem, which Hans Magnus Enzensberger once called an &quot;archaic medium&quot; and Niklas Luhman a &quot;paradoxical form of communication,&quot; often serves as an example of the non-ordinary, of opacity, untranslatability, self-mediation, or hypermediacy. We will read (often lesser known) texts by media theorists (McLuhan, Kittler, Flusser, Benjamin, Luhmann, Siegfried J. Schmidt, Hayles) and a selection of pre-media theory texts on the mediality and mediacy of poetry (Lessing, Hegel, Herder Schleiermacher, Hamburger), as well as one poem each week as we explore the relation between medium and message, content and form. Taught in German.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221662",
        "number": "GERMAN 374",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "375",
        "title": "The Sustainability of the Human Record (ENGLISH 370, SUSTAIN 350)",
        "description": "What happens in the year 12,021 when future generations seek to understand the extensive record of human endeavour, experience, and life, today and previously? What will constitute a future Rosetta Stone that makes accessible surviving monuments, texts, and languages of 2021; that ensures future people will know how to avoid the deadly nuclear dumps and climate breakdown created now? How can we seek to guarantee in the present that the technologies upon which we rely will be legible and accessible in even mere decades to come?This course will focus on the recording and preservation of, and access to, human communication through its long history and into the next century. How is communication created, produced, and received? How sustainable are the many media and devices through which it is transmitted? What are the key components to sustaining an understanding of the human record without which one might argue very little really matters?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224224",
        "number": "GERMAN 375",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "388",
        "title": "In Search of the Holy Grail: Percival's Quest in Medieval Literature (COMPLIT 188, COMPLIT 388, GERMAN 188)",
        "description": "This course focuses on one of the most famous inventions of the Middle Ages: the Holy Grail. The grail - a mysterious vessel with supernatural properties - is first mentioned in Chr&eacute;tien de Troyes' &quot;Perceval,&quot; but the story is soon rewritten by authors who alter the meaning of both the grail and the quest. By reading three different versions, we will explore how they respond differently to major topics in medieval culture and relevant to today: romantic love, family ties, education, moral guilt, and spiritual practice. The texts are: Chr&eacute;tien de Troyes' &quot;Perceval,&quot; Wolfram von Eschenbach's &quot;Parzival,&quot; and the anonymous &quot;Queste del Saint Graal.&quot; All readings will be available in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220690",
        "number": "GERMAN 388",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "396",
        "title": "German Studies Lecture Series",
        "description": "What's happening in German Studies today? The GSLS invites 3 speakers per quarter to present on their work and research in German literature, culture, politics, and history, offering students an insight into the current field of German Studies and an engagement with topics ranging from medieval fabrics to the refugee crisis. Luncheons are scheduled every first Tuesday of the month. To earn the unit for this course, students will attend the lecture, read 1-2 articles or book chapters written by the speaker of the week, and complete one short 2-page writing assignment (this could be a reflection, a review, a creative assignment, a poetic adaptation of a talk - we'll discuss). Taught in German and English.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30147",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14539",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28062",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221665",
        "number": "GERMAN 396",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "397",
        "title": "Graduate Studies Colloquium",
        "description": "Colloquium for graduate students in German Studies. Taught in English. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "7309",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 71400.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "7460",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 71400.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "11212",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:50:00 PM",
                        "location": "260-003",
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 71400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214403",
        "number": "GERMAN 397",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "398",
        "title": "Dissertation Prospectus Colloquium",
        "description": "Repeatable for Credit",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29373",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29663",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "29195",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "31193",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10377",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "11077",
                "currentClassSize": "0",
                "maxClassSize": "3",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "31194",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10378",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11078",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "31195",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10379",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11079",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "31196",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "29196",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "30921",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "31197",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "30922",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "31198",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10380",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "10381",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213811",
        "number": "GERMAN 398",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 21
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "399",
        "title": "Individual Work",
        "description": "Repeatable for Credit.  Instructor Consent Required.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29667",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29377",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10467",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "11425",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "30923",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10468",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "11426",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "11072",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10469",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11427",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11073",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11074",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "29197",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "31163",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10470",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "30924",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "11428",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "29198",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10471",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "11429",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213815",
        "number": "GERMAN 399",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 21
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "680",
        "title": "Curricular Practical Training",
        "description": "CPT course required for international students completing degree. nPrerequisite: German Studies Ph.D candidate.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "220677",
        "number": "GERMAN 680",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "GERMAN",
        "code": "802",
        "title": "TGR Dissertation",
        "description": "Doctoral students who have been admitted to candidacy, completed all required courses and degree requirements other than the University oral exam and dissertation, completed 135 units or 10.5 quarters of residency (if under the old residency policy), and submitted a Doctoral Dissertation Reading Committee form, may request Terminal Graduate Registration status to complete their dissertations.",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29668",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29378",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "29199",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pao, L.",
                                "sunet": "lpao"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "10382",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "11298",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "11136",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "10383",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "11299",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "11137",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernhardt-Kamil, E.",
                                "sunet": "ebernhar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "10384",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "11300",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "11138",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daub, A.",
                                "sunet": "daub"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "30927",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "10385",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "11301",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "George, A.",
                                "sunet": "alys"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "10386",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "11302",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "11140",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Starkey, K.",
                                "sunet": "starkey"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "11",
                "component": "T/D",
                "notes": null,
                "classId": "11774",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "11",
                "component": "T/D",
                "notes": null,
                "classId": "12273",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Smith, M.",
                                "sunet": "mwsmith1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213816",
        "number": "GERMAN 802",
        "units": [
            0
        ],
        "totalSections": 21
    }
]