[
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "6W",
        "title": "Community-Engaged Learning Workshop on Human Trafficking - Part I (FEMGEN 6W, HISTORY 6W)",
        "description": "Considers purpose, practice, and ethics of service learning.  Provides training for students' work in community.  Examines current scope of human trafficking in Bay Area, pressing concerns, capacity and obstacles to effectively address them.  Students work with community partners dedicated to confronting human trafficking and problems it entails on a daily basis.  Must currently be enrolled in or have previously taken History 5C/105C (FemGen 5C/105C, HumBio 178H, IR 105C, CSRE 5C/105C).  (Cardinal Course certified by the Haas Center)",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "216366",
        "number": "HUMRTS 6W",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "7W",
        "title": "Community-Engaged Learning Workshop on Human Trafficking - Part II (FEMGEN 7W, HISTORY 7W)",
        "description": "Prerequisite:  HISTORY6W (FEMGEN 6W).  Continuation of HISTORY 6W (FEMGEN 6W).  Students will continue working on their projects with their community partners. Several class meetings and small group consultations throughout the quarter.  (Cardinal Course certified by the Haas Center)",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "216367",
        "number": "HUMRTS 7W",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "101",
        "title": "Cross-Disciplinary Perspectives on Human Rights Theory and Practice",
        "description": "This course will introduce students to the philosophical and historical foundations for the modern concept of human rights, as well as the international and domestic legal frameworks currently in force to protect and promote these rights. Students will learn about the broad landscape of institutions responsible for defining and enforcing human rights from scholars who study the institutions, and practitioners who have worked inside them. Throughout the quarter we will read and discuss critical scholarship about the gap between the promises and aspirations of international human rights covenants, and the ongoing realities of widespread oppression, exploitation, and atrocity happening around the world. We will welcome practitioners as well as guest faculty from departments across the university whose teaching and research touches on aspects of human rights within their respective fields of expertise. Throughout the course, we will explore how distinct perspectives, assumptions, and vocabulary of particular disciplinary communities affect the way scholars and practitioners trained in these fields approach, understand, and employ human rights concepts. HUMRTS 101 fulfills the gateway course requirement for the Minor in Human Rights, and is offered once per year, winter quarter. No prior knowledge or formal human rights education is required of students enrolling in this introductory course. Students of all years and majors are welcome to join. Students should enroll in Section 01 of the course for in-person instruction Tu/Th 4:30-6:30pm. Optional office hours will be offered after 6:30pm. Enrollment in Section 02 is available only by special consent of the instructor, for students with special circumstances who need to complete HUMRTS 101 for the Minor, but cannot regularly attend the class in person as scheduled for Section 01. Students enrolled in Section 02 will complete identical curriculum, and will engage with classmates from Section 02 on a single Canvas site, but will have asynchronous and remote scheduling options for lectures. These same asynchronous and remote options can also be made available to Section 01 students (if/when needed, at discrete times throughout the quarter) in the event of COVID-related disruptions to class (e.g. instructor illness, student quarantine).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13326",
                "currentClassSize": "0",
                "maxClassSize": "44",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Van Tuyl, P.",
                                "sunet": "pvantuyl"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 69600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "SEM",
                "notes": null,
                "classId": "13417",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Van Tuyl, P.",
                                "sunet": "pvantuyl"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "218693",
        "number": "HUMRTS 101",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "103",
        "title": "Transitional Justice, Human Rights, and International Criminal Tribunals (ETHICSOC 280, INTLPOL 280, INTNLREL 180A)",
        "description": "(Formerly IPS 280) Historical backdrop of the Nuremberg and Tokyo Tribunals.  The creation and operation of the Yugoslav and Rwanda Tribunals (ICTY and ICTR).  The development of hybrid tribunals in East Timor, Sierra Leone, and Cambodia, including evaluation of their success in addressing perceived shortcomings of the ICTY and ICTR. Examination of the role of the International Criminal Court and the extent to which it will succeed in supplanting all other ad hoc international justice mechanisms and fulfill its goals.  Analysis focuses on the politics of creating such courts, their interaction with the states in which the conflicts took place, the process of establishing prosecutorial priorities, the body of law they have produced, and their effectiveness in addressing the needs of victims in post-conflict societies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12328",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210843",
        "number": "HUMRTS 103",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "106",
        "title": "Human Rights in Comparative and Historical Perspective (CLASSICS 116, CLASSICS 216, ETHICSOC 106)",
        "description": "The course examines core human rights concepts and issues as they arise in a variety of contexts ranging from the ancient world to today. These issues include slavery, human trafficking, gender based violence, discrimination against marginalized groups, and how these and other issues are linked to war, internal conflict, and imperialism. We will consider the ways in which such issues emerge, are explicitly treated, or are ignored in a variety of historical and contemporary settings with a particular emphasis on the impact that war and conflict have on laws and norms that in principle aim to protect individuals from violence and exploitation. This inquiry also entails consideration of the modern notion of the universality of human rights based on a conception of a common humanity and how alien that concept is in states and communities that define or embody hierarchies that systematically exclude groups or populations from the protections and respect that other groups and individuals are afforded. Nowhere do the devastating consequences of such exclusions become clearer than in times of crisis and conflict. The course draws upon a variety of case studies from the Greco-Roman world and other temporal and geographical contexts to explore the political and social dynamics that shape and inform the violence inherent in such events.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15320",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "219927",
        "number": "HUMRTS 106",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "108",
        "title": "Advanced Spanish Service-Learning: Migration, Asylum, and Human Rights at the Border",
        "description": "This community engaged learning workshop is open only to students who are concurrently enrolled in SPANLANG 108SL. Through the HUMRTS 108 units, students will have the opportunity to apply their advanced Spanish language skills and knowledge of the US immigration detention system from the class as volunteers with immigrant rights advocacy organizations. Students will be trained to staff a hotline to help monitor detention conditions in more than 200 immigrant prisons, report abuse, expose dehumanizing conditions, and request support on behalf of detainees and their loved ones. Human rights lawyer Penelope Van Tuyl will guest lecture to give students legal context, and we will have the visits as well of other specialists in US-Central American international relations, mental health, media, and art activism. We will also be joined by migrants and refugees who will share their stories in US detention and seeking asylum.  This course requires permission from the instructor to enroll. Please email instructor Vivian Brates vbrates@stanford.edu to get a link to the appropriate web form.  Please note that this course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit. Cardinal Course certified by the Haas Center for Public Service.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13328",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Brates, V.",
                                "sunet": "vbrates"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14086",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Brates, V.",
                                "sunet": "vbrates"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12813",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Lathrop 197",
                        "instructors": [
                            {
                                "name": "Brates, V.",
                                "sunet": "vbrates"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-ER"
        ],
        "objectID": "220870",
        "number": "HUMRTS 108",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "112",
        "title": "Human Trafficking: Historical, Legal, and Medical Perspectives (CSRE 105C, FEMGEN 105C, HISTORY 105C, INTNLREL 105C)",
        "description": "(Same as HISTORY 5C. 105C is 5 units, 5C is 3 units.) Interdisciplinary approach to understanding the extent and complexity of the global phenomenon of human trafficking, especially for forced prostitution, labor exploitation, and organ trade, focusing on human rights violations and remedies. Provides a historical context for the development and spread of human trafficking. Analyzes the current international and domestic legal and policy frameworks to combat trafficking and evaluates their practical implementation. Examines the medical, psychological, and public health issues involved. Uses problem-based learning. Required weekly 50-min. discussion section, time TBD. Students interested in service learning should consult with the instructor and will enroll in an additional course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "213147",
        "number": "HUMRTS 112",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "115",
        "title": "Corporations, Human Rights, and Social Responsibility",
        "description": "Large corporations now routinely spend millions of dollars to protect human rights and the environment. Shell Nigeria builds hospitals and schools in the Niger Delta. Nike employs hundreds of inspectors to improve conditions for the factory workers who produce its shoes across Asia and Latin America. Social media companies have faced scandals over user privacy, hate speech, and political manipulation. Other examples abound, across industries and around the globe. nnn&quot;Don't be evil&quot; (Google's one-time slogan) may be one motivation for these companies, but something more mundane is also at work: many companies believe they will do well, financially, if they do good, ethically. This course considers: nn-What does it mean for a company to &quot;do good?&quot; Should it care? nn-When does it serve a company's interest to take costly action to address human rights, labor, and environmental concerns? nn-What tactics have activists used to shift public opinion, media frames, and the law, and thereby change companies' incentives? nnnWe will learn through lectures, discussion, and occasional small group exercises. Several guest speakers with experience in business, advocacy, or in between will provide additional insights.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13731",
                "currentClassSize": "0",
                "maxClassSize": "23",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "O'Connell, J.",
                                "sunet": "jamieoc"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222219",
        "number": "HUMRTS 115",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "117",
        "title": "International Human Rights (INTLPOL 355)",
        "description": "(LAW 5010)  In part as a result of the rise of international human rights mechanisms in the twentieth century, conflicts over resources, privileges and power are now increasingly mediated through the lens of human rights, in terms of the protection of individual or group rights. Given that many of the most significant and complex national and international challenges today center on fundamental questions of human rights, understanding the legal regime that governs these rights is an important part of a comprehensive legal education.  This course serves as an introduction to the law, theory and practice of international human rights, together with the instruments, organizations and arrangements that affect their implementation and enforcement.  It will explore human rights as a philosophical and legal concept, and briefly probe differences between human rights, civil rights, and development frames. The course will then focus on the legal regime through which sovereign states have established human rights instruments and doctrine as part of positive international law, sometimes with binding domestic legal effects. We will review the foundations and history of international human rights law; the major international and regional human rights instruments and institutions; mechanisms and strategies of enforcement; and selected current issues in the field.  Elements used in grading:  Attendance, Class Participation, Exam.  Advanced undergraduate and graduate students may request enrollment by sending a statement of interest to Professor Achiume (achiume@law.stanford.edu).  Requests will be reviewed on a rolling basis.  Undergraduates who wish to enroll in this course must have completed HUMRTS 101 as a prerequisite.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14223",
                "currentClassSize": "0",
                "maxClassSize": "3",
                "schedules": [
                    {
                        "startTime": "11:10:00 AM",
                        "endTime": "12:40:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Achiume, E.",
                                "sunet": "achiume"
                            }
                        ],
                        "startTimestamp": 40200.0,
                        "endTimestamp": 45600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220890",
        "number": "HUMRTS 117",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "120",
        "title": "Human Rights in an Age of Great Power Rivalry, War, and Political Transformation (CLASSICS 129, GLOBAL 125, GLOBAL 225, INTNLREL 129)",
        "description": "As is well known, great and emerging power rivalries largely shaped the course of the 20th century through WWI, WWII, and the Cold War. In the aftermath of the collapse of the Soviet Union, the 21st century been characterized by the geopolitical reconfiguration underway today with the rise of China and India and the challenges posed for American and European influence. The end of the Cold War brought hope that the proxy wars, post-colonial conflicts, and mass atrocity events that characterized the mid-20th century would yield to a more stable international order of cooperation and, hence, to a greater realization of the human rights aspirations embodied in the UN framework. The founding of the International Criminal Court (ICC) in 2002 was widely hailed as a watershed event marking that transformation. Needless to say, those hopes have remained largely unrealized and the refusal of China, India, the United States, and Russia to join the ICC is indicative of how far away a realization of those aspirations remains. As this age of great power political, economic, and military rivalry intensifies how is it impacting both the countries where the rivalries are being played out (e.g.,in the Middle East, Southeast Asia, Africa) and the societies of the rival nations themselves? How are these conflicts affecting the response to global humanitarian issues such as migration, refugees, statelessness, human trafficking, modern day slavery, climate change, and the turn towards increasing authoritarian governance? The course will explore the humanitarian dimension and consequences of war, conflict, and political transformation in such contexts through a series of case studies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223735",
        "number": "HUMRTS 120",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "122",
        "title": "Global Human Rights and Local Practices (INTLPOL 282, INTNLREL 125, SOC 115, SOC 215)",
        "description": "The course examines how the international community has fared in promoting and protecting human rights in the world, with an emphasis on the role of the United Nations. The course will begin with an overview of debates about the state of the international human rights system in the contemporary world, and then examine how international society has addressed the challenges of implementing universal human rights principles in different local contexts across different issues. The specific rights issues examined include genocide, children's rights, labor rights, transitional justice, women's rights, indigenous rights, NGOs, and the complicated relationship between the US and global human rights. The course will feature video conference/guest lecture sessions with leading human rights scholars and practitioners, providing students with unique opportunities to hear their expert opinions based on research and experience.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14122",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tsutsui, K.",
                                "sunet": "teru"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223501",
        "number": "HUMRTS 122",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "123",
        "title": "Current Issues in Southeast Asia (INTLPOL 226)",
        "description": "Current Issues in Southeast Asia  (INTLPOL 226) is a seminar that will examine some of the key challenges facing the nations of Southeast Asia, which collectively boast the world's fifth largest economy and are home to some 680 million people.  After a brief introduction to the region's history and geography, students will review the region's political systems and  -- using country-specific case studies -- look at how they are dealing with issues such as democracy versus authoritarianism, ethnic and religious divisions, economic development, climate change, and China's rising influence. The course will cover all these issues in the context of some of the real-world factors, as opposed to theoretical concepts that influence and shape policies and decisions in the region, and which in many ways pose a threat to Southeast Asia's remarkable potential.  It will also offer an opportunity for students to learn about the policymaking process and policy-related writing.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15482",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Marciel, S.",
                                "sunet": "marciel7"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223819",
        "number": "HUMRTS 123",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "194A",
        "title": "Environmental Justice Colloquium (EARTHSYS 194A, URBANST 155A)",
        "description": "This colloquium brings the voices and vision of leading Environmental Justice (EJ) advocates to the Stanford community, in order to educate, inspire, and transform our understanding of environmental science.  Environmental Justice advances a positive vision for policies and actions that fight environmental racism. EJ approaches involve centering the voices and leadership of marginalized communities in 1) ensuring equitable access to environmental benefits, and 2) preventing or mitigating the disproportionate impacts of environmental harms for all communities, regardless of gender, class, race, ethnicity, or other social positions. This colloquium highlights the work of leading EJ thinkers and practitioners, speaking from frontline organizations on a wide range of topics. These topics include acting on toxic exposures and health disparities for community resilience, climate justice and youth action, Indigenous land and water rights, green cities and Afrofuturism, food justice and intersecting social movements, queer ecologies, and more. The colloquium will host a weekly speaker with course meetings held every Wednesday. Colloquium presentations will begin promptly at 12pm.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "13738",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": "300-300",
                        "instructors": [
                            {
                                "name": "Diver, S.",
                                "sunet": "sibs"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222700",
        "number": "HUMRTS 194A",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "196",
        "title": "Environmental Justice and Human Rights Lab (EARTHSYS 196A)",
        "description": "The Environmental Justice and Human Rights Lab is an intellectual hub and supportive learning community for students engaging in environmental justice and human rights work of any kind. Environmental justice (EJ) advances a positive vision for policies and actions that fight environmental racism, and human rights (HR) center on the notion that all people, by virtue of their existence and regardless of any given status or classification, are equally entitled to fundamental rights and protections. Our semi-structured weekly sessions will foster an open learning environment for students and peer-to-peer learning connections. Sessions will include giving and receiving feedback on capstone or community-based projects, independent research, or other relevant coursework or extracurricular activity. We also welcome students who are new to these topics and would like to learn more. We are open to students of all backgrounds and disciplines at any stage of their research or project work. Following EJ and HR principles, we seek to center local, contextualised knowledge and leadership through ethical research partnerships with community members. To do so, we follow community-based participatory research approaches and decolonizing methodologies. Examples of our work to date include 1) enabling graduate students to effectively bring EJ and HR approaches into dissertation research, 2) supporting campus leaders and directly participating in diversity, equity, and inclusion (DEI) initiatives, and 3) educating and learning from one another about critical EJ and HR scholarship and anti-racist approaches to our work. Lab interests include addressing inequitable impacts of climate change, advancing decolonial approaches to land and water management, promoting food justice, combatting human trafficking and labor exploitation, promoting fair and just immigration policies, and additional EJ and HR research topics. Note that this lab is intended as an open space for engagement. If you are unable to enroll for credit, but would still like to participate, please email humanrights@stanford.edu.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32595",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Diver, S.",
                                "sunet": "sibs"
                            },
                            {
                                "name": "Van Tuyl, P.",
                                "sunet": "pvantuyl"
                            },
                            {
                                "name": "Brunner, J.",
                                "sunet": "jbrunner"
                            },
                            {
                                "name": "Polk, E.",
                                "sunet": "empolk"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222862",
        "number": "HUMRTS 196",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "197",
        "title": "Human Rights Careers Intensive",
        "description": "This weekly seminar aimed at juniors, seniors, and graduate students, to support practical exploration of human rights careers. Students will meet alumni and other human rights professionals working in a variety of sectors, and get job-search ready. Each week, a guest speaker will present their unique story to the group, helping you connect your skills and undergraduate experiences at Stanford to long-term, meaningful human rights work. Please note this is a 6 week course beginning Week 2 of the Spring Quarter. For registration information please visit: https://humanrights.stanford.edu/academics/human-rights-careers-intensive",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Meets in Encina Hall Central 030.",
                "classId": "13084",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Van Tuyl, P.",
                                "sunet": "pvantuyl"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Course will take place in Encina Hall Center 029.",
                "classId": "12814",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Van Tuyl, P.",
                                "sunet": "pvantuyl"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 44400.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221426",
        "number": "HUMRTS 197",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "198",
        "title": "Independent Study or Directed Reading in Human Rights",
        "description": "May be repeated for credit. Students using these units toward the Minor in Human Rights must take for a letter grade. Department consent is required for enrollment. Please contact denisefz@stanford.edu indicating your plan and demonstrating agreement from the instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29926",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29651",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27862",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "13035",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "14080",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "13271",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "30964",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Brates, V.",
                                "sunet": "vbrates"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "15079",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Brates, V.",
                                "sunet": "vbrates"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "15702",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Brates, V.",
                                "sunet": "vbrates"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218850",
        "number": "HUMRTS 198",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 9
    },
    {
        "year": "2023-2024",
        "subject": "HUMRTS",
        "code": "199",
        "title": "Capstone Project: Human Rights Minor",
        "description": "Students completing a required capstone project for the Minor in Human Rights must enroll in this course for units with their capstone adviser selected as the instructor.  Students must agree with their capstone advisor how many units (3-5) their proposed capstone project is worth, and enroll accordingly. This course is open only to Human Rights Minors. Department consent is required for enrollment. Please contact denisefz@stanford.edu indicating your plan and demonstrating agreement from your advisor.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29655",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29938",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27866",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "12341",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "12599",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "12331",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "13960",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "O'Connell, J.",
                                "sunet": "jamieoc"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "15078",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Achiume, E.",
                                "sunet": "achiume"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "14733",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Brates, V.",
                                "sunet": "vbrates"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "15210",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "O'Connell, J.",
                                "sunet": "jamieoc"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "14816",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jolluck, K.",
                                "sunet": "katya"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "12999",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jolluck, K.",
                                "sunet": "katya"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "14220",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Brates, V.",
                                "sunet": "vbrates"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "14393",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tsutsui, K.",
                                "sunet": "teru"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218969",
        "number": "HUMRTS 199",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 14
    }
]