[
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "12Q",
        "title": "Humanities Core: Great Books, Big Ideas -- Europe, Middle Ages and Renaissance (DLCL 12Q, FRENCH 12Q, HUMCORE 12Q)",
        "description": "This three-quarter sequence asks big questions of major texts in the European and American tradition.  What is a good life?  How should society be organized?  Who belongs?  How should honor, love, sin, and similar abstractions govern our actions?  What duty do we owe to the past and future?  The second quarter focuses on the transition from the Middle Ages to Modernity, Europe's re-acquaintance with classical antiquity and its first contacts with the New World. Authors include Dante, Shakespeare, Machiavelli, Cervantes, and Milton. N.B. This is the second of three courses in the European track. These courses offer an unparalleled opportunity to study European history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future. Students who take HUMCORE 11 and HUMCORE 12Q will have preferential admission to HUMCORE 13Q (a WR2 seminar).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220740",
        "number": "ILAC 12Q",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "102",
        "title": "Spanish Through Poetry",
        "description": "This Spanish poetry course is designed for intermediate and advanced speakers who have an interest in environmental issues. It examines how poetry reflects and reimagines the environment, specifically in Latin America, from the 70s to the present. The course explores different aesthetic and theoretical approaches to poetry related to nature, ecopoetry, postnatural poetry, and poetry of place. Students will analyze and discuss various types of poetry, including single and collective poems, serial poetry, and multimedia poems. These may include Cecilia, Vicun?a?s SemiYa (Chile); C&iquest;sar Vallejo?s &quot;Los mineros salieron de la mina&quot; (Per&iquest;); Esthela Calder&iquest;n?s Soplo de corriente vital (Nicaragua); Exequiel Zaidenwerg?s &quot;&iquest;Qu&iquest; es la poes&iquest;a? (Yo es Nosotrxs)&quot; (Argentina); Humedal: poema a cuatro manos (collective poem, Wetlands Argentina); Lorenzo Sandoval?s Aquel Verano del 22 (Spain); Nicanor Parra?s ecopoemas (Chile); Ra&iquest;l Zurita?s &quot;Escritos en el cielo&quot; and &quot;Ni pena ni miedo&quot; (Chile); Roxana Miranda Rupailaf?s Shumpall (text and video-poem) (Wallmapu); Ver&iquest;nica Gerber Bicecci?s Otro d&iquest;a? (poemas sint&iquest;ticos) (M&iquest;xico); Yolanda Pant&iquest;n?s &quot;Deslave&quot; (Venezuela). In this genre, we will explore how environmental concerns are expressed through formal language and imagery. We will examine whether poetic devices obscure or reveal environmental inquiries and how language can highlight power dynamics and promote environmental consciousness. We will delve deeply into the formal aspects of language and the material processes involved in creating environmental poetic imagery, and we will connect poetry to environmental activism. Students must also enroll in the related course SPANLANG 103 &quot;Concurrent Writing Support&quot; for language learning.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29238",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Gates100",
                        "instructors": [
                            {
                                "name": "Castro, A.",
                                "sunet": "azca33"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "225387",
        "number": "ILAC 102",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "103E",
        "title": "Archeology of Computer Science: Islamic, Iberian, and Pre-Columbian Roots",
        "description": "This course examines the history of computer science before there were computers and before there was a scientific field. It makes use of an archaeology of knowledge to find traces in the past for ideas and practices common in our present. We will explore in this course some of the ideas and devices that foreshadowed, during the Middle Ages and Early Modernity, the field of computation. We will also explore the different uses that were given or were meant to be given to these ideas and devices. In this journey, we will discover how different cultures created, used, or imagined different devices for computation. Some of the topics that we will cover are: al-Khwarizmi's algebra, al-Jazari's clocks, Raymond Llull's combinatorial diagrams, Peruvian Quipus, and Leibniz's binary numbers. Our focus is cultural, philosophical, and historical, the course will not involve programming and knowing how to program is not a prerequisite. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "224234",
        "number": "ILAC 103E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "104",
        "title": "The Female Gaze: 20th-21st Century Iberian Literature and Visual Culture",
        "description": "What is gazing in Literature, Photography, and Film? Is there such a thing as a &quot;female gaze&quot;?  In this course, we will explore the concept of &quot;the gaze&quot; in Modern and Contemporary Iberian Literature and Visual Culture from a gender perspective and a multimedia approach. We will examine narrative, photographic, and cinematic works produced in Spain and Portugal from the 1930s to today by major authors such as Merc&egrave; Rodoreda, L&iacute;dia Jorge, &quot;Colita&quot;, Ic&iacute;ar Bolla&iacute;n, or Carlos Saura, among others. We will pay attention to perspective and positionality to explore how women gaze and are gazed as new technologies and ways of seeing evolve. Students will learn to visually analyze cultural artifacts and to compare how different media and forms question notions of gender and (in)visibility. Students will improve their interpretative and communication skills in Spanish. Taught in Spanish. Non-majors may write in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224263",
        "number": "ILAC 104",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "105",
        "title": "Climate Change and Latin American Naturecultures",
        "description": "In this course, we will explore fundamental concepts of the environmental humanities as they relate to the inseparable natural and cultural phenomena that constitute climate change in Latin America. The course will be structured around different ecological themes, such as energy and extractive industries, the Amazon, the desert, the Andes, the Caribbean, and urban habitats, that will be examined through twentieth- and twenty-first-century Latin American novels, films, short stories, and songs. Possible authors include Gloria Anzald&uacute;a, Macarena G&oacute;mez-Barris, Gabriel Garc&iacute;a M&aacute;rquez, and Jos&eacute; Eustasio Rivera. We will consider the ethics and politics of climate change in the Americas, how the methodologies of literary and decolonial studies can generate insights into contemporary climate change impacts in Latin America, and what role culture has in a period defined by chronic and slow-moving environmental crisis and recovery. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29820",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "220709",
        "number": "ILAC 105",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "106",
        "title": "From Disney to Telenovelas: Latin America in Popular Film and TV (CHILATST 106)",
        "description": "Popular film and media have represented Latin America in various ways, including as a geographical region, a homogeneous culture, and a form of racialization. In this course, we will investigate these representations to understand how Latin America, its people, and its diaspora imagine themselves and how others have conceptualized the region. We will pay particular attention to the myths and stereotypes that cinema and television have sustained as well as Latin America's history of colonization to examine the prevalence of anti-blackness, anti-indigeneity, and other forms of erasure and social exclusion. Sources include Disney's Saludos Amigos and Encanto, Pixar's Coco, and the telenovela Yo soy Betty la fea, among others.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28569",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "STLC 119",
                        "instructors": [],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225285",
        "number": "ILAC 106",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "107N",
        "title": "History in Images: Scenes from the Franco Dictatorship in Spanish Cinema",
        "description": "A restrospective of films from the 1950s to the early 21st century dealing with the troubled representation of the Spanish Civil War and the postwar &quot;iron years&quot;. The seminar will analyze the distortion of the past through both censorship and individual recollection under conditions of personal and collective trauma, while exploring the relation between history and film. We will also discuss the ways in which objective images can be used to explore subjectivity. Outstanding films by Luis Garc&iquest;a Berlanga, Luis Bu&iquest;uel, Carlos Saura, V&iquest;ctor Erice, Pilar Mir&iquest;, Julio Medem, Pedro Almod&iquest;var, Guillermo del Toro, Agust&iquest; Villaronga and Alejandro Amen&iquest;bar. Spanish comprehension is necessary for the required class films.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "28570",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "80-115",
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225286",
        "number": "ILAC 107N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "111Q",
        "title": "Texts and Contexts: Spanish/English Literary Translation Workshop (COMPLIT 111Q, DLCL 111Q)",
        "description": "The Argentinian writer and translator, Jorge Luis Borges, once said, 'Cada idioma es un modo de sentir el universo.' How are modes of feeling and perception translated across languages? How does the historical context of a work condition its translation into and out of a language? In this course, you will translate from a variety of genres that will teach you the practical skills necessary to translate literary texts from Spanish to English and English to Spanish. By the end of the term, you will have translated and received feedback on a project of your own choosing. Discussion topics may include: the importance of register, tone, and audience; the gains, in addition to the losses, that translations may introduce; the role of ideological, social-political, and aesthetic factors on the production of translations; and comparative syntaxes, morphologies, and semantic systems. Preference will be given to sophomores but freshman through seniors have enjoyed this course in the past. Course taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "216290",
        "number": "ILAC 111Q",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "112Q",
        "title": "2666",
        "description": "The novel 2666 has been regarded as the first classic of world literature in the 21st century. At the end of this course, you will have read and studied this work in its entirety. Close to 1000 pages long, Roberto Bola&ntilde;o's opus is both daunting and eminently readable&iquest;a feast for serious readers and aspiring writers. It is a dark thriller that spans several continents, with memorable characters and unsuspected plot twists throughout. Similar to Anna Karenina or One Hundred Years of Solitude in ambition, it explores the limits of the sayable, and of the novel form. Its protagonists include vivacious young people, a lost German author, an African-American journalist in Mexico, gallivanting academics, and bodily remains. Some of its topics include literary fame and influence, exile, Cartel violence, and the legacies of World War II. Take this course if you would like to gain solid training in the art of close reading, take your Spanish to the next level, immerse yourself in deep learning, familiarize yourself with current events in Latin America, and participate in a dedicated book salon. The reading pace is very moderate (20 pages every weekday), which allows for careful consideration and readerly enjoyment. The analytical skills you gain in this seminar are also highly portable: they will serve you well in all of your future scholarly pursuits. The course combines small seminar discussion&iquest;a staple of humanities education&iquest;with an approximation to a fresh, contemporary text. You will present on a small section of the book, write short response papers, and engage in various creative activities. Guest speakers and archival work will complement our regular activities.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221827",
        "number": "ILAC 112Q",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "113Q",
        "title": "Borges and Translation (DLCL 113Q)",
        "description": "Borges's creative process and practice as seen through the lens of translation. How do Borges's texts articulate the relationships between reading, writing, and translation? Topics include authorship, fidelity, irreverence, and innovation. Readings will draw on Borges's short stories, translations, and essays. Taught in Spanish. Prerequisite: 100-level course in Spanish or permission of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "217497",
        "number": "ILAC 113Q",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "115Q",
        "title": "From Rubber to Cocaine: Commodities in Colombian Literature",
        "description": "Do you like &quot;Narcos&quot; on Netflix and want to learn more about the Drug Wars and its representation? Are you curious about Colombia? The present sophomore seminar serves the double purpose of introducing you to Colombian culture and of training you in sophisticated rhetorical analysis. At the end of the course you will be a better reader and writer (in Spanish, no less!). You will also have familiarity with a country that in some ways is a &quot;meta-Latin American country,&quot; for it includes the regional cultures of the Caribbean, Pacific, Andes, plains, and Amazon jungle. We will read fascinating novels that deal with the sugar plantation economy in the 19th century, the exploitation of rubber at the onset of the 20th, and the coffee and cocaine booms leading to the present. Some things to expect: gripping, tragic love stories among the landed elites of the Pacific Coast, and among their slaves, set against the backdrop of a landscape forever transformed by agriculture (La Mar&iacute;a); dangerous adventures of city-dwellers turned jungle explorers (La Vor&aacute;gine),  a strike among banana workers turned supernatural catastrophe (Cien a&ntilde;os de soledad); the criminal legacy of Pablo Escobar, a man who built an empire of coca leaf, as a symptom of broader societal problems (La par&aacute;bola de Pablo). This rare course offering will allow you to gain granular knowledge about a fascinating body of literature. You will also become acquainted with an exciting method of cultural analysis called &quot;new materialism.&quot; Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220375",
        "number": "ILAC 115Q",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "116",
        "title": "Approaches to Spanish and Spanish American Literature",
        "description": "Short stories, poetry, and theater. What analytical tools do the &quot;grammars&quot; of different genres call for? What contact zones exist between these genres? How have ideologies, the power of patronage, and shifting poetics shaped their production over time? Authors may include Arrabal, Borges, Cort&aacute;zar, Cernuda, Garc&iacute;a M&aacute;rquez, Lorca, Neruda, Rivas. Taught in Spanish. Prerequisite: 100-level course in Spanish or permission of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "213339",
        "number": "ILAC 116",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "116Q",
        "title": "Not Quite White?: Whiteness in and Across the Americas",
        "description": "Is Brazilian model Gisele Bundchen a woman of color? Does the answer to that question change whether she is in Brazil or in the United States? Why was there a backlash in the Mexican entertainment industry to the stardom of visibly and proudly indigenous actors Yalitza Aparicio (the star of the film Roma) and Tenoch Huerta (Wakanda Forever)? Would a white-presenting person with one Black grandmother be eligible for university admissions through Brazil&iquest;s socioeconomic and racial quotas? In this seminar style IntroSem, we will explore these questions through an investigation of whiteness and white supremacy in the Americas, with a focus on Brazil, Colombia, Mexico, the Southern Cone, and the US and the Latinx community. Through in-class discussions and collaborative curation projects, we will analyze historical documents, current events, films, and, yes, Twitter debates, to think critically about whiteness in Latin America, how it relates to discourses of racial democracy, and how its ambiguity perpetuates national and regional identities founded on anti-Indigenous and anti-Black racism. You will engage with a wide range of methodological approaches to studying whiteness, including ethnography and psychology, as well as theoretical traditions like Black feminism and decoloniality. Your multidisciplinary final projects will showcase the skills you develop in using historical and cultural analysis as an entry point to examine and compare the different ways in which whiteness works throughout the Americas. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "225208",
        "number": "ILAC 116Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "117",
        "title": "Spanish Cities",
        "description": "TBD",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224275",
        "number": "ILAC 117",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "119",
        "title": "The Memory of the Eye: Iberian Cinema from Buñuel to Almodóvar",
        "description": "An introduction to Spanish, Portuguese, Basque, and Catalan cinema through films from the 1920s and 30s to the present. How film uses a visual grammar of the image to tackle social questions and construct a collective memory. This course will consider the problems of individual recollection under conditions of collective trauma and distortion of the past, exploring the relation between film and history. The course will also focus on how images can be used to explore subjectivity and the passions. We will be watching outstanding films by Luis Bu&ntilde;uel, Carlos Saura, V&iacute;ctor Erice, Bigas Luna, Pedro Almod&oacute;var, Miguel Gomes, Julio Medem, Ventura Pons, Iciar Bolla&iacute;n, and Isabel Coixet. Students will be responsible for watching all the films, engaging in lively discussion, in preparation for which, they will be asked to consider certain issues in writing before each class. Each student will present on one of the films for about fifteen minutes. There will be one short midterm essay and one final paper &quot;on a different film.&quot;",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "211197",
        "number": "ILAC 119",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "122",
        "title": "Drugs, Literatures and Visual Cultures in Latin America",
        "description": "This course aims to study the visibility of the drug object in some fin-de-si&egrave;cle (19th and 20th centuries) Latin American literary practices, magazines, and journals of the time. Through the examination of this corpus of texts and images, we will discuss the idea of the cultural, geographical, social, sensorial crossings or borders and its critical connections with a literary narrative where the ethnographic journey (within the city or on the geopolitical boundaries of the nation) and the exploration of the limits of sensitivity are intertwined. In the same way, this course will study the different aspects of visual culture related to the representation of drugs in order to reposit images and texts in a dynamic cultural and sensory border and thus try to shake the narcographic maps of modernism.T his course will be taught in Spanish. This will be taught by visiting Professor Contreras.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224956",
        "number": "ILAC 122",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "122A",
        "title": "Radical Poetry: The Avant-garde in Latin America and Spain (COMPLIT 122A)",
        "description": "The first few decades of the 20th century ushered in a dynamic literary and aesthetic renewal in Spain and Latin America. Young poets sought a radical change in response to a rapidly changing world, one marked by the horrors of World War I and the rise of a new technological urban society. This course will focus on the poetry and attendant manifestos of movements such as Creacionismo, Ultraismo, Estridentismo, Surrealismo and other -ismos. How did the European avant-garde (e.g. Futurism, Dada, and Surrealism) inform such aesthetic turns? In what ways did poetry assimilate modern visual culture while questioning established poetics? Authors may include Aleixandre, Borges, Cansino-Assens, G. Diego, G. de Torre, Huidobro, Larrea, Lorca, Maples Arce, Neruda, Tablada, and Vallejo. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222935",
        "number": "ILAC 122A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "123A",
        "title": "Resisting Coloniality: Then and Now (COMPLIT 123A)",
        "description": "What are the different shapes that Western colonialism took over the centuries? How did people resist the symbolic and material oppressions engendered by such colonialist endeavors? This course offers a deep dive into history of the emergence of Western colonialism (alt: Spanish and Portuguese empires) by focusing on literary and cultural strategies of resisting coloniality in Latin America, from the 16th century to the present. Students will examine critiques of empire through a vast array of sources (novel, letter, short story, sermon, history, essay), spanning from early modern denunciations of the oppression of indigenous and enslaved peoples to modern Latin American answers to the three dominant cultural paradigms in post-independence period: Spain, France, and the United States. Through an examination of different modes of resistance, students will learn to identify the relation between Western colonialism and the discriminatory discourses that divided people based on their class, gender, ethnicity, and race, and whose effects are still impactful for many groups of people nowadays. Authors may include Isabel Guevara, Catalina de Erauso, el Inca Garcilaso, Sor Juana, Sim&oacute;n Bol&iacute;var, Flora Trist&aacute;n, Silvina Ocampo, Jorge Luis Borges, and Gabriel Garc&iacute;a M&aacute;rquez. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "223264",
        "number": "ILAC 123A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "124",
        "title": "Coming of Age in Latin America",
        "description": "What can a novel tell us about coming of age? How does a novel shape a character when they do not conform to social norms? This course interrogates how the coming of age novel the Bildungsroman may combine, successfully or not, a narrative of national social progress and of personal growth. We will compare and contrast short selections from 19th, 20th and 21st centuries novels, while analyzing two masterpieces in depth. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222830",
        "number": "ILAC 124",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "125",
        "title": "Critical Feminisms in the Americas (ANTHRO 125W, FEMGEN 125)",
        "description": "This course examines critical feminist theories, practices, and movements in the Americas. Together, we will explore, analyze, and discuss the work of creators and activists in South America, Central America, the Caribbean, and North America, attending to local, national, and transnational efforts. Particular consideration will be given to intersectionality (within and across specific works and movements) and to critiques of larger political economic systems (including but not limited to colonialism, capitalism, and imperialism). We will engage works by creators and activists such as Silvia Rivera Cusicanqui, Faye Harrison, Petra Rivera-Rideau, Leah Lakshmi Piepzna-Samarasinha, Tiffany Lethabo King, Audre Lorde, Eve Tuck, Tourmaline, Maria Lugones, Harsha Walia, Mitsuye Yamada, Haunani-Kay Trask, Luc&iacute;a Ixch&iacute;u, Sylvia Wynter, Francia M&aacute;rquez, Gina Ulysse, Fatimah Asghar, Cecilia Menj&iacute;var, Omise'eke Natasha Tinsley, bell hooks, Sylvia Rivera, Sayak Valencia, and more. Student interests will be included in making a collaborative syllabus. Course will be taught in English, but readings and writing assignments will also be available in Spanish for Spanish Majors, or other students.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224018",
        "number": "ILAC 125",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "126",
        "title": "Latin American Art and Literature:  100 Years of Modernisms (ARTHIST 293A)",
        "description": "This course will explore the different kinds of modernisms and modernities that Latin American artists and authors have produced from the early twentieth century to the present. Defined as a break with the past and with tradition, the term &quot;modernism&quot; in Latin America has signified specific transformations that speak to the continent&iquest;s long history of colonialism and alleged marginality in relation to Europe and the United States. How have Latin American artistic and literary movements drawn from and broken with European modernisms and avant-gardes? What meanings of &quot;tradition&quot; and &quot;modernity&quot; emerge from their works, especially in their engagement with Indigenous and Afro-Latin American cultures? By examining artworks together with literary texts, we will address their aesthetic dimensions, as well as the socio-historical and political conditions that made them possible. Some movements may include Antropofagia (Brazil), Mexican Muralism, Surrealism, Indigenisms, Afro-Caribbean art and literature, Abstractionism, Neo-Concretism, and Tropicalia. Course content and discussions will be in English. ILAC/Spanish majors should take the course for 5 units and must do the readings and assignments in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "223360",
        "number": "ILAC 126",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "127",
        "title": "After Dictatorship: Facts, Fiction, and Justice in Latin America",
        "description": "In the wake of dictatorships across twentieth-century Latin America, writers and artists (as well as laws and truth commissions) have confronted past human rights violations. Today, authors across disciplines and genres continue to grapple with past atrocities. In this course, as we examine the stories we tell about the past, we will focus on concepts such as memory, truth, and justice. What kind of truth can fiction uncover? Whose stories are either remembered or excluded? How do different types of narratives confront issues of human rights and justice? And what can these narratives teach us about issues we continue to face today? Course will be taught in Spanish with the option to write in English (majors should write in Spanish). Readings will be in Spanish (and in Portuguese with translation) and will include fictional and &quot;true crime&quot; narratives as well as legal/historical texts and manifestos. Authors may include Alia Trabucco Zer&aacute;n, Gonz&aacute;lo Eltesch, Selva Almada, Mariana Enr&iacute;quez, Neusa Maria Pereira, and Juli&aacute;n Fuks.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "223019",
        "number": "ILAC 127",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "128",
        "title": "Spanish through Comics (CHILATST 128)",
        "description": "The course, an exploration of the graphic narrative medium in Spanish, is open to intermediate and advanced Spanish speakers. We'll analyze vignettes, sections, or chapters from both auteur and pop-culture series. These may include Arrugas and Lola Vendetta (Spain), Mafalda, Macanudo, Naftalina, and El eternauta (Argentina), Los once and Caminos condenados (Colombia), Nos vamos (Ecuador/ Colombia), Vivos se los llevaron (Mexico), as well as Spy vs. Spy and My Favorite Thing is Monsters (ChicanX/LatinX). Secondary sources include McCloud, Mbembe, Chute, and Aldama. The through line will be representations and instantiations of power struggles in this deceivingly naive form. Visual narratological aspects and the specificity of the medium will also be discussed at length. Language learners and everyone who wants detailed feedback on their Spanish must enroll in the cognate course SPANLANG 121 &quot;Concurrent Writing Support.&quot;",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "222846",
        "number": "ILAC 128",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "130",
        "title": "Introduction to Iberia: Cultural Perspectives",
        "description": "The purpose of this course is to study major figures and historical trends in modern Iberia against the background of the linguistic plurality and cultural complexity of the Iberian world. We will cover the period from the loss of the Spanish empire, through the civil wars and dictatorships to the end of the Portuguese Estado Novo and the monarchic restoration in Spain. Particular attention will be given to the Peninsula's difficult negotiation of its cultural and national diversity, with an emphasis on current events. This course is designed to help prepare students for their participation in the Stanford overseas study program in Spain. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "11144",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            },
                            {
                                "name": "Ferrer, O.",
                                "sunet": "oferrerb"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "207737",
        "number": "ILAC 130",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "131",
        "title": "Introduction to Latin America: Cultural Perspectives",
        "description": "This course focuses on the emergence of Latin America in modern times. How did the distinct nations and cultures of Latin America develop out of Spain and Portugal's former territories? The foundational, tumultuous period from the mid-eighteenth to the mid-twentieth century witnessed rebellions and revolts; independence and abolition; liberal reforms and revolutions; urbanization and the consolidation of national cultures. Students will give special consideration to the formation of political bodies in the nineteenth century and cultural identities in the twentieth century, all while considering the strategic means by which these processes effectively excluded or included large sectors of the population. Knowledge of this period in the region is crucial to understanding the world today. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "All prospective ILAC minors and majors welcome. Please request a permission number from the professor (nthughes@stanford.edu) if you have trouble enrolling.",
                "classId": "14937",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "207738",
        "number": "ILAC 131",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "132",
        "title": "Drug Wars: from Pablo Escobar to the Mara Salvatrucha to Iguala Mass Student Kidnapping",
        "description": "This course will study the ways in which Latin American Narcos are represented in feature films, documentaries, essays, and novels.  We will choose two regions and times: Pablo Escobar's Colombia (1949-1993) and current Mexico (1990-2015), including the mass students kidnappings in Iguala, M&eacute;xico, 2014. Films: Sins of my Father (Entel, 2009); Pablo's Hippos (Lawrence Elman, 2010); True Story of Killing Pablo, David Keane (2002), Sumas y restas (V&iacute;ctor Gaviria, 2003); La vida loca (Poveda, 2009), Sin nombre (Cary Fukunaga, 2009), El velador (Almada, 2011); La jaula de oro (Quemada-D&iacute;ez, 2013); La bestia (Pedro Ultreras, 2010); Cartel Land (Heineman, 2015); The Missing 43 (Vice, 2015). Books: Alejandra Inzunza, Jos&eacute; Luis Pardo, Pablo Ferri: Narco America, de los Andes a Manhattan (2015); Sergio Gonz&aacute;lez Rodr&iacute;guez: El hombre sin cabeza (2010); Rafael Ram&iacute;rez Heredia: La Mara (2004).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "217320",
        "number": "ILAC 132",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "132E",
        "title": "Introduction to Global Portuguese: Cultural Perspectives",
        "description": "Portuguese is the sixth most-spoken language in the world (roughly 250 million speakers now, with expected growth to 400 million by 2050) and the most-spoken language south of the Equator. It is the official language of nation-states on four continents, making it truly global in scope. Beyond Brazil, there are tens of millions of Portuguese speakers in Africa and Europe as well as smaller communities in Asia and North America. In this course, students will learn about the cultures and communities that make up the Portuguese-speaking world, even as they learn to critique the idea of linking these communities by means of a language that became global (like Spanish and English) through violent colonial expansion. Topics include art and music, film, poetry, short story, post-colonialism, indigeneity, crioulismo, empire, diaspora, semi-peripherality, modernism. Course taught in English with optional Portuguese section.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219523",
        "number": "ILAC 132E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "136",
        "title": "Modern Iberian Literatures",
        "description": "1800 to the mid 20th century. Topics include: romanticism; realism and its variants; the turn of the century; modernism and the avant garde; the Civil War; and the first half of the 20th century. Authors may include Mariano Jose de Larra, Gustavo Adolfo Becquer, Rosalia de Castro, Benito Perez Galdos, Jacint Verdaguer, Eca de Queiros, Miguel de Unamuno, Ramon de Valle-Inclan, Antonio Machado, and Federico Garc&iacute;a Lorca. Taught in Spanish. Prerequisites: SPANLANG 13 or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "11741",
                "currentClassSize": "0",
                "maxClassSize": "14",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "120159",
        "number": "ILAC 136",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "139",
        "title": "Jaguars and Labyrinths: A Survey of South American Short Fiction (COMPLIT 139A)",
        "description": "10 South American short stories in 10 weeks. We will read tales of jaguars and octopuses, labyrinthic cities and eerie parks, magicians and mediums, time loops and spatial stretches. Each of the works will offer a unique insight into South American literature, history, and culture. We will focus on 20th and 21st century stories that deal with the future of techno-science, the interaction between Western and indigenous worldviews, the intersection of fiction and reality, the relation between the human and the non-human, and the ecological planetary crisis. Authors include Clarice Lispector, Roberto Bola&ntilde;o, Jorge Luis Borges, Julio Cort&aacute;zar, Jo&atilde;o Guimar&atilde;es Rosa, Vil&eacute;m Flusser, and Concei&ccedil;&atilde;o Evaristo. Taught in English, no previous knowledge of Spanish and Portuguese required. Note: Students with a background in Portuguese and/or Spanish may use this course as a platform to enhance their linguistic proficiency and their close-reading skills in the target languages.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222812",
        "number": "ILAC 139",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "140",
        "title": "Migration in 21st Century Latin American Film (CHILATST 140)",
        "description": "Focus on how images and narratives of migration are depicted in recent Latin American film. It compares migration as it takes place within Latin America to migration from Latin America to Europe and to the U.S. We will analyze these films, and their making, in the global context of an ever-growing tension between &quot;inside&quot; and &quot;outside&quot;; we consider how these films represent or explore precariousness and exclusion; visibility and invisibility; racial and gender dynamics; national and social boundaries; new subjectivities and cultural practices. Films include: Bolivia, Copacabana, La teta asustada, Norteado, Sin nombre, Migraci&oacute;n, Ulises, among others. Films in Spanish, with English subtitles. Discussions and assignments in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29631",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "213352",
        "number": "ILAC 140",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "145",
        "title": "Poets, Journalists and Collectors: Latin American Modernismo",
        "description": "Discusses the different artistic avatars exercised by Latin American modernistas at the turn of the 19th Century in the context of growing capitalism, technological innovation and social transformation. We focus on how modernistas as poets, journalists and collectors explored and transgressed the limits of the individual and his/her situation. We consider topics like cosmopolitanism, dandysm, autonomy of art, and the aesthetic cultivation of the self. Authors include: Delmira Agustini, Rub&eacute;n Dar&iacute;o, Juli&aacute;n del Casal, Leopoldo Lugones, Jos&eacute; Mart&iacute;, Manuel Gutierrez N&aacute;jera, Jos&eacute; Enrique Rod&oacute;, Jos&eacute; Asunci&oacute;n Silva, and Abraham Valdelomar. Spanish proficiency required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "213354",
        "number": "ILAC 145",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "146",
        "title": "The Poetics of Crisis: Imaginación poética y crisis social en la poesía mexicana moderna",
        "description": "This class will focus on the intersection of poetics and politics in modern Mexican poetry, from the transformations of the mid-century, the turmoil of 1968 student movement, to the &quot;War on drugs&quot; and neoliberal policies that have reshaped Mexican society at the beginning of the 21st century. This class explores the relationship between textual strategies and the ongoing social and diverse forms of political crisis in Modern Mexico. The course will include readings from key authors such as Rosario Castellanos, Octavio Paz, Maria Rivera, Cristina Rivera Garza, Dolores Dorantes, Hubert Mati&uacute;w&agrave;a and Heriberto Y&eacute;pez. The purpose of this class is to introduce students to new ways of understanding the relationship between literature and society, and particularly between poetry and politics, and to understand the new voices of poetry in Mexico. Taught in Spanish. Instructor: Dr. Hugo Garc&iacute;a Manr&iacute;quez",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224002",
        "number": "ILAC 146",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "147",
        "title": "Spanish Through Documentaries",
        "description": "The use of cameras in our cellphones and the constant register of everyday life through the internet has turned &quot;documentary&quot; into an elusive category. The course situates documentary practices in Spanish-language films. Rather than working towards the ultimate definition of documentary, this course engages in a rich discussion of different aspects of the documentary impulse and its modes. Students will develop visual literacy skills in Spanish, while we move from Third Cinema classic examples from the 60s and 70s to contemporary re-elaborations of the documentary. We explore different aesthetic approaches to nonfiction films and question the charged relationships they create between document, testimonio, documentary, fiction, objectivity, and truth. The course is open to students with an intermediate and advanced Spanish proficiency level. Language learners must enroll in the cognate course SPANLANG 121.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224281",
        "number": "ILAC 147",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "149",
        "title": "The Laboring of Diaspora & Border Literary Cultures (COMPLIT 149, CSRE 149)",
        "description": "Focus is given to emergent theories of culture and on comparative literary and cultural studies.  How do we treat culture as a social force?  How do we go about reading the presence of social contexts within cultural texts? How do ethno-racial writers re-imagine the nation as a site with many &quot;cognitive maps&quot; in which the nation-state is not congruent with cultural identity?  How do diaspora and border narratives/texts strive for comparative theoretical scope while remaining rooted in specific local histories. Note: This course must be taken for a letter grade to be eligible for WAYS credit.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "210759",
        "number": "ILAC 149",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "151",
        "title": "Cuban Literature and Film: Imagination, Revolt, and Melancholia.",
        "description": "Since the late nineteenth century, the island of Cuba has been at the center of a number of key epochal disputes: between colonialism and independence, racism and racial justice, neocolonialism and revolution, liberalism and socialism, isolationism and globalization. In the arts, the turn of the century launched a period of great aesthetic invention. Considering the singular place of Cuba in Latin America, the Caribbean, and the globe, this course addresses some of the most representative works of Cuban literature and film since independence until the present time. Special attention will be given to Afrocubanismo, ethnographic literature, the avant-garde aesthetics of the group Or&iacute;genes, Marvelous Realism, testimony, revolution, socialist experimental film, diaspora, the Special Period, and post-Soviet life. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "223899",
        "number": "ILAC 151",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "155",
        "title": "Rivers That Were: Latin American Ecopoetry (COMPLIT 155)",
        "description": "For over a century, poetry in Latin America has been tracing the connections between the human and the nonhuman.  We will examine closely the ways in which such poetry registers environmental degradation and its disproportionate impacts along axes of race, gender, and class.  How does such poetry unearth a history of colonialism and extractivism that continues to manifest socio-politically and economically in the Latin American landscape?  What futures do these eco-poets imagine and advocate?  In its encounter with the natural world, poetry makes us feel:  how might it inspire us to act?  Texts include works by Mistral, Neruda, Parra, Cardenal, Pacheco, Aridjis, Calder&oacute;n, and Huen&uacute;n. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224411",
        "number": "ILAC 155",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "157",
        "title": "Medieval and Early Modern Iberian Literatures",
        "description": "From roughly 1000 to 1700 CE. A survey of significant authors and works of early Iberian literatures, focusing on fictional/historical prose and poetry. Topics include lyric poetry and performance, the rise of European empire, Islam in the West, the rise of the novel, early European accounts of Africa and the Americas. Authors may include: Andalusi lyric poets, Llull, the Archpriest of Hita, Zurara, March, Rojas, Vaz de Caminha, Cabeza de Vaca, S&aacute; de Miranda, Monte(ay)or, Teresa of &Aacute;vila, Cam&otilde;es, Mendes Pinto, G&oacute;ngora, S&oacute;ror Violante do C&eacute;u, Sor Juana, Calder&oacute;n, and Cervantes. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29110",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Barletta, V.",
                                "sunet": "vbarlett"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "207740",
        "number": "ILAC 157",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "159",
        "title": "Don Quijote",
        "description": "Focus is on a close reading of Miguel de Cervantes's prose masterpiece. Topics include: the rise of the novel, problems of authorship and meaning, modes of reading, the status of Muslim and Jewish converts in early modern Spain, the rise of capitalism, masochistic desire. Taught in Spanish. Prerequisites: SPANLANG 13 or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29243",
                "currentClassSize": "0",
                "maxClassSize": "7",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Barletta, V.",
                                "sunet": "vbarlett"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "211183",
        "number": "ILAC 159",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "161",
        "title": "Modern Latin American Literature",
        "description": "From independence to the present. A survey of significant authors and works of Hispanic and Brazilian Portuguese literatures, focusing on fictional prose and poetry. Topics include romantic allegories of the nation; modernism and postmodernism; avant-garde poetry; regionalism versus cosmopolitanism; indigenous and indigenist literature; magical realism and the literature of the boom; Afro-Hispanic literature; and testimonial narrative. Authors may include:  Bol&iacute;var, Bello, G&oacute;mez de Avellaneda, Isaacs, Sarmiento, Machado de Assis, Dar&iacute;o, Mart&iacute;, Agustini, Vallejo, Huidobro, Borges, Cort&aacute;zar, Neruda, Guillon, Rulfo, Ramos, Garc&iacute;a Marquez, Lispector, and Bola&ntilde;o. As a Writing in the Major (WIM) course, ILAC 161 provides structured opportunities for ILAC and Spanish majors to gradually develop their scholarly writing skills in Spanish. This component of the course is optional for non-majors. Taught in Spanish. Enrollment in ILAC 261 will be restricted to students in the MA program in Latin American Studies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14306",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "STLC 119",
                        "instructors": [
                            {
                                "name": "Kim, Y.",
                                "sunet": "yrk3pt"
                            },
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "120179",
        "number": "ILAC 161",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "175",
        "title": "CAPITALS: How Cities Shape Cultures, States, and People (COMPLIT 100, DLCL 100, FRENCH 175, GERMAN 175, HISTORY 206E, ITALIAN 175, URBANST 153)",
        "description": "This course takes students on a trip to major capital cities, at different moments in time: Renaissance Florence, Golden Age Madrid, Colonial Mexico City, Enlightenment and Romantic Paris, Existential and Revolutionary St. Petersburg, Roaring Berlin, Modernist Vienna, and bustling Buenos Aires. While exploring each place in a particular historical moment, we will also consider the relations between culture, power, and social life. How does the cultural life of a country intersect with the political activity of a capital? How do large cities shape our everyday experience, our aesthetic preferences, and our sense of history? Why do some cities become cultural capitals? Primary materials for this course will consist of literary, visual, sociological, and historical documents (in translation); authors we will read include Boccaccio, Dante, Sor Juana, Montesquieu, Baudelaire, Gogol, Irmgard Keun, Freud, and Borges. Note: To be eligible for WAYS credit, you must take the course for a Letter Grade.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29901",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            },
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "29900",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "6:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 66600.0,
                        "endTimestamp": 69600.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "32420",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "218539",
        "number": "ILAC 175",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "176",
        "title": "Forms of Poetry at Home and Abroad: A Workshop (COMPLIT 176)",
        "description": "Poets have long relied on formal structures to write into surprise and wonder. We know of structures such as the sonnet and the sestina, but what about the corrido, ghazal, haiku, jintishi, landay, lira, l&iquest;c b&aacute;t, qa&iquest;&iquest;da, pantoum, romance, rondeau, sijo, than-bauk, and triolet? How might we reimagine poetic forms in English by looking to the past at home and abroad?In this poetry workshop, you will write an original poem each week. Assigned readings will illustrate the development of specific forms from language traditions around the world and the ways in which they've crossed into English-language poetry. Previous experience with creative writing not required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "30618",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Santana, C.",
                                "sunet": "csantana"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225324",
        "number": "ILAC 176",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "178",
        "title": "History of Latin American Revolutions (FILMEDIA 178, HISTORY 78, HISTORY 178)",
        "description": "This course will examine the causes and consequences of Latin American Revolutions of the 20th century. It will focus on Mexico, Cuba, Nicaragua, Guatemala, Chile, and Bolivia. We will bring these revolutions and experiments in social change under analytical and comparative perspectives. To do so, the course will use primary sources, cultural artifacts, and secondary literature to explore the following: the meaning of revolution in a Latin American context; conflicting legacies of empowerment and repression; the role of violence and its effects; gendered understandings of political change; personal experiences of revolution from multiple perspectives; and the significance of these revolutions at the local, regional, and global level.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "This class section has been cancelled!",
                "classId": "27825",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "DIS",
                "notes": "This class section has been cancelled!",
                "classId": "27824",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "218103",
        "number": "ILAC 178",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "181",
        "title": "Philosophy and Literature (CLASSICS 42, COMPLIT 181, ENGLISH 81, FRENCH 181, GERMAN 181, ITALIAN 181, PHIL 81, SLAVIC 181)",
        "description": "Can novels make us better people? Can movies challenge our assumptions? Can poems help us become who we are? We'll think about these and other questions with the help of writers like Toni Morrison, Marcel Proust, Jordan Peele, Charlie Kaufman, Rachel Cusk, William Shakespeare, and Samuel Beckett, plus thinkers like Nehamas, Nietzsche, Nussbaum, Plato, and Sartre. We'll also ask whether a disenchanted world can be re-enchanted; when, if ever, the truth stops being the most important thing; why we sometimes choose to read sad stories; whether we ever love someone for who they are; who could possibly want to live their same life over and over again; what it takes to make ourselves fully moral; whether it's ever good to be conflicted; how we can pull ourselves together; and how we can take ourselves apart. (This is the required gateway course for the Philosophy and Literature major tracks. Majors should register in their home department.)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13694",
                "currentClassSize": "0",
                "maxClassSize": "99",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "McMurtry Art Building Oshman",
                        "instructors": [
                            {
                                "name": "Peacocke, A.",
                                "sunet": "peacocke"
                            },
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "13695",
                "currentClassSize": "0",
                "maxClassSize": "99",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "204034",
        "number": "ILAC 181",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "182",
        "title": "Mexican Cinema in the Era of Globalization",
        "description": "In this course we focus on the polemic quality of Mexican contemporary cinema, as we study this cinema in relation to the scholarship on globalization. We study how contemporary Mexican films and directors participate in coding, creating and reformulating images of Mexico and the world into the screen. Rather than concentrating on how contemporary films represent Mexican identity through a selection of films, we discuss rather how these films point to a situated `global' film making.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223546",
        "number": "ILAC 182",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "193",
        "title": "All about Almodóvar",
        "description": "Pedro Almod&oacute;var is one of the most recognizable auteur directors in the world today. His films express a hybrid and eclectic visual style and the blurring of frontiers between mass and high culture. Special attention is paid to questions of sexuality and the centering of usually marginalized characters. This course studies Pedro Almod&oacute;var's development from his directorial debut to the present, from the &quot;shocking&quot; value of the early films to the award-winning mastery of the later ones. Prerequisite: ability to understand spoken Spanish. Readings in English. Midterm and final paper can be in English for non-ILAC degree students. ILAC minors and majors should complete their assignments in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12438",
                "currentClassSize": "0",
                "maxClassSize": "27",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            },
                            {
                                "name": "Schriefer, E.",
                                "sunet": "ellisc"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-Gender",
            "WAY-A-II"
        ],
        "objectID": "120224",
        "number": "ILAC 193",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "194G",
        "title": "Black Brazil: Afro-Brazilian Music, Literature, and Art (AFRICAAM 294, CSRE 194)",
        "description": "More enslaved people from Africa were forced to Brazil than any other country and Brazil was the last country to abolish the practice of slavery in the Americas. How do these two facts impact the cultural history of Brazil? How and why was the country mythologized as a 'racial democracy' in the twentieth century? This class engages these questions to explore the origins, development, and centrality of Afro-Brazilian culture. We will immerse ourselves in the cities of Salvador and Rio de Janeiro, explore samba and Carnaval, take a dive into syncretic religious practices such as Candombl&eacute;, observe dances like capoeira, and study literary and artistic expressions from an anti-racist perspective to gain a fuller picture of Brazilian society today. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30213",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Winterbottom, T.",
                                "sunet": "mtw1"
                            },
                            {
                                "name": "Machado de Oliveira, M.",
                                "sunet": "marimach"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "223547",
        "number": "ILAC 194G",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "199",
        "title": "Individual Work",
        "description": "Open only to students in the department, or by consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30970",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29555",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10696",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Santana, C.",
                                "sunet": "csantana"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10998",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "31212",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "31205",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "11144",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10460",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "13427",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "11145",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "13428",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "13230",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "11",
                "component": "INS",
                "notes": null,
                "classId": "11340",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, R.",
                                "sunet": "saldivar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "11",
                "component": "INS",
                "notes": null,
                "classId": "13231",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "11",
                "component": "INS",
                "notes": null,
                "classId": "29303",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Santana, C.",
                                "sunet": "csantana"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "13958",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "120234",
        "number": "ILAC 199",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 16
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "200E",
        "title": "War and the Modern Novel",
        "description": "From the turn of the 19th century to well into the 20th century, novelists developed the theme of alienation and the decline of civilization. Along with the fall of centuries-old empires, World War I brought about the collapse of traditional European values and the dissociation of the subject. The aestheticizing of violence and the ensuing insecurity inaugurated the society of totally administered life, based on universal suspicion and pervasive guilt. The seminar will study narrative responses to these developments in some of the foremost authors of the 20th century from several European literatures: Knut Hamsun, Joseph Roth, Ernst J&uuml;nger, Virginia Woolf, Franz Kafka, Curzio Malaparte, Thomas Mann, Merc&egrave; Rodoreda, Antonio Lobo Antunes, and Jaume Cabr&eacute;. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "219460",
        "number": "ILAC 200E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "202",
        "title": "Revolution and Dictatorship in Latin American Literature and Film",
        "description": "TBD",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224264",
        "number": "ILAC 202",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "205",
        "title": "The Power of Myth (COMPLIT 205, COMPLIT 313, ILAC 305)",
        "description": "Is myth a form of thought or is it that which opposes thinking? How does myth create worldviews and engage the emotions? Is myth a universal language or is it a set of cultural dialects? In this seminar myth will be approached from several directions: its classic distinction from logos, its relation to history, its underwriting of ideology, its anthropological applications, and its contemporary uses in advertising. We will consider modern cases of popular myths, in particular the complementary figures of erotic seduction: Carmen (the femme fatale) and Don Juan.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224274",
        "number": "ILAC 205",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "207",
        "title": "Cuba: Modernity, Subjection, Revolution",
        "description": "This course will explore Cuba's intellectual currents and cultural objects from the late-eighteenth to the twenty-first centuries. How did different ideas about modernity, subjection, and revolution emerge and interact with one another in literary texts, visual artifacts, and legal documents throughout Cuban history? How does a conceptual history of these terms look like if we center the island's political, artistic, scientific, and religious movements? How does Cuba and its history inform our own ideas about freedom, slavery, and racial relations? While addressing these questions, we will also reflect on the island's past and present position in relation to other parts of the Caribbean, the Americas, and the Atlantic world. Ultimately, this course aims to challenge and historicize the most common connotations attributed to modernity, subjection, and revolution by examining not only European-based philosophical thought, but also cultural objects and discourses produced within the specific contexts of Cuba and the Caribbean.  Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224262",
        "number": "ILAC 207",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "211",
        "title": "Existentialism, from Moral Quest to Novelistic Form (COMPLIT 258A, ILAC 311)",
        "description": "This seminar intends to follow the development of Existentialism from its genesis to its literary expressions in the European postwar. The notions of defining commitment, of moral ambiguity, the project of the self, and the critique of humanism will be studied in selected texts by Kierkegaard, Heidegger, Unamuno, Albert Camus, Jean-Paul Sartre, Simone de Beauvoir, and Joan Sales.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "217335",
        "number": "ILAC 211",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "212",
        "title": "Curing the Institutions with Francesc Tosquelles: Politics and exile, disalienation and outsider art (ARTHIST 212A, DLCL 212, FRENCH 212E)",
        "description": "In the occupied France of the 1940s, Catalan psychiatrist Francesc Tosquelles used culture (amateur cinema, theater, and literature) and politics (self-management, cooperatives, and anti-Stalinist communism) to &quot;cure&quot; the institutions rather than patients. In his work he engaged with avantgarde poets like Paul &Eacute;luard, Antonin Artaud and Tristan Tzara, the post-colonial philosopher and psychiatrist Frantz Fanon and philosopher F&eacute;lix Guattari. His project was shaped by radical politics in Catalonia during the 1930s and his own practice of treating the therapeutic community rather than the patients themselves. Tosquelles worked with people outside the medical profession: musicians, writers, lawyers and even prostitutes. These experiences resonate in the book he wrote on poet Gabriel Ferrater and the Spanish Civil War. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28560",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "20-21B",
                        "instructors": [],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225264",
        "number": "ILAC 212",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "212A",
        "title": "Desiring Machines: Buildings, Maps, and Clouds (ARTHIST 212, ARTHIST 412, COMPLIT 212A, COMPLIT 312A, ILAC 312A)",
        "description": "Focus is on early modern machines as tools for experience and action. In their break with Freudian psychoanalysis, French theorists Deleuze and Guattari speak of the machine as a tool of desire and attraction itself as &quot;machinic&quot; rather than desire for something that is missing. The goal of this course is to equip students with a different way of thinking by exploring a large group of objects from the early modern world (poems, buildings, costumes, maps, nets, and clouds) that help us to approach the period in a new way.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223331",
        "number": "ILAC 212A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "214",
        "title": "Colonial Mexico: Images and Power (ARTHIST 277, HISTORY 272, HISTORY 372B, ILAC 314)",
        "description": "How did images maintain, construct, or transform political power during the conquest and colonization of Mexico? The creation and destruction of visual materials in this period had a complicated relationship with power. The pictographic codices that celebrated the expansive Aztec Empire were created after its fall; and the conquistadors' indigenous allies painted some of the most triumphalist narratives of the conquest. Friars accused indigenous peoples of &quot;idolatry&quot; both to justify the destruction of their images and objects, and to construct legal defenses of their humanity. Colonial authorities frequently claimed Afro-Catholic festivals were seditious. In light of such complexity, official histories that recount the top-down consolidation of royal and viceroyal power are suspiciously simple. What counter-narratives do images and other visual phenomena from this tumultuous period offer? This course introduces students to major texts from Colonial Mexico (royal chronicles, conquistadors' tales, letters, poems, festival accounts) alongside a fascinating trove of images (painted codices with Nahuatl texts, feather mosaics, and indigenous heraldry) and considers how experiences of images and spectacles were transformed into textual accounts (&quot;ekphrasis&quot; or the literary device of description). Taught in Spanish with accommodations for non-ILAC students who are still improving their language skills",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222793",
        "number": "ILAC 214",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "217",
        "title": "Fernando Pessoa: Aesthetics as Ontology",
        "description": "The poetry and prose of Fernando Pessoa (1888-1935), Portugal's greatest modern poet. As famous for his written work as for his complex understanding of selfhood, Pessoa remains a towering and largely perplexing figure even today. Class discussions will focus on close readings of Pessoa's work along with the implications of his theory of subjectivity for our understanding of modernity, aesthetics, and the self. Taught in English. Readings in Portuguese and English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219603",
        "number": "ILAC 217",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "218",
        "title": "Shipwrecks and Backlands: Getting Lost in Literature (COMPLIT 214, COMPLIT 314A, ILAC 318)",
        "description": "This course takes students on a journey through tales of getting lost in the Portuguese and Spanish empires. We will read harrowing stories of being caught adrift at sea and mystical interpretations of island desertion. The course begins with sea-dominated stories of Portuguese voyages to Asia, Africa, and Brazil then turns to how the Amazon and the sert&atilde;o, or backlands, became a driving force of Brazilian literature. Official historians, poets, and novelists imbued the ocean and the backlands with romanticism, yet these spaces were the backdrop to slavery and conquest. Instead of approaching shipwreck and captivity narratives as eyewitness testimonies, as many have, we will consider how they produced 'the sea' and 'the wilderness' as poetic constructions in Western literature while also offering glimpses of the 'darker side' of Iberian expansion. Taught in English with all texts offered both in English and the original Portuguese or Spanish. Optional guest lectures in Portuguese.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28330",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "100-101K",
                        "instructors": [
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "223534",
        "number": "ILAC 218",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "220E",
        "title": "Renaissance Africa (AFRICAST 220E, COMPLIT 220, ILAC 320E)",
        "description": "Literature, art, and culture in Central/Southern Africa during the sixteenth and seventeenth centuries. Emphasis on forms of exchange between Europeans and Africans in the Kingdom of Kongo and Angola. Readings in Portuguese and English. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "218137",
        "number": "ILAC 220E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "222",
        "title": "Latin American Avant-garde Narrative",
        "description": "This course aims to outline a general understanding of the Latin American avant-garde narrative following its representative themes. I will establish a map of avant-garde narrative considering the plurality of its expressions and temporalities, the proposals for renewal or rupture and the interest in readjusting its character to the sensitivity of the new. We will focus on the study the avant-garde narrative that operates with small scenarios, common and strangers, closer to everyday life, treating trivial issues, recreating the disputes around the relationships between experience and narration. We will also work on the formats of the detective story, science fiction, and the fables of modern artists and their links with modernity to understand how in avant-garde narratives, the referential world is transformed into oneiric materiality. We will discuss works by Teresa de la Parra, Arqueles Vela, Pablo Palacio, Julio Garmendia, Efr&eacute;n Hern&aacute;ndez, Felisberto Hern&aacute;ndez, Roberto Arlt, Jos&eacute; Mart&iacute;nez Sotomayor, Mar&iacute;a Luisa Bombal, Jorge Luis Borges, Armon&iacute;a Sommers, Jes&uacute;s Enrique Lossada, Marta Brunet and Vicente Huidobro. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28589",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Lathrop 292",
                        "instructors": [
                            {
                                "name": "Contreras, A.",
                                "sunet": "alconber"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225348",
        "number": "ILAC 222",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "223",
        "title": "Transatlantic Methodologies (ILAC 323)",
        "description": "Focus is on the practice of transatlantic studies in primarily, but not exclusively hispanophone fields. Emphasis on nineteenth century, with attention to critical work spanning colonial to contemporary periods. Students are expected to survey a variety of approaches and methodologies in order to consider transatlantic or the oceanic turn as a framing tool in relation to their own work.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223537",
        "number": "ILAC 223",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "225",
        "title": "Literatures of the War of 1898: Spain, Cuba, the Philippines, Puerto Rico and the United States (COMPLIT 335)",
        "description": "1898 marked a major shift in the imperial control of the Atlantic and Pacific. This course will address texts from primarily Spain, Cuba, the Philippines, and Puerto Rico, the United States, and other regions. Focus on literature and theory regarding empire, Hispanidad, Latinidad, the Caribe, gender, and race. Taught in English with option to do all written work and some readings in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224272",
        "number": "ILAC 225",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "227",
        "title": "The Making of Modern Brazil",
        "description": "This course explores vital moments in Brazil after its republican revolution of 1889 until the present. Through a cultural lens, we will study moments in Brazil's various impulses for &quot;progress&quot; and &quot;modernity.&quot; Through various authors, films, artworks, and manifestos from Brazil's biggest cities to the backlands and to the Amazon, we seek to imagine contemporary Brazil from a deep understanding of its cultural and historical context. Specific areas of focus include the Modern Art Week of 1922 in Sao Paulo, the construction of Brasilia, and the rise (and fall) of Brazil in the 2010s. Taught in English, with readings available in English and Portuguese and an option for students to complete assignments in Portuguese if desired.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220640",
        "number": "ILAC 227",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "233",
        "title": "Current Debates in Brazilian Studies",
        "description": "A discussion of contemporary Brazilian Studies with guest lecturers Pedro Erber (Cornell University) and Alfredo Cesar Barbosa de Melo (UNICAMP, Brazil). Class meets February 18, 19, 20, 25, 26 and 27, 2020. On February 27 there will be a cognate all-afternoon event with lectures by the instructors and additional guests speakers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "222204",
        "number": "ILAC 233",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "234",
        "title": "Valeria Luiselli: A Mexican New Materialist?",
        "description": "Award-winning Mexican Valeria Luiselli&iquest;s (1983) novels, although thematically very different from each other, explore the tension between body and text in ways that engage with contemporary critical theory, media ecology studies and new materialist philosophies, raising important aesthetic and political questions about the representability of actual and residual boundaries. Students taking this class will both engage in a narratological examination of the novels, survey the existing secondary bibliography, and explore pertinent theoretical frameworks. Combining sentence-by-sentence analysis with well-informed speculative reflection, the goal of the class is to prepare and encourage students to formulate their own perspectives on literature&iquest;s agency in the world. The course will be taught in Spanish and is open to intermediate and advanced Spanish speakers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222847",
        "number": "ILAC 234",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "236",
        "title": "Gender and Feminist Debates in Latin America",
        "description": "This interdisciplinary, 10 hour, 1-unit course, explores gender politics and representation in contemporary Latin American film, theory, and social movements. Seminar format, open to undergraduate and graduate students. Works may include: film: Se&ntilde;orita Mar&iacute;a (2017) by Rub&eacute;n Mendoza (Colombia); studies by Marta Lamas (Mexico), Ana Amado (Argentina), and Sonia Corr&ecirc;a (Brazil), among others. The course will be taught in Spanish at Bolivar House, 582 Alvarado Row. Schedule: The course dates are Monday, April 23 to Wednesday April, 25, 6:00-9:00pm. Instructor: Professor Moira Fradinger (Yale University), hosted by Professor H&eacute;ctor Hoyos. NOTE: Professor Fradinger will also give a talk on &quot;Ant&iacute;gonas: A Latin American Tradition,&quot; on Friday, April 27th, in the CLAS noon lecture series.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "220264",
        "number": "ILAC 236",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "238",
        "title": "Latin American Poetry as Witness to Self and World.",
        "description": "Can lyric poetry engage with the political? How have political contexts shaped poetic form? In this course we will study the ways in which Latin American poetry has modified, dismissed, and drawn inspiration from the traditions of the avant-garde and politicized poetry. Authors may include Dar&iacute;o, Huidobro, Vallejo, Guill&eacute;n, Storni, Neruda, Paz, Pizarnik, Parra, Dalton, Zurita, and Morej&oacute;n.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221810",
        "number": "ILAC 238",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "240E",
        "title": "Borges and Philosophy",
        "description": "Analysis of the Argentine author's literary renditions of philosophical ideas. Topics may include: time, free will, infinitude, authorship and self, nominalism vs. realism, empiricism vs. idealism, skepticism, peripheral modernities, postmodernism, and Eastern thought. Close reading of short stories, poems, and essays from Labyrinths paired with selections by authors such as Augustine, Berkeley, James, and Lao Tzu. The course will be conducted in English; Spanish originals will be available. Satisfies the capstone seminar requirement for the major in Philosophy and Literature. An optional Spanish language discussion section will be offered upon request and according to availability.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "210242",
        "number": "ILAC 240E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "241",
        "title": "Fiction Workshop in Spanish",
        "description": "Spanish and Spanish American short stories approached through narrative theory and craft. Assignments are creative in nature and focus on the formal elements of fiction (e.g. character and plot development, point of view, creating a scene, etc.). Students will write, workshop, and revise an original short story throughout the term. No previous experience with creative writing is required. Readings may include works by Ayala, Bola&ntilde;o, Borges, Clar&iacute;n, Cort&aacute;zar, Garc&iacute;a M&aacute;rquez, Piglia, Rodoreda, and others. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "208708",
        "number": "ILAC 241",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "242",
        "title": "Poetry Workshop in Spanish (COMPLIT 242)",
        "description": "Latin American and Spanish poetry approached through elements of craft. Assignments are creative in nature and focus on the formal elements of poetry (meter, rhythm, lineation, rhetorical figures and tropes) and the exploration of lyric subgenres (e.g. ode, elegy, prose poem). Students write original poems throughout the quarter. No previous experience with creative writing is required. Course taught in Spanish. Enrollment limited.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "13957",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "212464",
        "number": "ILAC 242",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "243",
        "title": "Latin American Aesthetics",
        "description": "As the branch of philosophy that deals with the principles of beauty and artistic taste, aesthetics is, purportedly, universal. The course interrogates its conspicuous omission of Latin American theorization and cultural production. Three thematic axes are vanguardia, colonialidad, and populismo; a central concern is aesthetic responses to precariousness. Argentine, Brazilian, Chilean, Colombian, and Cuban essayism and visual arts from the mid 20th century to the present, notably origenismo, neo-baroque, and indigenismo. In collaboration with a cognate course at UC Berkeley. Taught in Spanish.nNOTE: This course must be taken for a minimum of 3 units and a letter grade to be eligible for WAYS credit.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "219506",
        "number": "ILAC 243",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "249",
        "title": "Women and Wolves in Film and Literature (ILAC 355)",
        "description": "This course deconstructs the foundational narrative that corrals women into capitalist patriarchy, together with  animals. Paying close attention to interspecies bonds between canidae and homo sapiens, we study novels and films where women, wolves and dogs resist the male gaze. Ever heard of Little Red Riding Hood? What if there could be a liberating alliance between her and the wolf? Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222831",
        "number": "ILAC 249",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "251",
        "title": "Iberian Expansion Through the Looking Glass: One World or Many? (COMPLIT 251A, COMPLIT 351A, CSRE 251, CSRE 351, HISTORY 271C, HISTORY 371C, ILAC 351)",
        "description": "The conquerors, missionaries, and historians who reflected on Iberian overseas expansion during the early modern period often asked themselves a crucial question: was there only one world or many? Were the Americas a 'New World,' unknown to the ancients, entirely detached from the rest of human history? Even after the invasion and occupation of the Americas, many European chroniclers continued to think that the world was divided into three parts - Europe, Asia, and Africa. In their descriptions of the Americas, they drew heavily on histories and travel reports pertaining to other epochs and locales, especially contemporary Asia and ancient Rome. At the same time, indigenous elites and mestizo authors in the Americas used 'Old World' history and news of distant conflicts to reflect on the immediacy of their historical experience. In this course, students will consider the ways in which diverse authors in New Spain (Mexico), Peru, and Brazil contemplated themselves in relation to remote times and places: from Greco-Roman Antiquity to Lutheran Germany, the Ottoman Mediterranean to the Apocalyptic End of Times. Students will analyze the many reflections, distortions, inversions, translations, uncanny resemblances, and strange parallel dimensions that resulted from these intellectual experiments. Primary sources include chronicles, poetry, theater, Afro-Catholic festivals, pictographic codices, feather mosaics, and maps. All texts offered in the original language and in English translation whenever possible. For graduate students and advanced undergraduates.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223544",
        "number": "ILAC 251",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "253",
        "title": "Losing My Mind: Madness, Race, and Gender in Latin America (COMPLIT 253, ILAC 353)",
        "description": "What does it mean to lose our minds? Is the mind even ours to lose? How do race, gender, and social status inform our understandings and experiences of insanity? In this bilingual course we will explore figurations of madness, mental illnesses, and other kinds of crises of the self in Latin American cultural objects, from the eighteenth to the twentieth centuries. We will examine testimonies of religious experiences, novels, medical treatises, short stories, intimate diaries, and visual materials on disorderly states of mind and fragmented identities produced in territories that are today Cuba, Brazil, Mexico, Per&uacute;, Argentina, and the Dominican Republic, among others. In our examination of these objects and their historical contexts, we will discuss how colonial and state authorities have used psychiatric labels to control and regulate the lives of Afro-descendants and women in Latin American territories. We will also examine the ways in which men and women of color navigated through these labels in order to evade punishment, engage in creative processes, or simply live their lives. Readings will be in Spanish and English (when translated from Portuguese). Advanced knowledge of Spanish is required.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30564",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fraga, I.",
                                "sunet": "ifraga"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225207",
        "number": "ILAC 253",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "254",
        "title": "Crónicas: Soccer, Pop Icons, Shipwrecks, and Populism",
        "description": "In this course, Mexican scholar and writer Juan Villoro analyzes Latin American works that sit halfway between fiction and non-fiction (&quot;cr&oacute;nicas&quot;).  A survey on the shifting Latin-American cultural and political landscape, and its narrative representations. Authors include Nobel-laureate Gabriel Garc&iacute;a M&aacute;rquez, Elena Ponitowska, and her groundbreaking account of social movements in Mexico. Mart&iacute;n Camparr&oacute;s (biographer of Boca Juniors),queer activist auteur Pedro Lemebel (Chile), contemporary Argentine journalist Leila Guerriero, and selections from Tom&aacute;s Eloy Mart&iacute;nez's epochal Santa Evita.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221819",
        "number": "ILAC 254",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "256",
        "title": "Asian-Latin Americans: Historical, Literary, and Cultural Migrations (ILAC 356)",
        "description": "This course focuses on Asian migrations to Latin America, Asian-Latin American communities, transculturation, hybridity, and cultural production by and about Asian Latin Americans. It compares migrations from China and Japan to Latin America with Asian migrations to the US as well as with the experience of enslaved African. We will explore different aspects of Transpacific Studies, Orientalism in Latin America, transpacific transculturation and hybridization processes, as well as process of migration and re-migration. This course will be held in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30562",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            },
                            {
                                "name": "Kim, Y.",
                                "sunet": "yrk3pt"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 71400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225206",
        "number": "ILAC 256",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "256A",
        "title": "Landscapes in Latin American Cinema",
        "description": "From Patagonia to the US/Mexico border, this course examines diverse cinematic visions of the Latin American continent through documentaries, fiction films, stories, and essays. We will consider different regions and time periods, including representations of dictatorship/violence, the drug trade, and cities to explore how land, nature, and humanity interact in film and to what effect. Areas of focus are the Southern Cone, Brazil, and the US/Mexico/Central America borderlands, and students will gain a solid critical understanding of how to read film.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219813",
        "number": "ILAC 256A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "263",
        "title": "Visions of the Andes",
        "description": "Themes like &quot;people,&quot; &quot;revolt,&quot; &quot;community,&quot; &quot;utopia&quot; and &quot;landscape&quot; are central to 20th century Andean narrative and its accompanying critical apparatus. The course reviews major works of Andean literature to reconsider the aesthetic and intellectual legacy of modernity and modernization in the region. We discuss changes in recent literature and film. Special attention is payed to post-conflict Peru and Evo Morales' Bolivia.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "205704",
        "number": "ILAC 263",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "267E",
        "title": "Comparative Historical Development of Latin America and East Asia (HISTORY 205E, HISTORY 305E)",
        "description": "(Graduate students must enroll for 5 units.) Students will analyze, in historical perspective, the similarities and differences between the development of Latin America and East Asia from early modern times to the present. Focusing primarily on Brazil and Mexico, on one hand, and China and Japan, on the other, topics will include the impact of colonial and postcolonial relationships on the development of states, markets, and classes, as well as geopolitical, social, cultural, technological and environmental factors that shaped, and were shaped by, them.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216855",
        "number": "ILAC 267E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "268",
        "title": "INDIGENISMOS REVISITED",
        "description": "How are indigenous peoples represented in Mexico and Peru in the early 20th century? Why do we call that literature and visual art indigenista? What is the relationship between indigenista art, revolution and the nation? How do we examine indigenismos now?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221851",
        "number": "ILAC 268",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "269",
        "title": "Realismo Mágico vs. Real Maravilloso",
        "description": "Two important concepts and theories realismo m&aacute;gico and lo Real maravilloso have given sense and substance to Latin American literature during the last three decades. This course will focus on those concepts and on the works of Garcia Marquez and Alejo Carpentier, two key authors of modern Latin America. NOTE: Taught by professor Tom Winterbottom.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219811",
        "number": "ILAC 269",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "272",
        "title": "New Brazilian Cinema",
        "description": "This course studies cinema from Brazil with a focus on films from the last decade. We will consider how to effectively talk and write about film, particularly according to Brazil's specific historical and cultural context and from a perspective of social realism. Numerous readings and discussions will bolster our viewings of fiction films and documentaries. Directors include Kleber Mendon&ccedil;a Filho, Anna Muylaert, Gabriel Mascaro, Karim A&iuml;nouz, Aly Muritiba, and Petra Costa. Taught in English; films shown with English subtitles.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222060",
        "number": "ILAC 272",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "273",
        "title": "Kids: Youth Cultures in Contemporary Latin America",
        "description": "To the rhythm of Latin trap and K-Pop, a new generation of artists portrays the youth cultures that revolutionize contemporary Latin America: Juli Delgado (Colombia), Claudia Huaquimilla (Chile), and Ioshua (Argentina), among others. From a selection of movies, plays, and short stories produced by these emerging artists, we will delve into the strategies deployed by Latin American teenagers to face the challenges of a convulsed present: forced migration, labor exploitation, racial violence, and sexual discrimination. Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31486",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225398",
        "number": "ILAC 273",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "277",
        "title": "Senior Seminar: The Power of Chisme--Gossip, Rumor, and Hearsay in Latin America",
        "description": "This course explores gossip, rumor, and hearsay in cultures and histories of the Hispanic world. From asserting hegemonic moral values to organizing subversive movements and uprisings; from intrusions in people's private lives to community building, gossip, rumors, and hearsay have helped produce worlds and knowledge in different periods of Spanish and Latin American histories. We will examine plays, novels, short stories, historical documents, telenovelas, and other cultural objects from the seventeenth to the twentieth century in which chisme - or its cousins murmuraci&iquest;n, rumor, and ciza&iquest;a - operates as a device that either helps maintain or destabilize power relations. In doing so, we will consider  the role of gossip, rumor, and hearsay in narrative-making; the multiple definitions of chisme and the values associated with it in different historical periods, as well as the relationship between rumors and official or &quot;legitimate&quot; sources of information. Ultimately, we aim to address questions such as the following: How did chisme become such a fundamental feature in different Latin American cultures? What are the tropes and stereotypes associated with gossip, and what are their histories? Are we readers of literature mere chismosos? In addressing these questions, we will also confront matters related to orality, trustworthiness, intimacy, race, and gender. Classes will be a mixture of short lectures, discussions, student presentations, and conversations with invited scholars. Taught in Spanish. Students must have taken SPANLANG 13 or equivalent.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Meets Writing-in-the-Major requirement. Course required for senior Spanish majors.",
                "classId": "11204",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "260-011",
                        "instructors": [
                            {
                                "name": "Fraga, I.",
                                "sunet": "ifraga"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "213369",
        "number": "ILAC 277",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "278A",
        "title": "Senior Seminar: Food Studies",
        "description": "This transhistorical research seminar introduces students to the field of food studies while examining Iberian cultures from the Middle Ages to the present. Topics addressed include culture and authenticity, food and the performance of religious identity, maritime expansion, contemporary fishing treaties, agriculture in the medieval Muslim world, contemporary racial violence, monastic life, the Spanish Civil War, and more. Most weeks students will prepare and taste iconic culinary treats. In Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12459",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "32090",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 62400.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "208056",
        "number": "ILAC 278A",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "281E",
        "title": "Peripheral Dreams: The Art and Literature of Miró, Dalí, and other Surrealists in Catalonia (ARTHIST 221E)",
        "description": "Why was Salvador Dal&iacute; fascinated with the architecture of Gaud&iacute;? Why did Andr&eacute; Breton, Paul &Eacute;luard and Federico Garc&iacute;a Lorca visit Barcelona? Moreover, why did Catalonia become such an important cradle for Surrealism? Why is the (Catalan) landscape such a relevant presence in the work of Mir&oacute; and Dal&iacute;? Through a critical analysis and discussion of selected works of art and literature, this seminar focuses and follows the trajectories of Mir&oacute; and Dal&iacute;, from Barcelona to Paris to New York, and explores the role of their Catalan background as a potentially essential factor in their own contributions to Surrealism and the reception of their work. The course will provide the materials and guide the student to conduct research on a specific work(s) of art, architecture, literature or cinema either by Mir&oacute;, Dal&iacute; or one of his peers in relation to their cultural, social and political context. The course is intended for graduate students in Iberian and Comparative Literature, Art History, Cultural Studies, and related fields. Taught in English by Jordi Falg&agrave;s i Casanovas.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219517",
        "number": "ILAC 281E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "299",
        "title": "Individual Work",
        "description": "Open to department advanced undergraduates or graduate students by consent of professor. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28622",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28304",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29556",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Santana, C.",
                                "sunet": "csantana"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "30960",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "31206",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10302",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "9431",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "9261",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "30961",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "30962",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "10777",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, R.",
                                "sunet": "saldivar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "11",
                "component": "INS",
                "notes": null,
                "classId": "11146",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, R.",
                                "sunet": "saldivar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "13429",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "11147",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Santana, C.",
                                "sunet": "csantana"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "13",
                "component": "INS",
                "notes": null,
                "classId": "13430",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "13",
                "component": "INS",
                "notes": null,
                "classId": "11341",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Santana, C.",
                                "sunet": "csantana"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "13",
                "component": "INS",
                "notes": null,
                "classId": "30959",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Barletta, V.",
                                "sunet": "vbarlett"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "120342",
        "number": "ILAC 299",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 17
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "303",
        "title": "Topics of: Early Modern Theories of History",
        "description": "From the 15th to the 17th centuries, European expansion projects, especially the Iberian ones, prompted new constructions of the past, present, and future. This proliferation of history writing was complicated by the fact that the various populations of the global Iberian monarchies, particularly those of New Spain, Peru, and Brazil, did not share the same concepts of historicity or temporality. In this course, students will explore a great diversity of primary sources (chronicles, reports, annals, pictographic codices, theater, paintings, feather mosaics, murals, etc.) and discover the unexpected social memories and theories of history that they created.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220568",
        "number": "ILAC 303",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "305",
        "title": "The Power of Myth (COMPLIT 205, COMPLIT 313, ILAC 205)",
        "description": "Is myth a form of thought or is it that which opposes thinking? How does myth create worldviews and engage the emotions? Is myth a universal language or is it a set of cultural dialects? In this seminar myth will be approached from several directions: its classic distinction from logos, its relation to history, its underwriting of ideology, its anthropological applications, and its contemporary uses in advertising. We will consider modern cases of popular myths, in particular the complementary figures of erotic seduction: Carmen (the femme fatale) and Don Juan.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224274",
        "number": "ILAC 305",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "311",
        "title": "Existentialism, from Moral Quest to Novelistic Form (COMPLIT 258A, ILAC 211)",
        "description": "This seminar intends to follow the development of Existentialism from its genesis to its literary expressions in the European postwar. The notions of defining commitment, of moral ambiguity, the project of the self, and the critique of humanism will be studied in selected texts by Kierkegaard, Heidegger, Unamuno, Albert Camus, Jean-Paul Sartre, Simone de Beauvoir, and Joan Sales.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217335",
        "number": "ILAC 311",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "312A",
        "title": "Desiring Machines: Buildings, Maps, and Clouds (ARTHIST 212, ARTHIST 412, COMPLIT 212A, COMPLIT 312A, ILAC 212A)",
        "description": "Focus is on early modern machines as tools for experience and action. In their break with Freudian psychoanalysis, French theorists Deleuze and Guattari speak of the machine as a tool of desire and attraction itself as &quot;machinic&quot; rather than desire for something that is missing. The goal of this course is to equip students with a different way of thinking by exploring a large group of objects from the early modern world (poems, buildings, costumes, maps, nets, and clouds) that help us to approach the period in a new way.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223331",
        "number": "ILAC 312A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "314",
        "title": "Colonial Mexico: Images and Power (ARTHIST 277, HISTORY 272, HISTORY 372B, ILAC 214)",
        "description": "How did images maintain, construct, or transform political power during the conquest and colonization of Mexico? The creation and destruction of visual materials in this period had a complicated relationship with power. The pictographic codices that celebrated the expansive Aztec Empire were created after its fall; and the conquistadors' indigenous allies painted some of the most triumphalist narratives of the conquest. Friars accused indigenous peoples of &quot;idolatry&quot; both to justify the destruction of their images and objects, and to construct legal defenses of their humanity. Colonial authorities frequently claimed Afro-Catholic festivals were seditious. In light of such complexity, official histories that recount the top-down consolidation of royal and viceroyal power are suspiciously simple. What counter-narratives do images and other visual phenomena from this tumultuous period offer? This course introduces students to major texts from Colonial Mexico (royal chronicles, conquistadors' tales, letters, poems, festival accounts) alongside a fascinating trove of images (painted codices with Nahuatl texts, feather mosaics, and indigenous heraldry) and considers how experiences of images and spectacles were transformed into textual accounts (&quot;ekphrasis&quot; or the literary device of description). Taught in Spanish with accommodations for non-ILAC students who are still improving their language skills",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222793",
        "number": "ILAC 314",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "318",
        "title": "Shipwrecks and Backlands: Getting Lost in Literature (COMPLIT 214, COMPLIT 314A, ILAC 218)",
        "description": "This course takes students on a journey through tales of getting lost in the Portuguese and Spanish empires. We will read harrowing stories of being caught adrift at sea and mystical interpretations of island desertion. The course begins with sea-dominated stories of Portuguese voyages to Asia, Africa, and Brazil then turns to how the Amazon and the sert&atilde;o, or backlands, became a driving force of Brazilian literature. Official historians, poets, and novelists imbued the ocean and the backlands with romanticism, yet these spaces were the backdrop to slavery and conquest. Instead of approaching shipwreck and captivity narratives as eyewitness testimonies, as many have, we will consider how they produced 'the sea' and 'the wilderness' as poetic constructions in Western literature while also offering glimpses of the 'darker side' of Iberian expansion. Taught in English with all texts offered both in English and the original Portuguese or Spanish. Optional guest lectures in Portuguese.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28332",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "100-101K",
                        "instructors": [
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223534",
        "number": "ILAC 318",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "319",
        "title": "Lusophone Africa",
        "description": "Focus on representative authors and works of modern Lusophone African literature (the literatures of Angola, Cabo Verde, Guinea-Bissau, Mozambique, and S&atilde;o Tom&eacute; e Pr&iacute;ncipe) as well as relevant work in post-colonial theory. Students may take the course in English (3 units) or in English and Portuguese (5 units). Students who choose to take the course for five units must attend the Friday Portuguese discussion section.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217288",
        "number": "ILAC 319",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "320E",
        "title": "Renaissance Africa (AFRICAST 220E, COMPLIT 220, ILAC 220E)",
        "description": "Literature, art, and culture in Central/Southern Africa during the sixteenth and seventeenth centuries. Emphasis on forms of exchange between Europeans and Africans in the Kingdom of Kongo and Angola. Readings in Portuguese and English. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "218137",
        "number": "ILAC 320E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "321",
        "title": "Aljamiado Literature: Crypto-Muslim Culture in Early Modern Iberia",
        "description": "The history, culture, and literature of minority Muslim communities in Spain and Portugal from 1492 to the Morisco expulsions of 1609-14. Topics include: Islam and the West; Religious minorities in Europe; Inquisition and resistance; Gender and Islam; Law and Culture. Class discussions will revolve around selected works of Aljamiado literature (students will learn to read Arabic script), and the final project will involve the partial transcription and study of a sixteenth-century Aljamiado manuscript.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221852",
        "number": "ILAC 321",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "323",
        "title": "Transatlantic Methodologies (ILAC 223)",
        "description": "Focus is on the practice of transatlantic studies in primarily, but not exclusively hispanophone fields. Emphasis on nineteenth century, with attention to critical work spanning colonial to contemporary periods. Students are expected to survey a variety of approaches and methodologies in order to consider transatlantic or the oceanic turn as a framing tool in relation to their own work.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223537",
        "number": "ILAC 323",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "336",
        "title": "One World or Many? Representing Distance, Time, and Place in Iberian Expansion",
        "description": "The travelers, missionaries, and historians that reflected on Iberian overseas expansion during the early modern period often asked themselves a crucial question: was there only one world or many? Could the New World, unknown to the ancients, be entirely detached from the rest of human history? Many of these chroniclers continued to think that the world was divided into three parts: Europe, Asia, and Africa. In their descriptions of the Americas, they drew heavily on histories and travel reports pertaining to other epochs and locales, especially contemporary Asia and ancient Rome. Local authors and artists in the New World in this period used world history and news of distant conflicts to reflect on the immediacy of their historical experience. In this course, we will consider the ways in which historians, conquistadors, missionaries, and indigenous authors in New Spain (Mexico), Brazil, and Peru contemplated themselves in the looking glass of remote times and places: from Greco-Roman Antiquity to Lutheran Germany, from the Ottoman Mediterranean to the Apocalyptic End of Times. Students will reassess the importance of this archive to early modern studies writ large and challenge the scholarly tendency to frame the Iberian Peninsula as the center and the Americas as the periphery. Primary sources will include sixteenth and seventeenth-century chronicles, reports, poetry, theater, pictographic codices, feather mosaics, and maps. Reading knowledge of Spanish and a willingness to work with Portuguese required. Course to be taught by Nicole T. Hughes.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219593",
        "number": "ILAC 336",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "342",
        "title": "Meat",
        "description": "&quot;Carne&quot; mistranslates as &quot;meat,&quot; &quot;K&ouml;rper,&quot; or &quot;chair.&quot; Does the word codify into language a certain culturally specific experience of the body and its mediation with nature? In which ways does &quot;flesh&quot; subordinate nonhumans? How does the theme of meat articulate natural and political histories? This advanced research seminar tackles these questions across Latin American corpora: Pi&ntilde;era, Eltit, Echeverr&iacute;a, Bola&ntilde;o, Bombal, and Lispector. Theorists include: Singer, Santner, and Ortiz. Culturalist, new materialist debates on cattle and corpses. This course will be taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219524",
        "number": "ILAC 342",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "345",
        "title": "Ese íntimo desconocido. Imagen y experiencia íntima.",
        "description": "El trabajo de este mini-seminario se acerca al concepto de lo &iacute;ntimo como lo m&aacute;s pr&oacute;ximo, lo m&aacute;s interior y a la vez lo m&aacute;s exterior a uno, una suerte de interior/exterior que organiza al sujeto desde su radical ominosidad (lo des-familiar y lo ex-propio que lo constituyen). Los cuatro d&iacute;as de conversaci&oacute;n se centrar&aacute;n en el an&aacute;lisis de 4 filmes de directores gallegos (Eloy Enciso, Oliver Laxe, Lois Pati&ntilde;o y Diana Toucedo) destacando ciertas im&aacute;genes y figuras como el soporte existencial donde se escenifica &quot;la fractura constitutiva de la intimidad&quot; (J-A Miller) y su relaci&oacute;n a la vida y a la muerte (a la existencia). A partir de estas im&aacute;genes y figuras &eacute;xtimas, el seminario abordar&aacute; tem&aacute;ticas que conciernen a la subjetividad, a la &eacute;tica del comportamiento y  a la experiencia hist&oacute;rica, para producir reflexiones sobre cuestiones en relaci&oacute;n a la historicidad y temporalidad del sujeto. El curso girar&aacute; en torno a las presentaciones de la profesora invitada Cristina Moreiras (U. Michigan). Ser&aacute; en Espa&ntilde;ol de Lunes Oct. 31-Jueves Nov. 3.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224665",
        "number": "ILAC 345",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "347",
        "title": "Early Modern Iberian Lyric Poetry",
        "description": "Focused analysis of lyric poetry in Catalan, Portuguese, and Spanish from the fifteenth through the seventeenth centuries. Readings include poems by Ausi&agrave;s March, el marqu&eacute;s de Santillana, Bernardim Ribeiro, Francisco de S&aacute; de Miranda, Garcilaso de la Vega, Lu&iacute;s de Cam&otilde;es, Diogo Bernardes, Vicent Garcia, Luis de G&oacute;ngora, and Soror Violante do C&eacute;u. Ways of thinking about and thinking through poetry. Focus on poetic form, voice, figural language, performativity, empire, and the interaction of sensory registers. Taught in English with readings in Catalan, Portuguese, and Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220588",
        "number": "ILAC 347",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "348",
        "title": "US-Mexico Border Fictions: Writing La Frontera, Tearing Down the Wall (COMPLIT 348)",
        "description": "A border is a force of containment that inspires dreams of being overcome, crossed, and cursed; motivates bodies to climb over walls; and threatens physical harm. This graduate seminar places into comparative dialogue a variety of perspectives from Chicana/o and Mexican/Latin American literary studies. Our seminar will examine fiction and cultural productions that range widely, from celebrated Mexican and Chicano authors such as Carlos Fuentes (La frontera de cristal), Yuri Herrera (Se&ntilde;ales que precederan al fin del mundo), Willivaldo Delgaldillo (La Virgen del Barrio &Aacute;rabe), Am&eacute;rico Paredes (George Washington G&oacute;mez: A Mexico-Texan Novel), Gloria Anzald&uacute;a (Borderlands/La Frontera: The New Mestiza), and Sandra Cisneros (Carmelo: Puro Cuento), among others, to musicians whose contributions to border thinking and culture have not yet been fully appreciated such as Herb Albert, Ely Guerra, Los Tigres del Norte, and Caf&eacute; Tacvba. Last but not least, we will screen and analyze Orson Welles' iconic border films Touch of Evil and Rodrigo Dorfman's Los Sue&ntilde;os de Ang&eacute;lica. Proposing a diverse and geographically expansive view of the US-Mexico border literary and cultural studies, this seminar links the work of these authors and musicians to struggles for land and border-crossing rights, anti-imperialist forms of trans-nationalism, and to the decolonial turn in border thinking or pensamineto fronterizo. It forces us to take into account the ways in which shifts in the nature of global relations affect literary production and negative aesthetics especially in our age of (late) post-industrial capitalism. Taught in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29919",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, J.",
                                "sunet": "jds1"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218801",
        "number": "ILAC 348",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "350",
        "title": "Roberto Bolaño's 2666",
        "description": "Roberto Bola&ntilde;o's 2666 raises questions about the representability of sovereignty, neoliberalism, gender violence, and globalization. An unlikely global classic, it has become a de rigueur referent in contemporary literary studies. Graduate students taking this class will not only engage in a narratological examination of novel, but also survey the existing secondary bibliography, including forthcoming manuscripts with special permission from the authors. The goal of the seminar is to prepare graduate students to formulate their own contributions to the state of the discipline.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222064",
        "number": "ILAC 350",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "351",
        "title": "Iberian Expansion Through the Looking Glass: One World or Many? (COMPLIT 251A, COMPLIT 351A, CSRE 251, CSRE 351, HISTORY 271C, HISTORY 371C, ILAC 251)",
        "description": "The conquerors, missionaries, and historians who reflected on Iberian overseas expansion during the early modern period often asked themselves a crucial question: was there only one world or many? Were the Americas a 'New World,' unknown to the ancients, entirely detached from the rest of human history? Even after the invasion and occupation of the Americas, many European chroniclers continued to think that the world was divided into three parts - Europe, Asia, and Africa. In their descriptions of the Americas, they drew heavily on histories and travel reports pertaining to other epochs and locales, especially contemporary Asia and ancient Rome. At the same time, indigenous elites and mestizo authors in the Americas used 'Old World' history and news of distant conflicts to reflect on the immediacy of their historical experience. In this course, students will consider the ways in which diverse authors in New Spain (Mexico), Peru, and Brazil contemplated themselves in relation to remote times and places: from Greco-Roman Antiquity to Lutheran Germany, the Ottoman Mediterranean to the Apocalyptic End of Times. Students will analyze the many reflections, distortions, inversions, translations, uncanny resemblances, and strange parallel dimensions that resulted from these intellectual experiments. Primary sources include chronicles, poetry, theater, Afro-Catholic festivals, pictographic codices, feather mosaics, and maps. All texts offered in the original language and in English translation whenever possible. For graduate students and advanced undergraduates.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223544",
        "number": "ILAC 351",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "353",
        "title": "Losing My Mind: Madness, Race, and Gender in Latin America (COMPLIT 253, ILAC 253)",
        "description": "What does it mean to lose our minds? Is the mind even ours to lose? How do race, gender, and social status inform our understandings and experiences of insanity? In this bilingual course we will explore figurations of madness, mental illnesses, and other kinds of crises of the self in Latin American cultural objects, from the eighteenth to the twentieth centuries. We will examine testimonies of religious experiences, novels, medical treatises, short stories, intimate diaries, and visual materials on disorderly states of mind and fragmented identities produced in territories that are today Cuba, Brazil, Mexico, Per&uacute;, Argentina, and the Dominican Republic, among others. In our examination of these objects and their historical contexts, we will discuss how colonial and state authorities have used psychiatric labels to control and regulate the lives of Afro-descendants and women in Latin American territories. We will also examine the ways in which men and women of color navigated through these labels in order to evade punishment, engage in creative processes, or simply live their lives. Readings will be in Spanish and English (when translated from Portuguese). Advanced knowledge of Spanish is required.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30565",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fraga, I.",
                                "sunet": "ifraga"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225207",
        "number": "ILAC 353",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "355",
        "title": "Women and Wolves in Film and Literature (ILAC 249)",
        "description": "This course deconstructs the foundational narrative that corrals women into capitalist patriarchy, together with  animals. Paying close attention to interspecies bonds between canidae and homo sapiens, we study novels and films where women, wolves and dogs resist the male gaze. Ever heard of Little Red Riding Hood? What if there could be a liberating alliance between her and the wolf? Taught in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222831",
        "number": "ILAC 355",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "356",
        "title": "Asian-Latin Americans: Historical, Literary, and Cultural Migrations (ILAC 256)",
        "description": "This course focuses on Asian migrations to Latin America, Asian-Latin American communities, transculturation, hybridity, and cultural production by and about Asian Latin Americans. It compares migrations from China and Japan to Latin America with Asian migrations to the US as well as with the experience of enslaved African. We will explore different aspects of Transpacific Studies, Orientalism in Latin America, transpacific transculturation and hybridization processes, as well as process of migration and re-migration. This course will be held in Spanish.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30563",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "7:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            },
                            {
                                "name": "Kim, Y.",
                                "sunet": "yrk3pt"
                            }
                        ],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 71400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225206",
        "number": "ILAC 356",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "366",
        "title": "Topics of: The Yellow-Brick Road to the Spanish Nation-State",
        "description": "Nation states arise historically with the transfer of rule from the king to the people, which becomes depository of the general interest. But the old patrimonial state included different peoples, some of which continued to have their own constitutions, representative chambers, and codes of law. Unifying them was a pre-requisite for the emergence of the nation state. This was achieved through a process of nation building which, for most European states, culminated in the 19th century. Not so in Spain. The recurring crises of the Spanish state through the 19th and 20th centuries, and renewed territorial problems in the 21st, reveal an unachieved national project. The seminar will discuss theories of nationalism and sovereignty, and will consider the historical attempts of the Spanish state to manage its intractable nationalities problem, with particular reference to Catalonia. In addition to the state&iquest;s political fractures, the significance of culture for the insolubility of national identities in a single national project will be considered in some detail, as will the role of academic disciplines in furthering a cultural mandate in the sense of political power or in challenge to it.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220611",
        "number": "ILAC 366",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "367E",
        "title": "Contemporary Theory Lab (COMPLIT 367E, ENGLISH 367E)",
        "description": "This new graduate seminar examines the question of whether a new canon of theoretical monographs-as opposed to influential standalone essays or papers-has coalesced in recent years. We focus on a post-Foucaultian, post-1989 moment, understanding theory as an autonomous, interdisciplinary enterprise that is not subservient or reducible to philosophy or literary criticism but shares many of the core concerns of each discipline. The seminar provides students with a safe space to discuss cutting-edge ideas, arguing for, with, and against influential trends. We will study six to eight monographs in great detail, at least two of which will be determined by class vote. Of special interest are conceptual formations and methodologies that do not have an institutional home or pursue a narrow political agenda. Topics include anticolonial thinking, new materialism, affect studies, and the shadow of the linguistic turn. We may draw from a roster of thinkers such as Bruno Latour, Saidiya Hartman, Ver&oacute;nica Gago, Sianne Ngai, Rob Nixon, Sara Ahmed, Martin H&auml;gglund, Arturo Escobar, Mark Fisher, Wendy Brown, and Fred Moten. Previous experience with theory is recommended. Assignments sequence short papers with revisions, short student presentations, and a final paper. Stanford faculty and outside guests will be a mainstay. Broader community engagement with theory, as well as student integration of the subject matter towards their independent research projects, will be central goals. Open to co-terms, masters, and PhD students in the humanities and social sciences.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224278",
        "number": "ILAC 367E",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "368",
        "title": "Law and (non-)Humanities in Latin America",
        "description": "This research seminar, geared toward ILAC grad students and open to all, taught in Spanish, proposes a transversal revision of the Latin American canon from a Law and Humanities perspective, with a special interest in non-human affairs. Primary sources will be determined in consultation with participants and may include Argentine Esteban Echeverr&iacute;a's El matadero (1871), Ecuadorian Jorge Icaza's Huasipungo (1934), Mexican Elena Poniatowska's La noche de Tlatelolco (1971), and Colombian Juan C&aacute;rdenas's Los estratos (2013), as well as films by Solanas and Pereira dos Santos. Topics include agrarian reform, juridical personhood of nature, force of law, and representations of nature-cultural collectives. Students will become familiar with the state of the interdiscipline and will be encouraged to position their own research findings within it.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30411",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 69600.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225205",
        "number": "ILAC 368",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "371",
        "title": "Graduate Colloquium: Explorations in Latin American History and Historiography (HISTORY 371)",
        "description": "Introduction to modern Latin American history and historiography, including how to read and use primary sources for independent research.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "30932",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "2:20:00 PM",
                        "location": "Bolivar House",
                        "instructors": [
                            {
                                "name": "Wolfe, M.",
                                "sunet": "mikaelw"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 51600.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210963",
        "number": "ILAC 371",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "373",
        "title": "Baroque Brazil",
        "description": "In this course we will read texts from and about seventeenth- and eighteenth-century Brazil, with special emphasis on the baroque aesthetic in literature, art, and music. Authors include Ant&oacute;nio Vieira; Greg&oacute;rio de Matos; Bento Teixeira; Sebasti&atilde;o da Rocha Pita; Nuno Marques Pereira; Manuel Botelho de Oliveira; and Frei Itaparica.nReadings in English and Portuguese. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217365",
        "number": "ILAC 373",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "384",
        "title": "Nationalism, Cultural and Political (COMPLIT 384)",
        "description": "Is there a non-political nationalism? Does the term &quot;post-nationalism&quot; designate a political reality? Or does &quot;transnational&quot; add meaningfully to the more traditional term &quot;international&quot; in reference to dynamics occurring between or among nations? The seminar will analyze the emergence of the concept &quot;nationalism&quot; with Herder's political writings, the opposition between cultural nation and political state, the connection between democracy and the rise of the nation state and the reaction against nationalism in the wake of authoritarian movements in the 20th century and the challenge to popular sovereignty connected with the problematization of the nation. Texts by Rousseau, Herder, Fichte, Weber, Berlin, Huizinga, Miguel de Unamuno, Prat de la Riba, Eugeni d'Ors, Ortega y Gasset, among others. Taught in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30570",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225221",
        "number": "ILAC 384",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "399",
        "title": "Individual Work",
        "description": "For Spanish and Portuguese department graduate students only. Prerequisite: consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28305",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "31211",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "9263",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10304",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10535",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "13000",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, J.",
                                "sunet": "jds1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10305",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, R.",
                                "sunet": "saldivar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "13232",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "13960",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "13233",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "13962",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "INS",
                "notes": null,
                "classId": "13234",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "12",
                "component": "INS",
                "notes": null,
                "classId": "13431",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "13",
                "component": "INS",
                "notes": null,
                "classId": "13432",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "120436",
        "number": "ILAC 399",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 14
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "680",
        "title": "Curricular Practical Training",
        "description": "CPT course required for international students completing degree. Prerequisite: ILAC Ph.D. candidate.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13747",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14275",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13666",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222963",
        "number": "ILAC 680",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "801",
        "title": "TGR Project",
        "description": "TGR Project",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [],
        "gers": [],
        "objectID": "215107",
        "number": "ILAC 801",
        "units": [
            0
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ILAC",
        "code": "802",
        "title": "TGR Dissertation",
        "description": "Doctoral students who have been admitted to candidacy, completed all required courses and degree requirements other than the University oral exam and dissertation, completed 135 units or 10.5 quarters of residency (if under the old residency policy), and submitted a Doctoral Dissertation Reading Committee form, may request Terminal Graduate Registration status to complete their dissertations.",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28306",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "31475",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Briceno, X.",
                                "sunet": "xbriceno"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "9257",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "9433",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "9258",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "10307",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "9434",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Resina, J.",
                                "sunet": "jrresina"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "9259",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, R.",
                                "sunet": "saldivar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "12944",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "12691",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "13235",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "13433",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hughes, N.",
                                "sunet": "nthughes"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "10733",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, R.",
                                "sunet": "saldivar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "30964",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, J.",
                                "sunet": "jds1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "11",
                "component": "T/D",
                "notes": null,
                "classId": "31176",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Barletta, V.",
                                "sunet": "vbarlett"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "12",
                "component": "T/D",
                "notes": null,
                "classId": "11703",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saldivar, J.",
                                "sunet": "jds1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "13",
                "component": "T/D",
                "notes": null,
                "classId": "13198",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hoyos, H.",
                                "sunet": "hhoyos"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "14",
                "component": "T/D",
                "notes": null,
                "classId": "13215",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Surwillo, L.",
                                "sunet": "surwillo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "120438",
        "number": "ILAC 802",
        "units": [
            0
        ],
        "totalSections": 18
    }
]