[
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "5C",
        "title": "Human Trafficking: Historical, Legal, and Medical Perspectives (CSRE 5C, FEMGEN 5C, HISTORY 5C)",
        "description": "(Same as History 105C. 5C is 3 units; 105C is 5 units.) Interdisciplinary approach to understanding the extent and complexity of the global phenomenon of human trafficking, especially for forced prostitution, labor exploitation, and organ trade, focusing on human rights violations and remedies. Provides a historical context for the development and spread of human trafficking. Analyzes the current international and domestic legal and policy frameworks to combat trafficking and evaluates their practical implementation. Examines the medical, psychological, and public health issues involved. Uses problem-based learning. Required weekly 50-min. discussion section, time TBD. Students interested in service learning should consult with the instructor and will enroll in an additional course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "213152",
        "number": "INTNLREL 5C",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "25",
        "title": "War, Revolution, and Peace: The View from Hoover Tower",
        "description": "The collections of the Hoover Institution Library &amp; Archives document the wars, revolutions, political and social movements, and the struggles for peace around the globe in the 20th and 21st centuries. The course will introduce students to the origins and evolution of this unique institution, highlight its rare collections, and reveal how it collects, preserves, and makes available to researchers an enormous and ever-expanding array of primary-source material, including personal archives, photographs and film, posters, rare books and periodicals, artworks, and digital records. Students will gain insight into the operations of a special collections research center, including the role of conservation, the digitizing of collections, and how public exhibitions make the history that emerges from the collections available to a broader public. Speakers will include Hoover's curators and members of the Research Services, Digital Services, Preservation, Exhibitions, and Research and Education teams. Historian, Hoover Research Fellow, and IR Lecturer Bertrand Patenaude (Stanford MA '79, PhD '87), will introduce the course and coordinate the individual sessions.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "225066",
        "number": "INTNLREL 25",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "33SI",
        "title": "Myths and Realities of U.S.-China Relations",
        "description": "This course introduces students to the U.S.-China relationship through a weekly speaker series followed by student-led discussions. Speakers from academia and industry will explore topics such as the business environment of China, the politics of the Sino-American dynamic, and technological growth in China. The purpose of the course is to tackle the myths and misconceptions surrounding U.S.-China relations, and build in students a strong foundational understanding of the multiple facets of the bilateral relationship. Students will be exposed to a variety of issues and those who take the course for 2 units will be able to explore a topic of interest through a capstone presentation at the end of the course.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "221840",
        "number": "INTNLREL 33SI",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "35SI",
        "title": "Crisis and Cooperation: Contemporary Research on International Security",
        "description": "This 1-unit, student-initiated course will provide undergraduate students the opportunity to engage with faculty from across the university conducting research relating to international security. Students will have the opportunity to learn about cutting-edge research taking place at Stanford and be exposed to topics and subfields they may otherwise not have access to as undergraduates. The class will be framed around four subfields within international security studies: emerging technologies and intelligence; insurgent organizations and non-state actors; great power competition and the future of conflict; and nuclear weapons and arms control negotiation.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ACT",
                "notes": "Class held in Encina Commons 123.",
                "classId": "14697",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schultz, K.",
                                "sunet": "kschultz"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223238",
        "number": "INTNLREL 35SI",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "45Q",
        "title": "Genocide and Humanitarian Intervention",
        "description": "The seminar traces the history of genocide since the beginning of the 20th century. It examines the role of humanitarian intervention to prevent or stop it and the use of international law to punish it. The discussion begins with the Armenian genocide during the First World War and includes the Holocaust, Cambodia under the Khmer Rouge in the 1970s, and the Kurds in Iraq in the 1980s. Coverage starting in the 1990s includes the cases of Bosnia, Rwanda, Kosovo, and Darfur and the more recent discussions of the appropriateness of the term genocide to describe the fate of the Yazidis in Syria, the Rohingya in Myanmar, the Uighurs in China, and the people of Ukraine.Students will learn about the origins of the word &quot;genocide,&quot; which was coined during the Second World War, and about the legal definition of genocide as spelled out in the 1948 Genocide Convention. A chief focus of the course is the response of the United States, both in words and deeds, to alleged cases of genocide from Armenia in 1915 to Ukraine in 2023.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "28490",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:50:00 PM",
                        "location": "Encina West 202",
                        "instructors": [
                            {
                                "name": "Patenaude, B.",
                                "sunet": "bertiep"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 60600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "225107",
        "number": "INTNLREL 45Q",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "60Q",
        "title": "United Nations Peacekeeping (PEDS 60Q)",
        "description": "Focus is on an examination of United Nations peacekeeping, from its inception in 1956 in the wake of the Suez Crisis, to its increasingly important role as an enforcer of political stability in sub-Saharan Africa. Examines the practice of &quot;classic&quot; peacekeeping as it developed during the Cold War, the rise and fall of &quot;second-generation&quot; peacekeeping, and the reemergence of a muscular form of peacekeeping in sub-Saharan Africa more recently. Topics include the basic history of the United Nations since 1945, he fundamentals of the United Nations Charter, and the historical trajectory of U.N. peaeckeeping and the evolving arguments of its proponents and critics over the years.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "215615",
        "number": "INTNLREL 60Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "61Q",
        "title": "Food and security (EARTHSYS 61Q, ESS 61Q)",
        "description": "The course will provide a broad overview of key policy issues concerning agricultural development and food security, and will assess how global governance is addressing the problem of food security. At the same time the course will provide an overview of the field of international security, and examine how governments and international institutions are beginning to include food in discussions of security.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "212072",
        "number": "INTNLREL 61Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "62Q",
        "title": "Mass Atrocities: Reckoning and Reconciliation",
        "description": "Imagine you live in a country in which a delusional dictator imprisons untold masses in labor and concentration camps, and kills millions of them. Imagine you live in another country, in which one ethnic group slaughters the other. Imagine you live in yet another country in which a racial white minority terrorizes and violently discriminates against a huge majority of black population. Or, imagine you live in a country in which members of one group engage in an &quot;ethnic cleansing&quot; of their former neighbors.Now imagine this: Some big political change comes to each of these societies, and the perpetrators lose their power and are finally stopped from committing any more crimes and atrocities. Now comes the time to decide how to bring about justice for the past wrongs. It is also a question of how to come to terms with the terrible past. How to remember it?  How to confront it? How to judge the perpetrators? How to identify them?  How to punish them appropriately if at all? Also, is it possible to ever reconcile with the former oppressors and enemies? Maybe even to forgive them? If so, under what circumstances?  What is necessary for such reconciliation? What if some of the victims were also perpetrators?The scenarios mentioned above are real ones&iquest;they happened in Germany, Rwanda, South Africa, Bosnia, and elsewhere. In this IntroSem we will explore the social, political, and legal arrangements societies debated about, negotiated, and used to deal with the atrocities of the past.  We will assess their utility in the process of &iquest;transitional justice.&iquest;  We will scrutinize crimes tribunals and truth commissions, and inquire whether they enabled the victims to gain a sense of justice and fairness. Likewise, we will consider under what conditions those victims might ever be capable of a genuine reconciliation.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "216866",
        "number": "INTNLREL 62Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "63Q",
        "title": "International Organizations and Accountability",
        "description": "International organizations (IOs), like the IMF, the World Bank, the United Nations, and others, have been widely criticized as insufficiently accountable. For example, some argue that states are not able to control IOs whose bureaucracies have grown out of control and run amok, while others argue that the real problem is that communities most impacted by IO activities, such as those receiving World Bank loans or UN peacekeeping operations, are least able to influence their activities. Still others contend that the voting rules by which states control IOs are outdated and should be reformed to remedy these problems.Through readings, discussions and case studies, students will learn about a range of international organizations in order to better understand what they do and how they are supposed to be controlled. In addition, we will evaluate the critiques of IO accountability that come from the right and the left, as well as the North, South, East and West, and will analyze different mechanisms of accountability, both formal and informal. Students will have the opportunity to research and present on specific international organizations and accountability mechanisms.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "220387",
        "number": "INTNLREL 63Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "64Q",
        "title": "Leadership and International Organizations",
        "description": "What do intergovernmental organizations like the United Nations, the World Food Program, the United Nations High Commission for Refugees actually do? Do these organizations simply act on the interests of the governments that comprise them? Or do they have some autonomy to pursue their own programs, plans, and priorities? Does leadership of these organizations matter for their performance? What dilemmas do the leaders or intergovernmental organizations face as they try to satisfy governments while serving people in need all over the world? This course will get at these questions through examining the lives, careers and choices of leaders of major international organizations over the last thirty years. Reading assignments will include memoirs and biographies of leaders of international organizations, as well as analytical and empirical studies of international organizations. We plan on inviting former and current leaders of international organizations to visit the seminar.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221250",
        "number": "INTNLREL 64Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "74",
        "title": "Public Service and Social Impact: Pathways to Purposeful Careers (CSRE 190A, ENGLISH 180, POLISCI 74B, PUBLPOL 75B, SOC 190A, SYMSYS 193, URBANST 190A)",
        "description": "How do I translate my interests and skills into a career in public service and social impact? This course will introduce you to a wide range of roles that help shape public policy and civic life, including government, education, nonprofits, social enterprises, and arts/media.  It can be taken for one or two units. For one unit, you participate in a weekly, interactive speaker series designed to give you a sense for what different public service careers are like. Each week, guests describe their organizations and roles, highlight key intellectual issues and policy challenges, discuss their career paths, and describe skills crucial for the job. For a second unit, you participate in a hands-on weekly session designed to help you translate this knowledge into action. You will identify roles and organizations that might be a good match for you, build your network through informational interviewing, receive career coaching, and acquire the tools you need to launch your job or internship search. This course is intended for all students and all majors. Course content will be relevant to students soon entering the job market as well as those facing choices about courses of study and internships. Class sessions will be 60 minutes. This course is co-sponsored by the Haas Center for Public Service, the School of Humanities and Sciences, and Stanford in Government. Students taking the course for one unit (Tuesday lecture) must enroll in the -01 course option, and students taking the course for two units (Tuesday lecture and Thursday seminar) must enroll in the -02 course option.  IR approved.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30326",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30976",
                "currentClassSize": "0",
                "maxClassSize": "90",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:30:00 PM",
                        "location": "300-300",
                        "instructors": [
                            {
                                "name": "Litvak, L.",
                                "sunet": "lalitvak"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 63000.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "SEM",
                "notes": null,
                "classId": "30977",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:30:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Litvak, L.",
                                "sunet": "lalitvak"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 63000.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:30:00 PM",
                        "location": "Lathrop 282",
                        "instructors": [
                            {
                                "name": "Litvak, L.",
                                "sunet": "lalitvak"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 63000.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "DIS",
                "notes": null,
                "classId": "30325",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223178",
        "number": "INTNLREL 74",
        "units": [
            1,
            2
        ],
        "totalSections": 4
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "76",
        "title": "Protagonists in Policy (POLISCI 76)",
        "description": "Interested in learning from activists, academics, and politicians about the different ways you can be an agent of change and affect public policy? This course presents a lecture/discussion series in which students will have the opportunity to engage with influential speakers to discover and learn more about timely topics relating to policy, government, and international affairs. Speakers will be selected in cooperation with the Policy Dinners Committee, a branch of Stanford in Government.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "222625",
        "number": "INTNLREL 76",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "82",
        "title": "The Ending of World War I: Three Perspectives",
        "description": "This course is required for those students who will be taking the BOSP Overseas Seminar, The Ending of the First World War and the Shaping of the 20th Century. Enrollment is limited to students who will be taking the overseas seminar, or are waitlisted for the seminar.nnThis course has three learning goals: 1.) to provide historical background on the war and the events and processes leading up to the ending of the war;  2.) to help students formulate possible research topics for the Overseas Seminar; and 3.) to acquaint the students with archival research in preparation for their time in London.  The course will be taught from the perspectives of military history, political science, and literature. Each week we will meet to discuss the reading material.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "220017",
        "number": "INTNLREL 82",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "101",
        "title": "Introduction to International Relations (POLISCI 101)",
        "description": "The course provides an introduction to major factors shaping contemporary international politics, including: the origins and nature of nationalism; explanations for war; nuclear weapons; international implications of the rise of China; civil war and international peacekeeping; risks to international institutions with increasing major power conflict; and the politics of international &quot;public bads&quot; such as climate change and global pandemics.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Please enroll in this course through Axess and use Canvas to enroll in the discussion sections.",
                "classId": "26854",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "370-370",
                        "instructors": [
                            {
                                "name": "Fearon, J.",
                                "sunet": "jfearon"
                            },
                            {
                                "name": "Kaufmann, J.",
                                "sunet": "janekauf"
                            },
                            {
                                "name": "Theophanous, P.",
                                "sunet": "phedias"
                            },
                            {
                                "name": "Peters, S.",
                                "sunet": "speters9"
                            },
                            {
                                "name": "Park, P.",
                                "sunet": "pkpark"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-SI"
        ],
        "objectID": "122849",
        "number": "INTNLREL 101",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "101Z",
        "title": "Introduction to International Relations (POLISCI 101Z)",
        "description": "Approaches to the study of conflict and cooperation in world affairs. Applications to war, terrorism, trade policy, the environment, and world poverty. Debates about the ethics of war and the global distribution of wealth.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "WAY-SI"
        ],
        "objectID": "205948",
        "number": "INTNLREL 101Z",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "102",
        "title": "History of the International System since 1914 (HISTORY 102)",
        "description": "After defining the characteristics of the international system at the beginning of the twentieth century, this course reviews the primary developments in its functioning in the century that followed. Topics include the major wars and peace settlements; the emergence of Nazism and Communism; the Cold War; decolonization; and globalization. The role of international institutions and international society will also be a focus as will the challenges of climate change, inequality, migration, and terrorism.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13822",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rakove, R.",
                                "sunet": "robr"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 51600.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-GlobalCom",
            "WAY-SI"
        ],
        "objectID": "115013",
        "number": "INTNLREL 102",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "103F",
        "title": "Introduction to Modern Military History (HISTORY 3F, HISTORY 103F)",
        "description": "(HISTORY 3F is 3 units; 103F is 5 units.) This course will introduce students to the basic concepts of modern warfare, its evolution, and some of the immeasurable ways by which it shaped our history as well as our world today. How have strategy, operations and tactics been transformed by the modern state; the industrial revolution; and the accelerated pace of technological change? What is the meaning of total war, conventional war, and asymmetric war, and how were these different types of war fought in the 20th and 21st centuries? From the Napoleonic wars to the war in Ukraine, how do wars reflect, and shape, our politics, economics, culture, and technology? No prior knowledge of military history (or technology) is required. Students satisfying the WiM requirement for the major in International Relations must enroll in INTNLREL 103F course listing. Please note that the version of this course offered in 2023-24 and later does not fulfill a &quot;pre-1700&quot; requirement for the history major.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "12536",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "260-113",
                        "instructors": [
                            {
                                "name": "Vardi, G.",
                                "sunet": "gvardi"
                            },
                            {
                                "name": "Olson, J.",
                                "sunet": "olsonj"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": "Please see HISTORY 103F for discussion section meeting times. Discussion sections will be managed via Canvas.",
                "classId": "12824",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "213315",
        "number": "INTNLREL 103F",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "105C",
        "title": "Human Trafficking: Historical, Legal, and Medical Perspectives (CSRE 105C, FEMGEN 105C, HISTORY 105C, HUMRTS 112)",
        "description": "(Same as HISTORY 5C. 105C is 5 units, 5C is 3 units.) Interdisciplinary approach to understanding the extent and complexity of the global phenomenon of human trafficking, especially for forced prostitution, labor exploitation, and organ trade, focusing on human rights violations and remedies. Provides a historical context for the development and spread of human trafficking. Analyzes the current international and domestic legal and policy frameworks to combat trafficking and evaluates their practical implementation. Examines the medical, psychological, and public health issues involved. Uses problem-based learning. Required weekly 50-min. discussion section, time TBD. Students interested in service learning should consult with the instructor and will enroll in an additional course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "213147",
        "number": "INTNLREL 105C",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "110C",
        "title": "America and the World Economy (AMSTUD 110C, POLISCI 110C, POLISCI 110X)",
        "description": "Examination of contemporary US foreign economic policy.  Areas studied: the changing role of the dollar; mechanism of international monetary management; recent crises in world markets including those in Europe and Asia; role of IMF, World Bank and WTO in stabilizing world economy; trade politics and policies; the effects of the globalization of business on future US prosperity. Political Science majors taking this course for WIM credit should enroll in POLISCI 110C.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "WAY-SI"
        ],
        "objectID": "203386",
        "number": "INTNLREL 110C",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "110D",
        "title": "War and Peace in American Foreign Policy (AMSTUD 110D, POLISCI 110D, POLISCI 110Y)",
        "description": "The causes of war in American foreign policy. Issues: international and domestic sources of war and peace; war and the American political system; war, intervention, and peace making in the post-Cold War period. Political Science majors taking this course for WIM credit should enroll in POLISCI 110D for 5 units. International Relations majors taking this course for WIM credit should enroll in INTNLREL 110D for 5 units. All students not seeking WIM credit should enroll in POLISCI 110Y or AMSTUD 110D.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14650",
                "currentClassSize": "0",
                "maxClassSize": "90",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schultz, K.",
                                "sunet": "kschultz"
                            },
                            {
                                "name": "Kaufmann, J.",
                                "sunet": "janekauf"
                            },
                            {
                                "name": "Tchaouchev, D.",
                                "sunet": "dtchaouc"
                            },
                            {
                                "name": "MacDonald, M.",
                                "sunet": "maemac"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-SI"
        ],
        "objectID": "204161",
        "number": "INTNLREL 110D",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "114D",
        "title": "Democracy, Development, and the Rule of Law (INTLPOL 230, POLISCI 114D, POLISCI 314D, REES 230)",
        "description": "This course explores the different dimensions of development - economic, social, and political - as well as the way that modern institutions (the state, market systems, the rule of law, and democratic accountability) developed and interacted with other factors across different societies around the world. The class will feature additional special guest lectures by Francis Fukuyama, Larry Diamond, Michael McFaul, Anna Grzymala-Busse, and other faculty and researchers affiliated with the Center on Democracy, Development, and the Rule of Law. Undergraduate students should enroll in this course for 5 units. Graduate students should enroll for 3.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "Please enroll in this course through Axess and use Canvas to enroll in the discussion sections.",
                "classId": "12461",
                "currentClassSize": "0",
                "maxClassSize": "130",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "200-002",
                        "instructors": [
                            {
                                "name": "Stoner, K.",
                                "sunet": "ksweiss"
                            },
                            {
                                "name": "Fu, Y.",
                                "sunet": "yiqinfu"
                            },
                            {
                                "name": "Davis, S.",
                                "sunet": "sierrad"
                            },
                            {
                                "name": "Folsz, H.",
                                "sunet": "hfolsz"
                            },
                            {
                                "name": "Scott, E.",
                                "sunet": "ehscott"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-SI"
        ],
        "objectID": "204995",
        "number": "INTNLREL 114D",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "115",
        "title": "Spies, Lies, and Algorithms: The History and Future of American Intelligence (AMSTUD 115S, POLISCI 115, PUBLPOL 114)",
        "description": "This course examines the past, present, and future of American espionage. Targeted at first years and sophomores, the class surveys key issues in the development of the U.S. Intelligence Community since World War II. Topics include covert action, intelligence successes and failures, the changing motives and methods of traitors, congressional oversight, and ethical dilemmas. The course pays particular attention to how emerging technologies are transforming intelligence today. We examine cyber threats, the growing use of AI for both insight and deception, and the 'open-source' intelligence revolution online. Classes include guest lectures by former senior U.S. intelligence officials, policymakers, and open-source intelligence leaders. Course requirements include an all-day crisis simulation with former senior officials designed to give students a hands-on feel for the uncertainties, coordination challenges, time pressures, and policy frictions of intelligence in the American foreign policy process.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13123",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zegart, A.",
                                "sunet": "zegart"
                            },
                            {
                                "name": "Anand, M.",
                                "sunet": "manand2"
                            },
                            {
                                "name": "Tracey, T.",
                                "sunet": "tetracey"
                            },
                            {
                                "name": "Chapin, E.",
                                "sunet": "ejc5ys"
                            },
                            {
                                "name": "Houle, C.",
                                "sunet": "choule32"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "223423",
        "number": "INTNLREL 115",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "116",
        "title": "What is Security and Why Should We Care?",
        "description": "Much in this world is said to depend on security.  When governments curtail liberties, they often cite security as the reason. In countries emerging from war it is said that until security is provided, democracy, human rights and justice cannot thrive. Security justifies inconveniences like longer passwords that are nearly impossible to memorize or going through metal detectors to enter sporting events, political talks, and airline gates. One of the fundamental achievements of social democracy in the twentieth century was the provision of social security ? the promise of a funded retirement. Security is thought to be central to processes leading to war: the pursuit of security by one nation state may imperil the security of another, leading to a spiral of conflict, what international relations scholars have labelled &quot;the security dilemma.&quot; Sometimes we are asked to dismiss or understand otherwise impolite, nasty, or thoughtless behavior because someone suffers from the absence of security: 'Bob is not a terrible person; he's just insecure.' The power of security to structure so much of social life rests on some pretty impressive magic: everybody uses the word assuming everyone has a shared understanding of its meaning.  But there is good reason to be skeptical. For one, despite its importance and centrality in social and political life, security suffers from vagueness and imprecision. It can connote freedom from fear, or freedom from threat. Security's modifiers are abundant and suggest a wealth of objects to be secured; a non-exhaustive list includes human, social, national, international, nuclear, cyber, food, economic, energy, and homeland. Even if we discover that security is all that it is cracked up to be, its relation to other key words such as risk, trust, credibility, insurance and predictability remain relatively unexplored. In this course we will interrogate what people talk about when they talk about security. We will investigate how the meanings of security have shifted throughout history. We will ask why security becomes a societal preoccupation at different times in history. We will ask whether our current preoccupation with security will be permanent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225662",
        "number": "INTNLREL 116",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "122",
        "title": "Introduction to European Studies (POLISCI 213E)",
        "description": "This course offers an introduction to major topics in the study of historical and contemporary Europe. We focus on European politics, economics and culture. First, we study what makes Europe special, and how its distinct identity has been influenced by its history. Next, we analyze Europe's politics. We study parliamentary government and proportional representation electoral systems, and how they affect policy. Subsequently, we examine the challenges the European economy faces. We further study the European Union and transatlantic relations.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12117",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Crombez, C.",
                                "sunet": "crombez"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "216033",
        "number": "INTNLREL 122",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "123",
        "title": "The Future of the European Union: Challenges and Opportunities",
        "description": "First, this course analyzes the EU's greatest challenge, preserving the monetary union, and discusses the political and economic reforms needed to achieve that goal. In this context the course also studies the fiscal and budgetary polices of the EU. Second, the course discusses the EU's role in global politics, its desire to play a more prominent role, and the ways to reach that objective. Third, the course analyzes the EU's institutional challenges in its efforts to enhance its democratic character.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "11111",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Crombez, C.",
                                "sunet": "crombez"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "213890",
        "number": "INTNLREL 123",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "124",
        "title": "Immigration Issues in Europe",
        "description": "This course will consider responses to mass migration in Europe and its contribution to a radicalized political landscape. Sampling immigrant integration policies from Germany, Sweden, Denmark, France, Britain, Hungary, Poland, and Italy will help us examine public discourse on cultural and civic assimilation of mostly Muslim immigrants. Issues such as security and counterterrorism, as well as obstacles to cooperation with countries outside the EU (Turkey, Libya), will be included.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220413",
        "number": "INTNLREL 124",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "125",
        "title": "Global Human Rights and Local Practices (HUMRTS 122, INTLPOL 282, SOC 115, SOC 215)",
        "description": "The course examines how the international community has fared in promoting and protecting human rights in the world, with an emphasis on the role of the United Nations. The course will begin with an overview of debates about the state of the international human rights system in the contemporary world, and then examine how international society has addressed the challenges of implementing universal human rights principles in different local contexts across different issues. The specific rights issues examined include genocide, children's rights, labor rights, transitional justice, women's rights, indigenous rights, NGOs, and the complicated relationship between the US and global human rights. The course will feature video conference/guest lecture sessions with leading human rights scholars and practitioners, providing students with unique opportunities to hear their expert opinions based on research and experience.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14682",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tsutsui, K.",
                                "sunet": "teru"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223501",
        "number": "INTNLREL 125",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "129",
        "title": "Human Rights in an Age of Great Power Rivalry, War, and Political Transformation (CLASSICS 129, GLOBAL 125, GLOBAL 225, HUMRTS 120)",
        "description": "As is well known, great and emerging power rivalries largely shaped the course of the 20th century through WWI, WWII, and the Cold War. In the aftermath of the collapse of the Soviet Union, the 21st century been characterized by the geopolitical reconfiguration underway today with the rise of China and India and the challenges posed for American and European influence. The end of the Cold War brought hope that the proxy wars, post-colonial conflicts, and mass atrocity events that characterized the mid-20th century would yield to a more stable international order of cooperation and, hence, to a greater realization of the human rights aspirations embodied in the UN framework. The founding of the International Criminal Court (ICC) in 2002 was widely hailed as a watershed event marking that transformation. Needless to say, those hopes have remained largely unrealized and the refusal of China, India, the United States, and Russia to join the ICC is indicative of how far away a realization of those aspirations remains. As this age of great power political, economic, and military rivalry intensifies how is it impacting both the countries where the rivalries are being played out (e.g.,in the Middle East, Southeast Asia, Africa) and the societies of the rival nations themselves? How are these conflicts affecting the response to global humanitarian issues such as migration, refugees, statelessness, human trafficking, modern day slavery, climate change, and the turn towards increasing authoritarian governance? The course will explore the humanitarian dimension and consequences of war, conflict, and political transformation in such contexts through a series of case studies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223735",
        "number": "INTNLREL 129",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "131",
        "title": "Understanding Russia: Its Power and Purpose in a New Global Order (INTLPOL 231B, POLISCI 113, REES 231B)",
        "description": "Russia presents a puzzle for theories of socio-economic development and modernization and their relationship to state power in international politics. The collapse of the Soviet Union in 1991 brought into being the new Russia (or Russian Federation) as its successor in international politics. Russia suffered one of the worst recessions and experienced 25 years of halting reform. Despite these issues, Russia is again a central player in international affairs. Course analyzes motivations behind contemporary Russian foreign policy by reviewing its domestic and economic underpinnings. Examination of concept of state power in international politics to assess Russia's capabilities to influence other states' policies, and under what conditions its leaders use these resources. Is contemporary Russia strong or weak? What are the resources and constraints its projection of power beyond its borders? What are the determinants of state power in international politics in the twenty-first century? This course is a combination of a lecture and discussion, and will include lectures, readings, class discussions, films and documentaries.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29972",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221977",
        "number": "INTNLREL 131",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "135A",
        "title": "International Environmental Law and Policy: Oceans and Climate Change",
        "description": "This seminar offers an introduction to International Environmental Law, with a strong emphasis on oceans and climate change, its underlying principles, how it is developed and implemented, and the challenges of enforcing it. We will focus on oceans and climate change, exploring the United Nations Law of the Sea Convention (UNCLOS) and the United Nations Framework Convention for Climate Change (UNFCCC). We will explain why these agreements are described as &iquest;umbrella conventions&iquest; and how new conventions like  the Paris Agreement fit within them. There will be guest speakers, a negotiation simulation, and a legal design sprint focused on re-imagining International Environmental Law.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "216088",
        "number": "INTNLREL 135A",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "136R",
        "title": "Introduction to Global Justice (ETHICSOC 136R, PHIL 76, POLISCI 136R, POLISCI 336)",
        "description": "As we live in a globalized world, our lives are interconnected with many other people within and beyond the state borders. Currently, we face urgent problems of global justice, such as climate change, economic inequality, immigration, and health disparities, and how to address these issues is a crucial question for all of us. This course introduces students to normative inquiries into issues of global justice and offers an opportunity to integrate theories and practices by engaging with essential and timely questions. What normative demands does justice impose on individuals and institutions in a global world? Do people in affluent countries bear the responsibility for the suffering of those who live in other countries? Should relatively developed countries open their borders to those from developing countries? How should we allocate responsibilities for reducing global injustice, such as health disparities? How does injustice with historical roots, such as colonialism, further complicate the picture of normative demands? While there are no easy answers to these questions, throughout this course, students will be exposed to interdisciplinary approaches (including philosophy, political theory, gender studies, etc.), learn to critically analyze various theoretical approaches, and use them as frameworks to develop their views on issues of global justice. Please note that in addition to the listed lecture time, students must sign up for a 45-min discussion session. The schedule of the discussion session will be announced during the first week of the quarter.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "12353",
                "currentClassSize": "0",
                "maxClassSize": "35",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lin, T.",
                                "sunet": "tinanlin"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "14291",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-EthicReas",
            "WAY-ER"
        ],
        "objectID": "207533",
        "number": "INTNLREL 136R",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "140A",
        "title": "International Law and International Relations",
        "description": "International law, as a body of law, performs multiple, competing functions. It serves the interests, and seeks to limit the actions, of state actors. It is also a political rhetoric captured by the oppressed, and a foundation for activism and resistance. The purpose of this seminar is to illuminate this malleable nature of international law, to explain its foundational principles and sources, and to evaluate the contours of its role as law and discourse. Questions that will accompany us throughout this seminar include: What is the character of international legal rules? Do they matter in international politics? How effective are they? What potential and what limitations do they have? In addition to exploring such questions against the backdrop of theories of international relations, we will consider several topics which bring tensions between international law and international relations to the fore, such as use of force, human rights, and international criminal law.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29182",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "202096",
        "number": "INTNLREL 140A",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "140B",
        "title": "Navigating New Frontiers in International Law",
        "description": "In this seminar, students will delve into the interplay between international law and international relations, with a focus on understanding the challenges and opportunities presented by emerging technologies, particularly AI. Through examining legal and political theories and case studies, students will gain insights into the role of international law in shaping state behavior, global governance, and cooperation. Key topics include treaty-making processes, soft law, customary international law, state sovereignty, and the impact of new frontiers in international law, such as AI regulation. As AI technologies advance, they pose novel legal, ethical, and practical questions transcending national borders. This class will investigate AI's implications on human rights, privacy, and international security, exploring issues like autonomous weapons, surveillance, and AI-driven decision-making. The course will address central questions such as: How does the intersection of international law and relations shape global challenges? What principles and sources of international law influence state behavior and cooperation? How do emerging technologies, particularly AI, challenge existing legal frameworks? What is the current landscape of AI regulation, and what are the prospects for global governance? This seminar aims to equip students with the analytical and critical thinking skills necessary to engage in shaping the future of international law in a rapidly evolving technological landscape. The course is suitable for advanced undergraduates. Prior coursework in international law or international relations is recommended but not required.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225540",
        "number": "INTNLREL 140B",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "140C",
        "title": "The U.S., U.N. Peacekeeping, and Humanitarian War (HISTORY 201C, INTNLREL 140X)",
        "description": "The involvement of U.S. and the UN in major wars and international interventions since the 1991 Gulf War. The UN Charter's provisions on the use of force, the origins and evolution of peacekeeping, the reasons for the breakthrough to peacemaking and peace enforcement in the 90s, and the ongoing debates over the legality and wisdom of humanitarian intervention. Case studies include Croatia and Bosnia, Somalia, Rwanda, Kosovo, East Timor, and Afghanistan. *International Relations majors taking this course to fulfill the WiM requirement should enroll in INTNLREL 140C for 5 units.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "10987",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Encina West 202",
                        "instructors": [
                            {
                                "name": "Patenaude, B.",
                                "sunet": "bertiep"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "202097",
        "number": "INTNLREL 140C",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "140X",
        "title": "The U.S., U.N. Peacekeeping, and Humanitarian War (HISTORY 201C, INTNLREL 140C)",
        "description": "The involvement of U.S. and the UN in major wars and international interventions since the 1991 Gulf War. The UN Charter's provisions on the use of force, the origins and evolution of peacekeeping, the reasons for the breakthrough to peacemaking and peace enforcement in the 90s, and the ongoing debates over the legality and wisdom of humanitarian intervention. Case studies include Croatia and Bosnia, Somalia, Rwanda, Kosovo, East Timor, and Afghanistan. *International Relations majors taking this course to fulfill the WiM requirement should enroll in INTNLREL 140C for 5 units.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12937",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Encina West 202",
                        "instructors": [
                            {
                                "name": "Patenaude, B.",
                                "sunet": "bertiep"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "202097",
        "number": "INTNLREL 140X",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "141A",
        "title": "Camera as Witness: International Human Rights Documentaries",
        "description": "Rarely screened documentary films, focusing on global problems, human rights issues, and aesthetic challenges in making documentaries on international topics. Meetings with filmmakers.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12459",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "Lathrop 190",
                        "instructors": [
                            {
                                "name": "Bojic, J.",
                                "sunet": "jasmina1"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 62400.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "Y2E2 111",
                        "instructors": [
                            {
                                "name": "Bojic, J.",
                                "sunet": "jasmina1"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-EDP"
        ],
        "objectID": "201019",
        "number": "INTNLREL 141A",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "142",
        "title": "Challenging the Status Quo: Social Entrepreneurs Advancing Democracy, Development and Justice (AFRICAST 142, AFRICAST 242, CSRE 142C, URBANST 135)",
        "description": "This community-engaged learning class is part of a broader Program on Social Entrepreneurship at the Haas Center for Public Service. It will use practice to better inform theory about how innovation can help address societies biggest challenges. Working with the instructor and three visiting nonprofit social entrepreneurs in residence, students will use case studies of successful and failed social change strategies to explore relationships between social entrepreneurship, race, democracy and justice. This course interrogates approaches like design theory, measuring impact, fundraising, leadership, storytelling and policy advocacy and explores how they can address issues like ending homelessness, fighting the COVID-19 pandemic and achieving racial justice, with a particular focus on California. This is a community-engaged learning class in which students will learn by working on projects that support the social entrepreneurs' efforts to promote social change. Students should register for either 3 OR 5 units only. Students enrolled in the full 5 units will have a service-learning component along with the course. Students enrolled for 3 units will not complete the service-learning component. Limited enrollment. Attendance at the first class is mandatory in order to participate in service learning.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class will take place in the DK room at the Haas Center.",
                "classId": "14080",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Janus, K.",
                                "sunet": "kakelly"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "212837",
        "number": "INTNLREL 142",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "143",
        "title": "State and Society in Korea (SOC 111, SOC 211)",
        "description": "20th-century Korea from a comparative historical perspective. Colonialism, nationalism, development, state-society relations, democratization, and globalization with reference to the Korean experience.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32726",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-GlobalCom",
            "WAY-SI"
        ],
        "objectID": "202389",
        "number": "INTNLREL 143",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "145",
        "title": "Genocide and Humanitarian Intervention",
        "description": "The course, traces the history of genocide in the 20th century and the question of humanitarian intervention to stop it, a topic that has been especially controversial since the end of the Cold War.  The pre-1990s discussion begins with the Armenian genocide during the First World War and includes the Holocaust and Cambodia under the Khmer Rouge in the 1970s.  Coverage of genocide and humanitarian intervention since the 1990s includes the wars in Bosnia, Rwanda, Kosovo, the Congo, and Sudan.  The final session of the course will be devoted to a discussion of the International Criminal Court and the separate criminal tribunals that have been tasked with investigating and punishing the perpetrators of genocide.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "213021",
        "number": "INTNLREL 145",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "146A",
        "title": "Energy and Climate Cooperation in the Western Hemisphere (INTNLREL 246A)",
        "description": "The seminar provides an overview of the current political dynamics in each of the major fossil fuel producing countries in the Western Hemisphere and its impact on local energy exploration and production.  It also explores the potential for expanding existing or developing new renewable energy resources throughout the Americas, and impacts on the local environment, food prices, and land use issues.  The course examines the feasibility of integrating energy markets and establishing initiatives to reduce greenhouse gas emissions at the regional and hemispheric level.  The seminar focuses on Chile, a country that lacks significant petroleum and natural gas reserves and has traditionally been a major user of coal.  Accordingly, the country has been at the forefront of efforts to facilitate the regional integration of energy markets and develop renewable and non-traditional energy resources.  The course concludes with a discussion of the Energy and Climate Partnership of the Americas or ECPA, launched by the Obama administration at the Fifth Summit of the Americas in Trinidad in April 2009, and China's increasing role in Latin America's energy sector. Students taking this course for the M.A. in Latin American Studies should enroll in the INTNLREL 246A section.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29125",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "208250",
        "number": "INTNLREL 146A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "147",
        "title": "Political Economy of the Southern Cone Countries of South America (INTNLREL 247)",
        "description": "This seminar examines the economic and political development of the five countries that make up South America's Southern Cone (i.e., Argentina, Brazil, Chile, Paraguay, and Uruguay) as well as Bolivia (which was historically part of the sub-region and with which today it has close commercial ties). In particular, the course focuses on the era of Import Substitution Industrialization (ISI), explores the reasons why that model of economic development eventually collapsed and how this contributed to the rise of military dictatorships, looks at the return to democratic rule and the adoption of market-oriented economic policies, and concludes with a discussion of the contemporary situation. Students taking this course for the M.A. in Latin American Studies should enroll in the INTNLREL 247 section.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29441",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "207728",
        "number": "INTNLREL 147",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "150",
        "title": "Political Development in the Arab World",
        "description": "The purpose of this course is to situate important theoretical debates on the determinants and dynamics of political development in the contemporary empirical realities in the Arab world. Specifically, students are challenged to employ their understanding of the modern political landscape in Arab countries to evaluate seminal scholarly works theorizing the origins of political development. That is, how can the dynamics of political change and continuity in the Arab world inform and refine our broader understanding of fundamental questions we care about as political scientists: Why does authoritarianism persist? How can autocracy coexist with economic development and liberalization? How do the international political economy and external actors shape the boundaries for political change in a given country? How do we make sense of the paradoxical combination of elections and authoritarian rule?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224753",
        "number": "INTNLREL 150",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "154",
        "title": "The Cold War: An International History (HISTORY 166C)",
        "description": "Though it ended twenty years ago, we still live in a world shaped by the Cold War.  Beginning with its origins in the mid-1940s, this course will trace the evolution of the global struggle, until its culmination at the end of the 1980s.  Students will be asked to ponder the fundamental nature of the Cold War, what kept it alive for nearly fifty years, how it ended, and its long term legacy for the world. As distinguished from the lecture taught in previous quarters, this class will closely investigate ten major Cold War battlegrounds over the quarter.  Selected case studies will include: the division of Germany, Iran in the 1950s, Cuba, Vietnam, the Six Day War, the Chilean coup, sub-Saharan Africa, Afghanistan, Central America, and the Eastern European revolutions of 1989.  Students will be asked to consult a combination of original documents and recent histories.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "213467",
        "number": "INTNLREL 154",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "158",
        "title": "Chinese Politics (POLISCI 148, POLISCI 348)",
        "description": "China, one of the few remaining communist states in the world, has not only survived, but has become a global political actor of consequence with the fastest growing economy in the world.  Why has the CCP thrived while other communist regimes have failed? What explains China's authoritarian resilience?  What are the limits to such resilience? How has the Chinese Communist Party managed to develop markets and yet keep itself in power?  How does censorship work in the information and 'connected' age of social media?  How resilient is the party state in the face of technological and economic change?  Materials will include readings, lectures, and selected films. This course has no prerequisites. This course fulfills the Writing in the Major requirement for Political Science and International Relations undergraduate majors. PoliSci majors should register for POLISCI 148 and IR majors should register for INTNLREL 158. Graduate students should register for POLISCI 348.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-GlobalCom",
            "WAY-SI"
        ],
        "objectID": "122944",
        "number": "INTNLREL 158",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "160",
        "title": "United Nations Peacekeeping",
        "description": "This seminar is devoted to an examination of United Nations peacekeeping, from its inception in 1956 in the wake of the Suez Crisis, to its increasingly important role as an enforcer of political stability in sub-Saharan Africa. We will look at the practice of &quot;classic&quot; peacekeeping as it developed during the Cold War, with the striking exception of the Congo Crisis of 1960; the rise and fall of so-called &quot;second-generation peacekeeping&quot;&iquest;more accurately labeled &quot;peace enforcement&quot;&iquest;in the early 1990s in Bosnia and Somalia; and the reemergence in recent years of a muscular form of peacekeeping in sub-Saharan Africa, most notably in Congo in 2013.nStudents will learn the basic history of the United Nations since 1945 and the fundamentals of the United Nations Charter, especially with respect to the use of force and the sovereignty of member states. While the course does not attempt to provide comprehensive coverage of the historical details of any particular peacekeeping mission, students should come away with a firm grasp of the historical trajectory of U.N. peacekeeping and the evolving arguments of its proponents and critics over the years.nEach session of the course is structured around the discussion of assigned readings. Students are expected to complete the readings before class and to come to class prepared to participate in discussions. Each student will serve as rapporteur for one of the assigned readings, providing a critical summary of the reading in question and helping to stimulate the discussion to follow. The instructor will occasionally begin a session with brief introductory remarks (no more than ten minutes) to provide historical context about one or another topic. Required coursework includes two short papers whose particular topic and guidelines will be announced in class.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "222157",
        "number": "INTNLREL 160",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "168A",
        "title": "American Interventions, 1898-Present (HISTORY 259E, HISTORY 359E)",
        "description": "This class seeks to examine the modern American experience with limited wars, beginning with distant and yet pertinent cases, and culminating in the war in Iraq.  Although this class will examine war as a consequence of foreign policy, it will not focus primarily on presidential decision making.  Rather, it will place wartime policy in a broader frame, considering it alongside popular and media perceptions of the war, the efforts of antiwar movements, civil-military relations, civil reconstruction efforts, and conditions on the battlefield.  We will also examine, when possible, the postwar experience.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "27772",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Encina West 108",
                        "instructors": [
                            {
                                "name": "Rakove, R.",
                                "sunet": "robr"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "216895",
        "number": "INTNLREL 168A",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "168W",
        "title": "America as a World Power in the Modern Era (HISTORY 152K)",
        "description": "This course will examine the modern history of American foreign relations, from the turn of the twentieth century to the present. Beginning with the fateful decision to go to war with Spain, it will examine the major crises and choices that have defined the &quot;American Century.&quot; Our study of U.S. foreign relations will consider such key factors as geopolitics, domestic politics, bureaucracy, psychology, race, and culture.  Students will be asked to research and write a paper on a significant topic in the history of U.S. foreign relations. This course satisfies the IR Writing in the Major (WIM) requirement",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "213396",
        "number": "INTNLREL 168W",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "173",
        "title": "Presidents and Foreign Policy in Modern History (HISTORY 261G)",
        "description": "Nothing better illustrates the evolution of the modern presidency than the arena of foreign policy.  This class will examine the changing role and choices of successive presidential administrations over the past century, examining such factors as geopolitics, domestic politics, the bureaucracy, ideology, psychology, and culture.  Students will be encouraged to think historically about the institution of the presidency, while examining specific case studies, from the First World War to the conflicts of the 21st century.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "29683",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "213854",
        "number": "INTNLREL 173",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "174",
        "title": "Diplomacy on the Ground: Case Studies in the Challenges of Representing Your Country (HISTORY 252B)",
        "description": "The tragic death of Ambassador Chris Stevens has recently highlighted the dangers of diplomacy in the modern era. This class will look at how Americans in embassies have historically confronted questions such as authoritarian rule, human rights abuses, violent changes of government, and covert action. Case studies will include the Berlin embassy in the 1930s, Tehran in 1979, and George Kennan's experiences in Moscow, among others. Recommended for students contemplating careers in diplomatic service. *IR majors taking this course to fulfill the IR WIM requirement should enroll in INTNLREL174. As space is limited, first-year students must obtain the instructor's prior consent before enrolling.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "11302",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rakove, R.",
                                "sunet": "robr"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "214833",
        "number": "INTNLREL 174",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "175",
        "title": "American Empire in the Pacific",
        "description": "This course will provide an interdisciplinary overview of the history and current state of American empire in the Pacific Islands. Through the lenses of law, history, and anthropology, the course will chart the progression of the American empire, beginning with early colonization, through World War II and the Cold War, to present day, including modern challenges facing communities affected by U.S. imperialism, decolonization movements, and the intersection of empire and climate change. Themes include cultural imperialism, militarization and experimentation, human rights and global ethics, and social and environmental justice.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29862",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221192",
        "number": "INTNLREL 175",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "179",
        "title": "Major Themes in U.S.-Latin America Diplomatic History",
        "description": "This seminar provides an overview of the most important events and initiatives that have characterized the relationship of the United States of America with its neighbors to the south, including Mexico, the Caribbean (especially Cuba, Haiti, and the Dominican Republic), Central America, and South America since the proclamation of the Monroe Doctrine in the early 19th century until the Obama Administration. In particular, the course examines the motivations for the Theodore Roosevelt Corollary to the Monroe Doctrine and the resulting period of blatant interventionism known as &quot;Dollar Diplomacy,&quot; the Good Neighbor Policy of Franklin Delano Roosevelt, the brutal Cold War period, as well as policies pursued by the Clinton, George W. Bush, and Obama administrations, such as the Free Trade Area of the Americas (FTAA) and the Energy and Climate Partnership of the Americas (ECPA). The seminar explores not only what motivated U.S. policy makers and how their polices were implemented (and explains why they either succeeded or failed), but also discusses the impacts on individual countries and/or the region as a whole and the long-term consequences whose repercussions are still being felt today. The course also examines the major features of the inter-American system from the Pan American Union to the creation of the Organization of American States (OAS) and its continued relevancy in light of new institutional frameworks such as the Community of Latin American and Caribbean States (CELAC) and the Union of South American Nations (UNASUR) that exclude the United States of America.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "218010",
        "number": "INTNLREL 179",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "180A",
        "title": "Transitional Justice, Human Rights, and International Criminal Tribunals (ETHICSOC 280, HUMRTS 103, INTLPOL 280)",
        "description": "(Formerly IPS 280) Historical backdrop of the Nuremberg and Tokyo Tribunals.  The creation and operation of the Yugoslav and Rwanda Tribunals (ICTY and ICTR).  The development of hybrid tribunals in East Timor, Sierra Leone, and Cambodia, including evaluation of their success in addressing perceived shortcomings of the ICTY and ICTR. Examination of the role of the International Criminal Court and the extent to which it will succeed in supplanting all other ad hoc international justice mechanisms and fulfill its goals.  Analysis focuses on the politics of creating such courts, their interaction with the states in which the conflicts took place, the process of establishing prosecutorial priorities, the body of law they have produced, and their effectiveness in addressing the needs of victims in post-conflict societies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "11054",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cohen, D.",
                                "sunet": "dcohen3"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210843",
        "number": "INTNLREL 180A",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "182",
        "title": "The Great War (HISTORY 210G)",
        "description": "The First World War provided a prototype and a reference for a new, horrific kind of war. It catalyzed the emergence of modern means of warfare and the social mechanisms necessary to sustain the industrialized war machine. Killing millions, it became the blueprint for the total war that succeeded it. It also brought about new social and political orders, transforming the societies which it mobilized at unprecedented levels. This course will examine the military, political, economic, social and cultural aspects of the conflict. We will discuss the origins and outbreak of the war, the land, sea and air campaigns, the war's economic and social consequences, the home fronts, the war's final stages in eastern and western Europe as well as non-European fronts, and finally, the war's impact on the international system and on its belligerents' and participants' perceptions of the new reality it had created.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "14716",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "200-015",
                        "instructors": [
                            {
                                "name": "Vardi, G.",
                                "sunet": "gvardi"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "215336",
        "number": "INTNLREL 182",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "183",
        "title": "The Modern Battle (HISTORY 206C)",
        "description": "The purpose of this seminar is to examine the evolution of modern warfare by closely following four modern battles/campaigns. For this purpose the seminar offers four mock staff rides, facilitating highly engaged, well-researched experience for participants. In a mock staff ride, students are assigned roles; each student is playing a general or staff officer who was involved in the battle/campaign. Students will research their roles and, during the staff ride, will be required to explain &quot;their&quot; decisions and actions. Staff rides will not deviate from historical records, but closely examine how decisions were made, what pressures and forces were in action, battle outcomes, etc. This in-depth examination will allow students to gain a deeper understanding of how modern tactics, technology, means of communications, and the scale of warfare can decide, and indeed decided, campaigns. We will will spend two weeks preparing for and playing each staff ride. One meeting will be dedicated to discussing the forces shaping the chosen battle/campaign: the identity and goals ofnthe belligerents, the economic, technological, cultural and other factors involved, as well as the initial general plan. The second meeting will be dedicated to the battle itself. The four battles will illustrate major developments in modern warfare.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12945",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Vardi, G.",
                                "sunet": "gvardi"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "220388",
        "number": "INTNLREL 183",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "189",
        "title": "PRACTICAL TRAINING",
        "description": "Students obtain internship in a relevant research or industrial activity to enhance their professional experience consistent with their degree program and area of concentration. Prior to enrolling students must get internship approved by the director. At the end of the quarter, a three page final report must be supplied documenting work done and relevance to degree program. Meets the requirements for Curricular Practical Training for students on F-1 visas. Student is responsible for arranging own internship. Limited to declared International Relations students only who are non-US citizens. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ITR",
                "notes": "For declared International Relations students only. Prior approval from the Program Director required before enrolling. Please visit  program department to initiate enrollment.",
                "classId": "11488",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tomz, M.",
                                "sunet": "tomz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215634",
        "number": "INTNLREL 189",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "192",
        "title": "Policy Practicum: Accountability in International Development",
        "description": "In this practicum course, students will analyze real world problems in the field of international development accountability and produce a research report to be presented to an international non-governmental organization.  As part of the course, students will learn about international development, problems of accountability, and existing data and evidence from accountability mechanisms. This course is capped at 12 students. To apply for enrollment, please complete this brief form ASAP, but no later than Thursday, November 17: https://forms.gle/W9yocTnj1RP5SrF48. If selected, you will be notified by Tuesday, November 22 and receive an enrollment permission code.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "32887",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224843",
        "number": "INTNLREL 192",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "197",
        "title": "Directed Reading in International Relations",
        "description": "Open only to declared International Relations majors.n (Staff)",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28544",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28227",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "9505",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hecker, S.",
                                "sunet": "shecker"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "9327",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fearon, J.",
                                "sunet": "jfearon"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "9401",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fearon, J.",
                                "sunet": "jfearon"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "9507",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fearon, J.",
                                "sunet": "jfearon"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "9341",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hecker, S.",
                                "sunet": "shecker"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "9557",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hecker, S.",
                                "sunet": "shecker"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10111",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bernstein, B.",
                                "sunet": "bartonb"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10458",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Frank, Z.",
                                "sunet": "zfrank"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10444",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "O'Keefe, T.",
                                "sunet": "taokeefe"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10681",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lewis, M.",
                                "sunet": "mwlewis"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10498",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lewis, M.",
                                "sunet": "mwlewis"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10112",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Romer, P.",
                                "sunet": "promer"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10812",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Crenshaw, M.",
                                "sunet": "crenshaw"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10516",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Frank, Z.",
                                "sunet": "zfrank"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10126",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tomz, M.",
                                "sunet": "tomz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10813",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Aturupane, C.",
                                "sunet": "chonira"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10527",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Crenshaw, M.",
                                "sunet": "crenshaw"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10189",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Aturupane, C.",
                                "sunet": "chonira"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "114620",
        "number": "INTNLREL 197",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 75
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "198",
        "title": "Senior Thesis",
        "description": "Open only to declared International Relations majors with approved senior thesis proposals.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "10",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28545",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28228",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "9528",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lin, H.",
                                "sunet": "herblin"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "12145",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Stedman, S.",
                                "sunet": "sstedman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "9328",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fearon, J.",
                                "sunet": "jfearon"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "9542",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Stedman, S.",
                                "sunet": "sstedman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "12146",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Diamond, L.",
                                "sunet": "ldiamond"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "9329",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Diamond, L.",
                                "sunet": "ldiamond"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "9543",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Diamond, L.",
                                "sunet": "ldiamond"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "9494",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fearon, J.",
                                "sunet": "jfearon"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "9330",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Stedman, S.",
                                "sunet": "sstedman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "9547",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Magaloni-Kerpel, B.",
                                "sunet": "magaloni"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "9495",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Magaloni-Kerpel, B.",
                                "sunet": "magaloni"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "9332",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McFaul, M.",
                                "sunet": "mcfaul"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "9548",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Holloway, D.",
                                "sunet": "hollowdj"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "9496",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Holloway, D.",
                                "sunet": "hollowdj"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "9333",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Magaloni-Kerpel, B.",
                                "sunet": "magaloni"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "9549",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schultz, K.",
                                "sunet": "kschultz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "9497",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schultz, K.",
                                "sunet": "kschultz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "9334",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Holloway, D.",
                                "sunet": "hollowdj"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "114625",
        "number": "INTNLREL 198",
        "units": [
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10
        ],
        "totalSections": 218
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "200A",
        "title": "International Relations Honors Field Research",
        "description": "For juniors planning to write an honors thesis during senior year. Initial steps to prepare for independent research. Professional tools for conceptualizing a research agenda and developing a research strategy. Preparation for field research through skills such as data management and statistics, references and library searches, and fellowship and grant writing. Creating a work schedule for the summer break and first steps in writing. Prerequisite: acceptance to IR honors program.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Class held in Encina Hall Central, Suite 30 Conference Room. For IR Honors students only.",
                "classId": "7503",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "204921",
        "number": "INTNLREL 200A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "200B",
        "title": "International Relations Honors Seminar",
        "description": "Second of two-part sequence. For seniors working on their honors theses. Professional tools, analysis of research findings, and initial steps in writing of thesis. How to write a literature review, formulate a chapter structure, and set a timeline and work schedule for the senior year. Skills such as data analysis and presentation, and writing strategies. Prerequisites: acceptance to IR honors program, and 199 or 200A. * Course satisfies the WiM requirement for International Relations majors who are accepted into the IR Honors program.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "For declared IR Honors students only. Class held in Encina Hall Central, Suite 30 Conference Room.",
                "classId": "11110",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": "Hum Rgts / Int'l Rel Conf Room",
                        "instructors": [
                            {
                                "name": "Gould, E.",
                                "sunet": "egould"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "206589",
        "number": "INTNLREL 200B",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "200C",
        "title": "IR Honors Thesis Writing",
        "description": "Mandatory seminar for International Relations Honors Students who are writing their Honors Thesis. INTNLREL 200A and 200B are prerequisites.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "For IR Honors students only. Class held in Encina Hall Central, Suite 30 Conference Room.",
                "classId": "11521",
                "currentClassSize": "0",
                "maxClassSize": "8",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gould, E.",
                                "sunet": "egould"
                            }
                        ],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 48000.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214873",
        "number": "INTNLREL 200C",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "202",
        "title": "Original Research in International Relations",
        "description": "This new course offers IR majors an opportunity to conduct in-depth, original research and write an original research paper on a topic of their choosing within a single quarter.  It is ideally suited for students who have a question that has intrigued them and that they would like to answer through original research.  Through this course, students will narrow their interests into a clear research question, develop a research design, review relevant literature that addresses this question, conduct original empirical research and produce a final research paper. The course is designed for IR majors, and thus has an interdisciplinary focus and embraces methodological diversity.  It may also be petitioned to count towards the IR major.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222126",
        "number": "INTNLREL 202",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "246A",
        "title": "Energy and Climate Cooperation in the Western Hemisphere (INTNLREL 146A)",
        "description": "The seminar provides an overview of the current political dynamics in each of the major fossil fuel producing countries in the Western Hemisphere and its impact on local energy exploration and production.  It also explores the potential for expanding existing or developing new renewable energy resources throughout the Americas, and impacts on the local environment, food prices, and land use issues.  The course examines the feasibility of integrating energy markets and establishing initiatives to reduce greenhouse gas emissions at the regional and hemispheric level.  The seminar focuses on Chile, a country that lacks significant petroleum and natural gas reserves and has traditionally been a major user of coal.  Accordingly, the country has been at the forefront of efforts to facilitate the regional integration of energy markets and develop renewable and non-traditional energy resources.  The course concludes with a discussion of the Energy and Climate Partnership of the Americas or ECPA, launched by the Obama administration at the Fifth Summit of the Americas in Trinidad in April 2009, and China's increasing role in Latin America's energy sector. Students taking this course for the M.A. in Latin American Studies should enroll in the INTNLREL 246A section.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29126",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "208250",
        "number": "INTNLREL 246A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "INTNLREL",
        "code": "247",
        "title": "Political Economy of the Southern Cone Countries of South America (INTNLREL 147)",
        "description": "This seminar examines the economic and political development of the five countries that make up South America's Southern Cone (i.e., Argentina, Brazil, Chile, Paraguay, and Uruguay) as well as Bolivia (which was historically part of the sub-region and with which today it has close commercial ties). In particular, the course focuses on the era of Import Substitution Industrialization (ISI), explores the reasons why that model of economic development eventually collapsed and how this contributed to the rise of military dictatorships, looks at the return to democratic rule and the adoption of market-oriented economic policies, and concludes with a discussion of the contemporary situation. Students taking this course for the M.A. in Latin American Studies should enroll in the INTNLREL 247 section.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29442",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "207728",
        "number": "INTNLREL 247",
        "units": [
            5
        ],
        "totalSections": 1
    }
]