[
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "62N",
        "title": "Art and Healing in the Wake of Covid-19: A Health Humanities Perspective (FRENCH 62N)",
        "description": "How have artists contributed to healing during the Covid-19 pandemic? How does art shape or express diverse cultural understandings of health and illness, medicine and the body, death and spirituality, in response to crisis? How do such understandings directly impact the physical healing but also the life decisions and emotions of individuals, from caregivers to patients? And finally, how do these affect social transformation as part of healing? This course examines the art of COVID-19, from a contemporary and historical perspective, using the tools of Health Humanities, a relatively new discipline that connects medicine to the arts and social sciences. Materials for this course include art from different media (from poetry and fiction to performance and installation), produced during COVID-19 in mostly Western contexts, in diverse communities and with some forays into the rest of the world and into other historical moments of crisis. They also include some non-fiction readings from the disciplines Health Humanities draws from, such as history of medicine, anthropology, psychology, sociology, cultural history, media studies, art criticism, and medicine itself. We will thus be introduced to basics of Health Humanities and its methods while addressing the pandemic as a world-changing event, aided by the unique insights of artists. The course will culminate in final projects that present a critical and contextual appreciation of a specific art project created in response to COVID-19; such appreciations may be creative art projects as well, or more analytical, scholarly evaluations.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "223602",
        "number": "ITALIAN 62N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "75N",
        "title": "Narrative Medicine and Near-Death Experiences (FRENCH 75N)",
        "description": "Even if many of us don't fully believe in an afterlife, we remain fascinated by visions of it. This course focuses on Near-Death Experiences and the stories around them, investigating them from the many perspectives pertinent to the growing field of narrative medicine: medical, neurological, cognitive, psychological, sociological, literary, and filmic. The goal is not to understand whether the stories are veridical but what they do for us, as individuals, and as a culture, and in particular how they seek to reshape the patient-doctor relationship.  Materials will span the 20th century and come into the present. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "214260",
        "number": "ITALIAN 75N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "101",
        "title": "Italy: The Good, the Bad and the Ugly",
        "description": "Renowned for its rich cultural tradition, Italy is also one of the most problematic nations in Europe. This course explores the contradictions at the heart of Italy by examining how art and literature provide a unique perspective onto modern Italian history. We will focus on key phenomena that contribute both positively and negatively to the complex &quot;spirit&quot; of Italy, such as the presence of the past, political realism and idealism, revolution, corruption, decadence, war, immigration, and crises of all kinds. Through the study of historical and literary texts, films, and news media, the course seeks to understand Italy's current place in Europe and its future trajectory by looking to its past as a point of comparison. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "214230",
        "number": "ITALIAN 101",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "103",
        "title": "Future Text: AI and Literatures, Cultures, and Languages (DLCL 103)",
        "description": "How do AI language models work and what is their impact on education? In this course we will: Experiment with translation; Experiment with textual analysis of specific texts from different contexts and historical periods and cultures; Experiment with large data questions that are very hard to do by a single person; Experiment with ways to fact-check an AI generated work: we know AI creates false assertions, and backs them up with false references; Experiment with collaborating with AI to write a final paper, a blog, a newspaper article, etc.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28530",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "60-109",
                        "instructors": [
                            {
                                "name": "Wittman, L.",
                                "sunet": "lwittman"
                            },
                            {
                                "name": "Dombrowski, Q.",
                                "sunet": "qad"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "28529",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": "Green Earth Sciences131",
                        "instructors": [],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 44400.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "29399",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "Encina West 101",
                        "instructors": [],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 62400.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "225203",
        "number": "ITALIAN 103",
        "units": [
            4
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "115",
        "title": "Virtual Italy (ARCHLGY 117, CLASSICS 115, ENGLISH 115, HISTORY 238C)",
        "description": "Classical Italy attracted thousands of travelers throughout the 1700s. Referring to their journey as the &quot;Grand Tour,&quot; travelers pursued intellectual passions, promoted careers, and satisfied wanderlust, all while collecting antiquities to fill museums and estates back home. What can computational approaches tell us about who traveled, where and why? We will read travel accounts; experiment with parsing; and visualize historical data. Final projects to form credited contributions to the Grand Tour Project, a cutting-edge digital platform. No prior programming experience necessary.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220654",
        "number": "ITALIAN 115",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "115A",
        "title": "The Italian Renaissance, or the Art of Success (ARTHIST 115, ARTHIST 315, ITALIAN 315A)",
        "description": "How come that, even if you have never set foot in Italy, you have heard of Leonardo, Michelangelo, and Raphael? What made them so incredibly famous, back then as well as today? This course examines the shooting of those, and other, artists to fame. It provides in-depth analyses of their innovative drawing practices and the making of masterpieces, taking you through a virtual journey across some of the greatest European and American collections. At the same time, this course also offers a study of the mechanics of success, how opportunities are created and reputations managed, and what role art plays in the construction of class and in today's national politics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221390",
        "number": "ITALIAN 115A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "117",
        "title": "Is Horror (also) Italian?",
        "description": "Horror haunts our world. We associate it with manmade and natural catastrophes. But horror is also a genre. And haven't we all experienced something horrible? In this class, we take up the task of understanding what horror means, why it fascinates us, and to what extent it belongs to our lives. Our laboratory is perhaps an unexpected one: Italy. In the popular imagination, Italy is the land of fashion and Vespas, sunshine and romance: this class reveals its darker side. After finding the roots of Italian horror in Dante and Boccaccio's descriptions of Hell and the plague, we will then focus on horror in more recent Italian literature, comics, and cinema - covering supernatural sources, such as a haunted dance school, and horrifyingly real ones, such as the concentration camp. Centering on the Italian twentieth and twenty-first century, this class introduces students to a genre which is also, at the same time, an experience - and vice versa. Participants will reflect on questions such as: why and how do we represent horror? Is there anything philosophical about horror, and can we learn anything from it? Does horror presuppose gore or monsters, or specifically belong to certain canons and motifs? Are we all equally exposed to horror or can it be, for instance, a gendered experience? Taught in English. Readings available both in Italian and in translation. Authors include Dante, Boccaccio, Giacomo Leopardi, Curzio Malaparte, Primo Levi, Dario Argento, Giorgio de Maria, Elena Ferrante.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "223596",
        "number": "ITALIAN 117",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "120",
        "title": "Introduction to the Medical Humanities (ANTHRO 120H, DLCL 120, FRENCH 120E)",
        "description": "Medical Humanities is a humanistic and interdisciplinary approach to medicine. It explores the experience of health and illness as captured through the expressive arts (painting, music, literature), across historical periods and in different cultures, as interpreted by scholars in the humanities and social sciences as well as in medicine and policy. Its goal is to give students an opportunity to explore a more holistic and meaning-centered perspective on medical issues. It investigates how medicine is an art form as well as a science, and the way institutions and culture shape the way illness is identified, experienced and treated.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30578",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wittman, L.",
                                "sunet": "lwittman"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225237",
        "number": "ITALIAN 120",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "127",
        "title": "Inventing Italian Literature: Dante, Boccaccio, Petrarca",
        "description": "This course is both an introduction to medieval Italian literature and culture and a continuation of the study of the Italian language. In the literary sphere the course will focus primarily on the Italian lyric tradition of the Sicilian school, the Dolce Stil Novo, and Dante's early lyric poetry. From there we will read and discuss Petrarch's Canzoniere and autobiographical letters. The third part of the course will regard the short story, or novella, in Boccaccio's Decameron and its antecedent, Il Novellino. The literary genres to be explored in this course are short-form poetry and prose (sonnets, madrigals, sestinas, canzoni, and the novella). Linguistically, the course will focus on the language of literary and cultural criticism - expressing and defending opinions at an advanced level, and discussing the themes of the course fluently. The expectation is that levels of reading, writing, and speaking will improve by the end of the quarter. All class discussion, reading, and writing will be in Italian.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14304",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "240-201",
                        "instructors": [],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "118410",
        "number": "ITALIAN 127",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "128",
        "title": "The Italian Renaissance and the Path to Modernity",
        "description": "Are humans free and self-determining agents possessed of infinite potential or limited beings subject to the vagaries of fortune? What is the relationship between love and beauty? Is it better for a leader to inspire love or fear? These are the kind of questions Renaissance thinkers asked and we will pursue in our study of the literature, art, and history of Italy from the fifteenth through the eighteenth centuries. In this course, you will become acquainted with major writers, thinkers, and artists, and key ideas, innovations, and movements. Examining masterpieces of literature (poetry and prose), art (painting, drawing and sculpture), theater and music, including works of the High Renaissance, we will explore such topics as love, power, faith, reason, and contingency in human affairs. With the themes of discovery, invention and adaption as our guide, we will reflect on perennial tensions between imitation and inspiration, tradition and innovation, and conformity and transgression in Renaissance and early modern Italy. Taught in Italian. Recommended: ITALLANG 22A or equivalent (2 years of Italian). This course fulfills the Writing in the Major (WIM) requirement.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14879",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "118411",
        "number": "ITALIAN 128",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "129",
        "title": "Introduction to Modern Italian Literature and Culture",
        "description": "Ancient, yet new; united, yet fractured; central, yet marginal; imperial subject, aspirant empire: what historical, political, and social dynamics have shaped the Italian nation over the course of the last two centuries? How do we make sense of this Italy - at once monolithic and multitudinous, longstanding and newborn? Through the study of literary, filmic, and musical works from the period of Italian unification to the turn of the 21st century, students will reflect on how artists, writers, cultural and political movements expressed, influenced, and encoded Italy&iquest;s many, paradoxical modernities. The course is an introduction to modern Italian literature and culture and a continuation of the study of the Italian language. All class discussions, reading, and writing will be in Italian. Please do not hesitate to contact the instructor should you have doubts about your language level.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14435",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dule, G.",
                                "sunet": "gdule"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "118412",
        "number": "ITALIAN 129",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "140",
        "title": "Great Minds of the Italian Renaissance and their World (ARTHIST 210, HISTORY 240C, ITALIAN 240)",
        "description": "What enabled Leonardo da Vinci to excel in over a dozen fields from painting to engineering and to anticipate flight four hundred years before the first aircraft took off? How did Michelangelo paint the Sistine Chapel Ceiling? What forces and insights led Machiavelli to write &quot;The Prince&quot;? An historical moment and a cultural era, the Italian Renaissance famously saw monumental achievements in literature, art, and architecture, influential developments in science and technology, and the flourishing of multi-talented individuals who contributed profoundly, expertly, and simultaneously to very different fields. In this course on the great thinkers, writers, and achievers of the Italian Renaissance, we will study these &quot;universal geniuses&quot; and their world. Investigating the writings, thought, and lives of such figures as Leonardo da Vinci, Niccol&iquest; Machiavelli, and Galileo Galilei, we will interrogate historical and contemporary ideas concerning genius, creativity, and the phenomenon of &quot;Renaissance man&quot; known as polymathy. Taught in English. In 2023-24, this course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Tuesdays you meet in your own course, and on Thursday all the HumCore seminars in session that quarter meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28163",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "160-323",
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222499",
        "number": "ITALIAN 140",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "141",
        "title": "The Pen and the Sword: A Gendered History (COMPLIT 140, FEMGEN 141B, HISTORY 261P)",
        "description": "As weapons, the pen and the sword have been used to wound, punish, and condemn as well as to protect, liberate, and elevate. Historically entangled with ideals of heroism, nobility, and civility, the pen and the sword have been the privileged instruments of men. Yet, throughout history, women have picked up the pen and the sword in defense, despair, and outrage as well as with passion, vision, and inspiration. This course is dedicated to them, and to study of works on love, sex, and power that articulate female experience. In our readings and seminars, we will encounter real and fictive women in their own words and in narrations and depictions by others from classical antiquity to the present, with a special focus on the Renaissance and on the twentieth and twenty-first centuries. Touching on such topics as flattery and slander through the study of misogynistic, protofeminist, and feminist works in the early modern and modern periods in various European literary traditions, we will consider questions of truth and falsehood in fiction and in life. Course materials span a variety genres and media, from poetry, letters, dialogues, public lectures, treatises, short stories, and drama to painting, sculpture, music, and film works regarded for their aesthetic, intellectual, religious, social, and political value and impact.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224381",
        "number": "ITALIAN 141",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "142",
        "title": "The Good Life: Renaissance Perspectives on Perennial Questions",
        "description": "What constitutes a good life? What conditions and relationships enable one to live well, and what attitudes and activities, systems and structures bring them about or make them possible? Renaissance men and women asked such questions, turning to study of the classical past and to close observation of their contemporary world in search of satisfying answers. This course will explore their reflections and investigations, experimentations and creations, examining seminal conceptions and ideals of the Renaissance through their expression in text and image. Topics will include beauty and love; virtue and honor; excellence and exceptionalism; freedom and justice; power and authority; leadership and governance; wealth and prosperity; work and service; education and religion; health and medicine; family, friendship and community. Focusing on Italian contexts with reference to broader European and global trends, discussion and analysis will center on discrepancies between the real and the ideal in Renaissance society and culture. Taught in English. NOTE: New Italian Studies Assistant Professor Sarah Prodan will teach this course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221738",
        "number": "ITALIAN 142",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "148",
        "title": "Cinema and the Real: Italian Neo-Realism and the French New Wave (FRENCH 148, FRENCH 248, ITALIAN 248)",
        "description": "Between the 1940s and 1960s, in Italy and France, a handful of movie directors revolutionized the art of cinema. In the wake of World War II they entirely re-defined the aesthetics of the 7th art in films such as &quot;Bicycle Thieves,&quot; &quot;400 Blows,&quot; &quot;Rome Open City,&quot; and &quot;Breathless.&quot; These works shared an aesthetic and a philosophy of &quot;the real&quot; - they eschewed big studios and sets in favor of natural light, on-location shooting, and non-professional actors to capture the present moment. This survey course will explore how the dialogue between Italian neo-realism and the French New Wave has yielded some of the most revolutionary filmic masterpieces of both traditions, while raising theoretical and philosophical questions about form, time, space, fiction, representation, and reality. Films: Roberto Rossellini, Vittorio de Sica, Luchino Visconti, Federico Fellini, Fran&ccedil;ois Truffaut, Jean-Luc Godard, Alain Resnais and Agn&egrave;s Varda.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222486",
        "number": "ITALIAN 148",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "149",
        "title": "Love at First Sight: Visual Desire, Attraction, and the Pleasures of Art (ARTHIST 119, ARTHIST 319, FRENCH 149, FRENCH 349, ITALIAN 349)",
        "description": "Why do dating sites rely on photographs? Why do we believe that love is above all a visual force? How is pleasure, even erotic pleasure, achieved through looking? While the psychology of impressions offers some answers, this course uncovers the ways poets, songwriters, and especially artists have explored myths and promoted ideas about the coupling of love and seeing. Week by week, we will be reflecting on love as political critique, social disruption, and magical force. And we will do so by examining some of the most iconic works of art, from Dante's writings on lovesickness to Caravaggio's Narcissus, studying the ways that objects have shifted from keepsakes to targets of our cares. While exploring the visual roots and evolutions of what has become one of life's fundamental drives, this course offers a passionate survey of European art from Giotto's kiss to Fragonard's swing that elicits stimulating questions about the sensorial nature of desire and the human struggle to control emotions.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220546",
        "number": "ITALIAN 149",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "152",
        "title": "Boccaccio's Decameron: The Ethics of Storytelling (ITALIAN 352)",
        "description": "This course involves an in-depth study of Boccaccio's Decameron in the context of medieval theories of poetry and interpretation. The goal is to understand more fully the relationship between literature and lived experience implied by Boccaccio's fictions. We will address key critical issues and theoretical approaches related to the text. Taught in English translation, there will be an optional supplementary Italian discussion section during weeks 2-9.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "214163",
        "number": "ITALIAN 152",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "154",
        "title": "Film & Philosophy (COMPLIT 154A, ENGLISH 154F, FRENCH 154, PHIL 193C, PHIL 293C)",
        "description": "What makes you the individual you are? Should you plan your life, or make it up as you go along? Is it always good to remember your past? Is it always good to know the truth? When does a machine become a person? What do we owe to other people?  Is there always a right way to act? How can we live in a highly imperfect world? And what can film do that other media can't? We'll think about all of these great questions with the help of films that are philosophically stimulating, stylistically intriguing, and, for the most part, gripping to watch: Do The Right Thing (Lee), The Dark Knight (Nolan), Eternal Sunshine of the Spotless Mind (Kaufman), Arrival (Villeneuve), My Dinner with Andr&eacute; (Malle), Blade Runner (Scott), La Jet&eacute;e (Marker), Fight Club (Fincher), No Country for Old Men (Coen), The Seventh Seal (Bergman), and Memento (Nolan). Attendance at weekly screenings is mandatory; and fun. We will not be using the waitlist on Axess - if you would like to enroll and the course is full/closed please email us to get on the waitlist!",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29649",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "DIS",
                "notes": null,
                "classId": "29648",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "213463",
        "number": "ITALIAN 154",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "154E",
        "title": "Film & Philosophy CE (FRENCH 154E, PHIL 193E, PHIL 293E)",
        "description": "Issues of authenticity, morality, personal identity, and the value of truth explored through film; philosophical investigation of the filmic medium itself. Screenings to include Blade Runner (Scott), Do The Right Thing (Lee), The Seventh Seal (Bergman), Fight Club (Fincher), La Jet&eacute;e (Marker), Memento (Nolan), and Eternal Sunshine of the Spotless Mind (Kaufman). Taught in English. Satisfies the WAY CE.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "220282",
        "number": "ITALIAN 154E",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "155",
        "title": "The Mafia in Society, Film, and Fiction",
        "description": "The mafia has become a global problem through its infiltration of international business, and its model of organized crime has spread all over the world from its origins in Sicily. At the same time, film and fiction remain fascinated by a romantic, heroic vision of the mafia.  Compares both Italian and American fantasies of the Mafia to its history and impact on Italian and global culture. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "211245",
        "number": "ITALIAN 155",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "157",
        "title": "From Saint Francis to San Francisco",
        "description": "This course focuses on the figure of Saint Francis and his impact on medieval literature and the contemporary world. The course will begin with extracts from several Franciscan biographies, analyzing the differences and the analogies. One of the main focuses will be on Francis' poverty and its relevance to Dante. More specifically, the course investigates how Comedy Dante's denunciations of avarice must be understood against the backdrop of the Franciscan virtue of poverty. Another focus will be the importance of Francis' contemplation of nature and how his legacy is crucial in today's world under the lenses of eco-theology. From Saint Francis to San Francisco will conclude by responding to a query inspired by a linguistic observation of American academia. In the USA, to identify Saint Augustine, they use only his first name, &quot;Augustine,&quot; the same for Saint Thomas, who is identified as Aquinas. Yet, Saint Francis is Saint Francis, independent from the speaker's religious belief. This detail demonstrates Saint Francis&iquest; unique legacy and resonance in the modern era.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224400",
        "number": "ITALIAN 157",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "175",
        "title": "CAPITALS: How Cities Shape Cultures, States, and People (COMPLIT 100, DLCL 100, FRENCH 175, GERMAN 175, HISTORY 206E, ILAC 175, URBANST 153)",
        "description": "This course takes students on a trip to major capital cities, at different moments in time: Renaissance Florence, Golden Age Madrid, Colonial Mexico City, Enlightenment and Romantic Paris, Existential and Revolutionary St. Petersburg, Roaring Berlin, Modernist Vienna, and bustling Buenos Aires. While exploring each place in a particular historical moment, we will also consider the relations between culture, power, and social life. How does the cultural life of a country intersect with the political activity of a capital? How do large cities shape our everyday experience, our aesthetic preferences, and our sense of history? Why do some cities become cultural capitals? Primary materials for this course will consist of literary, visual, sociological, and historical documents (in translation); authors we will read include Boccaccio, Dante, Sor Juana, Montesquieu, Baudelaire, Gogol, Irmgard Keun, Freud, and Borges. Note: To be eligible for WAYS credit, you must take the course for a Letter Grade.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29893",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            },
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "32418",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "6:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 66600.0,
                        "endTimestamp": 69600.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "29892",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "218539",
        "number": "ITALIAN 175",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "179",
        "title": "Italian Art, Italian Food: Florence and the Banquet of Culture",
        "description": "This class is being offered in collaboration with Stanford in Florence, Bing Overseas Studies Program. This online activity course transports students to three world-class Florentine museums - the Uffizi, the Accademia and the Museo dell'Opera del Duomo. Students will be accompanied by the respective museum directors who will discuss their collections and take questions from the students. The visits are all double sessions: the first dedicated to the history of the collection and the second focused on the principal masterpieces each museum contains. Stanford in Florence resident art historian, Timothy Verdon, will guide students on these visits beginning in the recently re-installed Museo dell'Opera del Duomo, which he directs, and then moving on to the Uffizi where he will be joined by its Director, Eike Schmidt, and finally, he will go the Accademia Gallery where the Director, Dr. Cecilie Hollberg, will discuss her museum.  After each set of two museum visits, the course will feature a cooking class (three in total), taught by Florentine chef Maria Valiani, and inspired by the artists and works found in the museums themselves. One unit of credit, CR/NC.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30122",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223158",
        "number": "ITALIAN 179",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "181",
        "title": "Philosophy and Literature (CLASSICS 42, COMPLIT 181, ENGLISH 81, FRENCH 181, GERMAN 181, ILAC 181, PHIL 81, SLAVIC 181)",
        "description": "Can novels make us better people? Can movies challenge our assumptions? Can poems help us become who we are? We'll think about these and other questions with the help of writers like Toni Morrison, Marcel Proust, Jordan Peele, Charlie Kaufman, Rachel Cusk, William Shakespeare, and Samuel Beckett, plus thinkers like Nehamas, Nietzsche, Nussbaum, Plato, and Sartre. We'll also ask whether a disenchanted world can be re-enchanted; when, if ever, the truth stops being the most important thing; why we sometimes choose to read sad stories; whether we ever love someone for who they are; who could possibly want to live their same life over and over again; what it takes to make ourselves fully moral; whether it's ever good to be conflicted; how we can pull ourselves together; and how we can take ourselves apart. (This is the required gateway course for the Philosophy and Literature major tracks. Majors should register in their home department.)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13436",
                "currentClassSize": "0",
                "maxClassSize": "93",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "McMurtry Art Building Oshman",
                        "instructors": [
                            {
                                "name": "Peacocke, A.",
                                "sunet": "peacocke"
                            },
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "204034",
        "number": "ITALIAN 181",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "186",
        "title": "The Art of Self-Portraits (COMPLIT 186A, FEMGEN 186, FRENCH 186)",
        "description": "What is a self-portrait? The simple answer is that it is a portrait of the self. The complex answer is: anything that a person finds relevant to one's identity. Sometimes self-portraits are built around a positive idea, sometimes around a sense of loss; sometimes they are constructed as a shield or as a weapon, and turn into a manifesto of the self; sometimes they include a physical representation, sometimes they deny legitimacy to the body; sometimes gender or race (or both) are at the core of the identity, sometimes they are hidden; they are, however, never neutral and are always meaningful. In this class we will learn how to disentangle these multiple layers and will work on deconstructing them: we will focus on how each facet shapes and determines the representation and will appreciate the tactics and strategies used by the artists and authors in our syllabus (Frida Kahlo, Pablo Picasso, Simone de Beauvoir, Jin Min Lee, Alison Bechdel, Jhumpa Lahiri, among others). The class is taught in English and will have creative as well as critical assignments.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "223593",
        "number": "ITALIAN 186",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "188",
        "title": "Women, Wheat, and Weather? Lessons from Italy and the Global South for the 21st Century (COMPLIT 188A, COMPLIT 288, FRENCH 188, FRENCH 288, ITALIAN 288)",
        "description": "The Global South - a symbolic Mediterranean stretching from the Caribbean to India - lures the civilized man with the promise of excellent weather, voluptuous women, and good food. Already in antiquity, Sicily, the southernmost province of what is today modern Italy, was known as &quot;the granary of Rome,&quot; supplying the Empire with wheat. Still today, the South is associated with vacation, underdevelopment, superstition, the mafia, la dolce vita: &quot;The South is the problem; the North the solution,&quot; Boaventura de Sousa Santos succinctly puts it. In this course, we will move beyond the three W's by focusing on Italy from the point of view of &quot;Southern Thought&quot; (&quot;pensiero meridiano&quot;). We will read 20th/21st-century literary, philosophical, anthropological, and sociological texts from the Global South (Franco Cassano, Roberto M. Dainotto, Salman Rushdie, Gayatri Spivak, de Sousa Santos, Frantz Fanon, Homi Bhabha, Achille Mbembe, Carla Lonzi) to discuss such relevant topics as community and belonging (Elena Ferrante), technology and globalization (Luigi Pirandello; Fernando Pessoa), virus and contagion (Albert Camus), as well as race and gender (Igiaba Scego) from a Southern critical perspective. What counterhegemonic, non-binary, and renewable alternatives do the south of Italy and the Global South in general offer to understand these issues, and to the Western and Northern European emphasis on reason (the Cartesian &quot;cogito&quot;), individualism, and objectivity? We will have guest speakers from the Council of the EU and USAID specialized in international development, as well as conversations with authors. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223590",
        "number": "ITALIAN 188",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "189",
        "title": "Writing About Italy",
        "description": "Writing about various topics in Italian Studies. Topics based on student interests: current politics, economics, European affairs, or cultural and literary history, medieval to modern, in Italy. Intensive focus on writing. Students may write on their experience at Stanford in Florence. Fulfills the WIM requirement for Italian majors.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30405",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wittman, L.",
                                "sunet": "lwittman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223587",
        "number": "ITALIAN 189",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "190",
        "title": "The Celluloid Gaze: Gender, Identity and Sexuality in Cinema",
        "description": "This course examines femininity and gender representation in cinema. The rich tradition of film theory, from the key semiotic approaches of the 1970s-1990s until the current and equally influential methodologies, will provide the framework for an informed analysis of the films. Topics: the question of the gaze, the power of looking, of being looked at, and of looking back;  women as disruption in the patriarchal/cultural text;  maternity both as a sign of normalcy as well as a locus for obsession and manic concerns;  the woman&iquest;s body as a place of illness and sexuality. Our main object of investigation will be Italian cinema but we will also analyze a few Hollywood films which have inspired much feminist debate; we will focus as well on recent cinematic re-conceptualizations of gender and sexuality. Students will become familiar with key theoretical concepts such as the gaze, desire, intersectionality, masochism and masquerade, as well as modes of feminist resistance to traditional gender hierarchies. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "222395",
        "number": "ITALIAN 190",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "199",
        "title": "Individual Work",
        "description": "Prerequisite: consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27669",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29375",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29665",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10394",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "31275",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "31276",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11234",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "31277",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10395",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11235",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "31278",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10396",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "11236",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "31279",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10397",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "31280",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "11237",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "31281",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "10398",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "11238",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213813",
        "number": "ITALIAN 199",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 29
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "200",
        "title": "Italian Modernities: Lecture Series and Course (ITALIAN 300)",
        "description": "Lecture series and seminar on modern Italian literature, cinema, and culture. While we emphasize the 20th and 21st centuries, we will include medieval and renaissance topics also. We invite 3-6 speakers per year to address us about their recent work or work in progress, so as to get a better knowledge of very recent trends in the field of Italian studies, both in the US and abroad. Seminar meetings, when speakers are not invited, are for the following: (a) preparation and follow-up discussion of speakers' work; (b) presentation of students work in progress; (c) presentation of books reviews on recent work in the field. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "220734",
        "number": "ITALIAN 200",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "203",
        "title": "Women's Voices in the Italian Literary Tradition: From Catherine of Siena to Elena Ferrante",
        "description": "Women have been historically marginalized ? when not systematically excluded ? from participation in both the social sphere and the process of cultural production since the origin of the Italian literary tradition. And yet, well-educated, creative, literary Italian women throughout history have been able to reformulate the canonical language, style, and themes of the male-centered tradition in a continuous attempt to give voice to their unique identity and redeem their historically weak social agency. Starting with the study of classical, late-antique, and medieval misogynistic works that established authoritative misconceptions on women'fres moral and biological identities (the legacy of which is still evident in modern-day society), this course intends to revise the Italian literary canon to fully include women as pivotal agents in the historical formation of the national cultural identity. As the work of these writers often emerged through a constant, fruitful dialogue with their contemporary male counterparts, our investigations will apply an integral definition of gender, which simultaneously defends the equal dignity and acknowledges the differences of the sexes. Course materials will include a wide range of cross-medial genres and works by or about Italian women (poetry, novels, short stories, drama, non-fictional narrative, visual arts and films) dealing with issues of identity, emotional life, politics, and social justice. All the readings will be in English translation; there are no prerequisites or language requirements. Students will be occasionally allowed to select their own primary readings and are expected to produce a research essay on an elective topic, as well as several informal writing assignments.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225713",
        "number": "ITALIAN 203",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "205",
        "title": "Songs of Love and War: Gender, Crusade, Politics (FEMGEN 205, FRENCH 205, FRENCH 305, ITALIAN 305)",
        "description": "The course examines the medieval love lyric tradition, including the troubadours, trouv&egrave;res, and the Italian dolce stil nuovo. Focus on how to understand this tradition in the context of other non-Western lyric and its performative and material contexts such as manuscripts. Study of female lyrics, secondary readings on voice, lyric theory, and medieval textuality. Will be taught in English.  FRENCH 205 fulfills DLCL 121: Performing in the Middle Ages core course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:EC-Gender",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "214149",
        "number": "ITALIAN 205",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "213",
        "title": "Trauma and Disenchantment in Post-War Italy",
        "description": "Italian Neorealism was a flourishing literary and film movement in post-war Italy. The first half ofthis course will deal with some of its major novels, including Italo Calvino's &quot;The Path to the Nest of Spiders&quot;, Beppe Fenoglio's &quot;A Private Matter&quot;, and Primo Levi's &quot;Survival in Auschwitz&quot;. Through these novels we will seek to understand Italy's experience of World War II and the complexities of the altered social and psychological conditions of everyday life during this time. The second half of the course will focus on neorealist film as a response to the trauma of the war. We will explore how the cinematic medium both reflects on and reacts to tragedy. Movies such as &quot;Bicycle Thief&quot; [Vittorio de Sica], &quot;Rome, Open City&quot; [Roberto Rossellini], &quot;La Dolce Vita&quot; [Federico Fellini], and &quot;La Terra Trema&quot; [Luchino Visconti] will be considered.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15198",
                "currentClassSize": "0",
                "maxClassSize": "14",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224380",
        "number": "ITALIAN 213",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "214",
        "title": "Pirandello, Sartre, and Beckett (COMPLIT 281E, COMPLIT 381E, FRENCH 214, FRENCH 314, ITALIAN 314)",
        "description": "In this course we will read the main novels and plays of Pirandello, Sartre, and Beckett, with special emphasis on the existentialist themes of their work. Readings include The Late Mattia Pascal, Six Characters in Search of an Author, Henry IV; Nausea, No Exit, &quot;Existentialism is a Humanism&quot;; Molloy, Endgame, Krapp's Last Tape, Waiting for Godot. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "215495",
        "number": "ITALIAN 214",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "217",
        "title": "Love, Death and the Afterlife in the Medieval West (FRENCH 217, FRENCH 317, HISTORY 217D, HISTORY 317D, ITALIAN 317)",
        "description": "Romantic love, it is often claimed, is an invention of the High Middle Ages. The vocabulary of sexual desire that is still current in the twenty-first century was authored in the twelfth and thirteenth, by troubadours, court poets, writers like Dante; even by crusaders returning from the eastern Mediterranean. How did this devout society come to elevate the experience of sensual love? This course draws on primary sources such as medieval songs, folktales, the &quot;epic rap battles&quot; of the thirteenth century, along with the writings of Boccaccio, Saint Augustine and others, to understand the unexpected connections between love, death, and the afterlife from late antiquity to the fourteenth century. Each week, we will use a literary or artistic work as an interpretive window into cultural attitudes towards love, death or the afterlife. These readings are analyzed in tandem with major historical developments, including the rise of Christianity, the emergence of feudal society and chivalric culture, the crusading movement, and the social breakdown of the fourteenth century.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "31873",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "80-115",
                        "instructors": [
                            {
                                "name": "Phillips, J.",
                                "sunet": "jennarp"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "224545",
        "number": "ITALIAN 217",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "220",
        "title": "Madness, Magic, and Amor in L'Orlando Furioso (ITALIAN 320)",
        "description": "This class is an in-depth reading of the Italian epic poem L'Orlando Furioso, written by Ludovico Ariosto in the early sixteenth century. Errant knights, magic, and unpredictable adventures are just a few of the themes that characterize this unique poem. Ariosto's re-writing of classic medieval tropes will be central to our conversation. Taught in Italian.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224444",
        "number": "ITALIAN 220",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "221",
        "title": "Giambattista Vico (COMPLIT 221, FRENCH 212, FRENCH 321, ITALIAN 321)",
        "description": "An intensive reading of Vico's book - New Science.  Emphasis will be on Vico's philosophy of history and theories of poetic wisdom, myth, and language.  Vico will be put in dialogue with Ren&eacute; Descartes, Rousseau, Auguste Compte, Claude L&eacute;vi Strauss, and Paul Feyerabend, whose ideas about myth and science converge in striking ways with Vico's.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220703",
        "number": "ITALIAN 221",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "228",
        "title": "Science, Technology, and Society and the Humanities in the Face of Looming Disaster (FRENCH 228, POLISCI 233F)",
        "description": "How STS and the Humanities can together help think out the looming catastrophes that put the future of humankind in jeopardy.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "213654",
        "number": "ITALIAN 228",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "231",
        "title": "Leonardo's World: Science, Technology, and Art (ARTHIST 231, ARTHIST 431, HISTORY 231, HISTORY 331, ITALIAN 331)",
        "description": "Leonardo da Vinci is emblematic of creativity and innovation. His art is iconic, his inventions legendary. His understanding of nature, the human body, and machines made him a scientist and engineer as well as an artist. His fascination with drawing buildings made him an architect, at least on paper. This class explores the historical Leonardo, considering his interests and accomplishments as a product of the society of Renaissance Italy. Why did this world produce a Leonardo? Special attention will be given to interdisciplinary connections between religion, art, science, and technology.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220196",
        "number": "ITALIAN 231",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "232B",
        "title": "Heretics, Courtesans and Merchants: Venice and its Empire (HISTORY 232B)",
        "description": "Between 1200-1600, Venice created a powerful empire at the boundary between East and West that controlled much of the Mediterranean, with a merchant society that allowed social groups, religions, and ethnicities to coexist. Topics include the features of Venetian society, the relationship between center and periphery, order and disorder, orthodoxy and heresy, the role of politics, art, and culture in the Venetian Renaissance, and the empire's decline as a political power and reinvention as a tourist site and living museum.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "214036",
        "number": "ITALIAN 232B",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "233",
        "title": "When Worlds Collide:  The Trial of Galileo (HISTORY 235D, HISTORY 335D, ITALIAN 333)",
        "description": "In 1633, the Italian mathematician Galileo was tried and condemned for advocating that the sun, not the earth, was the center of the cosmos.  The Catholic Church did not formally admit that Galileo was right until 1992. Examines the many factors that led to the trial of Galileo and looks at multiple perspectives on this signal event in the history of science and religion. Considers the nature and definition of intellectual heresy in the sixteenth and early seventeenth centuries, and examines the writings of Galileo's infamous predecessor Giordano Bruno (burned at the stake in 1600). Looks closely at documents surrounding the trial and related literature on Renaissance and Reformation Italy in order to understand the perspectives of various participants in this famous event. Focal point of seminar involves the examination of the many different histories that can be produced from Galileo's trial. What, in the end, were the crimes of Galileo?",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221653",
        "number": "ITALIAN 233",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "237",
        "title": "Michelangelo: Gateway to Early Modern Italy (ARTHIST 218A, ARTHIST 418A, HISTORY 237B, HISTORY 337B, ITALIAN 337)",
        "description": "Revered as one of the greatest artists in history, Michelangelo Buonarroti's extraordinarily long and prodigious existence (1475-1564) spanned the Renaissance and the Reformation in Italy. The celebrity artist left behind not only sculptures, paintings, drawings, and architectural designs, but also an abundantly rich and heterogeneous collection of artifacts, including direct and indirect correspondence (approximately 1400 letters), an eclectic assortment of personal notes, documents and contracts, and 302 poems and 41 poetic fragments. This course will explore the life and production of Michelangelo in relation to those of his contemporaries. Using the biography of the artist as a thread, this interdisciplinary course will draw on a range of critical methodologies and approaches to investigate the civilization and culture of Italy in the fifteenth and sixteenth centuries. Course themes will follow key tensions that defined the period and that found expression in Michelangelo: physical-spiritual, classical-Christian, tradition-innovation, individual-collective.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221770",
        "number": "ITALIAN 237",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "238A",
        "title": "Dante's \"Inferno\" (COMPLIT 238A, ITALIAN 338A)",
        "description": "Intensive reading of Dante's &quot;Inferno&quot; (the first canticle of his three canticle poem The Divine Comedy).  Main objective: to learn how to read the Inferno in detail and in depth, which entails both close textual analysis as well as a systematic reconstruction of the Christian doctrines that subtend the poem. The other main objective is to understand how Dante's civic and political identity as a Florentine, and especially his exile from Florence, determined his literary career and turned him into the author of the poem. Special emphasis on Dante's moral world view and his representation of character. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30906",
                "currentClassSize": "0",
                "maxClassSize": "5",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "460-126",
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "214164",
        "number": "ITALIAN 238A",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "238B",
        "title": "Dante's \"Purgatorio\" and \"Paradiso\" (COMPLIT 238B, ITALIAN 338B)",
        "description": "Reading the second and third canticles of Dante's &quot;Divine Comedy.&quot; Prerequisite: students must have read Dante's &quot;Inferno&quot; in a course or on their own. Taught in English. Recommended: reading knowledge of Italian.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29704",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "214261",
        "number": "ITALIAN 238B",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "240",
        "title": "Great Minds of the Italian Renaissance and their World (ARTHIST 210, HISTORY 240C, ITALIAN 140)",
        "description": "What enabled Leonardo da Vinci to excel in over a dozen fields from painting to engineering and to anticipate flight four hundred years before the first aircraft took off? How did Michelangelo paint the Sistine Chapel Ceiling? What forces and insights led Machiavelli to write &quot;The Prince&quot;? An historical moment and a cultural era, the Italian Renaissance famously saw monumental achievements in literature, art, and architecture, influential developments in science and technology, and the flourishing of multi-talented individuals who contributed profoundly, expertly, and simultaneously to very different fields. In this course on the great thinkers, writers, and achievers of the Italian Renaissance, we will study these &quot;universal geniuses&quot; and their world. Investigating the writings, thought, and lives of such figures as Leonardo da Vinci, Niccol&iquest; Machiavelli, and Galileo Galilei, we will interrogate historical and contemporary ideas concerning genius, creativity, and the phenomenon of &quot;Renaissance man&quot; known as polymathy. Taught in English. In 2023-24, this course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Tuesdays you meet in your own course, and on Thursday all the HumCore seminars in session that quarter meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28162",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "160-323",
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222499",
        "number": "ITALIAN 240",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "244",
        "title": "Literature and Technology from Frankenstein to the Futurists (COMPLIT 244, ENGLISH 244, ITALIAN 344)",
        "description": "Overview of defects and disorder across crystalline, amorphous, and glassy phases that are central to function and application, spanning metals, ceramics, and soft/biological matter. Structure and properties of simple 0D/1D/2D defects in crystalline materials. Scaling laws, connectivity and frustration, and hierarchy/distributions of structure across length scales in more disordered materials. Key characterization techniques. Pre-reqs: MATSCI 211 (thermo), 212 (kinetics)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "223588",
        "number": "ITALIAN 244",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "248",
        "title": "Cinema and the Real: Italian Neo-Realism and the French New Wave (FRENCH 148, FRENCH 248, ITALIAN 148)",
        "description": "Between the 1940s and 1960s, in Italy and France, a handful of movie directors revolutionized the art of cinema. In the wake of World War II they entirely re-defined the aesthetics of the 7th art in films such as &quot;Bicycle Thieves,&quot; &quot;400 Blows,&quot; &quot;Rome Open City,&quot; and &quot;Breathless.&quot; These works shared an aesthetic and a philosophy of &quot;the real&quot; - they eschewed big studios and sets in favor of natural light, on-location shooting, and non-professional actors to capture the present moment. This survey course will explore how the dialogue between Italian neo-realism and the French New Wave has yielded some of the most revolutionary filmic masterpieces of both traditions, while raising theoretical and philosophical questions about form, time, space, fiction, representation, and reality. Films: Roberto Rossellini, Vittorio de Sica, Luchino Visconti, Federico Fellini, Fran&ccedil;ois Truffaut, Jean-Luc Godard, Alain Resnais and Agn&egrave;s Varda.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222486",
        "number": "ITALIAN 248",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "250",
        "title": "The Oceanic Novel: Woolf, Conrad, Duras, Tournier, Condé, Ortese (COMPLIT 250B, COMPLIT 350B, FRENCH 250, FRENCH 350, ITALIAN 350)",
        "description": "This course will examine novels situated by, on, or in the sea.  Its guiding questions: how do the immense breadth and depth of the sea relate to human interiority, self-discovery, and the shadow world of dreams?  Does the sea mark a boundary, or a dissolution of that boundary?  Novels include 'To The Lighthouse,' 'The Secret Sharer,' 'The Sailor from Gibraltar,' 'Friday,' 'Crossing the Mangrove,' and 'The Iguana.'",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223370",
        "number": "ITALIAN 250",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "251",
        "title": "Writing, Memory, and the Self (FRENCH 251, FRENCH 351, ITALIAN 351)",
        "description": "Recent work in psychology and neuroscience emphasizes the narrative quality of the self, as we create it and recreate it through language and writing, shaping memories both personal and historical. This process is circular: we grow into the stories we tell about ourselves, and we tell different stories to fit our changing life experiences. What is the self in the midst of all this? How does it relate to other selves and to the world? This course examines the nature of self, combining the insights of fiction writers (including Luigi Pirandello, Anna Banti, Michel Tournier, Alain Robbe-Grillet, Peter N&aacute;das) with works from philosophy, psychology, medical humanities, and neuroscience (including Edith Wyschogrod, Alexander Nehamas, Ruth Leys, Oliver Sacks). Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "213634",
        "number": "ITALIAN 251",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "257",
        "title": "Simone Weil, Simone de Beauvoir, Hannah Arendt, and Adriana Cavarero (COMPLIT 257, COMPLIT 357A, FEMGEN 257X, FEMGEN 357X, FRENCH 257, FRENCH 357, ITALIAN 357)",
        "description": "What does it mean to say the personal is the political, or, in the case of Arendt, that the personal is not political, especially if you are a woman?  This course explores how Weil, De Beauvoir, Arendt, and Caverero contend with the question of personhood, in its variegated social, political, ethical, and gendered dimensions. Particular attention will be given to a philosophy of social change and personal transformation, and to the enduring relevance of these women's thought to issues of our day. Texts include selections from &quot;Gravity and Grace,&quot; &quot;The Second Sex,&quot; &quot;The Ethics of Ambiguity,&quot; &quot;The Human Condition,&quot; &quot;Between Past and Future,&quot; &quot;Stately Bodies,&quot; and &quot;Relating Narratives.&quot;",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217319",
        "number": "ITALIAN 257",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "261",
        "title": "War and Peace: Writings by and about Veterans in the 20th and 21st Centuries (FRENCH 261, FRENCH 361, ITALIAN 361)",
        "description": "Since the aftermath of World War One, and with increasing urgency in contemporary America, stories about and by veterans are assigned a double role: that of exposing the horror of war yet also defending the possibility of a just war, and that of healing both veterans themselves and the society they return to. Key questions for this course are: Given the current practice of using writing and the hero&iquest;s journey as a model for healing veterans and making their voices heard in our culture, can we look back to post-World-War-One culture and see if writing fulfills a similar function? And given how many post-World-War-One veterans became famous writers, how do we assess the interplay between literature, poetry, memoir, journalism, personal letters, photo accounts? Is there a connection between artistic innovation and the capacity to heal?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219348",
        "number": "ITALIAN 261",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "262",
        "title": "Symbolism in Literature and the Arts (FRENCH 262, FRENCH 362, ITALIAN 362)",
        "description": "This course will deal with the some of the 19th and 20th century authors and artists  associated with Symbolism. We will focus on some key theoretical essays about the symbol, as well as on symbolist poetry, novels, visual arts, cinema, and music. In reading authors such as Coleridge, Blake, Poe, Baudelaire, Rimbaud, Verlaine, Mallarm&eacute;, Val&eacute;ry, Pascoli, Campana, d&iquest;Annunzio, and Savinio, we will explore the nature and uses of the symbol in art.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220706",
        "number": "ITALIAN 262",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "265",
        "title": "Word and Image (ARTHIST 265A, ARTHIST 465A, COMPLIT 225, ITALIAN 365)",
        "description": "What impact do images have on our reading of a text? How do words influence our understanding of images or our reading of pictures? What makes a visual interpretation of written words or a verbal rendering of an image successful? These questions will guide our investigation of the manifold connections between words and images in this course on intermediality and the relations and interrelations between writing and art from classical antiquity to the present. Readings and discussions will include such topics as the life and afterlife in word and image of Ovid's &quot;Metamorphoses,&quot; Dante's &quot;Divine Comedy,&quot; Ludovico Ariosto's &quot;Orlando Furioso,&quot; and John Milton's &quot;Paradise Lost;&quot; the writings and creative production of poet-artists Michelangelo Buonarroti, William Blake, and Dante Gabriel Rossetti; innovations in and correspondences between literature and art in the modern period, from symbolism in the nineteenth century through the flourishing of European avant-garde movements in the twentieth century.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222487",
        "number": "ITALIAN 265",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "272",
        "title": "Body Doubles: From the Fantastic Short Story to Science-Fiction (FRENCH 272, FRENCH 372, ITALIAN 372)",
        "description": "How do we imagine our bodies through language, at times almost completely refashioning a physical double, be it idealized or abject? How do such body doubles intersect with our sense of self, defining or redefining sexual identity, spiritual aspirations, illness and recovery, and the senses themselves, as our window into reality? This course focuses on short stories from the late 19th- and early 20th-century fantastic genre, and science fiction stories from the following turn of the century, 100 years later: in these revealing instances, body doubles often seem to acquire a will of their own, overwhelming normal physical identity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219349",
        "number": "ITALIAN 272",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "278",
        "title": "Elena Ferrante and Feminist Fiction from a Global Perspective (ITALIAN 378)",
        "description": "Taking the global impact of the novels of Elena Ferrante as its starting point, this course looks back on the many feminist authors she engages with, including Elsa Morante, Anna Banti, Marguerite Duras, Jeanne Hyvrard, and Christa Wolf. The course will also include readings from the European feminist tradition, probing difference feminism in particular, and include Simone de Beauvoir, Luce Irigaray, and Adriana Cavarero.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225263",
        "number": "ITALIAN 278",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "286",
        "title": "Poetry and Philosophy (FRENCH 286, FRENCH 386, ITALIAN 386)",
        "description": "When and why do philosophers resort to poetry?nWhat is the relationship between poetic metaphor and philosophical argumentation?nWhy is the poetic often associated with empathy - recently touted as an essential human characteristic -  whereas philosophy is considered more objective?nWhat is poetry's role in the pursuit of wisdom or the good life?nAuthors include Nietzsche, Heidegger, Bataille, Agamben, Ricoeur, Derrida, Irigaray, Wyschogrod, and Cavarero.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220716",
        "number": "ITALIAN 286",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "288",
        "title": "Women, Wheat, and Weather? Lessons from Italy and the Global South for the 21st Century (COMPLIT 188A, COMPLIT 288, FRENCH 188, FRENCH 288, ITALIAN 188)",
        "description": "The Global South - a symbolic Mediterranean stretching from the Caribbean to India - lures the civilized man with the promise of excellent weather, voluptuous women, and good food. Already in antiquity, Sicily, the southernmost province of what is today modern Italy, was known as &quot;the granary of Rome,&quot; supplying the Empire with wheat. Still today, the South is associated with vacation, underdevelopment, superstition, the mafia, la dolce vita: &quot;The South is the problem; the North the solution,&quot; Boaventura de Sousa Santos succinctly puts it. In this course, we will move beyond the three W's by focusing on Italy from the point of view of &quot;Southern Thought&quot; (&quot;pensiero meridiano&quot;). We will read 20th/21st-century literary, philosophical, anthropological, and sociological texts from the Global South (Franco Cassano, Roberto M. Dainotto, Salman Rushdie, Gayatri Spivak, de Sousa Santos, Frantz Fanon, Homi Bhabha, Achille Mbembe, Carla Lonzi) to discuss such relevant topics as community and belonging (Elena Ferrante), technology and globalization (Luigi Pirandello; Fernando Pessoa), virus and contagion (Albert Camus), as well as race and gender (Igiaba Scego) from a Southern critical perspective. What counterhegemonic, non-binary, and renewable alternatives do the south of Italy and the Global South in general offer to understand these issues, and to the Western and Northern European emphasis on reason (the Cartesian &quot;cogito&quot;), individualism, and objectivity? We will have guest speakers from the Council of the EU and USAID specialized in international development, as well as conversations with authors. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223590",
        "number": "ITALIAN 288",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "290",
        "title": "Magic, Science, and Religion (COMPLIT 290A, COMPLIT 390A, FRENCH 290, FRENCH 390, ITALIAN 390)",
        "description": "With the rise of the human sciences in the later nineteenth century, &quot;magic,&quot; &quot;science,&quot; and &quot;religion&quot; came to be understood as entirely separate domains, with different versions of truth and divergent methods of inquiry. But how has this division broken down in the past 150 years? How is it, for example, that other people's religion is &quot;merely magic&quot;? How does science still draw on religious categories, in particular to claim the universe is meaningful? How have new forms of magic shaped new age, global culture? We will examine these questions by pairing literary texts with readings from anthropology, history of science, religious studies, and cultural criticism. This course is taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221747",
        "number": "ITALIAN 290",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "300",
        "title": "Italian Modernities: Lecture Series and Course (ITALIAN 200)",
        "description": "Lecture series and seminar on modern Italian literature, cinema, and culture. While we emphasize the 20th and 21st centuries, we will include medieval and renaissance topics also. We invite 3-6 speakers per year to address us about their recent work or work in progress, so as to get a better knowledge of very recent trends in the field of Italian studies, both in the US and abroad. Seminar meetings, when speakers are not invited, are for the following: (a) preparation and follow-up discussion of speakers' work; (b) presentation of students work in progress; (c) presentation of books reviews on recent work in the field. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "220734",
        "number": "ITALIAN 300",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "302",
        "title": "The Interruption of the Machine: Introduction to Sound Studies through Literature (COMPLIT 333, ENGLISH 303A, MUSIC 303, TAPS 302)",
        "description": "This course will introduce students to the field of Sound Studies (methodology, vocabulary, main claims) with a focus on the various sonic articulations of human-machine interactions in literature. The world of fiction as a sonic machine that articulates noise, sound, music, voice, or silence offers an excellent archive. We will read works by Nathaniel Hawthorne, E&ccedil;a de Queir&oacute;s, Mark Twain, the Italian Futurists, Zora Neale Hurston, and Luigi Pirandello. Secondary readings will include seminal contributions by R. Murray Schafer (the soundscape), Leo Marx (U.S. industrialization), Jacques Attali (noise and music), Mladen Dolar (philosophy and voice), Adriana Cavarero (gender, voice, and the body), Jonathan Crary (culture, aesthetics, and perception), Friedrich Kittler (media), and Daphne Brooks (black feminist sound).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224538",
        "number": "ITALIAN 302",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "303",
        "title": "Innovation and Transformation of the Counter-Reformation: Religion and Culture in Early Modern Italy",
        "description": "Between the sixteenth and seventeenth centuries, following the Council of Trent (1545?63) and the attempt of the Catholic Church to reformulate its doctrines and regulate its disciplinary and spiritual renewal, Italian religious life and culture underwent remarkable transformations affecting all branches of human knowledge. As the nature of these transformations has long been the subject of scholarly debate, the literature and culture of the Counter-Reformation continue to be prejudicially neglected by scholars as products of a systematically repressive period. However, the complex cultural milieu of post-Tridentine Italy generated innovative and varied expressions of art, religion, science, and literature. This course intends to investigate a wide range of these cultural products, from lyric to epic poetry, from drama to non-fictional narrative, from visual arts to music. Works of this period are influenced by a uniquely syncretic religiosity and spirituality that reflect a profoundly interiorized experience of the Divine. With their unique blend of the pagan and Christian, literary and visual, marvelous and edifying, heroic and saintly, aesthetic and pious, theoretical and empirical, moral decorum and stylistic conceit, the cultural products of post-Tridentine Italy aim at triggering an emotional response in the mind of the devout reader. Due to the affective nature of the spirituality these works entail, male and female writers and artists highly value the relationship between devotion, creativity, and identity and act as self-aware agents of a complex cultural synergy, the nature of which is experiential rather than normative. A closer look at these neglected authors reveals the importance of the period's cultural shift, its intellectual and creative richness, and its enduring legacy. All the readings will be in English translation; there are no prerequisites or language requirements. Students will be occasionally allowed to select their own primary readings and are expected to produce a research essay on an elective topic, as well as several informal writing assignments.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225714",
        "number": "ITALIAN 303",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "305",
        "title": "Songs of Love and War: Gender, Crusade, Politics (FEMGEN 205, FRENCH 205, FRENCH 305, ITALIAN 205)",
        "description": "The course examines the medieval love lyric tradition, including the troubadours, trouv&egrave;res, and the Italian dolce stil nuovo. Focus on how to understand this tradition in the context of other non-Western lyric and its performative and material contexts such as manuscripts. Study of female lyrics, secondary readings on voice, lyric theory, and medieval textuality. Will be taught in English.  FRENCH 205 fulfills DLCL 121: Performing in the Middle Ages core course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "214149",
        "number": "ITALIAN 305",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "314",
        "title": "Pirandello, Sartre, and Beckett (COMPLIT 281E, COMPLIT 381E, FRENCH 214, FRENCH 314, ITALIAN 214)",
        "description": "In this course we will read the main novels and plays of Pirandello, Sartre, and Beckett, with special emphasis on the existentialist themes of their work. Readings include The Late Mattia Pascal, Six Characters in Search of an Author, Henry IV; Nausea, No Exit, &quot;Existentialism is a Humanism&quot;; Molloy, Endgame, Krapp's Last Tape, Waiting for Godot. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "215495",
        "number": "ITALIAN 314",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "315A",
        "title": "The Italian Renaissance, or the Art of Success (ARTHIST 115, ARTHIST 315, ITALIAN 115A)",
        "description": "How come that, even if you have never set foot in Italy, you have heard of Leonardo, Michelangelo, and Raphael? What made them so incredibly famous, back then as well as today? This course examines the shooting of those, and other, artists to fame. It provides in-depth analyses of their innovative drawing practices and the making of masterpieces, taking you through a virtual journey across some of the greatest European and American collections. At the same time, this course also offers a study of the mechanics of success, how opportunities are created and reputations managed, and what role art plays in the construction of class and in today's national politics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221390",
        "number": "ITALIAN 315A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "317",
        "title": "Love, Death and the Afterlife in the Medieval West (FRENCH 217, FRENCH 317, HISTORY 217D, HISTORY 317D, ITALIAN 217)",
        "description": "Romantic love, it is often claimed, is an invention of the High Middle Ages. The vocabulary of sexual desire that is still current in the twenty-first century was authored in the twelfth and thirteenth, by troubadours, court poets, writers like Dante; even by crusaders returning from the eastern Mediterranean. How did this devout society come to elevate the experience of sensual love? This course draws on primary sources such as medieval songs, folktales, the &quot;epic rap battles&quot; of the thirteenth century, along with the writings of Boccaccio, Saint Augustine and others, to understand the unexpected connections between love, death, and the afterlife from late antiquity to the fourteenth century. Each week, we will use a literary or artistic work as an interpretive window into cultural attitudes towards love, death or the afterlife. These readings are analyzed in tandem with major historical developments, including the rise of Christianity, the emergence of feudal society and chivalric culture, the crusading movement, and the social breakdown of the fourteenth century.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "31874",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "80-115",
                        "instructors": [
                            {
                                "name": "Phillips, J.",
                                "sunet": "jennarp"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224545",
        "number": "ITALIAN 317",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "320",
        "title": "Madness, Magic, and Amor in L'Orlando Furioso (ITALIAN 220)",
        "description": "This class is an in-depth reading of the Italian epic poem L'Orlando Furioso, written by Ludovico Ariosto in the early sixteenth century. Errant knights, magic, and unpredictable adventures are just a few of the themes that characterize this unique poem. Ariosto's re-writing of classic medieval tropes will be central to our conversation. Taught in Italian.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224444",
        "number": "ITALIAN 320",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "321",
        "title": "Giambattista Vico (COMPLIT 221, FRENCH 212, FRENCH 321, ITALIAN 221)",
        "description": "An intensive reading of Vico's book - New Science.  Emphasis will be on Vico's philosophy of history and theories of poetic wisdom, myth, and language.  Vico will be put in dialogue with Ren&eacute; Descartes, Rousseau, Auguste Compte, Claude L&eacute;vi Strauss, and Paul Feyerabend, whose ideas about myth and science converge in striking ways with Vico's.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220703",
        "number": "ITALIAN 321",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "325",
        "title": "Petrarch & Petrarchism: Fragments of the Self",
        "description": "In this course we will examine Francis Petrarch's book of Italian lyric poems, Rerum vulgarium fragmenta, and its reception in early modern France, England, and Spain. Readings from Petrarch's epistolary and ethical writings will contextualize historically and intellectually the aesthetics and ethics of the fragment in his poetry. With this foundation, we will investigate the long-lasting impact of Petrarch's work on Renaissance poetry and humanism, with attention to both the literary and the material aspects of its reception. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "215481",
        "number": "ITALIAN 325",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "328",
        "title": "Literature, Narrative, and the Self (COMPLIT 328, FRENCH 328)",
        "description": "It is often said that &quot;life is a narrative,&quot; or that &quot;we live our lives in stories.&quot; But is this true? Do we always live our lives as narratives? Could we fail to live our lives as narratives? Could we choose not to live our lives as narratives? Even for those who do see their life as a story, will any old narrative do, or is there something special about the examples provided by the literary tradition? How does literary genre factor in? What is closure? And why are middles what they are? Readings from Appiah, Aristotle, Camus, Hume, Nietzsche, Simmel, G. Strawson, Velleman; Brooks, Woloch; Kahneman, Sacks; Shakespeare, Balzac, Sartre, Beckett, Calvino, Levi, Morrison. Films by Ephron, Kaufman, Polley. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "214160",
        "number": "ITALIAN 328",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "331",
        "title": "Leonardo's World: Science, Technology, and Art (ARTHIST 231, ARTHIST 431, HISTORY 231, HISTORY 331, ITALIAN 231)",
        "description": "Leonardo da Vinci is emblematic of creativity and innovation. His art is iconic, his inventions legendary. His understanding of nature, the human body, and machines made him a scientist and engineer as well as an artist. His fascination with drawing buildings made him an architect, at least on paper. This class explores the historical Leonardo, considering his interests and accomplishments as a product of the society of Renaissance Italy. Why did this world produce a Leonardo? Special attention will be given to interdisciplinary connections between religion, art, science, and technology.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220196",
        "number": "ITALIAN 331",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "332B",
        "title": "Heretics, Prostitutes and Merchants: The Venetian Empire (HISTORY 332B)",
        "description": "Between 1200-1600, Venice created a powerful empire at the boundary between East and West that controlled much of the Mediterranean, with a merchant society that allowed social groups, religions, and ethnicities to coexist. Topics include the features of Venetian society, the relationship between center and periphery, order and disorder, orthodoxy and heresy, the role of politics, art, and culture in the Venetian Renaissance, and the empire's decline as a political power and reinvention as a tourist site and living museum.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "115326",
        "number": "ITALIAN 332B",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "333",
        "title": "When Worlds Collide:  The Trial of Galileo (HISTORY 235D, HISTORY 335D, ITALIAN 233)",
        "description": "In 1633, the Italian mathematician Galileo was tried and condemned for advocating that the sun, not the earth, was the center of the cosmos.  The Catholic Church did not formally admit that Galileo was right until 1992. Examines the many factors that led to the trial of Galileo and looks at multiple perspectives on this signal event in the history of science and religion. Considers the nature and definition of intellectual heresy in the sixteenth and early seventeenth centuries, and examines the writings of Galileo's infamous predecessor Giordano Bruno (burned at the stake in 1600). Looks closely at documents surrounding the trial and related literature on Renaissance and Reformation Italy in order to understand the perspectives of various participants in this famous event. Focal point of seminar involves the examination of the many different histories that can be produced from Galileo's trial. What, in the end, were the crimes of Galileo?",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221653",
        "number": "ITALIAN 333",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "337",
        "title": "Michelangelo: Gateway to Early Modern Italy (ARTHIST 218A, ARTHIST 418A, HISTORY 237B, HISTORY 337B, ITALIAN 237)",
        "description": "Revered as one of the greatest artists in history, Michelangelo Buonarroti's extraordinarily long and prodigious existence (1475-1564) spanned the Renaissance and the Reformation in Italy. The celebrity artist left behind not only sculptures, paintings, drawings, and architectural designs, but also an abundantly rich and heterogeneous collection of artifacts, including direct and indirect correspondence (approximately 1400 letters), an eclectic assortment of personal notes, documents and contracts, and 302 poems and 41 poetic fragments. This course will explore the life and production of Michelangelo in relation to those of his contemporaries. Using the biography of the artist as a thread, this interdisciplinary course will draw on a range of critical methodologies and approaches to investigate the civilization and culture of Italy in the fifteenth and sixteenth centuries. Course themes will follow key tensions that defined the period and that found expression in Michelangelo: physical-spiritual, classical-Christian, tradition-innovation, individual-collective.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221770",
        "number": "ITALIAN 337",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "338A",
        "title": "Dante's \"Inferno\" (COMPLIT 238A, ITALIAN 238A)",
        "description": "Intensive reading of Dante's &quot;Inferno&quot; (the first canticle of his three canticle poem The Divine Comedy).  Main objective: to learn how to read the Inferno in detail and in depth, which entails both close textual analysis as well as a systematic reconstruction of the Christian doctrines that subtend the poem. The other main objective is to understand how Dante's civic and political identity as a Florentine, and especially his exile from Florence, determined his literary career and turned him into the author of the poem. Special emphasis on Dante's moral world view and his representation of character. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30907",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "460-126",
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214164",
        "number": "ITALIAN 338A",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "338B",
        "title": "Dante's \"Purgatorio\" and \"Paradiso\" (COMPLIT 238B, ITALIAN 238B)",
        "description": "Reading the second and third canticles of Dante's &quot;Divine Comedy.&quot; Prerequisite: students must have read Dante's &quot;Inferno&quot; in a course or on their own. Taught in English. Recommended: reading knowledge of Italian.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31274",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214261",
        "number": "ITALIAN 338B",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "343",
        "title": "Deep Tech at the Intersection of Literature, Philosophy, and Society",
        "description": "The Oxford English Dictionary defines &quot;Deep Tech&quot; as &quot;the part of the World Wide Web that is not discoverable by means of standard search engines.&quot; When startups and companies around Silicon Valley describe themselves as &quot;deep-tech,&quot; it means that they employ methods and technologies that are not available on the mainstream market. What does it mean to practice &quot;Deep Tech&quot; from a Humanities point of view? It means to leverage literary and philosophical concepts and methods so that we can: 1) tackle change, and b) evaluate proposals and new technologies for their coherence, viability, and ethical implications. Three such concepts are judgment, moderation, and love. Accordingly, the course is structured in three parts: In the first part, we will talk about the role of aesthetic evaluations in the practice of judgment as a form of deep collective thinking. Readings on the topic will include texts by Hannah Arendt, Simone Weil, David N. Rodowick, and Carlo Collodi's Pinocchio (1883). In the second part, we will discuss the concept of limit (or moderation) as envisioned by Albert Camus, the Italian sociologist Franco Cassano, and Karel Capek's play Rossum's Universal Robots (1920). Finally, we will talk about the idea of love and what it means to receive a political education in emotions as outlined by Martha C. Nussbaum through Mary Shelley's Frankenstein (1818).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224379",
        "number": "ITALIAN 343",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "344",
        "title": "Literature and Technology from Frankenstein to the Futurists (COMPLIT 244, ENGLISH 244, ITALIAN 244)",
        "description": "Overview of defects and disorder across crystalline, amorphous, and glassy phases that are central to function and application, spanning metals, ceramics, and soft/biological matter. Structure and properties of simple 0D/1D/2D defects in crystalline materials. Scaling laws, connectivity and frustration, and hierarchy/distributions of structure across length scales in more disordered materials. Key characterization techniques. Pre-reqs: MATSCI 211 (thermo), 212 (kinetics)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223588",
        "number": "ITALIAN 344",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "346",
        "title": "Body over Mind (FRENCH 246, FRENCH 346)",
        "description": "How does modern fiction, aided by modern philosophy, give the lie to Descartes' famous &quot;I think therefore I am&quot;? And how does writing convey the desire for a different, perhaps stronger, integration of mind and body? Does the body speak a particular truth that we must learn to hear, that the mind is not always connected to? How do modern metaphors for the mind-body connection shape our experience? These questions will be explored via the works of major French and Italian writers and thinkers, including Pirandello, Calvino, Camus, Houellebecq, Sartre, and Agamben.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "218133",
        "number": "ITALIAN 346",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "349",
        "title": "Love at First Sight: Visual Desire, Attraction, and the Pleasures of Art (ARTHIST 119, ARTHIST 319, FRENCH 149, FRENCH 349, ITALIAN 149)",
        "description": "Why do dating sites rely on photographs? Why do we believe that love is above all a visual force? How is pleasure, even erotic pleasure, achieved through looking? While the psychology of impressions offers some answers, this course uncovers the ways poets, songwriters, and especially artists have explored myths and promoted ideas about the coupling of love and seeing. Week by week, we will be reflecting on love as political critique, social disruption, and magical force. And we will do so by examining some of the most iconic works of art, from Dante's writings on lovesickness to Caravaggio's Narcissus, studying the ways that objects have shifted from keepsakes to targets of our cares. While exploring the visual roots and evolutions of what has become one of life's fundamental drives, this course offers a passionate survey of European art from Giotto's kiss to Fragonard's swing that elicits stimulating questions about the sensorial nature of desire and the human struggle to control emotions.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220546",
        "number": "ITALIAN 349",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "350",
        "title": "The Oceanic Novel: Woolf, Conrad, Duras, Tournier, Condé, Ortese (COMPLIT 250B, COMPLIT 350B, FRENCH 250, FRENCH 350, ITALIAN 250)",
        "description": "This course will examine novels situated by, on, or in the sea.  Its guiding questions: how do the immense breadth and depth of the sea relate to human interiority, self-discovery, and the shadow world of dreams?  Does the sea mark a boundary, or a dissolution of that boundary?  Novels include 'To The Lighthouse,' 'The Secret Sharer,' 'The Sailor from Gibraltar,' 'Friday,' 'Crossing the Mangrove,' and 'The Iguana.'",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223370",
        "number": "ITALIAN 350",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "351",
        "title": "Writing, Memory, and the Self (FRENCH 251, FRENCH 351, ITALIAN 251)",
        "description": "Recent work in psychology and neuroscience emphasizes the narrative quality of the self, as we create it and recreate it through language and writing, shaping memories both personal and historical. This process is circular: we grow into the stories we tell about ourselves, and we tell different stories to fit our changing life experiences. What is the self in the midst of all this? How does it relate to other selves and to the world? This course examines the nature of self, combining the insights of fiction writers (including Luigi Pirandello, Anna Banti, Michel Tournier, Alain Robbe-Grillet, Peter N&aacute;das) with works from philosophy, psychology, medical humanities, and neuroscience (including Edith Wyschogrod, Alexander Nehamas, Ruth Leys, Oliver Sacks). Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "213634",
        "number": "ITALIAN 351",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "352",
        "title": "Boccaccio's Decameron: The Ethics of Storytelling (ITALIAN 152)",
        "description": "This course involves an in-depth study of Boccaccio's Decameron in the context of medieval theories of poetry and interpretation. The goal is to understand more fully the relationship between literature and lived experience implied by Boccaccio's fictions. We will address key critical issues and theoretical approaches related to the text. Taught in English translation, there will be an optional supplementary Italian discussion section during weeks 2-9.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "214163",
        "number": "ITALIAN 352",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "357",
        "title": "Simone Weil, Simone de Beauvoir, Hannah Arendt, and Adriana Cavarero (COMPLIT 257, COMPLIT 357A, FEMGEN 257X, FEMGEN 357X, FRENCH 257, FRENCH 357, ITALIAN 257)",
        "description": "What does it mean to say the personal is the political, or, in the case of Arendt, that the personal is not political, especially if you are a woman?  This course explores how Weil, De Beauvoir, Arendt, and Caverero contend with the question of personhood, in its variegated social, political, ethical, and gendered dimensions. Particular attention will be given to a philosophy of social change and personal transformation, and to the enduring relevance of these women's thought to issues of our day. Texts include selections from &quot;Gravity and Grace,&quot; &quot;The Second Sex,&quot; &quot;The Ethics of Ambiguity,&quot; &quot;The Human Condition,&quot; &quot;Between Past and Future,&quot; &quot;Stately Bodies,&quot; and &quot;Relating Narratives.&quot;",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "217319",
        "number": "ITALIAN 357",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "361",
        "title": "War and Peace: Writings by and about Veterans in the 20th and 21st Centuries (FRENCH 261, FRENCH 361, ITALIAN 261)",
        "description": "Since the aftermath of World War One, and with increasing urgency in contemporary America, stories about and by veterans are assigned a double role: that of exposing the horror of war yet also defending the possibility of a just war, and that of healing both veterans themselves and the society they return to. Key questions for this course are: Given the current practice of using writing and the hero&iquest;s journey as a model for healing veterans and making their voices heard in our culture, can we look back to post-World-War-One culture and see if writing fulfills a similar function? And given how many post-World-War-One veterans became famous writers, how do we assess the interplay between literature, poetry, memoir, journalism, personal letters, photo accounts? Is there a connection between artistic innovation and the capacity to heal?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219348",
        "number": "ITALIAN 361",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "362",
        "title": "Symbolism in Literature and the Arts (FRENCH 262, FRENCH 362, ITALIAN 262)",
        "description": "This course will deal with the some of the 19th and 20th century authors and artists  associated with Symbolism. We will focus on some key theoretical essays about the symbol, as well as on symbolist poetry, novels, visual arts, cinema, and music. In reading authors such as Coleridge, Blake, Poe, Baudelaire, Rimbaud, Verlaine, Mallarm&eacute;, Val&eacute;ry, Pascoli, Campana, d&iquest;Annunzio, and Savinio, we will explore the nature and uses of the symbol in art.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220706",
        "number": "ITALIAN 362",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "365",
        "title": "Word and Image (ARTHIST 265A, ARTHIST 465A, COMPLIT 225, ITALIAN 265)",
        "description": "What impact do images have on our reading of a text? How do words influence our understanding of images or our reading of pictures? What makes a visual interpretation of written words or a verbal rendering of an image successful? These questions will guide our investigation of the manifold connections between words and images in this course on intermediality and the relations and interrelations between writing and art from classical antiquity to the present. Readings and discussions will include such topics as the life and afterlife in word and image of Ovid's &quot;Metamorphoses,&quot; Dante's &quot;Divine Comedy,&quot; Ludovico Ariosto's &quot;Orlando Furioso,&quot; and John Milton's &quot;Paradise Lost;&quot; the writings and creative production of poet-artists Michelangelo Buonarroti, William Blake, and Dante Gabriel Rossetti; innovations in and correspondences between literature and art in the modern period, from symbolism in the nineteenth century through the flourishing of European avant-garde movements in the twentieth century.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222487",
        "number": "ITALIAN 365",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "369",
        "title": "Introduction to the Profession of Literary Studies (COMPLIT 369, DLCL 369, FRENCH 369, GERMAN 369)",
        "description": "A survey of how literary theory and other methods have been made institutional since the nineteenth century. The readings and conversation are designed for entering Ph.D. students in the national literature departments and comparative literature.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13727",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "300-303",
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 66000.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "117816",
        "number": "ITALIAN 369",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "372",
        "title": "Body Doubles: From the Fantastic Short Story to Science-Fiction (FRENCH 272, FRENCH 372, ITALIAN 272)",
        "description": "How do we imagine our bodies through language, at times almost completely refashioning a physical double, be it idealized or abject? How do such body doubles intersect with our sense of self, defining or redefining sexual identity, spiritual aspirations, illness and recovery, and the senses themselves, as our window into reality? This course focuses on short stories from the late 19th- and early 20th-century fantastic genre, and science fiction stories from the following turn of the century, 100 years later: in these revealing instances, body doubles often seem to acquire a will of their own, overwhelming normal physical identity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219349",
        "number": "ITALIAN 372",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "377",
        "title": "Medieval Lyric: How Lyric Moves (COMPLIT 377, FRENCH 377)",
        "description": "Through the study of various vernacular premodern traditions, this graduate level course examines the qualities that make texts &quot;lyric&quot; and place them into conversation with contemporary theories of lyric. The course will situate medieval lyric within the critical discourse of poetics, the Global South, the archive, and anachrony. We will consider the movement of verse within and among various material contexts (song, manuscript, artworks, objects, tombstones). Poets considered: troubadours, trouv&egrave;res, Galician-Portugese cantigas d'amigo, Stilnovists, Dante, Petrarchan poetry, Jean Renart, Charles d'Orl&eacute;ans, Villon, Pound, Brazilian Concrete Poetry.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222489",
        "number": "ITALIAN 377",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "378",
        "title": "Elena Ferrante and Feminist Fiction from a Global Perspective (ITALIAN 278)",
        "description": "Taking the global impact of the novels of Elena Ferrante as its starting point, this course looks back on the many feminist authors she engages with, including Elsa Morante, Anna Banti, Marguerite Duras, Jeanne Hyvrard, and Christa Wolf. The course will also include readings from the European feminist tradition, probing difference feminism in particular, and include Simone de Beauvoir, Luce Irigaray, and Adriana Cavarero.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225263",
        "number": "ITALIAN 378",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "386",
        "title": "Poetry and Philosophy (FRENCH 286, FRENCH 386, ITALIAN 286)",
        "description": "When and why do philosophers resort to poetry?nWhat is the relationship between poetic metaphor and philosophical argumentation?nWhy is the poetic often associated with empathy - recently touted as an essential human characteristic -  whereas philosophy is considered more objective?nWhat is poetry's role in the pursuit of wisdom or the good life?nAuthors include Nietzsche, Heidegger, Bataille, Agamben, Ricoeur, Derrida, Irigaray, Wyschogrod, and Cavarero.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220716",
        "number": "ITALIAN 386",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "390",
        "title": "Magic, Science, and Religion (COMPLIT 290A, COMPLIT 390A, FRENCH 290, FRENCH 390, ITALIAN 290)",
        "description": "With the rise of the human sciences in the later nineteenth century, &quot;magic,&quot; &quot;science,&quot; and &quot;religion&quot; came to be understood as entirely separate domains, with different versions of truth and divergent methods of inquiry. But how has this division broken down in the past 150 years? How is it, for example, that other people's religion is &quot;merely magic&quot;? How does science still draw on religious categories, in particular to claim the universe is meaningful? How have new forms of magic shaped new age, global culture? We will examine these questions by pairing literary texts with readings from anthropology, history of science, religious studies, and cultural criticism. This course is taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221747",
        "number": "ITALIAN 390",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "395",
        "title": "Philosophical Reading Group (COMPLIT 359A, FRENCH 395)",
        "description": "Discussion of one contemporary or historical text from the Western philosophical tradition per quarter in a group of faculty and graduate students. For admission of new participants, a conversation with Professor Robert Harrison is required. May be repeated for credit. Taught in English.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "126249",
        "number": "ITALIAN 395",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "398",
        "title": "Intensive Reading in French/Italian (FRENCH 398)",
        "description": "Enrollment is limited to French/Italian Ph.D. students.  Course is designed for French/Italian Ph.D. students to prepare for department milestone exams.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "10",
        "unitsMax": "10",
        "sections": [],
        "gers": [],
        "objectID": "215173",
        "number": "ITALIAN 398",
        "units": [
            10
        ]
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "399",
        "title": "Individual Work",
        "description": "Repeatable for Credit",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "12",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27670",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29376",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29666",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10400",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "15642",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "31284",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "31285",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10401",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11094",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "31286",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10402",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "11095",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "31287",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10403",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "11096",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "31288",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "31289",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "10404",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "11097",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "31290",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213814",
        "number": "ITALIAN 399",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12
        ],
        "totalSections": 29
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "680",
        "title": "Curricular Practical Training",
        "description": "CPT course required for international students completing degree. Prerequisite: Italian Ph.D. candidate.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28584",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30624",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30461",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225341",
        "number": "ITALIAN 680",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "ITALIAN",
        "code": "802",
        "title": "TGR Dissertation",
        "description": "Doctoral students who have been admitted to candidacy, completed all required courses and degree requirements other than the University oral exam and dissertation, completed 135 units or 10.5 quarters of residency (if under the old residency policy), and submitted a Doctoral Dissertation Reading Committee form, may request Terminal Graduate Registration status to complete their dissertations.",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29374",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29664",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "10406",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Alduy, C.",
                                "sunet": "alduy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "13193",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "13194",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Wittman, L.",
                                "sunet": "lwittman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "14395",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Prodan, S.",
                                "sunet": "sprodan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "10407",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "11100",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "31292",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dupuy, J.",
                                "sunet": "jpdupuy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "10408",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "11101",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "31293",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edelstein, D.",
                                "sunet": "danedels"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "10409",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "11102",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "31294",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "T/D",
                "notes": null,
                "classId": "31295",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Galvez, M.",
                                "sunet": "mgalvez"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "10410",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "11103",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Harrison, R.",
                                "sunet": "harrison"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "T/D",
                "notes": null,
                "classId": "31296",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "10",
                "component": "T/D",
                "notes": null,
                "classId": "10411",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213812",
        "number": "ITALIAN 802",
        "units": [
            0
        ],
        "totalSections": 29
    }
]