[
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "20",
        "title": "Humanities Core: Dao, Virtue, and Nature -- Foundations of East Asian Thought (CHINA 20, HUMCORE 20, KOREA 20)",
        "description": "This course explores the values and questions posed in the formative period of East Asian civilizations. Notions of a Dao (&quot;Way&quot;) are common to Confucianism, Daoism, and Buddhism, but those systems of thought have radically different ideas about what that Dao is and how it might be realized in society and an individual's life. These systems of thought appeared first in China, and eventually spread to Korea and Japan. Each culture developed its own ways of reconciling the competing systems, but in each case the comprehensive structure of values and human ideals differs significantly from those that appeared elsewhere in the ancient world. The course examines East Asian ideas about self-cultivation, harmonious society, rulership, and the relation between human and nature with a view toward expanding our understanding of these issues in human history, and highlighting their legacies in Asian civilizations today. The course features selective readings in classics of Confucian, Daoist, and Buddhist texts that present the foundational tenets of Asian thought. N. B. This is the first of three courses in the Humanities Core, East Asian track. These courses show how history and ideas shape our world and future. Take all three to experience a year-long intellectual community dedicated to the life of the mind.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "220552",
        "number": "JAPAN 20",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "21",
        "title": "Humanities Core: Love and Betrayal in Asia (CHINA 21, HUMCORE 21, KOREA 21)",
        "description": "Why are lovers in storybooks East and West always star-crossed? Why do love and death seem to go together? For every Romeo and Juliet, there are dozens of doomed lovers in the Asian literary repertoires, from Genji's string of embittered mistresses, to the Butterfly lovers in early modern China, to the voices of desire in Koryo love songs, to the devoted adolescent cousins in Dream of the Red Chamber, to the media stars of Korean romantic drama, now wildly popular throughout Asia. In this course, we explore how the love story has evolved over centuries of East Asian history, asking along the way what we can learn about Chinese, Japanese, and Korean views of family and community, gender and sexuality, truth and deception, trust and betrayal, ritual and emotion, and freedom and solidarity from canonical and non-canonical works in East Asian literatures. N.B. This is the second of three courses in the East Asian track. These courses offer an unparalleled opportunity to study East Asian history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "219307",
        "number": "JAPAN 21",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "21Q",
        "title": "Humanities Core: Love and Betrayal in Asia (CHINA 21Q, HUMCORE 21Q, KOREA 21Q)",
        "description": "Why are lovers in storybooks East and West always star-crossed? Why do love and death seem to go together? For every Romeo and Juliet, there are dozens of doomed lovers in the Asian literary repertoires, from Genji's string of embittered mistresses, to the Butterfly lovers in early modern China, to the voices of desire in Koryo love songs, to the devoted adolescent cousins in Dream of the Red Chamber, to the media stars of Korean romantic drama, now wildly popular throughout Asia. In this course, we explore how the love story has evolved over centuries of East Asian history, asking along the way what we can learn about Chinese, Japanese, and Korean views of family and community, gender and sexuality, truth and deception, trust and betrayal, ritual and emotion, and freedom and solidarity from canonical and non-canonical works in East Asian literatures. N.B. This is the second of three courses in the East Asian track. These courses offer an unparalleled opportunity to study East Asian history and culture, past and present. Take all three to experience a year-long intellectual community dedicated to exploring how ideas have shaped our world and future.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220549",
        "number": "JAPAN 21Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "24",
        "title": "Humanities Core: How to be Modern in East Asia (CHINA 24, COMPLIT 44, HUMCORE 133, KOREA 24)",
        "description": "Modern East Asia was almost continuously convulsed by war and revolution in the 19th and 20th centuries. But the everyday experience of modernity was structured more profoundly by the widening gulf between the country and the city, economically, politically, and culturally. This course examines literary and cinematic works from China and Japan that respond to and reflect on the city/country divide, framing it against issues of class, gender, national identity, and ethnicity. It also explores changing ideas about home/hometown, native soil, the folk, roots, migration, enlightenment, civilization, progress, modernization, nationalism, cosmopolitanism, and sustainability. All materials are in English. This course is part of the Humanities Core: https://humanitiescore.stanford.edu/",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32664",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Xu, L.",
                                "sunet": "ljxu"
                            },
                            {
                                "name": "Reichert, J.",
                                "sunet": "reichert"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "220673",
        "number": "JAPAN 24",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "52",
        "title": "Global Humanities: The Grand Millennium, 800-1800 (DLCL 52, HISTORY 206D, HUMCORE 52)",
        "description": "How should we live? This course explores ethical pathways in European, Islamic, and East Asian traditions: mysticism and rationality, passion and duty, this and other worldly, ambition and peace of mind. They all seem to be pairs of opposites, but as we'll see, some important historical figures managed to follow two or more of them at once. We will read works by successful thinkers, travelers, poets, lovers, and bureaucrats written between 800 and 1900 C.E. We will ask ourselves whether we agree with their choices and judgments about what is a life well lived.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "220586",
        "number": "JAPAN 52",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "60",
        "title": "Asian Arts and Cultures (ARTHIST 2)",
        "description": "An exploration of the visual arts of East and South Asia from ancient to modern times, in their social, religious, literary and political contexts. Analysis of major monuments of painting, sculpture and architecture will be organized around themes that include ritual and funerary arts, Buddhist art and architecture across Asia, landscape and narrative painting, culture and authority in court arts, and urban arts in the early modern world.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-A-II"
        ],
        "objectID": "110603",
        "number": "JAPAN 60",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "82N",
        "title": "Joys and Pains of Growing Up and Older in Japan",
        "description": "What do old and young people share in common?  With a focus on Japan, a country with a large long-living population, this seminar spotlights older people's lives as a reflectiion of culture and society, history, and current social and personal changes.  Through discussion of multidisciplinary studies on age, analysis of narratives, and films, we will gain a closer understanding of Japanese society and the multiple meanings of growing up and older.  Students will also create a short video/audio profile of an older individual, and we will explore cross-cultural comparisons. Held in Knight Bldg. Rm. 201.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "212061",
        "number": "JAPAN 82N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "112A",
        "title": "Asian Screen Cultures (CHINA 112A, CHINA 212A, JAPAN 212A, KOREA 112, KOREA 212)",
        "description": "Asian screen culture, ranging from cinema to online games, has (re)shaped the global and national/regional imaginings of Asia. The Post-Cold War intensification of intra-Asian interactions has precipitated the rise of a Pan-Asian regional identity wherein the nation-state is not yet obsolete. What role does screen culture plays in the border-crossing interplay among languages, ideologies, aesthetics, and affect? How does the converging media of screen culture capture local/global desires and propel the history of transformation of sign systems from the written words to visual moving images in a digital time? How do we understand the aesthetic, storytelling, and politics of Asian screen cultures vis-&agrave;-vis its historical and social context? While exploring these transnational and transdisciplinary questions, this course will deal with topical issues of Pan-Asian identity, (trans)nationalism, (un)translatability, commodity fetishism, locality and globality, technophobia, and politics of gender. Students will learn how to think and write about screen cultures of East Asia in particular and of our world of screens in general.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222258",
        "number": "JAPAN 112A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "118",
        "title": "Humanities Core: Everybody Eats: The Language, Culture, and Ethics of Food in East Asia (CHINA 118, HUMCORE 22, KOREA 118)",
        "description": "Many of us have grown up eating &quot;Asian&quot; at home, with friends, on special occasions, or even without full awareness that Asian is what we were eating. This course situates the three major culinary traditions of East Asia--China, Japan, and Korea--in the histories and civilizations of the region, using food as an introduction to their rich repertoires of literature, art, language, philosophy, religion, and culture. It also situates these seemingly timeless gastronomies within local and global flows, social change, and ethical frameworks. Specifically, we will explore the traditional elements of Korean court food, and the transformation of this cuisine as a consequence of the Korean War and South Korea&iquest;s subsequent globalizing economy; the intersection of traditional Japanese food with past and contemporary identities; and the evolution of Chinese cuisine that accompanies shifting attitudes about the environment, health, and well-being. Questions we will ask ourselves during the quarter include, what is &quot;Asian&quot; about Asian cuisine? How has the language of food changed? Is eating, and talking about eating, a gendered experience? How have changing views of the self and community shifted the conversation around the ethics and ecology of meat consumption?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "Writing 2"
        ],
        "objectID": "219672",
        "number": "JAPAN 118",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "121",
        "title": "Translating Japan, Translating the West (COMPLIT 142B, JAPAN 221)",
        "description": "Translation lies at the heart of all intercultural exchange.  This course introduces students to the specific ways in which translation has shaped the image of Japan in the West, the image of the West in Japan, and Japan's self-image in the modern period. What texts and concepts were translated by each side, how, and to what effect? No prior knowledge of Japanese language necessary.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "209763",
        "number": "JAPAN 121",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "123",
        "title": "Critical Translation Studies (COMPLIT 228, JAPAN 223)",
        "description": "This course does not teach students how to translate, but rather how to incorporate translation into their critical thinking. Critical translation studies comprises wide-ranging ruminations on the complex interplay between languages, cultures, power, and identity. How can we integrate translation into our thinking about the processes that shape literary, political, ethical, and aesthetic sensibilities, and what do we stand to gain by doing so? Course readings introduce key works from inter-lingual perspectives that range across English, Hebrew, French, German, Italian, Spanish, Tagalog, Bengali, Chinese, Japanese, Indonesian, and Qu&eacute;b&eacute;cois. (Students need only have some knowledge of a language other than Standard American English to productively engage with the readings.) Class discussions and workshop assignments are designed to prepare students to integrate critical thinking about translation into their own research and intellectual interests.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221574",
        "number": "JAPAN 123",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "125",
        "title": "Tokyo, Kyoto, Osaka and Beyond: Place in Modern Japan (JAPAN 225)",
        "description": "From the culturally distinct urban centers of Tokyo, Kyoto, and Osaka to the sharp contrasts between the southernmost and northernmost parts of Japan, modern Japanese literature and film present rich characterizations of place that have shaped Japanese identities at the national, regional, and local levels. This course focuses attention on how these settings operate in key works of literature and film, with an eye toward developing students' understanding of diversity within modern Japan. FOR UNDERGRADS: This course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13801",
                "currentClassSize": "0",
                "maxClassSize": "68",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Levy, I.",
                                "sunet": "ilevy"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "221988",
        "number": "JAPAN 125",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "126",
        "title": "Japanese Functional Objects (JAPAN 226)",
        "description": "This course focuses on the creation of objects at the boundary between the aesthetic allure of fine art and the utilitarian practicality of everyday life. It is also about how we value the objects with which we surround ourselves, connected to issues that go from sustainability to the intimacy of the handmade - of the little but precise tool marks that evoke the skilled expertise of years spent at the workbench. Traditionally in Japan the distinction between a work of art and a utilitarian object was inessential. An aesthetic object acquired its cultural identity and social value precisely because it could be used. Famous examples of this duality can be found in tea ceremony ceramics, complex architectural joinery, lavish fabric design, and fine temple-inspired cuisine. This is true even for painting and calligraphy: illustrated paper-covered architectural partitions were as useful in keeping a room warm as in serving as the highlight of a social gathering; hanging scrolls and flower arrangements displayed in a purpose-built alcove (tokonoma) conveyed delicate political and cultural messages. At a modern museum, as soon as an object is acquired and accessioned into the collection, it ceases to be available to be touched, smelled, or weighed in one's hands. The only contact with warm bodies comes now through the gloved hands of a few trained professionals. A tokonoma alcove, by contrast, has no glass. What is more, a mere hint by the guest will prompt the host to retrieve the object displayed and offer it for close examination, or, as was often the case, actual use by the guests. The sense of closeness between object and body in premodern Japan was intensified by the fact that users were often makers themselves. Socialized utilization became the perfect venue for the assessment, evaluation, and explication of both the techniques of fabrication and the decisions inherent to artistic creation. For these reasons, the ideal way to study Japanese functional objects is to immerse oneself in the tradition by trying one's hand at the fundamental tools and techniques. This course will combine readings, lectures, and practical hands-on training in two core traditional disciplines: woodworking and ceramics. Traditional hand tools will be provided for students to customize and keep. This dimension of the course is made possible by the generous support of the Halpern Family Foundation. Attempts to broker a place for traditional craftsmanship in a context of mass production are at the core of modern movements such as William Morris's Arts and Crafts, Walter Gropius's Bauhaus, and Yanagi Soetsu's Mingei. This course is designed for students with interests in making, art history, engineering, anthropology, studio, intellectual history, and the material culture of East Asia more generally. No previous technical expertise required. Course taught in English. Venue: PRL",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "223337",
        "number": "JAPAN 126",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "138",
        "title": "Introduction to Modern Japanese Literature and Culture (JAPAN 238)",
        "description": "This class introduces key literary texts from Japan's modern era (1868-present), locating these works in the larger political, social, and cultural trends of the period. The goal of the class is to use literary texts as a point of entry to understand the grand narrative of Japan's journey from its tentative re-entry into the international community in the 1850s, through the cataclysm of the Pacific War, the remarkable prosperity of the bubble years in the 1980s until most recent, post-3/11 catastrophe-evoked Zeitgeist.We will examine a variety of primary texts by such authors as Futabatei Shimei, Higuchi Ichiy&ocirc;, Natsume S&ocirc;seki, Tanizaki Jun'ichir, Miyamoto Yuriko, Kawabata Yasunari, &Ocirc;e Kenzabur&ocirc;, Yoshimoto Banana, Tawada Yko, and Yu Miri among others. Each text will be discussed in detail paying attention to its specific character and contextualized within larger political trends (e.g., the modernization program of the Meiji regime, the policies of Japan's wartime government, and postwar Japanese responses to the cold war), social developments (e.g., changing notions of social class, the women's rights movement, the social effects of the postwar economic expansion, ecocriticism), and cultural movements (e.g., literary reform movement of the 1890s, modernism of the 1920s and 30s, postmodernism of the 1980s, and exophony). Students will also be encouraged to think about the ways these texts relate to each other and a variety of issues beyond the Japanese socio-cultural and historical context.No prior knowledge of Japanese is required for this course, although students with sufficient proficiency are welcome to refer to original sources. Prerequisites: None",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14147",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Reichert, J.",
                                "sunet": "reichert"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-A-II"
        ],
        "objectID": "111420",
        "number": "JAPAN 138",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "141",
        "title": "Japanese Performance Traditions (COMPLIT 218A, JAPAN 241)",
        "description": "Japanese performance traditions present a distinct challenge to modern Western concepts of gender, performance, self-expression, and even the human body itself. This course introduces the socio-historical underpinnings of these traditions, and invites students to engage in a fundamental questioning of the relationship between performance, gender, and cross-cultural interpretation. This course is designed for students with interests in performance, gender, and media as well as those with an interest in Japan. Genres covered include Noh, Kabuki, Bunraku, and Butoh.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222888",
        "number": "JAPAN 141",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "151",
        "title": "Japanese Business Culture and Systems (JAPAN 251)",
        "description": "This is an English-language course about Japanese group dynamics in industrial and corporate systems, negotiating styles, decision making, and crisis management, as well as about strategies for managing intercultural differences. Includes team project to develop strategy and pitch to take an early-stage U.S. firm to the Japan market. Taught by Professor Richard Dasher, Director of the US-Asia Technology Management Center.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32569",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dasher, R.",
                                "sunet": "rdasher"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111389",
        "number": "JAPAN 151",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "151B",
        "title": "The Nature of Knowledge: Science and Literature in East Asia (CHINA 151B, CHINA 251B, JAPAN 251B, KOREA 151, KOREA 251)",
        "description": "&quot;The Nature of Knowledge&quot; explores the intersections of science and humanities East Asia. It covers a broad geographic area (China, Japan, and Korea) along a long temporal space (14th century - present) to investigate how historical notions about the natural world, the human body, and social order defied, informed, and constructed our current categories of science and humanities. The course will make use of medical, geographic, and cosmological treatises from premodern East Asia, portrayals and uses of science in modern literature, film, and media, as well as theoretical and historical essays on the relationships between literature, science, and society.nnAs part of its exploration of science and the humanities in conjunction, the course addresses how understandings of nature are mediated through techniques of narrative, rhetoric, visualization, and demonstration. In the meantime, it also examines how the emergence of modern disciplinary &quot;science&quot; influenced the development of literary language, tropes, and techniques of subject development. This class will expose the ways that science has been mobilized for various ideological projects and to serve different interests, and will produce insights into contemporary debates about the sciences and humanities.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32672",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zur, D.",
                                "sunet": "dafnaz"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220687",
        "number": "JAPAN 151B",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "157S",
        "title": "Tyranny and Resistance: East Asia's Political Culture and Tradition (CHINA 157S, KOREA 157S)",
        "description": "What is tyranny? When does political power cease to be legitimate and government become tyrannical? And what can individuals do in the face of tyranny? This course will explore East Asia's long political tradition through the problem of tyranny and its resistance. We will cover a wide range of material. We begin with how seminal political thinkers in East Asia, including Warring States philosophers such as Mencius and Han Feizi, understood the boundary between legitimate and illegitimate authority. We will also look at the strategies used by various political actors, including government officials, cultural or social elites, and common people, when they confronted what they perceived to be the unjust exercise political power, whether in the form of despotic monarchs, corrupt authorities, or general misrule. Our discussions will be wide-ranging. We will pay particular attention to how these historical examples from China, Korea, and Japan&iquest;s past have resonated with modern and contemporary political discussions in contemporary East Asian societies.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219305",
        "number": "JAPAN 157S",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "158",
        "title": "A Critical and Historical Survey of Classical Japanese Literature (JAPAN 258)",
        "description": "This course presents a broad survey of classical Japanese literature in English translation, with particular emphasis on prose fiction and poetry. We will make use of multiple, complementary modes of literary criticism, beginning with historicism and formalism, which reflect different assumptions and interpretive priorities. The approach is integrative, with attention paid throughout to the intersections between literature, social and institutional history, and religion. Key questions to be explored include the following: How were the major works of classical Japanese literature understood by readers during the medieval and early-modern periods? How did the current canon of classical Japanese literature arise, and what historical forces shaped its development? How might modern modes of literary criticism help us better approach premodern Japanese literature, and what are their limitations?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "218898",
        "number": "JAPAN 158",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "159",
        "title": "The Paranormal in Premodern Japan (JAPAN 259)",
        "description": "This course will explore the various stories of gods, ghosts, demons, and monsters that appear throughout the Premodern period in Japan. The course will use the concept of the paranormal to explore the ways these beings are depicted as living alongside humanity and that humanity can easily and unknowingly enter into the realm of these beings.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "219673",
        "number": "JAPAN 159",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "162",
        "title": "Japanese Poetry and Poetics (JAPAN 262)",
        "description": "Heian through Meiji periods with emphasis on relationships between the social and aesthetic. Works vary each year. This year's genre is the diary. Prerequisites: 246, 247, or equivalent.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "202316",
        "number": "JAPAN 162",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "163",
        "title": "Japanese Performance Traditions (JAPAN 263)",
        "description": "Major paradigms of gender in Japanese performance traditions from ancient to modern times, covering Noh, Kabuki, Bunraku, and Takarazuka.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER:DB-Hum"
        ],
        "objectID": "210925",
        "number": "JAPAN 163",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "163A",
        "title": "Beauty and Renunciation in Japan (HUMCORE 123)",
        "description": "Is it okay to feel pleasure? Should humans choose beauty or renunciation? This is the main controversy of medieval Japan. This course introduces students to the famous literary works that created a world of taste, subtlety, and sensuality. We also read essays that warn against the risks of leading a life of gratification, both in this life and in the afterlife. And we discover together the ways in which these two positions can be not that far from each other. Does love always lead to heartbreak? Is the appreciation of nature compatible with the truths of Buddhism? Is it good to have a family? What kind of house should we build for ourselves? Can fictional stories make us better persons? Each week, during the first class meeting, we will focus on these issues in Japan. During the second class meeting, we will participate in a collaborative conversation with the other students and faculty in Humanities Core classes, about other regions and issues. This course is taught in English. This course is part of the Humanities Core, a collaborative set of global humanities seminars that brings all of its students and faculty into conversation. On Mondays you meet in your own course, and on Wednesdays all the HumCore seminars (in session that quarter) meet together: https://humanitiescore.stanford.edu/.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222850",
        "number": "JAPAN 163A",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "164",
        "title": "Introduction to Premodern Japanese (JAPAN 264)",
        "description": "Readings from Heian, Kamakura, Muromachi, and early Edo periods with focus on grammar and reading comprehension. Prerequisite: JAPANLNG 129B or 103, or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "111549",
        "number": "JAPAN 164",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "165",
        "title": "Readings in Premodern Japanese (JAPAN 265)",
        "description": "Edo and Meiji periods with focus on grammar and reading comprehension. May be repeated for credit. Prerequisite: 246 or equivalent.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "111550",
        "number": "JAPAN 165",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "170",
        "title": "The Tale of Genji and Its Historical Reception (JAPAN 270)",
        "description": "Approaches to the tale including 12th-century allegorical and modern feminist readings. Influence upon other works including poetry, Noh plays, short stories, modern novels, and comic book ( manga) retellings. Prerequisite for graduate students: JAPANLNG 129B or 103, or equivalent.nnThis course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "201887",
        "number": "JAPAN 170",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "188",
        "title": "The Japanese Tea Ceremony: The History, Aesthetics, and Politics Behind a National Pastime (ARTHIST 287A, JAPAN 288)",
        "description": "This course on the Japanese tea ceremony ('water for tea') introduces the world of the first medieval tea-masters and follows the transformation of chanoyu into a popular pastime, a performance art, a get-together of art connoisseurs, and a religious path for samurai warriors, merchants, and artists in early-modern Japan. It also explores the metamorphosis of chanoyu under 20th century nationalisms and during the postwar economic boom, with particular attention to issues of patronage, gender, and social class.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "206610",
        "number": "JAPAN 188",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "191",
        "title": "Sharing Conversations Across Generations: The Magic of Haiku (JAPAN 291)",
        "description": "This course explores what communicative practices can enhance the inclusion of persons living in different life stages in a community.  We consider how verbal or non-verbal interactions can contribute to transforming society into one in which marginalized persons such as older adults (possibly living with compromised cognitive conditions) can be integrated as citizens of the community.  A primary focus is on the role of creative verbal arts in fostering cross-generational understanding, in particular, creating the short Japanese poetic form, haiku. As part of community-engaged learning, students will experience and examine how activities based on creative verbal arts, along with conversations that emerge during such activities, can promote self-expression and meaningful intergenerational connections. As a community-engaged learning course, students will learn through engaging in activities with persons in local communities. The service-learning component will entail participation in a haiku-making activity with older adults in local adult day services facilities and assisted living residences to consider how to create a more age-inclusive society through working with local communities, and to become effective citizens in today's diverse society. This course is open to undergraduate students, graduate students, and medical school students. Students can take the course for 3-5 units. Students enrolled in the full 5 units will complete the service-learning component described above along with the core component of the course. Students enrolled for 3 units do not need to complete the service-learning component. Cardinal Course certified by the Haas Center for Public Service.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course will meet in the Knight Building, room 102.",
                "classId": "28897",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Matsumoto, Y.",
                                "sunet": "yoshikom"
                            },
                            {
                                "name": "Maeda, H.",
                                "sunet": "harumi56"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE",
            "WAY-EDP"
        ],
        "objectID": "225378",
        "number": "JAPAN 191",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "192",
        "title": "Analyzing Japanese Text and Talk (JAPAN 292)",
        "description": "Are there reasons why certain words, phrases, sentences and prosody are chosen by language speakers and writers in specific contexts?  What linguistic and extra-linguistic elements give the hearers and readers the impression that certain utterances and passages are friendly, accusatory, officious, humorous, personal, formal, colloquial, etc.?  This seminar provides an introduction to different theoretical and analytical approaches to studying language use in context (e.g. pragmatics, sociolinguistics, usage-based grammar, conversational analysis, critical discourse analysis) and an opportunity to critically analyze text and talk.  Using the analytical tools acquired through readings and discussions, students will be able to analyze Japanese materials of their selection.  The course is designed for graduate students and advanced undergraduate students with interests either (or both) in Japanese linguistics and literature.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "219308",
        "number": "JAPAN 192",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "193",
        "title": "Acquisition of Japanese as a Second Language (JAPAN 293)",
        "description": "This course provides students with a broad overview of second language acquisition (SLA) research and introduces recent SLA studies on Japanese as a second language (L2). It covers six topics: (1) the evolution of the field, (2) approaches to understanding learner language, (3) current state of knowledge of L2 developmental patterns, (4) theories of L2 learning, (5) factors that affect SLA, and (6) instructed SLA. By reading and discussing exemplary SLA studies on L2 Japanese as well as seminal papers on these topics, students will develop abilities to analyze learner language from multiple perspectives, critically read research reports, and consider implications for L2 teaching.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221986",
        "number": "JAPAN 193",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "195C",
        "title": "Modern Japanese History: From Samurai to Pokemon (HISTORY 195C)",
        "description": "(95C is 3 units; 195C is 5 units.) Japan's modern transformation from the late 19th century to the present. Topics include: the Meiji revolution; industrialization and social dislocation; the rise of democracy and empire; total war and US occupation; economic miracle and malaise; Japan as soft power; and politics of memory. Readings and films focus on the lived experience of ordinary men and women across social classes and regions.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14302",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "200-303",
                        "instructors": [
                            {
                                "name": "Uchida, J.",
                                "sunet": "junu"
                            },
                            {
                                "name": "Chung, Y.",
                                "sunet": "tomoting"
                            },
                            {
                                "name": "Song, H.",
                                "sunet": "hsong76"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "14301",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-GlobalCom",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "115253",
        "number": "JAPAN 195C",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "197",
        "title": "Points in Japanese Grammar (JAPAN 297)",
        "description": "(Formerly JAPANLIT157/257) The course provides practical but in-depth analyses of selected points in Japanese grammar that are often difficult to acquire within the limited hours of language courses. We consider findings from linguistic research, focusing on differences between similar expressions and distinctions that may not be salient in English, with the aim to provide systematic analytical background for more advanced understanding of the language. May be repeated for credit. Prerequisite: JAPANLNG23 or equivalent for JAPAN197; JAPANLNG103 or equivalent for JAPAN297.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32666",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Matsumoto, Y.",
                                "sunet": "yoshikom"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci"
        ],
        "objectID": "201886",
        "number": "JAPAN 197",
        "units": [
            2,
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "212A",
        "title": "Asian Screen Cultures (CHINA 112A, CHINA 212A, JAPAN 112A, KOREA 112, KOREA 212)",
        "description": "Asian screen culture, ranging from cinema to online games, has (re)shaped the global and national/regional imaginings of Asia. The Post-Cold War intensification of intra-Asian interactions has precipitated the rise of a Pan-Asian regional identity wherein the nation-state is not yet obsolete. What role does screen culture plays in the border-crossing interplay among languages, ideologies, aesthetics, and affect? How does the converging media of screen culture capture local/global desires and propel the history of transformation of sign systems from the written words to visual moving images in a digital time? How do we understand the aesthetic, storytelling, and politics of Asian screen cultures vis-&agrave;-vis its historical and social context? While exploring these transnational and transdisciplinary questions, this course will deal with topical issues of Pan-Asian identity, (trans)nationalism, (un)translatability, commodity fetishism, locality and globality, technophobia, and politics of gender. Students will learn how to think and write about screen cultures of East Asia in particular and of our world of screens in general.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222258",
        "number": "JAPAN 212A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "221",
        "title": "Translating Japan, Translating the West (COMPLIT 142B, JAPAN 121)",
        "description": "Translation lies at the heart of all intercultural exchange.  This course introduces students to the specific ways in which translation has shaped the image of Japan in the West, the image of the West in Japan, and Japan's self-image in the modern period. What texts and concepts were translated by each side, how, and to what effect? No prior knowledge of Japanese language necessary.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "209763",
        "number": "JAPAN 221",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "223",
        "title": "Critical Translation Studies (COMPLIT 228, JAPAN 123)",
        "description": "This course does not teach students how to translate, but rather how to incorporate translation into their critical thinking. Critical translation studies comprises wide-ranging ruminations on the complex interplay between languages, cultures, power, and identity. How can we integrate translation into our thinking about the processes that shape literary, political, ethical, and aesthetic sensibilities, and what do we stand to gain by doing so? Course readings introduce key works from inter-lingual perspectives that range across English, Hebrew, French, German, Italian, Spanish, Tagalog, Bengali, Chinese, Japanese, Indonesian, and Qu&eacute;b&eacute;cois. (Students need only have some knowledge of a language other than Standard American English to productively engage with the readings.) Class discussions and workshop assignments are designed to prepare students to integrate critical thinking about translation into their own research and intellectual interests.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221574",
        "number": "JAPAN 223",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "225",
        "title": "Tokyo, Kyoto, Osaka and Beyond: Place in Modern Japan (JAPAN 125)",
        "description": "From the culturally distinct urban centers of Tokyo, Kyoto, and Osaka to the sharp contrasts between the southernmost and northernmost parts of Japan, modern Japanese literature and film present rich characterizations of place that have shaped Japanese identities at the national, regional, and local levels. This course focuses attention on how these settings operate in key works of literature and film, with an eye toward developing students' understanding of diversity within modern Japan. FOR UNDERGRADS: This course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13802",
                "currentClassSize": "0",
                "maxClassSize": "68",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Levy, I.",
                                "sunet": "ilevy"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221988",
        "number": "JAPAN 225",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "226",
        "title": "Japanese Functional Objects (JAPAN 126)",
        "description": "This course focuses on the creation of objects at the boundary between the aesthetic allure of fine art and the utilitarian practicality of everyday life. It is also about how we value the objects with which we surround ourselves, connected to issues that go from sustainability to the intimacy of the handmade - of the little but precise tool marks that evoke the skilled expertise of years spent at the workbench. Traditionally in Japan the distinction between a work of art and a utilitarian object was inessential. An aesthetic object acquired its cultural identity and social value precisely because it could be used. Famous examples of this duality can be found in tea ceremony ceramics, complex architectural joinery, lavish fabric design, and fine temple-inspired cuisine. This is true even for painting and calligraphy: illustrated paper-covered architectural partitions were as useful in keeping a room warm as in serving as the highlight of a social gathering; hanging scrolls and flower arrangements displayed in a purpose-built alcove (tokonoma) conveyed delicate political and cultural messages. At a modern museum, as soon as an object is acquired and accessioned into the collection, it ceases to be available to be touched, smelled, or weighed in one's hands. The only contact with warm bodies comes now through the gloved hands of a few trained professionals. A tokonoma alcove, by contrast, has no glass. What is more, a mere hint by the guest will prompt the host to retrieve the object displayed and offer it for close examination, or, as was often the case, actual use by the guests. The sense of closeness between object and body in premodern Japan was intensified by the fact that users were often makers themselves. Socialized utilization became the perfect venue for the assessment, evaluation, and explication of both the techniques of fabrication and the decisions inherent to artistic creation. For these reasons, the ideal way to study Japanese functional objects is to immerse oneself in the tradition by trying one's hand at the fundamental tools and techniques. This course will combine readings, lectures, and practical hands-on training in two core traditional disciplines: woodworking and ceramics. Traditional hand tools will be provided for students to customize and keep. This dimension of the course is made possible by the generous support of the Halpern Family Foundation. Attempts to broker a place for traditional craftsmanship in a context of mass production are at the core of modern movements such as William Morris's Arts and Crafts, Walter Gropius's Bauhaus, and Yanagi Soetsu's Mingei. This course is designed for students with interests in making, art history, engineering, anthropology, studio, intellectual history, and the material culture of East Asia more generally. No previous technical expertise required. Course taught in English. Venue: PRL",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223337",
        "number": "JAPAN 226",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "235",
        "title": "Academic Readings in Japanese I",
        "description": "Strategies for reading academic writings in Japanese. Readings of scholarly papers and advanced materials in Japanese in students' research areas in the humanities and social sciences. Prerequisites: JAPANLNG 103, 129B, or equivalent; and consent of instructor. May be repeat for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "206274",
        "number": "JAPAN 235",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "238",
        "title": "Introduction to Modern Japanese Literature and Culture (JAPAN 138)",
        "description": "This class introduces key literary texts from Japan's modern era (1868-present), locating these works in the larger political, social, and cultural trends of the period. The goal of the class is to use literary texts as a point of entry to understand the grand narrative of Japan's journey from its tentative re-entry into the international community in the 1850s, through the cataclysm of the Pacific War, the remarkable prosperity of the bubble years in the 1980s until most recent, post-3/11 catastrophe-evoked Zeitgeist.We will examine a variety of primary texts by such authors as Futabatei Shimei, Higuchi Ichiy&ocirc;, Natsume S&ocirc;seki, Tanizaki Jun'ichir, Miyamoto Yuriko, Kawabata Yasunari, &Ocirc;e Kenzabur&ocirc;, Yoshimoto Banana, Tawada Yko, and Yu Miri among others. Each text will be discussed in detail paying attention to its specific character and contextualized within larger political trends (e.g., the modernization program of the Meiji regime, the policies of Japan's wartime government, and postwar Japanese responses to the cold war), social developments (e.g., changing notions of social class, the women's rights movement, the social effects of the postwar economic expansion, ecocriticism), and cultural movements (e.g., literary reform movement of the 1890s, modernism of the 1920s and 30s, postmodernism of the 1980s, and exophony). Students will also be encouraged to think about the ways these texts relate to each other and a variety of issues beyond the Japanese socio-cultural and historical context.No prior knowledge of Japanese is required for this course, although students with sufficient proficiency are welcome to refer to original sources. Prerequisites: None",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14148",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Reichert, J.",
                                "sunet": "reichert"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111420",
        "number": "JAPAN 238",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "239",
        "title": "Modern Japanese Short Stories",
        "description": "This course explores the postwar Japanese short story. We will read representative works by major authors, such as Ishikawa Jun, Hayashi Fumiko, Abe Kobe and Murakami Haruki.  Attention will be devoted to both accurate reading of the Japanese prose and more general discussion of the literary features of the texts.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "211960",
        "number": "JAPAN 239",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "241",
        "title": "Japanese Performance Traditions (COMPLIT 218A, JAPAN 141)",
        "description": "Japanese performance traditions present a distinct challenge to modern Western concepts of gender, performance, self-expression, and even the human body itself. This course introduces the socio-historical underpinnings of these traditions, and invites students to engage in a fundamental questioning of the relationship between performance, gender, and cross-cultural interpretation. This course is designed for students with interests in performance, gender, and media as well as those with an interest in Japan. Genres covered include Noh, Kabuki, Bunraku, and Butoh.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222888",
        "number": "JAPAN 241",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "251",
        "title": "Japanese Business Culture and Systems (JAPAN 151)",
        "description": "This is an English-language course about Japanese group dynamics in industrial and corporate systems, negotiating styles, decision making, and crisis management, as well as about strategies for managing intercultural differences. Includes team project to develop strategy and pitch to take an early-stage U.S. firm to the Japan market. Taught by Professor Richard Dasher, Director of the US-Asia Technology Management Center.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32570",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dasher, R.",
                                "sunet": "rdasher"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111389",
        "number": "JAPAN 251",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "251B",
        "title": "The Nature of Knowledge: Science and Literature in East Asia (CHINA 151B, CHINA 251B, JAPAN 151B, KOREA 151, KOREA 251)",
        "description": "&quot;The Nature of Knowledge&quot; explores the intersections of science and humanities East Asia. It covers a broad geographic area (China, Japan, and Korea) along a long temporal space (14th century - present) to investigate how historical notions about the natural world, the human body, and social order defied, informed, and constructed our current categories of science and humanities. The course will make use of medical, geographic, and cosmological treatises from premodern East Asia, portrayals and uses of science in modern literature, film, and media, as well as theoretical and historical essays on the relationships between literature, science, and society.nnAs part of its exploration of science and the humanities in conjunction, the course addresses how understandings of nature are mediated through techniques of narrative, rhetoric, visualization, and demonstration. In the meantime, it also examines how the emergence of modern disciplinary &quot;science&quot; influenced the development of literary language, tropes, and techniques of subject development. This class will expose the ways that science has been mobilized for various ideological projects and to serve different interests, and will produce insights into contemporary debates about the sciences and humanities.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32669",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Zur, D.",
                                "sunet": "dafnaz"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220687",
        "number": "JAPAN 251B",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "253",
        "title": "Japanese Graduate Seminar: Translation Theory & Premodern Literature",
        "description": "Translation Theory &amp; Premodern Literature course",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220102",
        "number": "JAPAN 253",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "258",
        "title": "A Critical and Historical Survey of Classical Japanese Literature (JAPAN 158)",
        "description": "This course presents a broad survey of classical Japanese literature in English translation, with particular emphasis on prose fiction and poetry. We will make use of multiple, complementary modes of literary criticism, beginning with historicism and formalism, which reflect different assumptions and interpretive priorities. The approach is integrative, with attention paid throughout to the intersections between literature, social and institutional history, and religion. Key questions to be explored include the following: How were the major works of classical Japanese literature understood by readers during the medieval and early-modern periods? How did the current canon of classical Japanese literature arise, and what historical forces shaped its development? How might modern modes of literary criticism help us better approach premodern Japanese literature, and what are their limitations?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "218898",
        "number": "JAPAN 258",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "259",
        "title": "The Paranormal in Premodern Japan (JAPAN 159)",
        "description": "This course will explore the various stories of gods, ghosts, demons, and monsters that appear throughout the Premodern period in Japan. The course will use the concept of the paranormal to explore the ways these beings are depicted as living alongside humanity and that humanity can easily and unknowingly enter into the realm of these beings.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "219673",
        "number": "JAPAN 259",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "262",
        "title": "Japanese Poetry and Poetics (JAPAN 162)",
        "description": "Heian through Meiji periods with emphasis on relationships between the social and aesthetic. Works vary each year. This year's genre is the diary. Prerequisites: 246, 247, or equivalent.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "202316",
        "number": "JAPAN 262",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "263",
        "title": "Japanese Performance Traditions (JAPAN 163)",
        "description": "Major paradigms of gender in Japanese performance traditions from ancient to modern times, covering Noh, Kabuki, Bunraku, and Takarazuka.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "210925",
        "number": "JAPAN 263",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "264",
        "title": "Introduction to Premodern Japanese (JAPAN 164)",
        "description": "Readings from Heian, Kamakura, Muromachi, and early Edo periods with focus on grammar and reading comprehension. Prerequisite: JAPANLNG 129B or 103, or equivalent.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "111549",
        "number": "JAPAN 264",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "265",
        "title": "Readings in Premodern Japanese (JAPAN 165)",
        "description": "Edo and Meiji periods with focus on grammar and reading comprehension. May be repeated for credit. Prerequisite: 246 or equivalent.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course will meet in the Knight Building, room 201.",
                "classId": "31088",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Reichert, J.",
                                "sunet": "reichert"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111550",
        "number": "JAPAN 265",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "270",
        "title": "The Tale of Genji and Its Historical Reception (JAPAN 170)",
        "description": "Approaches to the tale including 12th-century allegorical and modern feminist readings. Influence upon other works including poetry, Noh plays, short stories, modern novels, and comic book ( manga) retellings. Prerequisite for graduate students: JAPANLNG 129B or 103, or equivalent.nnThis course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "201887",
        "number": "JAPAN 270",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "279",
        "title": "Research in Japanese Linguistics",
        "description": "This proseminar introduces Japanese linguistics research to graduate students and advanced undergraduate students.  Through readings and discussions, students will familiarize themselves with materials and references in both English and Japanese in preparation for conducting research effectively in their own areas of interest in Japanese linguistics.  They learn the organization and presentation of research projects and conduct a pilot project in their selected area of interest. May be repeated for credit. Prerequisite: JAPANLNG 103 or consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32660",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Matsumoto, Y.",
                                "sunet": "yoshikom"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210900",
        "number": "JAPAN 279",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "287",
        "title": "Pictures of the Floating World: Images from Japanese Popular Culture (ARTHIST 287, ARTHIST 487X)",
        "description": "Printed objects produced during the Edo period (1600-1868), including the Ukiyo-e (pictures of the floating world) and lesser-studied genres such as printed books (ehon) and popular broadsheets (kawaraban). How a society constructs itself through images. The borders of the acceptable and censorship; theatricality, spectacle, and slippage; the construction of play, set in conflict against the dominant neo-Confucian ideology of fixed social roles.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "110948",
        "number": "JAPAN 287",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "288",
        "title": "The Japanese Tea Ceremony: The History, Aesthetics, and Politics Behind a National Pastime (ARTHIST 287A, JAPAN 188)",
        "description": "This course on the Japanese tea ceremony ('water for tea') introduces the world of the first medieval tea-masters and follows the transformation of chanoyu into a popular pastime, a performance art, a get-together of art connoisseurs, and a religious path for samurai warriors, merchants, and artists in early-modern Japan. It also explores the metamorphosis of chanoyu under 20th century nationalisms and during the postwar economic boom, with particular attention to issues of patronage, gender, and social class.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "206610",
        "number": "JAPAN 288",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "291",
        "title": "Sharing Conversations Across Generations: The Magic of Haiku (JAPAN 191)",
        "description": "This course explores what communicative practices can enhance the inclusion of persons living in different life stages in a community.  We consider how verbal or non-verbal interactions can contribute to transforming society into one in which marginalized persons such as older adults (possibly living with compromised cognitive conditions) can be integrated as citizens of the community.  A primary focus is on the role of creative verbal arts in fostering cross-generational understanding, in particular, creating the short Japanese poetic form, haiku. As part of community-engaged learning, students will experience and examine how activities based on creative verbal arts, along with conversations that emerge during such activities, can promote self-expression and meaningful intergenerational connections. As a community-engaged learning course, students will learn through engaging in activities with persons in local communities. The service-learning component will entail participation in a haiku-making activity with older adults in local adult day services facilities and assisted living residences to consider how to create a more age-inclusive society through working with local communities, and to become effective citizens in today's diverse society. This course is open to undergraduate students, graduate students, and medical school students. Students can take the course for 3-5 units. Students enrolled in the full 5 units will complete the service-learning component described above along with the core component of the course. Students enrolled for 3 units do not need to complete the service-learning component. Cardinal Course certified by the Haas Center for Public Service.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31085",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Matsumoto, Y.",
                                "sunet": "yoshikom"
                            },
                            {
                                "name": "Maeda, H.",
                                "sunet": "harumi56"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225378",
        "number": "JAPAN 291",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "292",
        "title": "Analyzing Japanese Text and Talk (JAPAN 192)",
        "description": "Are there reasons why certain words, phrases, sentences and prosody are chosen by language speakers and writers in specific contexts?  What linguistic and extra-linguistic elements give the hearers and readers the impression that certain utterances and passages are friendly, accusatory, officious, humorous, personal, formal, colloquial, etc.?  This seminar provides an introduction to different theoretical and analytical approaches to studying language use in context (e.g. pragmatics, sociolinguistics, usage-based grammar, conversational analysis, critical discourse analysis) and an opportunity to critically analyze text and talk.  Using the analytical tools acquired through readings and discussions, students will be able to analyze Japanese materials of their selection.  The course is designed for graduate students and advanced undergraduate students with interests either (or both) in Japanese linguistics and literature.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "219308",
        "number": "JAPAN 292",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "293",
        "title": "Acquisition of Japanese as a Second Language (JAPAN 193)",
        "description": "This course provides students with a broad overview of second language acquisition (SLA) research and introduces recent SLA studies on Japanese as a second language (L2). It covers six topics: (1) the evolution of the field, (2) approaches to understanding learner language, (3) current state of knowledge of L2 developmental patterns, (4) theories of L2 learning, (5) factors that affect SLA, and (6) instructed SLA. By reading and discussing exemplary SLA studies on L2 Japanese as well as seminal papers on these topics, students will develop abilities to analyze learner language from multiple perspectives, critically read research reports, and consider implications for L2 teaching.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "221986",
        "number": "JAPAN 293",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "296",
        "title": "Modern Japanese Literature",
        "description": "Advanced readings in modern Japanese literature. May be repeated for credit. Prerequisite: JAPANLNG 213.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "111560",
        "number": "JAPAN 296",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "297",
        "title": "Points in Japanese Grammar (JAPAN 197)",
        "description": "(Formerly JAPANLIT157/257) The course provides practical but in-depth analyses of selected points in Japanese grammar that are often difficult to acquire within the limited hours of language courses. We consider findings from linguistic research, focusing on differences between similar expressions and distinctions that may not be salient in English, with the aim to provide systematic analytical background for more advanced understanding of the language. May be repeated for credit. Prerequisite: JAPANLNG23 or equivalent for JAPAN197; JAPANLNG103 or equivalent for JAPAN297.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32667",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Matsumoto, Y.",
                                "sunet": "yoshikom"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "201886",
        "number": "JAPAN 297",
        "units": [
            2,
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "298",
        "title": "The Theory and Practice of Japanese Literary Translation",
        "description": "Theory and cultural status of translation in modern Japanese and English. Comparative analysis of practical translation strategies. Final project is a literary translation of publishable quality. Prerequisite: fourth-year Japanese or consent of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "111555",
        "number": "JAPAN 298",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "381",
        "title": "Topics in Pragmatics and Discourse Analysis",
        "description": "Naturally occurring discourse (conversational, narrative, or written) and theoretical implications. Discourse of different age groups, expressions of identity and persona, and individual styles. May be repeated for credit.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "204275",
        "number": "JAPAN 381",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "382",
        "title": "Research Projects in Japanese Linguistics",
        "description": "For advanced graduate students with specific research projects in Japanese linguistics. Consent of instructor is required before enrollment.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216851",
        "number": "JAPAN 382",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "383",
        "title": "Language and Aging in Japan",
        "description": "A seminar examining multifaceted issues found in the intersection of language and aging.  The primary focus is given to the language uses and people in Japan.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225105",
        "number": "JAPAN 383",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "389",
        "title": "Seminar in Premodern Japanese Literature",
        "description": "This graduate seminar examines the major texts, genres, and conceptual developments in the field of premodern Japanese literary studies. It combines three approaches: 1) Reading seminar covering texts in the original Japanese in annotated print editions. 2) Review of current scholarly works in English and Japanese. 3) Methodology and bibliography workshop on digital and analog tools available to the researcher. On a rotating basis we will focus on the Ancient and Classical periods, the Medieval period, and the Early Modern period.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222119",
        "number": "JAPAN 389",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "392D",
        "title": "Japan in Asia, Asia in Japan (HISTORY 292D, HISTORY 392D)",
        "description": "(History 292D is an undergraduate course offered for 5 units; History 392D is a graduate course offered for 4-5 units.) How Japan and Asia mutually shaped each other in the late 19th and 20th centuries. Focus is on Japanese imperialism in Asia and its postwar legacies. Topics include: pan-Asianism and orientalism; colonial modernization in Korea and Taiwan; collaboration and resistance; popular imperialism in Manchuria; total war and empire; comfort women and the politics of apology; the issue of resident Koreans; and economic and cultural integration of postwar Asia.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "29278",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Uchida, J.",
                                "sunet": "junu"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "204443",
        "number": "JAPAN 392D",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "396",
        "title": "Seminar in Modern Japanese Literature",
        "description": "Works and topics vary each year. May be repeated for credit.  Prerequisite: fourth-year Japanese or consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course will meet in the Knight Building, room K201.",
                "classId": "14425",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Reichert, J.",
                                "sunet": "reichert"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14867",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Levy, I.",
                                "sunet": "ilevy"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 69600.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "111554",
        "number": "JAPAN 396",
        "units": [
            2,
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "JAPAN",
        "code": "396D",
        "title": "Historiography of Modern Japan (HISTORY 396D)",
        "description": "Introduces students to the major historical problems and historiographic trends in the study of modern Japan from the Meiji period to the present.  Themes include approaches to late Meiji culture and politics, the formation of imperial subjects and citizens, agrarian society and politics, gender in modern Japan, empire and modernity, total war and transwar state and society, U.S. occupation, and postwar Japan.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "115935",
        "number": "JAPAN 396D",
        "units": [
            4,
            5
        ]
    }
]