[
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "4",
        "title": "What Didn't Make the Bible (CLASSICS 9N, HISTORY 112C, RELIGST 4)",
        "description": "Over two billion people alive today consider the Bible to be sacred scripture. But how did the books that made it into the bible get there in the first place? Who decided what was to be part of the bible and what wasn't? How would history look differently if a given book didn't make the final cut and another one did? Hundreds of ancient Jewish and Christian texts are not included in the Bible. &quot;What Didn't Make It in the Bible&quot; focuses on these excluded writings. We will explore the Dead Sea Scrolls, Gnostic gospels, hear of a five-year-old Jesus throwing temper tantrums while killing (and later resurrecting) his classmates, peruse ancient romance novels, explore the adventures of fallen angels who sired giants (and taught humans about cosmetics), tour heaven and hell, encounter the garden of Eden story told from the perspective of the snake, and learn how the world will end. The course assumes no prior knowledge of Judaism, Christianity, the bible, or ancient history. It is designed for students who are part of faith traditions that consider the bible to be sacred, as well as those who are not. The only prerequisite is an interest in exploring books, groups, and ideas that eventually lost the battles of history and to keep asking the question &quot;why.&quot; In critically examining these ancient narratives and the communities that wrote them, you will investigate how religions canonize a scriptural tradition, better appreciate the diversity of early Judaism and Christianity, understand the historical context of these religions, and explore the politics behind what did and did not make it into the bible.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31887",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "STLC 115",
                        "instructors": [
                            {
                                "name": "Penn, M.",
                                "sunet": "mppenn"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "221622",
        "number": "JEWISHST 4",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "5",
        "title": "Biblical Greek (CLASSICS 6G, RELIGST 171A)",
        "description": "This is a one term intensive class in Biblical Greek.  After quickly learning the basics of the language, we will then dive right into readings from the New Testament and the Septuagint, which is the ancient Greek translation of the Hebrew Bible.  No previous knowledge of Greek required.  If demand is high for a second term, an additional quarter will be offered in the Spring.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "208191",
        "number": "JEWISHST 5",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "5B",
        "title": "Biblical Greek (CLASSICS 7G)",
        "description": "This is a continuation of the Winter Quarter Biblical Greek Course. Pre-requisite: CLASSICS 6G or a similar introductory course in Ancient Greek.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "213012",
        "number": "JEWISHST 5B",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "12S",
        "title": "Multiculturalism in the Middle Ages: Muslims, Christians, and Jews in Medieval Spain (HISTORY 12S)",
        "description": "Before the year 1492, Spain had been a dynamic and complex region of Muslim and Christian kingdoms populated by Christians, Muslims, and Jews for nearly 800 years. What political, economic, and military exchanges took place among peoples of the three faiths in medieval Spain? Did community leaders and governments attempt to regulate and prohibit fluid identity boundaries? How has 20th-century Spanish nationalism shaped our understanding of medieval Spain? How have 21st-century questions of multiculturalism impacted our view of medieval Spain? These are the kinds of questions that this course will explore through chronicles, poetry, letters, legal documents, art, and architecture.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "223626",
        "number": "JEWISHST 12S",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "14B",
        "title": "The Crusades: A Global History (HISTORY 14B)",
        "description": "(HISTORY 14B is 3 units; HISTORY 114B is 5 units.) Questioning traditional western narratives of the crusades, this course studies Latin and Turkic invaders as rival barbarian formations, and explores the societies of western Afro-Eurasia and the Mediterranean in the centuries before western European global expansion. We approach the crusades as a &quot;Christianized Viking raid,&quot; and investigate an array of Muslim, Christian, and Jewish sources. In so doing, we emphasize the diversity of perspectives within the Muslim, Christian, and Jewish communities: in the Muslim case, the tangle of Turkic, Arab, and Berber ethnicities; in the Jewish case, Hebrew, Arabic, and Turkic speakers ranging from the Iberian peninsula to India; in the Christian case, the fragmented Greek, Latin, and Arabic traditions. We explore how these barbarian invasions transformed the societies of western Afro-Eurasia, how ancient Greek knowledge in Islamic translation came to medieval Europe, and how a fragmenting Byzantine Empire gave way to the rise of the Ottoman Empire. However foreign, the interactions and encounters between these societies continue to reverberate today.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223620",
        "number": "JEWISHST 14B",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "14S",
        "title": "Conversion in Ancient and Medieval Judaism, Christianity, and Islam (HISTORY 14S)",
        "description": "In the third century, a group of Roman soldiers submerged themselves in baptismal waters in the Syrian desert and became Christians, a radical act. A thousand years later, the Jews of Spain were forced to do the same; in 1391, their mass forced baptisms sparked widespread panic. Traces of these historical events, and countless others like them, survive in texts, manuscripts and archeological remains, and prompt the following questions: how did people of the past judge the &quot;authenticity&quot; of a religious conversion?  What was the relationship between religion, culture, ethnicity, and race? Was religion an internal conviction, or a cultural practice?  This course will explore conversions, both willing and forced, in Europe, the Middle East and North Africa from Antiquity to the Renaissance. Our exploration will focus on conversions among the three Abrahamic traditions: Judaism, Christianity, and Islam",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224330",
        "number": "JEWISHST 14S",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "31Q",
        "title": "Resistance and Collaboration in Hitler's Europe (HISTORY 31Q)",
        "description": "What is resistance and what did it entail in Nazi-occupied Europe? What prompted some to resist, while others accommodated or actively collaborated with the occupiers? How have postwar societies remembered their resistance movements and collaborationists? This seminar examines how Europeans responded to the Nazi order during World War II. We will explore experiences under occupation; dilemmas the subject peoples faced; the range of resistance motivations, goals, activities, and strategies; and postwar memorialization. Select cases from Western, Eastern, and Mediterranean Europe.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "219221",
        "number": "JEWISHST 31Q",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "37Q",
        "title": "Zionism and the Novel (COMPLIT 37Q)",
        "description": "At the end of the nineteenth century, Zionism emerged as a political movement to establish a national homeland for the Jews, eventually leading to the establishment of the State of Israel in 1948. This seminar uses novels to explore the changes in Zionism,  the roots of the conflict in the Middle East, and the potentials for the future. We will take a close look at novels by Israelis, both Jewish and Arab, in order to understand multiple perspectives, and we will also consider works by authors from the North America and from Europe. Note: This course must be taken for a letter grade to be eligible for WAYS credit.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "14364",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "160-322",
                        "instructors": [
                            {
                                "name": "Berman, R.",
                                "sunet": "berman"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP",
            "Writing 2"
        ],
        "objectID": "215452",
        "number": "JEWISHST 37Q",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "39S",
        "title": "The Other Side: Ethnography and Travel Writing through Jewish, Christian and Muslim Eyes",
        "description": "In an age of reality television and social media, we are bombarded with snapshots of the exotic, monstrous, and bizarre. Yet despite their quantity, these images pale in comparison to the qualities of terror, wonder and curiosity that ancient travelers evoked in their encounters with foreign lands and peoples. Early ethnographers, too, painstakingly explored the beliefs and practices of unfamiliar peoples sometimes very close to home. This course surveys their most vivid writings, from ancient Greece to the colonization of the New World, focusing on the relation between fascination with the other and the author's own religious imagination. In particular, it introduces the contributions of Jewish travelers and ethnographers to this history, which has often been written from the standpoint of imperial, ecclesiastical or colonial power. It stresses literary continuities across three general periods (ancient, medieval, and colonial), showing how remarkably consistent patterns of identification spring from diverse encounters.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "219037",
        "number": "JEWISHST 39S",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "53",
        "title": "Exploring Jewish Spirituality (RELIGST 53)",
        "description": "It was once accepted as fact that Judaism is, at its core, a rational religion devoid of any authentic mystical tradition. But the past century of scholarship has reversed this claim, demonstrating that the spiritual life has been integral to Judaism's vital heart since ancient times. This yearning for a direct immediate experience of God's Presence, a longing to grasp the mysteries of the human soul and know the inner dynamics of the Divine realm, has taken on many different forms across the centuries. &lt;br&gt;This course will introduce students to the major texts--from theological treatises to poems and incantations--and core ideas of Jewish mysticism and spirituality, tracking their development from the Hebrew Bible to the dawn of modernity. Close attention will be paid to the historical context of these sources, and we will also engage with broader methodological approaches--from phenomenology to philology--regarding the academic study of religion and the comparative consideration of mysticism in particular. &lt;br&gt;This course assumes no prior background of Judaism or any other religious traditions. All readings will be made available in English. Students are, however, invited to challenge themselves with the &quot;optional/advanced&quot; readings of sources both primary and secondary. Pending interest, students with facility in the original languages (Hebrew or Aramaic) will be given the opportunity to do so.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "219273",
        "number": "JEWISHST 53",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "77",
        "title": "\"Jewish\" in 7 Concepts",
        "description": "This course explores Jewish religion, history, and culture by tracing seven key concepts that shape what we mean when we say &quot;Jewish.&quot; This course offers a gateway for students pursuing a minor in Jewish Studies or a degree in CSRE, but is open to everyone. The course will include visits from Stanford Jewish Studies core faculty members who will share their approaches to the concepts from their respective fields in history, religious studies, and literature.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224613",
        "number": "JEWISHST 77",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "80A",
        "title": "Jewish Music of the Diaspora (MUSIC 80A)",
        "description": "Through the perspective of Jewish music, the students will be exposed to diverse musical cultures from around the globe while simultaneously being exposed to the rich and multi-faceted cultures of Jewish music. Because the Jews were dispersed around the globe, discrete musical styles and genres evolved for the same texts. The various styles differ from each other in their tonal and rhythmic organizations; instrumentation, tora recitations.&nbsp;&nbsp;The course examines these aspects as well as the influence of Jewish music on classical music and vice versa. No prior knowledge of Jewish history, Judaism and music theory is required. &nbsp;",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "15053",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Braun 105",
                        "instructors": [
                            {
                                "name": "Berger, T.",
                                "sunet": "talyab"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224137",
        "number": "JEWISHST 80A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "85B",
        "title": "Jews in the Contemporary World:  Culture, Pop Culture, and Representation (HISTORY 85B, REES 85B)",
        "description": "(HISTORY 85B is 3 units; HISTORY 185B is 5 units.) From Barbra Streisand to Volodymyr Zelenskyy, from The Dybbuk to Broad City, and from Moscow to LA, this course applies a multicultural perspective on different experiences of Jewishness in the 20th and 21st centuries. The discussion is centered on the ways in which these experiences are represented in various types of media: in literature or on TikTok, in poetry or on Instagram, in film and on television. The themes of the course include (but are not limited to) the interplay of national, religious, ethnic, linguistic, and political identities,  intersectionality, the definitions and boundaries of Jewish cultures, Queer and variously gendered experiences of Jewishness, as well as antisemitism and stereotyped representations of Jewishness. The course introduces students to the analysis of a diverse array of media as cultural texts and historical sources. Students are encouraged to apply their new skills to media of their choice.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "212057",
        "number": "JEWISHST 85B",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "86",
        "title": "Exploring the New Testament (CLASSICS 43, RELIGST 86)",
        "description": "To explore the historical context of the earliest Christians, students will read most of the New Testament as well as many documents that didn't make the final cut. Non-Christian texts, Roman art, and surviving archeological remains will better situate Christianity within the ancient world. Students will read from the Dead Sea Scrolls, explore Gnostic gospels, hear of a five-year-old Jesus throwing divine temper tantrums while killing (and later resurrecting) his classmates, peruse an ancient marriage guide, and engage with recent scholarship in archeology, literary criticism, and history.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "214458",
        "number": "JEWISHST 86",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "86Q",
        "title": "Blood and Money: The Origins of Antisemitism (HISTORY 86Q)",
        "description": "For over two millennia, Jews and Judaism have been the object of sustained anxieties, fears, and fantasies, which have in turn underpinned repeated outbreaks of violence and persecution. This course will explore the development and impact of antisemitism from Late Antiquity to the Enlightenment, including the emergence of the Blood libel, the association between Jews and moneylending, and the place of Judaism in Christian and Islamic theology. No prior background in history or Jewish studies is necessary. Prerequisite: PWR 1.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "32782",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dorin, R.",
                                "sunet": "dorin"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI",
            "Writing 2"
        ],
        "objectID": "219182",
        "number": "JEWISHST 86Q",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "101A",
        "title": "First-Year Hebrew, First Quarter (AMELANG 128A)",
        "description": "In the first-year program, students acquire essential Hebrew through abundant opportunities to interact in the language in meaningful ways. The  students learn to function appropriately in the language in a variety of social and cultural contexts.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": null,
                "classId": "11003",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "8:30:00 AM",
                        "endTime": "9:20:00 AM",
                        "location": "Thornton 207",
                        "instructors": [
                            {
                                "name": "Tadmor, J.",
                                "sunet": "jtadmor"
                            }
                        ],
                        "startTimestamp": 30600.0,
                        "endTimestamp": 33600.0,
                        "days": "Monday Tuesday Wednesday Thursday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "119332",
        "number": "JEWISHST 101A",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "101B",
        "title": "First-Year Hebrew, Second Quarter (AMELANG 128B)",
        "description": "Continuation of AMELANG 128A. Prerequisite: Placement Test,  AMELANG 128A.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": null,
                "classId": "10840",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "8:30:00 AM",
                        "endTime": "9:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Porat, G.",
                                "sunet": "gporat"
                            }
                        ],
                        "startTimestamp": 30600.0,
                        "endTimestamp": 33600.0,
                        "days": "Monday Tuesday Wednesday Thursday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "119333",
        "number": "JEWISHST 101B",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "101C",
        "title": "First-Year Hebrew, Third Quarter (AMELANG 128C)",
        "description": "Continuation of AMELANG 128B. Prerequisite: Placement Test, AMELANG 128B. Fulfill the University Foreign Language Requirement.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": "Satisfies University Language Requirement.",
                "classId": "11290",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "8:30:00 AM",
                        "endTime": "9:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Porat, G.",
                                "sunet": "gporat"
                            }
                        ],
                        "startTimestamp": 30600.0,
                        "endTimestamp": 33600.0,
                        "days": "Monday Tuesday Wednesday Thursday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "Language"
        ],
        "objectID": "119334",
        "number": "JEWISHST 101C",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "102A",
        "title": "Second-Year Hebrew, First Quarter (AMELANG 129A)",
        "description": "Continuation of AMELANG 128C. Sequence integrating culture and language. Emphasis is on proficiency in oral and written discourse including presentational language and socio culturally appropriate discourse in formal and informal, academic, and professional contexts. Prerequisite: Placement Test, First Year Hebrew .",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": null,
                "classId": "11005",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Thornton 207",
                        "instructors": [
                            {
                                "name": "Porat, G.",
                                "sunet": "gporat"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "Language"
        ],
        "objectID": "119335",
        "number": "JEWISHST 102A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "102B",
        "title": "Second-Year Hebrew, Second Quarter (AMELANG 129B)",
        "description": "Continuation of AMELANG 129A. Sequence integrating culture and language. Emphasis is on proficiency in oral and written discourse including presentational language and socio culturally appropriate discourse in formal and informal, academic, and professional contexts. Prerequisite: Placement Test, Hebrew 129A.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "119336",
        "number": "JEWISHST 102B",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "102C",
        "title": "Second-Year Hebrew, Third Quarter (AMELANG 129C)",
        "description": "Continuation of AMELANG 129B. Sequence integrating culture and language. Emphasis is on advanced proficiency in oral and written discourse including presentational language and socio culturally appropriate discourse in formal and informal, academic, and professional contexts. Prerequisite: placement Test, Hebrew129B.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "Language"
        ],
        "objectID": "119337",
        "number": "JEWISHST 102C",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "103A",
        "title": "Third-Year Hebrew, First Quarter (AMELANG 130A)",
        "description": "Continuation of AMELANG 129C. Prerequisite: Placement Test, AMELANG 129C.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "119338",
        "number": "JEWISHST 103A",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "104",
        "title": "Hebrew Forum (AMELANG 131A)",
        "description": "Intermediate and advanced level. Biweekly Hebrew discussion on contemporary issues with Israeli guest speakers. Vocabulary enhancement. Focus on exposure to academic Hebrew. May be repeat for credit up to 4 times",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "200313",
        "number": "JEWISHST 104",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "104A",
        "title": "First-Year Yiddish, First Quarter (AMELANG 140A)",
        "description": "Reading, writing, and speaking.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": null,
                "classId": "12239",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": "260-241",
                        "instructors": [
                            {
                                "name": "Levitow, J.",
                                "sunet": "jnlvtw"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "204221",
        "number": "JEWISHST 104A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "104B",
        "title": "First-Year Yiddish, Second Quarter (AMELANG 140B)",
        "description": "Continuation of AMELANG 140A. Prerequisite: AMELANG.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": null,
                "classId": "15509",
                "currentClassSize": "0",
                "maxClassSize": "6",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Levitow, J.",
                                "sunet": "jnlvtw"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "204556",
        "number": "JEWISHST 104B",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "104C",
        "title": "First-Year Yiddish, Third Quarter (AMELANG 140C)",
        "description": "Continuation of AMELANG 140B. Prerequisite: AMELANG 140B. Fulfills the University Foreign Language Requirement.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LNG",
                "notes": "Satisfies University Language Requirement.",
                "classId": "12453",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Levitow, J.",
                                "sunet": "jnlvtw"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "Language"
        ],
        "objectID": "204557",
        "number": "JEWISHST 104C",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "105",
        "title": "Hebrew Forum (AMELANG 131B)",
        "description": "Intermediate and advanced level. Biweekly Hebrew discussion on contemporary issues with Israeli guest speakers. Vocabulary enhancement. Focus on exposure to academic Hebrew. May  repeat for credit",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "214325",
        "number": "JEWISHST 105",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "107A",
        "title": "Biblical Hebrew, First Quarter (RELIGST 170A)",
        "description": "Establish a basic familiarity with the grammar and vocabulary of  Biblical Hebrew and will begin developing a facility with the language. Students that are enrolled in this course must also enroll in Beginning Hebrew. This course requires no prior knowledge of Hebrew and will begin with learning the alphabet. By the end of the year, students will be able to translate basic biblical texts, will be familiar with common lexica and reference grammars, and will have sufficient foundational knowledge to enable them to continue expanding their knowledge either in a subsequent course or own their own.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "203826",
        "number": "JEWISHST 107A",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "112",
        "title": "Passing: Hidden Identities Onscreen (CSRE 113, FEMGEN 112)",
        "description": "Characters who are Jewish, Black, Latinx, women, and LGBTQ often conceal their identities - or &quot;pass&quot; - in Hollywood film. Our course will trace how Hollywood has depicted&quot;passing&quot; from the early 20th century to the present. Just a few of our films will include Gentleman's Agreement (1947), Imitation of Life (1959), School Ties (1992), White Chicks (2004), and Blackkklansman (2018). Through these films, we will explore the overlaps and differences between antisemitism, racism, misogyny, and queerphobia, both onscreen and in real life. In turn, we will also study the ideological role of passing films: how they thrill audiences by challenging social boundaries and hierarchies, only to reestablish familiar boundaries by the end. With this contradiction, passing films often help audiences to feel enlightened without actually challenging the oppressive status quo. Thus, we will not treat films as accurate depictions of real-world passing, but rather as cultural tools that help audiences to manage ideological contradictions about race, gender, sexuality, and class. Students will finish the course by creating their own short films about passing.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32401",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Branfman, J.",
                                "sunet": "branfman"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "224437",
        "number": "JEWISHST 112",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "115",
        "title": "Understanding Jews (AMSTUD 215)",
        "description": "This discussion-based course will give students an opportunity to explore the constellation of religious, ethnic, national, cultural, artistic, spiritual, and political forces that shape Jewish life in the 21st century.  Drawing on historical documents, classical texts, and contemporary events, this course will give students from any background an opportunity to ask hard questions, deepen their own understandings, and challenge their conceptions of what makes Jewish life 'Jewish.'  No matter where you went for Sunday school - church, synagogue, the woods, or nowhere at all - this course is a chance to question what you know, and interrogate how you came to know what you know about Jews, Judaism, and Jewish culture.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30922",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "5:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": "320-109",
                        "instructors": [
                            {
                                "name": "Kelman, A.",
                                "sunet": "aykelman"
                            }
                        ],
                        "startTimestamp": 63000.0,
                        "endTimestamp": 69600.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221050",
        "number": "JEWISHST 115",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "124",
        "title": "German Jews: Thought, Race, and Identity",
        "description": "This course offers an introduction to German Jewish thought from the 18th century to the present day. We will explore the way Jews in the German-speaking world understood their identities in the face of changing cultural and political contexts and the literary and philosophical works they produced in the face of antisemitism, discrimination, and genocide. This course covers the major themes and events in German-Jewish cultural history, including the Haskalah (Jewish Enlightenment), fin de si&iquest;cle Vienna, Zionism, exile and migration, the Holocaust, and the modern German Jewish renaissance, with readings from Moses Mendelsohn, Karl Marx, Franz Kafka, Hannah Arendt, Max Czollek, and more. We will pay special attention to the way the German Jewish experience challenges our understanding of identity categories such as race and religion, as well as concepts of whiteness, Europeanness, and the modern nation state.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32657",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225646",
        "number": "JEWISHST 124",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "127D",
        "title": "Readings in Talmudic Literature (JEWISHST 227D, RELIGST 170D)",
        "description": "Readings of Talmudic texts. Some knowledge of Hebrew is preferred, but not necessary. The goal of the ongoing workshop is to provide Stanford students with the opportunity to engage in regular Talmud study, and to be introduced to a variety of approaches to studying Talmudic texts and thought.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "214642",
        "number": "JEWISHST 127D",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "130VP",
        "title": "Introduction to Social Demography: A Comparative Approach (Israel & US) (SOC 119VP)",
        "description": "In this class we will learn about Israel's unique demographic structure and we will compare it to the US and other countries.  Reading materials include general theories as well as research published in scholarly journals.  In the first half of this class we will review basic demographic concepts (mortality, fertility and migration), and we will apply them to the Israeli context, with comparisons between different social groups in Israel and with comparison to the US.  We will also review basic demographic theories (theories of population change) and apply them to different countries.  nnIn the second half of the class we will focus on demography of the family.  We will ask how fertility, marriage and divorce differ for different population groups in Israel and the US, and we will tie family processes to current theories of gender and family change.  We will also learn how demographic processes may be related to the reproduction of poverty, and inequality.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "220864",
        "number": "JEWISHST 130VP",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "131",
        "title": "Jews, Race, and Ethnicity in French Cinema and Literature",
        "description": "An exploration of Jews, race, ethnicity and postcolonialism through the lens of French cinema and literature",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32655",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225645",
        "number": "JEWISHST 131",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "131VP",
        "title": "Poverty and Inequality in Israel and the US: A Comparative Approach (CSRE 120P, SOC 120VP)",
        "description": "Poverty rates in Israel are high and have been relatively stable in recent decades, with about one fifth of all households (and a third of all children) living below the poverty line.  In this class we will learn about poverty and inequality in Israel and we will compare with the US and other countries.nnIn the first few weeks of this class we will review basic theories of poverty and inequality and we will discuss how theories regarding poverty have changed over the years, from the &quot;culture of poverty&quot; to theories of welfare state regimes.  We will also learn about various ways of measuring poverty, material hardship, and inequality, and we will review the methods and data used.nnIn the remaining weeks of the class we will turn to substantive topics such as gender, immigration, ethnicity/nationality, welfare policy, age, and health. Within each topic we will survey the debates within contemporary scholarship and we will compare Israel and the US. Examination of these issues will introduce students to some of the challenges that Israeli society faces today.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "220863",
        "number": "JEWISHST 131VP",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "132VP",
        "title": "Family and Society: A Comparative Approach (Israel  & the US) (SOC 121VP, SOC 221VP)",
        "description": "Families are changing: Non-marital partnerships such as cohabitation are becoming more common, marriage is delayed and fertility is declining. In this class we will learn about how families are changing in Israel and we will compare with the US and other countries.  Reading materials include general theories as well as research published in scholarly journals.  nnAfter reviewing general theories and major scholarly debates concerning issues of family change, we will turn to specific family processes and compare Israel, the US and other countries.  We will ask how family transitions may differ for different population groups and at different stages of the life course, and we will tie family processes to current theories of gender.  nnWe will cover a wide range of topics, from marriage and marital dissolution to cohabitation, LAT and remarriage.  We will also discuss changes in women's labor force participation and how it bears on fertility, parenthood and household division of labor. Within each substantive topic we will survey the debates within contemporary scholarship and we will compare Israel and the US",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "220865",
        "number": "JEWISHST 132VP",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "143",
        "title": "Literature and Society in Africa and the Caribbean (AFRICAAM 133, AFRICAST 132, COMPLIT 133, COMPLIT 233A, CSRE 133E, FRENCH 133)",
        "description": "This course provides students with an introductory survey of literature and cinema from Francophone Africa and the Caribbean in the 20th and 21st centuries. Students will be encouraged to consider the geographical, historical, and political connections between the Maghreb, the Caribbean, and Sub-Saharan Africa. This course will help students improve their ability to speak and write in French by introducing students to linguistic and conceptual tools to conduct literary and visual analysis. While analyzing novels and films, students will be exposed to a diverse number of topics such as national and cultural identity, race and class, gender and sexuality, orality and textuality, transnationalism and migration, colonialism and decolonization, history and memory, and the politics of language. Readings include the works of writers and filmmakers such as Aim&eacute; C&eacute;saire, Albert Memmi, Ousmane Semb&egrave;ne, Le&iuml;la Sebbar, Mariama B&acirc;, Maryse Cond&eacute;, Dany Laferri&egrave;re, Mati Diop, and special guest L&eacute;onora Miano. Taught in French. Students are encouraged to complete FRENLANG 124 or successfully test above this level through the Language Center.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13950",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Seck, F.",
                                "sunet": "fseck"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "213802",
        "number": "JEWISHST 143",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "145",
        "title": "Masterpieces: Kafka (COMPLIT 114, GERMAN 150)",
        "description": "This class will address major works by Franz Kafka and consider Kafka as a modernist writer whose work reflects on modernity. We will also examine the role of Kafka's themes and poetics in the work of contemporary writers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216217",
        "number": "JEWISHST 145",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "147B",
        "title": "The Hebrew and Jewish Short Story (COMPLIT 127B)",
        "description": "Short stories from Israel, the US and Europe including works by Agnon, Kafka, Keret, Castel-Bloom, Kashua, Singer, Benjamin, Freud, biblical myths and more. The class will engage with questions related to the short story as a literary form and the history of the short story. Reading and discussion in English.  Note: To be eligible for WAYS credit, you must take the course for a Letter Grade.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "218785",
        "number": "JEWISHST 147B",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "148",
        "title": "Writing Between Languages:  The Case of Eastern European Jewish Literature (JEWISHST 348, SLAVIC 198, SLAVIC 398)",
        "description": "Eastern European Jews spoke and read Hebrew, Yiddish, and their co-territorial languages (Russian, Polish, etc.).  In the modern period they developed secular literatures in all of them, and their writing reflected their own multilinguality and evolving language ideologies.  We focus on major literary and sociolinguistic texts.  Reading and discussion in English; students should have some reading knowledge of at least one relevant language as well. This course must be taken for a minimum of 3 units and a letter grade to be eligible for WAYS credit. In 2020-21, a 'letter' or 'CR' grade will satisfy the WAYS requirement.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "212346",
        "number": "JEWISHST 148",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "149",
        "title": "Tails from the Russian Empire: Animals in Russian and Yiddish Literatures (SLAVIC 149)",
        "description": "Unless you subscribe to certain extreme life philosophies, animals probably constitute some of your existence and environment - whether living with pets, hearing birds around campus, or confronting our human selves every morning, most of us would struggle to completely avoid animals in daily life. In this course, we explore different types of media and texts - though predominantly Russian and Yiddish literatures from 19th-century Russia in English translation - ventriloquizing, problematizing, and otherwise instrumentalizing non-human animals. Through our animal readings on narration and theory, we reconsider concepts of relation, humanism, sustainability, responsibility. Students can apply their refined understandings to create art pieces of digital humanities projects using the Textile Makerspace.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30599",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kim, E.",
                                "sunet": "kimer"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225270",
        "number": "JEWISHST 149",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "150",
        "title": "Texts that Changed the World from the Ancient Middle East (COMPLIT 31, HUMCORE 111, RELIGST 150)",
        "description": "This course traces the story of the cradle of human civilization. We will begin with the earliest human stories, the Gilgamesh Epic and biblical literature, and follow the path of the development of law, religion, philosophy and literature in the ancient Mediterranean or Middle Eastern world, to the emergence of Jewish and Christian thinking. We will pose questions about how this past continues to inform our present: What stories, myths, and ideas remain foundational to us? How did the stories and myths shape civilizations and form larger communities? How did the earliest stories conceive of human life and the divine? What are the ideas about the order of nature, and the place of human life within that order? How is the relationship between the individual and society constituted? This course is part of the Humanities Core: https://humanitiescore.stanford.edu/",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "220477",
        "number": "JEWISHST 150",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "185B",
        "title": "Jews in the Contemporary World: Culture, Pop Culture, and Representation (CSRE 185B, HISTORY 185B, REES 185B, SLAVIC 183)",
        "description": "(HISTORY 185B is 5 units; HISTORY 85B is 3 units.)  From Barbra Streisand to Volodymyr Zelenskyy, from The Dybbuk to Broad City, and from Moscow to LA, this course applies a multicultural perspective on different experiences of Jewishness in the 20th and 21st centuries. The discussion is centered on the ways in which these experiences are represented in various types of media: in literature or on TikTok, in poetry or on Instagram, in film and on television. The themes of the course include (but are not limited to) the interplay of national, religious, ethnic, linguistic, and political identities,  intersectionality, the definitions and boundaries of Jewish cultures, Queer and variously gendered experiences of Jewishness, as well as antisemitism and stereotyped representations of Jewishness. The course introduces students to the analysis of a diverse array of media as cultural texts and historical sources. Students are encouraged to apply their new skills to media of their choice.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "115235",
        "number": "JEWISHST 185B",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "186",
        "title": "Jews in Trump's America and Before (HISTORY 286F)",
        "description": "This class considers the notion of American Jewish exceptionalism through the lens of Trump's America. The social and economic success of American Jewry over the last 350 years is remarkable, yet Jews continue to find their position in American society called into question. This course moves between past and present and will consider key moments in American Jewish life with a particular emphasis on contemporary currents, including post-liberal identity politics, Israel, and the rise of white supremacy.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222236",
        "number": "JEWISHST 186",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "199B",
        "title": "Directed Reading in Yiddish, Second Quarter",
        "description": "For intermediate or advanced students. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "204189",
        "number": "JEWISHST 199B",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "200BG",
        "title": "Doing History: Biography as History (HISTORY 200BG)",
        "description": "Although historians often focus on broad social forces, individuals can and do shape these currents in unexpected ways, as the headlines of our own time illustrate.  What role do individuals play in historical change?  How can we use individual life stories to illuminate broader trends?  Led by two history faculty members who are also biographers, this seminar will introduce students to a diverse cast including writers, musicians, politicians, and intellectuals, with a general focus on the modern era since 1870.  As a final project, students will draw on Stanford's archival holdings to write an original mini-biography.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224232",
        "number": "JEWISHST 200BG",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "200R",
        "title": "Directed Research",
        "description": "Independent Research",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224917",
        "number": "JEWISHST 200R",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "204E",
        "title": "Totalitarianism (HISTORY 204E, HISTORY 307E)",
        "description": "This course analyzes the evolution and nature of revolutionary and totalitarian polities through the reading of monographs on the Puritan Reformation, French Revolutionary, turn of the 20th Century, interwar, and Second World War eras. Among topics explored are the essence of modern ideology and politics, the concept of the body national and social, the modern state, state terror, charismatic leadership, private and public spheres, totalitarian economies, and identities and practices in totalitarian polities.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "32975",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-GlobalCom"
        ],
        "objectID": "115372",
        "number": "JEWISHST 204E",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "207",
        "title": "Biography and History (AMSTUD 207B, HISTORY 207, HISTORY 308)",
        "description": "Designed along the lines of the PBS series, &quot;In the Actor's Workshop,&quot; students will meet weekly with some of the leading literary biographers writing today.  Included this spring will be &quot;New Yorker&quot; staff writer Judith Thurman -- whose biography of Isak Dinesen was made into the film &quot;Out of Africa&quot; -- as well as Shirley Jackson biographer Ruth Franklin, now at work on a book about Anne Frank. Professor Zipperstein will share with the class drafts of the biography of Philip Roth that he is now writing.  Critics questioning the value of biography as an historical and literary tool will also be invited to meetings with the class.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum"
        ],
        "objectID": "201141",
        "number": "JEWISHST 207",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "211",
        "title": "Out of Eden: Deportation, Exile, and Expulsion from Antiquity to the Renaissance (HISTORY 211, HISTORY 311)",
        "description": "This course examines the long pedigree of modern deportations and mass expulsions, from the forced resettlements of the ancient world to the expulsion of Jews from Spain in 1492, and from the outlawry of Saga-era Iceland to the culture of civic exile in Renaissance Italy. The course focuses on Europe and the Mediterranean from antiquity to the early modern period, but students are welcome to venture beyond these geographical and chronological boundaries for their final papers.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "218117",
        "number": "JEWISHST 211",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "221C",
        "title": "Aramaic Texts (JEWISHST 321C, RELIGST 221C, RELIGST 321C)",
        "description": "Readings in Aramaic/Syriac with special focus on grammar and syntax of ancient texts.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum"
        ],
        "objectID": "211364",
        "number": "JEWISHST 221C",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "226E",
        "title": "The Holocaust: Insights from New Research (HISTORY 226D, HISTORY 326D, JEWISHST 326D)",
        "description": "Overview of the history of the Holocaust, the genocide of European Jews.  Explores its causes, course, consequences, and memory.  Addresses the events themselves, as well as the roles of perpetrators and bystanders, dilemmas faced by victims, collaboration of local populations, and the issue of rescue.  Considers how the Holocaust was and is remembered and commemorated by victims and participants alike.  Uses different kinds of sources:  scholarly work, memoirs, diaries, film, and primary documents.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "14245",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jolluck, K.",
                                "sunet": "katya"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221644",
        "number": "JEWISHST 226E",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "227D",
        "title": "Readings in Talmudic Literature (JEWISHST 127D, RELIGST 170D)",
        "description": "Readings of Talmudic texts. Some knowledge of Hebrew is preferred, but not necessary. The goal of the ongoing workshop is to provide Stanford students with the opportunity to engage in regular Talmud study, and to be introduced to a variety of approaches to studying Talmudic texts and thought.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "214642",
        "number": "JEWISHST 227D",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "236A",
        "title": "Casablanca - Algiers - Tunis : Cities on the Edge (COMPLIT 236A, CSRE 140S, FRENCH 236, FRENCH 336, HISTORY 245C, URBANST 140F)",
        "description": "Casablanca, Algiers and Tunis embody three territories, real and imaginary, which never cease to challenge the preconceptions of travelers setting sight on their shores. In this class, we will explore the myriad ways in which these cities of North Africa, on the edge of Europe and of Africa, have been narrated in literature, cinema, and popular culture. Home to Muslims, Christians, and Jews, they are an ebullient laboratory of social, political, religious, and cultural issues, global and local, between the nineteenth and twenty-first centuries. We will look at mass images of these cities, from films to maps, novels to photographs, sketching a new vision of these magnets as places where power, social rituals, legacies of the Ottoman and French colonial pasts, and the influence of the global economy collude and collide. Special focus on class, gender, and race.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "220414",
        "number": "JEWISHST 236A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "242G",
        "title": "Myth and Modernity (COMPLIT 222A, GERMAN 222, GERMAN 322, JEWISHST 342)",
        "description": "Masters of German 20th- and 21st-Century literature and philosophy as they present aesthetic innovation and confront the challenges of modern technology, social alienation, manmade catastrophes, and imagine the future. Readings include Nietzsche, Freud, Rilke, Musil, Brecht, Kafka, Doeblin, Benjamin, Juenger, Arendt, Musil, Mann, Adorno, Celan, Grass, Bachmann, Bernhardt, Wolf, and Kluge. Taught in English. Note for German Studies grad students: GERMAN 322 will fulfill the grad core requirement since GERMAN 332 is not being offered this year. NOTE: Enrollment requires Professor Eshel's consent. Please complete the following form to be considered for the class: https://forms.gle/zq3EwGWc1Ff7xn7T9. Enrollment is limited to 20 students. Students will be notified about their acceptance by March 20th and given a permission code. UPDATE 3/2/23 - There was a problem with the original form. Please edit your response to include your name.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "213572",
        "number": "JEWISHST 242G",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "243A",
        "title": "Hannah Arendt: Facing Totalitarianism (COMPLIT 353B, GERMAN 253, GERMAN 353)",
        "description": "Like hardly any other thinker of the modern age, Hannah Arendt's thought offers us timeless insights into the fabric of the modern age, especially regarding the perennial danger of totalitarianism. This course offers an in-depth introduction to Arendt's most important works in their various contexts, as well as a consideration of their reverberations in contemporary philosophy and literature. Readings include Arendt's &lt;em&gt;The Origin of Totalitarianism&lt;/em&gt;, &lt;em&gt;The Human Condition, Between Past and Future&lt;/em&gt;, &lt;em&gt;Men in Dark Times&lt;/em&gt;, &lt;em&gt;On Revolution&lt;/em&gt;,&lt;em&gt;Eichmann in Jerusalem&lt;/em&gt;, and &lt;em&gt;The Life of the Mind&lt;/em&gt;, as well as considerations of Hannah Arendt's work by Max Frisch, J&uuml;rgen Habermas, Seyla Benhabib, Judith Butler, Giorgio Agamben, and others. Special attention will be given to Arendt's writings on literature with an emphasis on Kafka, Brecht, Auden, Sartre, and Camus. This course will be synchronously conducted, but will also use an innovative, Stanford-developed, online platform called Poetic Thinking. Poetic Thinking allows students to share both their scholarly and creative work with each other. Based on the newest technology and beautifully designed, it greatly enhances their course experience.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220959",
        "number": "JEWISHST 243A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "249",
        "title": "The Algerian Wars (CSRE 249, FRENCH 249, HISTORY 239G)",
        "description": "From Algiers the White to Algiers the Red, Algiers, the Mecca of the Revolutionaries in the words of Amilcar Cabral, this course offers to study the Algerian Wars since the French conquest of Algeria (1830-) to the Algerian civil war of the 1990s. We will revisit the ways in which the war has been narrated in literature and cinema, popular culture, and political discourse. A special focus will be given to the Algerian War of Independence (1954-1962). The course considers the racial representations of the war in the media, the continuing legacies surrounding the conflict in France, Africa, and the United States, from Che Guevara to the Black Panthers. A key focus will be the transmission of collective memory through transnational lenses, and analyses of commemorative events and movies. nReadings from James Baldwin, Assia Djebar, Albert Camus, Frantz Fanon, Mouloud Feraoun. Movies include &quot;The Battle of Algiers,&quot; &quot;Days of Glory,&quot; and  &quot;Viva Laldj&eacute;rie.&quot; nTaught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:EC-GlobalCom",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "218406",
        "number": "JEWISHST 249",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "249A",
        "title": "Levinas and Literature (COMPLIT 259A)",
        "description": "Focus is on major works by French phenomenologist Emmanuel Levinas (1906-1995) and their import for literary studies. Aim is to discuss and evaluate Levinas's (often latent) aesthetics through a close reading of his work in phenomenology, ethics, and Jewish philosophy. If poetry has come to seem barbaric (or at least useless) in a world so deeply shaped by genocide, forced migration, and climate change, Levinas offers a clear and deeply engaged path forward. If you love literature but still haven't figured out what on earth it might be good for, this course is for you. Readings and discussion in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "218853",
        "number": "JEWISHST 249A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "263",
        "title": "Paul Celan: The Poetic Event (COMPLIT 263B, GERMAN 263, GERMAN 363)",
        "description": "Paul Celan (1920-1970) is one of the greatest poets of our time. Touching on philosophy, history, our relation to nature, and love, his poetry is a profound meditation on the modern human condition. This course will present some of Celan's best work and will discuss significant contributions to Celan scholarship. Readings include Heidegger, Gadamer, Nelly Sachs, Bachmann, Derrida, Szondi, and Anne Carson, among others.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223493",
        "number": "JEWISHST 263",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "265",
        "title": "Jewish Law: Introduction and Topics",
        "description": "This course will provide an overview of the field of Jewish Law and will seek to provide a few case studies of topics in Jewish Law. All the readings are in English and this course presupposes no background in Jewish Law. Jewish Law is the world's oldest complex legal systems with distinct and idiosyncratic approaches to family, commercial, ritual and many other areas of law. It also has developed an elaborate &quot;conflicts of law&quot; sub-literature focusing on when should Jewish Law apply and when should some other legal system apply, reflecting the long history of the Jewish community in the diaspora as a minority. In this course, we will consider how Jewish law approaches a number of specific topics and we will ponder as well the proper interaction between Jewish law and secular legal norms, Jewish Law and changes in technology, Jewish law and sovereignty, Jewish Law and Bioethics and Jewish law and Family. Other topics will be added as we all see fit. Students who are interested in making a presentation on an area of their choice are welcome to do so. The course will seek to include an optional supplementary &quot;field trip&quot; to see a rabbinical court in action in California. The Learning Outcomes provided by this court include the following: Students who take this course will: 1. Exhibit knowledge and understanding of key concepts in substantive law, procedural law, and legal thought in Jewish Law. 2. Demonstrate facility with legal analysis and reasoning in the Jewish Legal tradition and will demonstrate the ability to conduct legal research in Jewish Law. After the term begins, students accepted into the course can transfer, with consent of the instructor, from section (01) into section (02), which meets the R requirement. Elements used in grading: Attendance, Class Participation, Final Paper.  Cross-listed with the Law School (LAW 5038).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222047",
        "number": "JEWISHST 265",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "274",
        "title": "Wonder: The Event of Art and Literature (ARTHIST 274, ARTHIST 474)",
        "description": "What falls below, or beyond, rational inquiry? How do we write about the awe we feel in front of certain works of art, in reading lines of poetry or philosophy, or watching a scene in a film without ruining the feeling that drove us to write in the first place? In this course, we will focus on a heterogeneous series of texts, artworks, and physical locations to discuss these questions. Potential topics include The Book of Exodus, the poetry of Friedrich H&ouml;lderlin and of Elizabeth Bishop, the location of Harriet Tubman's childhood, the poetry and drawings of Else Lasker-Sch&uuml;ler, the philosophy of Martin Heidegger, the art of James Turrell, and the films of Luchino Visconti.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224305",
        "number": "JEWISHST 274",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "281K",
        "title": "Departures: Late Ottoman Displacements of Muslims, Christians, and Jews, 1853-1923",
        "description": "In the late nineteenth and early twentieth centuries, millions of people moved into and out of the Ottoman Empire, sometimes voluntarily and sometimes under extremely violent circumstances. More often than not, they moved in groups that were religiously defined. This course examines how these developments shaped the future of the modern Middle East, Balkans, and beyond. Questions include: How did migration and the idea of the nation shape each other? What does it mean to call a group or a migration &quot;religious&quot;? Why did certain types of diversity become a &quot;problem,&quot; in the eyes of the state? What caused these population displacements? What can this topic teach us about today's mass migrations?",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222691",
        "number": "JEWISHST 281K",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "282",
        "title": "Circles of Hell: Poland in World War II (HISTORY 228, HISTORY 328, JEWISHST 382)",
        "description": "Looks at the experience and representation of Poland's wartime history from the Nazi-Soviet Pact (1939) to the aftermath of Yalta (1945). Examines Nazi and Soviet ideology and practice in Poland, as well as the ways Poles responded, resisted, and survived. Considers wartime relations among Polish citizens, particularly Poles and Jews. In this regard, interrogates the traditional self-characterization of Poles as innocent victims, looking at their relationship to the Holocaust, thus engaging in a passionate debate still raging in Polish society.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "201521",
        "number": "JEWISHST 282",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "282K",
        "title": "Refugees and Migrants in the Middle East and Balkans: 18th Century to Present (HISTORY 282K, HISTORY 382K)",
        "description": "This course studies one of the most pressing issues of our day--massive population displacements--from a historical perspective. Our focus will be the Ottoman Empire and its successor states, including Turkey, Greece, Bulgaria, Serbia, Bosnia and Herzegovina, Syria, Iraq, Lebanon, and Israel/Palestine. Questions include the following: When and why did certain ethno-religious groups begin to relocate en masse? To what extent were these departures caused by state policy? In what cases can we apply the term &quot;ethnic cleansing&quot;? How did the movement of people and the idea of the nation influence each other in the modern age?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "30945",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "200-013",
                        "instructors": [
                            {
                                "name": "Daniels, J.",
                                "sunet": "jacobd"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223781",
        "number": "JEWISHST 282K",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "282S",
        "title": "The History of Genocide (HISTORY 202S, HISTORY 402D, JEWISHST 482D)",
        "description": "This course will explore the history, politics, and character of genocide from the beginning of world history to the present. It will also consider the ways that the international system has developed to prevent and punish genocide.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219171",
        "number": "JEWISHST 282S",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "283K",
        "title": "Muslims, Christians, and Jews in the Eastern Mediterranean: From Ottoman to Modern Times (HISTORY 283K, HISTORY 383K)",
        "description": "At a time when Europe was riven by sectarian war, the expanding Ottoman Empire came to rule over a religiously diverse population in what we now call the Balkans and Middle East. Focusing on the period 1323-1789, this course asks the following questions: Why was &quot;difference&quot; normal in the Ottoman Empire but not elsewhere? How did the Ottomans maintain relatively low levels of intercommunal violence during the early-modern period? How did Ottoman rule and intracommunal dynamics affect each other? How did perceptions of ethno-religious diversity vary among commentators and over time?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "32974",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Daniels, J.",
                                "sunet": "jacobd"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223782",
        "number": "JEWISHST 283K",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "284",
        "title": "The \"Other\" Jews: Sephardim in Muslim-Majority Lands (HISTORY 284K, HISTORY 384K)",
        "description": "This course expands conceptions of Jewish History by focusing on overlooked regions such as North Africa, the Middle East, and the Balkans. Beginning in medieval Al-Andalus, the course follows the Jews of Spain and Portugal to other parts of the world and traces their stories into the 20th century. Topics include the expulsions from Iberia, the formation of a Sephardi identity, encounters between Sephardim and other communities (Muslim, Christian, and Jewish), life in the Ottoman Empire, networks and mobility, gender, colonialism, and the rise of the nation-state paradigm.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225544",
        "number": "JEWISHST 284",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "284C",
        "title": "Genocide and Humanitarian Intervention (HISTORY 224C, HISTORY 324C, JEWISHST 384C, PEDS 224)",
        "description": "Open to medical students, graduate students, and undergraduate students. Traces the history of genocide in the 20th century and the question of humanitarian intervention to stop it, a topic that has been especially controversial since the end of the Cold War. The pre-1990s discussion begins with the Armenian genocide during the First World War and includes the Holocaust and Cambodia under the Khmer Rouge in the 1970s. Coverage of genocide and humanitarian intervention since the 1990s includes the wars in Bosnia, Rwanda, Kosovo, the Congo and Sudan.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "11993",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Patenaude, B.",
                                "sunet": "bertiep"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 60600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "212766",
        "number": "JEWISHST 284C",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "285",
        "title": "Post-Colonial and Post-Shoah Readings: The Conundrums of Memory Politics (GERMAN 285, HISTORY 234G)",
        "description": "In April of 2020, amidst the COVID-19 pandemic, a huge controversy erupted in Germany on the relation between Postcolonial and Holocaust Studies. Previously, in 2012, Judith Butler on the occasion of being awarded the Adorno Prize was assailed for her support of the Boycott, Divestment and Sanctions (BDS) movement. This time, the philosopher Achille Mbembe, from Cameroon, the former German colony, was accused of antisemitism. His comparison of Israel with the apartheid state in South Africa and his critique of Palestine's occupation as a form of settler colonialism is condemned for relativizing the Holocaust and questioning the Israeli state's right to exist. The allegation of &quot;postcolonial antisemitism&quot; resurfaced in 2022 in the context of the Documenta 15 in Kassel. The curators, ruangrupa, an Indonesian art collective, are accused of antisemitism, of supporting BDS and of the &quot;silent boycott&quot; of Jewish-Israeli artists.These controversies confront us with the challenge of how to think together antisemitism and racism. In this class, we will engage with critical scholarship to address the conundrums of memory politics and to engage with the &quot;unfinished conversations&quot; between Jewish and Postcolonial Studies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224172",
        "number": "JEWISHST 285",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "285C",
        "title": "The Immigrant in Modern America (HISTORY 285C)",
        "description": "The 2016 presidential election propelled the topic of immigration to the center of public attention. This is not the first time, however, that questions of immigration and what it means to be an American have revealed deep divisions within the U.S. This course explores the reception of immigrants in modern America, including differing views toward immigration; how immigrants help shape ideas about the American nation; and the growth of state bureaucracy and policing apparatus as a response.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222106",
        "number": "JEWISHST 285C",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "285D",
        "title": "Vanishing Diaspora? Ruin, Revival, and Jewish Life in Post-Holocaust Europe (HISTORY 285D)",
        "description": "This course explores the lives and fates of European Jews as they re-encountered, reimagined, and reconstructed their communities in the grim aftermath of World War II. Attending to a variety of national and ideological contexts, with a particular focus on Eastern Europe and the communist bloc, the course traces how Jews wrestled with their present and future in the wake of continent-wide calamity, the founding of the state of Israel, Soviet influence, Cold War geopolitics, the collapse of communism, and, finally, the post-Soviet order of the 1990s and 2000s. It likewise traces how postwar European Jewry grappled with the anxieties of immigration and return, the wages of acculturation and assimilation, and the interplay between cultural destruction, revival, and nostalgia in the face of persistent antisemitism, explosive Holocaust memory politics, and significant foreign Jewish philanthropy. Drawing on a wide range of printed, visual, and oral sources, this highly interdisciplinary course investigates questions particular to the Jewish experience, but also broader concerns about European inclusion, interethnic relations, and diasporic identity in the twentieth and twenty-first centuries. All readings are in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "225625",
        "number": "JEWISHST 285D",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "286D",
        "title": "Yours in Struggle: African Americans and Jews in the 20th Century U.S. (HISTORY 286D)",
        "description": "This colloquium explores the history of African Americans and Jews in 20th century US beginning with Jewish immigration from Eastern Europe and the Great Migration to America's urban centers. It considers the geographical and economic tensions that developed between two minority groups living in close proximity; the appropriation of black culture; Jewish claims to whiteness and performance of blackness; intercommunal relations during the Civil Rights movement; the breakdown of the black-Jewish alliance in the late 1960s; and the lingering ramifications of this shift today.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "221725",
        "number": "JEWISHST 286D",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "287",
        "title": "Hope in the Modern Age (COMPLIT 287, GERMAN 287)",
        "description": "Immanuel Kant famously considered &quot;What may I hope?&quot; to be the third and final question of philosophy. This course considers the thinkers, from Immanuel Kant to Judith Butler, who have attempted to answer this question from within the context of modernity. Has revolution replaced religion as the object of our hope? Has Enlightenment lived up to its promises? These topics and more will be discussed, with readings from thinkers including Hegel, Marx, Nietzsche, Benjamin, Adorno, and Arendt, alongside the literature of writers such as Kafka, Celan, Nelly Sachs, among others, and with particular focus on the question of hope within the German-Jewish tradition.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "223391",
        "number": "JEWISHST 287",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "287S",
        "title": "Graduate Research Seminar in Ottoman and Middle East History (HISTORY 481, JEWISHST 481)",
        "description": "Student-selected research topics. May be repeated for credit",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "RES",
                "notes": null,
                "classId": "14513",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Yaycioglu, A.",
                                "sunet": "ayayciog"
                            },
                            {
                                "name": "Barakat, N.",
                                "sunet": "nbarakat"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218760",
        "number": "JEWISHST 287S",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "288C",
        "title": "Jews of the Modern Middle East and North Africa (CSRE 288C, HISTORY 288C)",
        "description": "This course will explore the cultural, social, and political histories of the Jews of the Middle East and North Africa (MENA) from 1860 to present times. The geographic concentration will range from Morocco to Iran, Iraq to Turkey, and everywhere in between. Topics include: Jewish culture and identity in Islamic contexts; the impacts of colonialism, westernization, and nationalism; Jewish-Muslim relations; the racialization of MENA Jews; the Holocaust; the experience and place of MENA Jews in Israel; and &quot;Jews of Color.&quot;",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222878",
        "number": "JEWISHST 288C",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "291X",
        "title": "Learning Religion: How People Acquire Religious Commitments (AMSTUD 231X, EDUC 231, RELIGST 231X)",
        "description": "This course will examine how people learn religion outside of school, and in conversation with popular cultural texts and practices. Taking a broad social-constructivist approach to the variety of ways people learn, this course will explore how people assemble ideas about faith, identity, community, and practice, and how those ideas inform individual, communal and global notions of religion. Much of this work takes place in formal educational environments including missionary and parochial schools, Muslim madrasas or Jewish yeshivot. However, even more takes place outside of school, as people develop skills and strategies in conversation with broader social trends. This course takes an interdisciplinary approach to questions that lie at the intersection of religion, popular culture, and education. May be repeat for credit.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "213405",
        "number": "JEWISHST 291X",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "293X",
        "title": "Church, State, & Schools: Issues in Education & Religion (AMSTUD 293, EDUC 293, RELIGST 234X)",
        "description": "This course will examine interactions between religion and education, focusing on both formal and experiential sites in which people and communities explore, articulate, encounter, and perform religious ideologies and identities. The class will focus on different religious traditions and their encounters the institutions and structures of education in American culture, both in the United States and as it manifests in American culture transnationally.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32847",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kelman, A.",
                                "sunet": "aykelman"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "212919",
        "number": "JEWISHST 293X",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "299A",
        "title": "Directed Reading in Yiddish, First Quarter",
        "description": "Directed Reading in Yiddish, First Quarter",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "206693",
        "number": "JEWISHST 299A",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "301",
        "title": "Colloquium on Jews, Judaism, and Jewish Culture",
        "description": "An interdisciplinary graduate student colloquium for Stanford graduate students interested in Jewish Studies.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "221049",
        "number": "JEWISHST 301",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "302",
        "title": "The Geography of Yiddish Literature (SLAVIC 302)",
        "description": "How does location matter for Yiddish creativity? This class looks at descriptions of places in Yiddish poetry and prose. It compares the Yiddish writing produced in Russia (and the Soviet Union), Poland, Israel/Palestine, and North America. If students want, more places can be added. For students with at least some knowledge of Yiddish; readings in Yiddish and English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30763",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "240-201",
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225271",
        "number": "JEWISHST 302",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "321C",
        "title": "Aramaic Texts (JEWISHST 221C, RELIGST 221C, RELIGST 321C)",
        "description": "Readings in Aramaic/Syriac with special focus on grammar and syntax of ancient texts.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "211364",
        "number": "JEWISHST 321C",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "326D",
        "title": "The Holocaust: Insights from New Research (HISTORY 226D, HISTORY 326D, JEWISHST 226E)",
        "description": "Overview of the history of the Holocaust, the genocide of European Jews.  Explores its causes, course, consequences, and memory.  Addresses the events themselves, as well as the roles of perpetrators and bystanders, dilemmas faced by victims, collaboration of local populations, and the issue of rescue.  Considers how the Holocaust was and is remembered and commemorated by victims and participants alike.  Uses different kinds of sources:  scholarly work, memoirs, diaries, film, and primary documents.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "14246",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jolluck, K.",
                                "sunet": "katya"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221644",
        "number": "JEWISHST 326D",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "333",
        "title": "Comparative Mysticism (RELIGST 233, RELIGST 333)",
        "description": "This graduate seminar will explore the mystical writings of the major religious traditions represented in our department: Judaism, Christianity, Islam, Buddhism and Hinduism. It will address major issues in the study of mysticism, exposing students to a wide variety of religious thinkers and literary traditions, while simultaneously interrogating the usefulness of the concept of &quot;mysticism&quot; as a framework in the study of religion. We will consider various paradigms of method (comparative, constructivist, essentialist), and examine the texts with an eye to historical and social context together with the intellectual traditions that they represent. Preserving the distinctiveness of each religious tradition, the class will be structured as a series of five units around these traditions, but our eyes will be continuously trained upon shared topics or themes, including: language; gender; notions of sainthood; scripture and exegesis; autobiography and writing; mysticism and philosophy; poetry and translation; mysticism and social formation; the interface of law, devotion, and spirit; science and mysticism; perceptions of inter-religious influence; mysticism and the modern/ post-modern world. Advanced reading knowledge of at least one language of primary-source scholarship in one of the above traditions is required. Undergraduates register for 200-level for 5 units. Graduate students register for 300-level for 3-5 unit.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32658",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221767",
        "number": "JEWISHST 333",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "342",
        "title": "Myth and Modernity (COMPLIT 222A, GERMAN 222, GERMAN 322, JEWISHST 242G)",
        "description": "Masters of German 20th- and 21st-Century literature and philosophy as they present aesthetic innovation and confront the challenges of modern technology, social alienation, manmade catastrophes, and imagine the future. Readings include Nietzsche, Freud, Rilke, Musil, Brecht, Kafka, Doeblin, Benjamin, Juenger, Arendt, Musil, Mann, Adorno, Celan, Grass, Bachmann, Bernhardt, Wolf, and Kluge. Taught in English. Note for German Studies grad students: GERMAN 322 will fulfill the grad core requirement since GERMAN 332 is not being offered this year. NOTE: Enrollment requires Professor Eshel's consent. Please complete the following form to be considered for the class: https://forms.gle/zq3EwGWc1Ff7xn7T9. Enrollment is limited to 20 students. Students will be notified about their acceptance by March 20th and given a permission code. UPDATE 3/2/23 - There was a problem with the original form. Please edit your response to include your name.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "213572",
        "number": "JEWISHST 342",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "348",
        "title": "Writing Between Languages:  The Case of Eastern European Jewish Literature (JEWISHST 148, SLAVIC 198, SLAVIC 398)",
        "description": "Eastern European Jews spoke and read Hebrew, Yiddish, and their co-territorial languages (Russian, Polish, etc.).  In the modern period they developed secular literatures in all of them, and their writing reflected their own multilinguality and evolving language ideologies.  We focus on major literary and sociolinguistic texts.  Reading and discussion in English; students should have some reading knowledge of at least one relevant language as well. This course must be taken for a minimum of 3 units and a letter grade to be eligible for WAYS credit. In 2020-21, a 'letter' or 'CR' grade will satisfy the WAYS requirement.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "212346",
        "number": "JEWISHST 348",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "382",
        "title": "Circles of Hell: Poland in World War II (HISTORY 228, HISTORY 328, JEWISHST 282)",
        "description": "Looks at the experience and representation of Poland's wartime history from the Nazi-Soviet Pact (1939) to the aftermath of Yalta (1945). Examines Nazi and Soviet ideology and practice in Poland, as well as the ways Poles responded, resisted, and survived. Considers wartime relations among Polish citizens, particularly Poles and Jews. In this regard, interrogates the traditional self-characterization of Poles as innocent victims, looking at their relationship to the Holocaust, thus engaging in a passionate debate still raging in Polish society.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "201521",
        "number": "JEWISHST 382",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "384C",
        "title": "Genocide and Humanitarian Intervention (HISTORY 224C, HISTORY 324C, JEWISHST 284C, PEDS 224)",
        "description": "Open to medical students, graduate students, and undergraduate students. Traces the history of genocide in the 20th century and the question of humanitarian intervention to stop it, a topic that has been especially controversial since the end of the Cold War. The pre-1990s discussion begins with the Armenian genocide during the First World War and includes the Holocaust and Cambodia under the Khmer Rouge in the 1970s. Coverage of genocide and humanitarian intervention since the 1990s includes the wars in Bosnia, Rwanda, Kosovo, the Congo and Sudan.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "11994",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Patenaude, B.",
                                "sunet": "bertiep"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 60600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "212766",
        "number": "JEWISHST 384C",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "385A",
        "title": "Graduate Colloquium in Early Modern Jewish History (HISTORY 385A)",
        "description": "Core colloquium in Jewish History, 17th to 19th centuries.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "31526",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rodrigue, A.",
                                "sunet": "rodrigue"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "115899",
        "number": "JEWISHST 385A",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "385B",
        "title": "Graduate Colloquium in Jewish History, 19th-20th Centuries (HISTORY 385B)",
        "description": "Graduate colloquium in Jewish History, 19th-20th centuries.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "32886",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "115900",
        "number": "JEWISHST 385B",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "393X",
        "title": "The Education of American Jews (EDUC 313, RELIGST 313X)",
        "description": "This course will take an interdisciplinary approach to the question of how American Jews negotiate the desire to retain a unique ethnic sensibility without excluding themselves from American culture more broadly. Students will examine the various ways in which people debate, deliberate, and determine what it means to be an &quot;American Jew&quot;. This includes an investigation of how American Jewish relationships to formal and informal educational encounters through school, popular culture, religious ritual, and politics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "212920",
        "number": "JEWISHST 393X",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "481",
        "title": "Graduate Research Seminar in Ottoman and Middle East History (HISTORY 481, JEWISHST 287S)",
        "description": "Student-selected research topics. May be repeated for credit",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "RES",
                "notes": null,
                "classId": "14512",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Yaycioglu, A.",
                                "sunet": "ayayciog"
                            },
                            {
                                "name": "Barakat, N.",
                                "sunet": "nbarakat"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218760",
        "number": "JEWISHST 481",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "482D",
        "title": "The History of Genocide (HISTORY 202S, HISTORY 402D, JEWISHST 282S)",
        "description": "This course will explore the history, politics, and character of genocide from the beginning of world history to the present. It will also consider the ways that the international system has developed to prevent and punish genocide.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219171",
        "number": "JEWISHST 482D",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "486A",
        "title": "Graduate Research Seminar in Jewish History (HISTORY 486A)",
        "description": null,
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "RES",
                "notes": null,
                "classId": "14434",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rodrigue, A.",
                                "sunet": "rodrigue"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "RES",
                "notes": null,
                "classId": "32976",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "116106",
        "number": "JEWISHST 486A",
        "units": [
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "JEWISHST",
        "code": "486B",
        "title": "Graduate Research Seminar in Jewish History (HISTORY 486B)",
        "description": "Prerequisite: HISTORY 486A.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "205758",
        "number": "JEWISHST 486B",
        "units": [
            4,
            5
        ]
    }
]