[
    {
        "year": "2023-2024",
        "subject": "LAWGEN",
        "code": "110Q",
        "title": "Criminal Justice and the Criminal Courts",
        "description": "Focus is on the structures and theories at play in the criminal court  nnsystem, emphasizing court procedures, structures, constitutional  nnguarantees, and the trial process. The roles of individual agents,  nnincluding the police, prosecutors, defense attorneys, judges,  nnprobation officers, and corrections officials. Note: This is an Introductory Seminar and is not open to Law students.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "209192",
        "number": "LAWGEN 110Q",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LAWGEN",
        "code": "112N",
        "title": "Law and Inequality",
        "description": "Most Americans know that discrimination on the basis of race, sex, and religion is unlawful. Seems simple enough. But advertisements in the back of newspapers still announce: &quot;Single White Female Seeks Single White Male?&quot; Isn't that discrimination on the basis of race and sex? Most businesses don't consider men for women's locker room or bathroom attendant. And why aren't those men and women's bathrooms and locker rooms illegal segregation? After all we know what would happened if some business set up separate bathrooms for blacks and whites. Isn't it discrimination for an employer to insist that men wear a jacket and tie and women wear nylons and a skirt? Why are some forms of discrimination unlawful and others not? Why is discrimination against short people, overweight people, or people with annoying personalities not against the law? We will answer these and many other questions by looking at court cases, legal theory, and philosophy. We may also have conversations with guest lecturers who work in civil rights enforcement, and the seminar may include a field trip to visit the offices of civil rights lawyers (lawyers tend to be busy people so these opportunities will depend on their schedules). Class participation and a short final paper are required, but here are no prerequisites other than an open mind and a willingness to delve into unfamiliar material.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "32527",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:00:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ford, R.",
                                "sunet": "rford"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215999",
        "number": "LAWGEN 112N",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LAWGEN",
        "code": "115N",
        "title": "Human Rights Advocacy",
        "description": "What are the origins of the human rights movement and where is it headed? What does it mean to be a human rights activist? What are the main challenges and dilemmas facing those engaged in human rights advocacy? In the space of seven decades, human rights advocates have transformed a marginal utopian ideal into a central element of global discussion, if not practice. In this seminar we will examine the actors and organizations behind this remarkable development as well as the vast challenges faced by advocates in the recent past and today. Together, we will learn to be critical of, as well as to think, and act, like human rights advocates.  This seminar will introduce you to some the main debates and dilemmas within the human rights movement. We will consider and understand the differing agendas of western international nongovernmental organizations (INGOs) and their counterparts in the frequently non-western) developing world, as well as tensions between and among rights advocates along other important dimensions (civil and political vs. economic, social and cultural rights; rights promotion through engagement of powerful actors vs. challenging structures of power, etc.). The seminar seeks to develop your ability: 1) to understand human rights and social justice issues as contested political, legal and cultural phenomena; 2) to review advocacy texts, videos and other interventions critically; 3) to appreciate the political dimensions of efforts to promote human rights; 4) to understand how recent  history constrains and structures options and possibilities for social intervention to promote rights and justice.  During the course of the quarter you will be required to submit several short reflection papers and develop a human rights advocacy campaign.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "215998",
        "number": "LAWGEN 115N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LAWGEN",
        "code": "206",
        "title": "Thinking Like a Lawyer",
        "description": "(Same as GSBGEN 382.) Open to all graduate students. An analytical framework for understanding the core concepts of the law; how lawyers analyze and structure their work. Foundational principles of law. Topics such as contracts, litigation, intellectual property, securities, and employment law.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "209221",
        "number": "LAWGEN 206",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LAWGEN",
        "code": "209Q",
        "title": "Exploring Campus Public Safety",
        "description": "This course explores the multitude of roles, responsibilities and services provided by the Stanford Department of Public Safety. Classes will provide opportunities to engage in discussion and gather insights through experiential learning. A range of topics will be covered regarding police-community interactions and types of response, as well as scenarios involving traffic stops, a field sobriety testing lab, and the use of force. These sessions are intended to enrich your knowledge of working in campus public safety, cultivate relationships, and foster understanding with the community to which we all belong.  Students taking the course for 1 unit of credit will be required to submit a reflection essay, 2 pages in length, for each class that includes external source material (recommended resource list will be provided). Pre-requisites: application and background check; must be 18 years of age.  While this course is open to all students throughout the University, the units will not accrue to Law Degree Candidates for credit toward a degree in Law (JD, JSM, JSD, or LLM).  This class meets Wednesday nights from 5:30 - 8:00pm in the Winter Quarter, beginning January 11.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "210458",
        "number": "LAWGEN 209Q",
        "units": [
            1
        ]
    }
]