[
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "95",
        "title": "Ensemble Leadership",
        "description": "This experiential course allows students to grow as leaders through immersion in leadership positions in the Stanford Band. Study and implement frameworks and tools that enhance leadership and team performance. Topics covered include traditional leadership and governance concepts, as well as approaches specifically effective in music ensembles.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "This class is part of the Stanford Band program and so date and time will be determined after students enroll.  This class has a $35 course fee.",
                "classId": "26311",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gavin, R.",
                                "sunet": "rgavin"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "This class is part of the Stanford Band program and so date and time will be determined after students enroll. Please contact instructor to add.  This class has a $35 course fee.",
                "classId": "26877",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gavin, R.",
                                "sunet": "rgavin"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "This class is for students in the band and meets in a band room. A permission code from the instructor is required to add the course.",
                "classId": "25193",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gavin, R.",
                                "sunet": "rgavin"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220368",
        "number": "LEAD 95",
        "units": [
            1,
            2
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "101",
        "title": "Leading at Stanford & Beyond: Skills for Changemaking & Community Building",
        "description": "Enhance your skills in leading and creating positive social change within the Stanford community and beyond. Deepen self-knowledge and self-awareness while building capabilities for leading in teams and communities. Rooted in the Social Change Model, this experiential and project-based course explores topics including values in action, effective collaboration, team and community-building, communicating across differences, and inspiring common purpose within groups. Build your leadership toolkit through hands-on practice and apply your learnings in the specific communities to which you belong. This class is for students with both formal and informal leadership roles on campus.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "217655",
        "number": "LEAD 101",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "103",
        "title": "Living on Purpose (WELLNESS 123)",
        "description": "Explore the art and science of purpose-finding as it relates to living a more flourishing life at Stanford and beyond. Investigate the contemplative, psychological, social, and communal factors that deepen meaning-making, support authenticity, and encourage living more purposefully. Drawing from disciplines as diverse as art, storytelling, design, and positive psychology, create and utilize tools that promote wellbeing. Highly interactive course employs creative expression, group and individual activities, discussions, lectures, and mini-field trips to reflect on fundamental human questions in pragmatic ways.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "208036",
        "number": "LEAD 103",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "104",
        "title": "Tools for Meaningful Communities (ANTHRO 104, LIFE 104)",
        "description": "How can we live together and honor both difference and belonging? How do we create community amidst divisiveness and the existential threats of climate change, oppression of marginalized peoples, and our disconnection from ourselves and each other? We are inherently relational and have the potential to heal, flourish, and lead. Leadership and changemaking must be rooted in a commitment to deep inner work that cultivates wellbeing, insight, and wisdom. Inner work radiates outward to shape the systems that create and sustain our societies. In this class, grounded in your experiences at Stanford, you will cultivate skills and tools to enhance your intrapersonal, interpersonal and extrapersonal capacities to enact change for yourself and others. Working in teams, you will learn about and practice building community through the application of interdisciplinary frameworks that provide multiple perspectives on the transformation of the self, our relations with each other, our communities, and societal systems.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-CE",
            "WAY-EDP"
        ],
        "objectID": "223873",
        "number": "LEAD 104",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "105",
        "title": "Art of Facilitation",
        "description": "This experiential education style course allows participants to develop and test their group facilitation skills. Students will explore delivering group initiatives surrounding popular leadership topics and learn how to help their group take away valuable learning from an educational experience. Topics include: Group dynamics theories, safety, assessing the physical, human and social environment to improve group effectiveness.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "217656",
        "number": "LEAD 105",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "106A",
        "title": "Spiritual Wellbeing and Religious Encounter: Reflecting On Our Personal Spiritual Journeys (WELLNESS 106A)",
        "description": "Engage in meaningful spiritual dialogue and religious encounter with one another, fostering a conversation across differences. Explore ways to nurture meaning and purpose in daily life through experiential learning activities. You will have the opportunity to focus inwards on your own spirituality and write your spiritual autobiography. It is not expected that you will be an adherant of or have expertise in religious practices and traditions or background in religious scholarship. You will gain skills and knowledge enabling you to wrestle with life's ultimate religious and spiritual questions through readings, facilitated discussions, and breakout sessions. All sessions will be held over dinner as communal meals are ways of community building between the students. Dinner is provided.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "223122",
        "number": "LEAD 106A",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "106B",
        "title": "Spiritual Wellbeing and Religious Encounter: Creating Community (WELLNESS 106B)",
        "description": "Engage in meaningful spiritual dialogue and religious encounter with one another, fostering a conversation across differences. Explore ways to nurture meaning and purpose in daily life through experiential learning activities. Expand your religious literacy by visiting spiritual gatherings across campus. It is not expected that you will be an adherent of or have expertise in religious practices and traditions or background in religious scholarship. You will gain skills and knowledge enabling you to wrestle with life's ultimate religious and spiritual questions through readings, facilitated discussions, and breakout sessions. All sessions will be held over dinner as communal meals are ways of community building between the students. Dinner is provided.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224977",
        "number": "LEAD 106B",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "107",
        "title": "Living Leadership: Ecological and Contemplative Foundations",
        "description": "Given today's climate crisis and the associated stressors on human existence, this class engages the question: What kind of leadership is needed to guide humanity toward a sustainable, just and thriving future? Using the lens of &quot;going inward to engage outward&quot;, students explore the relationship between their personal values and beliefs and the leadership they wish to embody, with considerations of collective responsibility, justice, and sustainability. Students deepen skillfulness to navigate these inner and outer realms through nature-based practices, experiential learning, and applying ecological and Indigenous frameworks. Each class also features an exemplary guest (Indigenous wisdom keepers, community leaders, permaculturists, and contemplative teachers) to bring to life hopeful models of applied leadership at the intersection of contemplative practice and ecology.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224825",
        "number": "LEAD 107",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "108",
        "title": "Leadership from Within: Meditation, Creativity, and Connection (WELLNESS 108)",
        "description": "This interdisciplinary and practice-based course develops foundational life skills that enable students to realize their potential in school, work, and life in the 21st century. Research over the last few decades has shown that one's ability to thrive is highly correlated with growing and developing as a person: emotionally, socially, cognitively, and psychophysically. This course fosters inner growth through a specific form of evidence-based meditation called Transcendental Meditation, shown to enhance awareness, creativity, resilience, and balance. Students will also develop key communication, relationship building, and collaboration skills. The course features recent research on holistic human development, neuroscience of performance, and integrative leadership. Its design is based on a training program utilized by thousands of leaders of larger established organizations, venture backed startups, NGO's, and government agencies. This integrative approach to leadership development can reduce stress and lead to emotional balance, mental clarity, and increased effectiveness in life pursuits.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class includes the following requirements to meet beyond the class time: 4 consecutive individual training meetings in weeks 2 or 3 and a Saturday retreat in weeks 4 or 5.",
                "classId": "31007",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "2:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Littlefield 103",
                        "instructors": [],
                        "startTimestamp": 52200.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225572",
        "number": "LEAD 108",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "111",
        "title": "Luminaries and Changemakers: Life Lessons & Conversations with Extraordinary Leaders",
        "description": "Encounter luminaries and changemakers in the fields of leadership, business, social innovation, and change-making ranging from noted entrepreneurs and CEOs to social change agents, artists, and activists who are committed to enhancing individual and collective flourishing. Survey course format emphasizes direct, personal interactions with a broad variety of global luminaries and changemakers in order to understand their particular approaches and learn insights from their experiences. Engage at levels of theory and practice in order to emerge your own vision of leadership and changemaking, increase your leadership toolkit, and enhance your capacity to make meaningful impact. Specific topics evolve quarter-to-quarter based on the group of luminaries co-creating and lecturing in the course with the instructor/s. See the course notes section for this quarter's line-up of leaders and changemakers.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "221203",
        "number": "LEAD 111",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "114",
        "title": "Athletes as Leaders: Embrace the Intersection of Identities In Athletics as Tools for Social Change",
        "description": "Being an athlete provides us with a unique opportunity for leadership both within our team and beyond. In this experiential and discussion-based course, we will reflect critically on who we are behind our athlete identities - how do the other visible and invisible identities we carry intersect to shape our athlete experience? While we may all identify as Stanford athletes, no one athlete's experience is the same. With an emphasis on the importance of self-awareness and storytelling, students will look beyond their talents in their sports to reflect on how all their identities intersect and affect their positionality within Stanford and the surrounding community. As a class we will specifically look at how gender, race, ethnicity, sexual orientation, religion, socioeconomic status, mental health, and disability interact with one's identity as an athlete. Using the Marshall Ganz framework for public narrative, students will explore who they are beyond their athlete identity, what it means to be a Stanford athlete, and how the athlete community can come together to address challenges they face. Students will leave with tangible leadership skills in coaching and public narrative to allow them to better know themselves, find their voice, and learn how to use their voice for positive social change within the Stanford community. This class is specifically designed for varsity and club athletes.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class starts in Week 2. Class will be held in the Circle Room in Old Union.",
                "classId": "31080",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Friedlaender, D.",
                                "sunet": "dianef"
                            },
                            {
                                "name": "Kokenis, T.",
                                "sunet": "tkokenis"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225574",
        "number": "LEAD 114",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "120",
        "title": "Violence Intervention and Prevention: Cultivating Sexual Citizenship in Fraternities & Sororities (WELLNESS 120)",
        "description": "This course will introduce initiated fraternity and sorority members to the Sexual Citizenship Framework as well as fundamental skills and practices to support creating positive change. Students will be provided opportunities, guidance, and resources to design and implement their own projects to advance a culture of sexual citizenship in their chapters and broader fraternity and sorority communities. This course is limited to initiated fraternity and sorority members only. A permission code is required to register.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32180",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32549",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Class will be held in Kingscote 140. This class is reserved for fraternity and sorority members and will require a permission code to register.",
                "classId": "31009",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ghaffari, G.",
                                "sunet": "gpoon1"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225573",
        "number": "LEAD 120",
        "units": [
            2
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "121",
        "title": "Peer Support: Creating Spaces for Healing and Growth (WELLNESS 192)",
        "description": "Social support is an integral part of the human experience and a core pillar of human well-being. Explore ways you can be an effective source of support for your peers, using models, skills, and practices rooted in positive psychology, leadership studies and peer coaching. Conceived as a two part process, going inward and engaging outward, you will examine your well-being so you can offer support to others. Through coaching your peers you will help them discover their values, develop meaningful goals, and take steps towards building the life they want. Develop the skills, knowledge, and mindsets needed to be present with your peers when they struggle, feel stuck, and need your support. Cultivate the confidence and abilities needed to be a community leader, well-being champion, and role model for balanced, whole-hearted living at Stanford and beyond. Highly interactive course employs creative expression, group, pair,  and individual work, discussions, lectures, and self-guided reflections to support your own well-being and build your capacity to help others enhance theirs.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "30315",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224064",
        "number": "LEAD 121",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "122",
        "title": "Leading with Integrity: ASSU Leadership Foundations",
        "description": "Strengthen your leadership capacities through deepened self-awareness drawing on values-driven leadership and ethical decision-making practices in this experiential leadership development course. This course, for ASSU student leaders, emphasizes your role in supporting student life and engagement and provides frameworks, like the Social Change Model and Cultural Competence for Equity and Inclusion, to support you respectfully engaging with different constituencies, creating equitable programming opportunities, and forging partnerships with students and staff. You will focus on leadership as a set of behaviors engaged in with groups to transform advocacy priorities into robust recommendations influencing University policy, practice, and procedures.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224976",
        "number": "LEAD 122",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "127B",
        "title": "Leadership, Organizing and Action: Intensive (CSRE 127B, ETHICSOC 127B, URBANST 127B)",
        "description": "Two Consecutive Weekend Course: Community Organizing makes a difference in addressing major public challenges that demand full engagement of the citizenry, especially those whose voices are marginalized. In this course you will learn and practice the leadership skills needed to mobilize your communities for positive social change. We identify leadership as accepting responsibility to enable others to achieve shared purpose in the face of uncertainty. As organizers you will learn how to develop capacity within your community and analyze power dynamics to develop a strategic plan. By the end of this course, you will create an organizing campaign that builds power rooted in the resources of your community. The class will be an intensive held the first two weekends of winter quarter, Jan 12-14 and Jan 19-21, 2024. Class begins on Friday in the afternoon and runs through early Sunday evening. In weeks 3-10 there will be team meetings schedule TBD along with one final all class gathering Week 7 or 10.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "32697",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224851",
        "number": "LEAD 127B",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "150",
        "title": "Leading for Social Justice: The Practice and Power of Dialogue",
        "description": "This course uses a social justice framework to explore issues of identity, community, power and privilege with respect to diverse populations. We will explore historical and contemporary oppressions based on race, sex, gender identity, class, and other dimensions of identity, and use self-reflection to examine students' own lived experiences. This course will be taught in a dialogic format and will explore the power of dialogue in advancing diversity and social justice. Students will learn key concepts and skills for utilizing dialogic skills in their leadership practice, in the classroom, and in their peer interactions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "223298",
        "number": "LEAD 150",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "198",
        "title": "Directed Reading and Individual Studies - Leadership",
        "description": "Translate theoretical knowledge and acquired skills into actionable projects or initiatives that make positive impact within and/or beyond the Stanford community. Students work in collaborative groups or individually under the mentorship of the course instructor(s) to design, deliver, and evaluate an initiative or project.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "27407",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Friedlaender, D.",
                                "sunet": "dianef"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "26579",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Friedlaender, D.",
                                "sunet": "dianef"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course needs instructor permission. Students need to contact the instructor to set-up an individual studies project, schedule, and obtain a permission code.",
                "classId": "25354",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Friedlaender, D.",
                                "sunet": "dianef"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "SEM",
                "notes": null,
                "classId": "27803",
                "currentClassSize": "0",
                "maxClassSize": "8",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sol, K.",
                                "sunet": "kwiatt"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221244",
        "number": "LEAD 198",
        "units": [
            1,
            2
        ],
        "totalSections": 4
    },
    {
        "year": "2023-2024",
        "subject": "LEAD",
        "code": "199",
        "title": "Selected Topics: Leadership Studies",
        "description": "Exploration of a topic (to be determined) not covered by the standard curriculum but of interest to faculty and students in a particular quarter. May be repeated with change of content. For more information regarding specific course titles, please refer to the notes of each course section.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "27408",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Friedlaender, D.",
                                "sunet": "dianef"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "26570",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Friedlaender, D.",
                                "sunet": "dianef"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "27769",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sol, K.",
                                "sunet": "kwiatt"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "28097",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sol, K.",
                                "sunet": "kwiatt"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218681",
        "number": "LEAD 199",
        "units": [
            1,
            2
        ],
        "totalSections": 4
    }
]