[
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "10",
        "title": "Climate Change and Political Violence",
        "description": "Policymakers and scholars are increasingly interested in whether climate change could increase the risk of political instability, including violent conflicts within and between countries. In this seminar, we explore such questions as: How could the expected effects of climate change make civil or international conflicts more likely? What evidence is there that environmental factors contribute to political violence, both historically and today? What regions or countries are most at risk from these challenges, and why? In addition to addressing the human and social impacts of climate change, topics include what causes political violence within and between countries and how we can assess the contribution of different risk factors. In addition, methods and data that scholars use to explore the link between climate and conflict.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221219",
        "number": "OSPCPTWN 10",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "14",
        "title": "Academic Internship",
        "description": "Opportunity for students to pursue their specialization in an institutional setting such as a school, research institute, university, NGO, ICT4D organizations, or museums/art galleries. Engage with selection of readings relevant to the context of internship, meet weekly with the Engaged Learning Coordinator in small groups, attend group seminars, and complete assignments set by the instructors. Program culminates with a symposium, where students present their internship projects. Units determined by the number of hours per week at the internship. Prerequisite: consultation with BOSP Cape Town Engaged Learning Coordinator to develop internship that links field of study to practical experience and reflection",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "218580",
        "number": "OSPCPTWN 14",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "15",
        "title": "INDIGENOUS PEOPLES, LAW",
        "description": "This seminar will examine the history of Indigenous peoples and their legal status in some of the settler colonies of the British Empire, including the United States, Canada, New Zealand, Australia, and South Africa. It will consider shared histories of Indigenous dispossession and struggles over land tenure, contests over sovereignty and the meaning of treaties, issues of citizenship and subjecthood, and efforts at the destruction of Indigenous culture through the criminalization of traditional religious practices and the forcible removal of Indigenous children; it will also explore histories of Indigenous resistance to settler policies. The course will conclude with a comparative survey of the law governing Indigenous communities in these settler states today, as well as ongoing struggles for Indigenous rights.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223308",
        "number": "OSPCPTWN 15",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "17",
        "title": "Understanding Liberation Struggles: The US Civil Rights and South African Anti-Apartheid Movements",
        "description": "Two of the most consequential social movements of the 20th century are the African American Freedom Struggle in the U.S. and the Anti-Apartheid Movement in South Africa.  There are extensive literatures on both movements, but rarely have these two movements been studied comparatively.  What are the similarities and differences between the two struggles?  And how well to theories of social movement origins account for the two movements?  In this course, we will review the history of the two movements and then compare their emergence, subsequent development and ultimate impact through the lens of social movement theory.  We will then bring the course to a close with a sobering look at the legacies of both movements as well as the state of contemporary racial politics in the U.S. and South Africa.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "224245",
        "number": "OSPCPTWN 17",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "19",
        "title": "Understanding Liberation Struggles:  The US Civil Rights & South African Anti-Apartheid Movements",
        "description": "Two of the most consequential social movements of the 20thcentury are the African-American Freedom Struggle in the U.S. and the Anti-Apartheid Movement in South Africa.  There are extensive literatures on both movements, but rarely have these two movements been studied comparatively.  What are the similarities and differences between thetwo struggles?  And how well do current theories of social movement origins account for the two movements?  In this course, we will review the history of the two movements and then compare their emergence, subsequent development, and ultimate impact through the lens of social movement theory.  We will then bring the course to a close with a sobering look at the legacies of both movements as well as the state of contemporary racial politics in the U.S. and South Africa.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "222835",
        "number": "OSPCPTWN 19",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "20",
        "title": "Social Dynamics of Health in South Africa: A Medical Anthropological Perspective",
        "description": "This seminar introduces students to the field of anthropology's intersection with Health, Illness and Medical Histories. Drawing on discourses in Body politics, feminist theories of health and medical anthropological approaches to research, this seminar series seeks to question and explore the nature of health realities in South Africa and Africa more broadly. Essentially, it provides an intersectional exploration into how health is comparatively conceptualised using anthropology as the model of analysis.  The series is presented discursively and students' lived-experience and critical reflections are welcomed. Topics covered in the course include anthropological configurations of  'the body' (including phenomenology and biopower) as well as the history and geography of medicine (something of a broad sweep of the impact of European medicinal encounters in Africa). The theoretical approach adopted will consider postcolonial theory, development theory, and feminist theories to unpack health realities in South Africa and Africa more broadly. Typical to studies in health and well-being, the seminar series is interdisciplinary in its delivery and students are encouraged to engage critically with a broad range of literature and texts in order to grapple with the content. Thus, there are no prerequisites for doing the course and we welcome students with varying majors. The course will consist of weekly seminar sessions across 8 weeks (2 seminars per week, 16 seminar sessions in total)Instructor: Dr Efua Prah",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30445",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223857",
        "number": "OSPCPTWN 20",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "23",
        "title": "Foundations of Public Health",
        "description": "This interdisciplinary core course examines public health and healthcare in the US and globally using a social justice lens and emphasizing the interconnectedness of population and individual health. Using public health and healthcare delivery as the overarching framework, the course will cover foundational elements of public health and historical contributions. The course will cover the ethical bases, key terms and concepts, system organization; and the social, behavioral, environmental, and biological factors that contribute to specific individual and community health outcomes through interactive learning strategies and the application and integration of concepts to understand and prevent current public health problems and those facing public health.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30440",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223843",
        "number": "OSPCPTWN 23",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "24",
        "title": "Sustainable Energy Systems for South Africa",
        "description": "This course addresses the question: How can South Africa realize it pledge to reduce global warming emissions by 2030 and beyond. The approach is to review the South Africa Energy Flow Diagram and determine system solutions to carbon emission reduction, assisted by a modeling program developed in the Hesselink group. The teaching approach involves lectures, field trips, consultations with energy leaders in South Africa, and small discussion groups involving students and teacher. The overarching objective of the course is to teach students to improve their ability to critically think about (energy) issues and solving problems.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Cape Town only.",
                "classId": "29296",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hesselink, L.",
                                "sunet": "lhesse"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225121",
        "number": "OSPCPTWN 24",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "26",
        "title": "Topics in Organizations and Management",
        "description": "Students my choose from the following topics: Culture and Cultural Differences; Global Work; Navigating Diverse Teams; Organizations and Management; The Future of Work. Weekly meetings to review progress.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "221321",
        "number": "OSPCPTWN 26",
        "units": [
            1,
            2,
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "30",
        "title": "Introduction to Contemporary Issues in South Africa",
        "description": "This compulsory course provides a brief introduction to social issues in contemporary South Africa. It explores the impact of historical legacies in a post-Apartheid context. Drawing from a range of disciplines, this course provides insights into the form and content of South Africa's socio-political-historic and economic landscapes",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15362",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Louskieter, L.",
                                "sunet": "lancelou"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "For students participating in the Bing Overseas Studies Program in Cape Town only.",
                "classId": "15316",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Africa, A.",
                                "sunet": "aafrica"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217754",
        "number": "OSPCPTWN 30",
        "units": [
            1,
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "35",
        "title": "In and Out of the Margins: The Plays of Athol Fugard",
        "description": "This seminarfocuseson the plays of Athol Fugard, the most well-known, influential, and accomplished of South African playwrights. His innovative dramatic style (drawing orignally on improvisation, Brecht, and Greek tragedy,before shifting into realistic situations and dialogue);his apartheid-challenging collaborations with black South African theater artists (especially Zekes Mokei, John Kani, and Winston N'Tshona);and his extraordinarily long career (over the past sevendecades) makehis work of particular interest to students of history, theater, and politics. Through Fugard's plays, students confront signifcant issues in apartheid and post-apartheid South Africa. Set in the confines of the theater, these confrontations paradoxically generate a fuller engagement with the issues than we often get from accounts in the disciplines of history orpolitcal science. As Picasso once said, &quot;Art is the lie that tells the truth,&quot; and Fugard's theater tries to do that. In studying his plays, students will learn a different kind of truth about social and historical realities that have faced South Africans over the past six decades.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30257",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "222832",
        "number": "OSPCPTWN 35",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "36",
        "title": "The Archaeology of Southern African Hunter Gatherers",
        "description": "Archaeology, history and ethnography of the aboriginal hunter gatherers of southern Africa, the San people. Formative development of early modern humans and  prehistory of hunters in southern Africa before the advent of herding societies; rock paintings and engravings of the subcontinent as situated in this history. Spread of pastoralism throughout Africa. Problems facing the descendants of recent hunter gatherers and herders in southern Africa, the Khoisan people.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-GlobalCom",
            "WAY-SI"
        ],
        "objectID": "209971",
        "number": "OSPCPTWN 36",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "38",
        "title": "Genocide: African Experiences in Comparative Perspective",
        "description": "Genocide as a major social and historical phenomenon, contextualized within African history. Time frame ranging from the extermination of indigenous Canary Islanders in the fourteenth and fifteenth centuries to more recent mass killings in Rwanda and Darfur. Emphasis on southern African case studies such Cape San communities and the Herero people in Namibia. Themes include: roles of racism, colonialism and nationalism in the making of African genocides. Relevance of other social phenomena such as modernity, Social Darwinism, ethnicity, warfare and revolution. Comparative perspective to elucidate global dimensions.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29507",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-GlobalCom",
            "WAY-EDP"
        ],
        "objectID": "209967",
        "number": "OSPCPTWN 38",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "42",
        "title": "White South-African Writers",
        "description": "I would be thrilled to work with students on an independent study that addressed the work of white South-African writers whose fiction (and in some cases their political activism) challenged the South African apartheid government. I would imagine a directed reading of white South-African novelists &iquest;Alan Paton, Nadinne Gordimer, and J.M. Coetzee&iquest;whose work (and in some cases whose lives) constituted resistance to apartheid. The many possibilities include Alan Paton's Cry, The Beloved Country(a new film adaptation, starring Mark Rylance and Johnny Depp, is set to be released this year) and Ah, but Your Land is Beautiful; Nadinee Gordimer's The Conservationist, Occasion for Loving, The Burgher's Daughter, Get a Life, and The Pickup(2001); J.M. Coetzee Waiting for the Barbarians,Disgrace, The Life &amp; Times of Michael K, and essays from White Writing. Interested students could undertake reading and discussing works by a single author, or a combination of the titles listed above by different writers.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30258",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222833",
        "number": "OSPCPTWN 42",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "45",
        "title": "Transitional Justice and Transformation Debates in South Africa",
        "description": "Exploration of transitional justice through critical discussion of contemporary South Africa. Conflicting perspectives of the South African transition through an exploration of the creation of the &quot;rainbow nation&quot; as well as discussions over whether a denial of justice for apartheid-era crimes prevails. Decisions made post-apartheid over how best to confront the large-scale human rights abuses of the past, including South Africa's recent past through the lens of the &quot;pillars&quot; of transitional justice: truth seeking, criminal justice, reparations and institutional reform. Issues of structural violence and the legacies of apartheid in order to question to what extent we can consider South Africa to have realised the promises of its transition",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "15514",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Scanlon, H.",
                                "sunet": "scanlonh"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": "For students participating in the Bing Overseas Studies Program in Cape Town only.",
                "classId": "15320",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Africa, A.",
                                "sunet": "aafrica"
                            },
                            {
                                "name": "Scanlon, H.",
                                "sunet": "scanlonh"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "219768",
        "number": "OSPCPTWN 45",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "49",
        "title": "Foundations of Public Health and Social Justice",
        "description": "This course will examine public health and healthcare in the US, South Africa and globally using a social justice lens and emphasizing the interconnectedness of population and individual health. Using public health and healthcare delivery as the overarching framework, the course will cover foundational elements of public health, historical contributions and incorporate elements of social justice throughout the course. Students will learn about the social determinants of health and the influence this has on the health of a society. Students will gain an understanding of the complex nature of the person in the environment taking into consideration the dynamics of social oppression, diversity and social functioning and how biases, prejudice and oppression have led to health disparities. Through active learning in class, field trips and community engagement, students will be guided in becoming effective leaders to promote social justice and healthy communities. Course Director: Lars Osterberg, MD, MPH https://profiles.stanford.edu/lars-osterberg  larso@stanford.edu",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223981",
        "number": "OSPCPTWN 49",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "55",
        "title": "Arts of Change",
        "description": "How might we understand the creative arts in South Africa in terms of their variety and impact? What social issues do they reflect? What impact might they yet have? Students will have the opportunity for a related practicum. Course must be taken for a minimum of 3 units to satisfy a Ways requirement.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29428",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "215432",
        "number": "OSPCPTWN 55",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "67",
        "title": "ICT4D: An Introduction to the Use of ICTs for Development",
        "description": "Overview of selected ICT4D initiatives in Africa and South Africa. Engage critically with the optimism that follows technology invention to evaluate context and the digital knowledge gap. Themes such as the notion of technological colonization, co-design, SDG ICT agenda, policy and frameworks and other fundamentals in the field.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15363",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "For students participating in the Bing Overseas Studies Program in Cape Town only.",
                "classId": "29515",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Africa, A.",
                                "sunet": "aafrica"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "217193",
        "number": "OSPCPTWN 67",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "78",
        "title": "Postcolonial Modernist Art Movements in Africa",
        "description": "Introduction to the complexities and contradictions of 'modernity' and 'modernism(s)' in postcolonial Africa. With a focus on ideology-driven interdisciplinary artistic movements in Senegal, Nigeria, Sudan, Congo, Egypt, Ethiopia and South Africa, examine various schools of thought that were part of modern consciousness that characterised the independence decades. Role that art centres, workshops, collectives and mission schools played in histories of European expansion and colonialism. Debates regarding notions of 'appropriation,' 'natural synthesis' and 'assimilation' interpreted in the context of postcolonial theory. Different modes of production and methodological approaches.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "217755",
        "number": "OSPCPTWN 78",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "79",
        "title": "Engaging Southern Cities: Thinking urbanization, development, and public culture from Cape Town",
        "description": "Critical exploration of culture-led urban development in postapartheid Cape Town and beyond. Introduction to the rise of the creative economy in South Africa and Cape Town; current local development of Woodstock. Ways and forms of conflict but also new social interfaces between the new creative tenants and the old established community, on the one hand pointing to problematic issues like lingering gentrification, sociospatial polarisation and lopsided cultural representation while also trying to flesh out some of the opportunities for finding the right frequency of engagement between creative industries and spaces of vernacular creativity within Cape Town's post-apartheid urban realm.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29568",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "For students participating in the Bing Overseas Studies Program in Cape Town only.",
                "classId": "29298",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Africa, A.",
                                "sunet": "aafrica"
                            },
                            {
                                "name": "Wenz, L.",
                                "sunet": "wenzl"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "217756",
        "number": "OSPCPTWN 79",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "83",
        "title": "From Cape to California: Settler Colonialism and the Genocide of Indigenous Peopes",
        "description": "Two major social and historical phenomena: genocide and settler colonialism, contextualized within the broad contours of world history as well as the making of European colonialism and Western global domination from the start of European colonial expansion in the fifteenth century to the twentieth century. Emphasis on developing global comparative perspectives focusing on southern African, North and Latin American, as well as Australian case studies. Histories of the place from which students come, California, as well as the place they currently find themselves, the Cape, and the links both have to settler colonialism and the genocidal destruction of indigenous peoples",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "221040",
        "number": "OSPCPTWN 83",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "85",
        "title": "Diversity, Inclusion and Social Justice in Cape Town",
        "description": "Implicit bias and the value of diversity and inclusion in our society; understanding of bias (explicit vs implicit) and the power that bias has in our every-day lives given implicit bias has such a profound effect on our attitudes, behaviors, and decision making. Students learn of some of their own biases, how they can mitigate them, and through study and visiting local communities and historical sites, appreciate the value of social justice. Power that diversity has in the composition of teams and in society and the importance for all of us to restore and maintain social justice so there can be peace both within and among nations",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "221362",
        "number": "OSPCPTWN 85",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "OSPCPTWN",
        "code": "88",
        "title": "Computational Education",
        "description": "In 2022 there is a unique opportunity to build better learning experiences that serve more students. In this research-level course we explore ways to leverage; modern AI, online platforms and large datasets to address challenges in education for learners around the world. Imagining and contributing to education's digital future is an open challenge and as such this course is designed to encourage your creativity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30259",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223844",
        "number": "OSPCPTWN 88",
        "units": [
            4
        ],
        "totalSections": 1
    }
]