[
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "15N",
        "title": "\"My Life Had Stood - A Loaded Gun\":  Dostoevsky, Dickinson, and the Question of Freedom.",
        "description": "As far apart as Dickinson and Dostoevsky are in terms of national contexts, gendered possibilities of life, and their choice of minimalist or maximalist forms, their experiences of constriction and freedom bore significant similarities. Dostoevsky penned his vow to love life on the day that he was manacled as a political prisoner and marched off to thirteen years of forced labor and exile in Siberia. He exploded back on the Petersburg literary scene in the early 1860's with three block-busters, &lt;em&gt;Notes from the Underground&lt;/em&gt;, &lt;em&gt;Memoirs from the House of the Dead&lt;/em&gt;, and &lt;em&gt;Crime and Punishment&lt;/em&gt;, establishing himself forever as Russia's most controversial explorer of the violence of human thought. In these same years Emily Dickinson was sequestering herself in her family's Amherst house for the remainder of her life, yet she announced her rebel's credo in these enigmatic lines: &lt;em&gt;&quot;My Life Had Stood, a Loaded Gun&lt;/em&gt; - until the Day...&quot; In this class we will explore the idea that Emily Dickinson and Fyodor Dostoevsky may be seen as original shifters of modern literary art and philosophy. We will unpack the agonizing relationship of freedom, action, and language that both authors explore. Classes will be organized around presentations, debates in pairs, the exploration of &quot;scandalous scenes,&quot; and finally a symposium in which students will present and contribute to each other's paper projects. There are no prerequisites for this course apart from a desire to read poems and novels closely and in tandem.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220410",
        "number": "SLAVIC 15N",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "36",
        "title": "Dangerous Ideas (ARTHIST 36, COMPLIT 36A, EALC 36, ENGLISH 71, ETHICSOC 36X, FRENCH 36, HISTORY 3D, MUSIC 36H, PHIL 36, POLISCI 70, RELIGST 36X, TAPS 36)",
        "description": "Ideas matter. Concepts such as equality, tradition, and Hell have inspired social movements, shaped political systems, and dramatically influenced the lives of individuals. Others, like race and urban renewal, play an important role in contemporary debates in the United States. All of these ideas are contested, and they have a real power to change lives, for better and for worse. In this one-unit class we will examine these &quot;dangerous&quot; ideas. Each week, a faculty member from a different department in the humanities and arts will explore a concept that has shaped human experience across time and space.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "219068",
        "number": "SLAVIC 36",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "61N",
        "title": "Literature at War",
        "description": "Why have verbal artists since Homer been fascinated with armed conflict and destruction? In the early 1990s, two self-consciously multinational and multicultural socialist states, the Soviet Union and Yugoslavia, broke apart. Soon, people who had lived in countries that proclaimed slogans like &quot;friendship of the peoples&quot; and &quot;brotherhood and unity&quot; were fighting wars with one another, incited by militant nationalism and dreams of conquest. Writers played an important role in these conflicts, usually not as frontline combatants (though it was a former poet who led the genocide in Bosnia) but rather because literature was called upon to explain the failures of the past and disasters of the present, to build up national identities that were newly autonomous yet under attack, or even to recreate a sense of multinational solidarity. In this class we will read literature connected to two wars in which smaller states have faced the violent designs of their more powerful neighbors: the invasion of Bosnia by Serbia (and Croatia) in the mid-1990s, and the ongoing invasion of Ukraine by Russia. Readings will include works by Miljenko Jergovi, Dubravka Ugrei, Saa Stanii, Serhiy Zhadan, and Andrey Kurkov, in English translation.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224410",
        "number": "SLAVIC 61N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "70N",
        "title": "Socialism vs. Capitalism: Russian and American Writers' Responses",
        "description": "The turn of the 20th century was marked with turbulent political events and heated discussions about the future of Russian and American societies. Many writers and intellectuals responded to the burning issues of social justice, inequality, egalitarianism, and exploitation associated with capitalism and socialism. Through close reading, critical thinking, and analytical writing, we will engage in the critical discussions of class struggle, individual interest versus collective values, race, and social equality, and identify points of convergence and divergence between the two systems. To what extent was the opposition between capitalism and socialism fueled by the artistic vision of the great Russian and American writers? What was these thinkers' ideal of society and what impact did it have on shaping emerging socialism? Readings for the class include the fundamental works of Fyodor Dostoevsky, Leo Tolstoy, Jack London, W.E.B. Du Bois and Sholem Aleichem. The course will culminate in a digital mapping project visualizing intellectual connections between ideas and writers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220217",
        "number": "SLAVIC 70N",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "77Q",
        "title": "Russia's Weird Classic: Nikolai Gogol",
        "description": "This seminar investigates the work and life of Nikolai Gogol, the most eccentric of Russian authors, the founder of what was dubbed Fantastic (or Magic) Realism. Our investigation will be based on close reading of the works written in various stages of Gogol's literary career. This study provides a perspective on the relationship between Romanticism and Realism in Russian literature, and between the popular Ukrainian culture and &quot;high&quot; Russian and West European traditions in Gogol's oeuvre. In the course, we will discuss such important theoretical concepts as the relation of narrator and author in a work, the methods of depicting characters, the differences between humor and satire, the notions of 'reality' and fantastic' in Gogol's world. The seminar also traces Gogol's influences on subsequent Russian literature (Dostoevsky in particular) and explores the impact of his work on XX century modernist literature, theatre, music, and painting (literature of the absurd, Dmitry Shostakovich, Vladimir Nabokov, Marc Chagall and Kazimir Malevich). The course is intended for the students interested in literature and literary theory.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "119555",
        "number": "SLAVIC 77Q",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "104N",
        "title": "Chernobyl in Media and Popular Culture",
        "description": "The course will introduce students to the Chernobyl nuclear disaster through the history of the late Soviet utopian project of the &quot;atomic cities&quot; to the intellectual, aesthetic, and artistic responses that the Chernobyl catastrophe generated in the post-Soviet Ukrainian, Belarusian, and Russian societies. During the course, we will study environmental, social, and ecological consequences of the Chernobyl disaster and analyze its many representations of Chernobyl in fictional, cinematographic, oral histories, map projects, VR, photography, and other media in order to understand how the disaster resonates across space and time. We will consider such issues as urban and technological utopias of the late Soviet Union, representations of the disaster; ethics; health and disease; the body and its deconstruction; ecology and climate; the appropriation of disaster narratives and disaster tourism; the media and cover-ups; and faith and religion.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISF",
                "notes": "Introductory Seminar. Preference to first-year students; sophomore and new transfer students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "28563",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Econ 206",
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            },
                            {
                                "name": "Korotkov, G.",
                                "sunet": "georgii"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225274",
        "number": "SLAVIC 104N",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "110",
        "title": "The Russian Empire, 1450-1800 (HISTORY 120A)",
        "description": "(Same as HISTORY 20A. 120A is 5 units, 20A is 3 units.) The rise of Russian state as a Eurasian &quot;empire of difference&quot;; strategies of governance of the many ethnic and religious groups with their varied cultures and political economies; particular attention to Ukraine. In the Russian center, explores gender and family; serfdom; Russian Orthodox religion and culture; Europeanizing cultural change of 18th century.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-SI"
        ],
        "objectID": "115056",
        "number": "SLAVIC 110",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "111",
        "title": "Russia and Her Conflicts: History, Literature, and Film",
        "description": "Winston Churchill famously characterized Russia as a &quot;riddle wrapped in a mystery inside an enigma.&quot; As war rages on in Ukraine, many are left wondering: why is Russia so hostile to her neighbors and the West? This course examines the origins of Russia's foreign and domestic conflicts - from Ivan the Terrible to Vladimir Putin - by examining a wide variety of literature, autobiography, film, art, and historical documents. Topics include: Russian imperialism in Europe, the Caucuses, and Siberia, the Russian Revolution, World War II, the Gulag, and the war in Ukraine. Course and all readings are in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "225100",
        "number": "SLAVIC 111",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "116",
        "title": "Literature and the Dream of Agriculture in Russia and Beyond",
        "description": "Why do city people think if they started farming, they could heal themselves and their society? How do writers make agriculture seem exciting, or farms seem beautiful? While agriculture is ancient and world-wide, literature and political movements that posited it as a way for urbanites to be happier and more virtuous and societies to reach utopia thrived especially in the 19th-century Russian Empire. These movements influenced Soviet Communism, nationalisms (including Zionism), and American communes in the 1970s. In this class, we read fiction, poetry, memoirs, and essays about city people's embrace of farming. We compare the Eastern European case to the United States in the 20th century and we look at 21st-century back-to-the-land writing and films. This class is offered in partnership with the Stanford Farm, where we will spend a few days working (assuming pandemic restrictions permit).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222838",
        "number": "SLAVIC 116",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "117",
        "title": "The Eurasian World From Plato to NATO: History, Politics, and Culture (HISTORY 127, POLISCI 142)",
        "description": "The course explores the history, politics and culture of the Eurasian space, covering themes such as the rise and fall of civilizations; political and ideological movements; literature and art; and geopolitics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30437",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Weiner, A.",
                                "sunet": "weiner"
                            },
                            {
                                "name": "Grzymala-Busse, A.",
                                "sunet": "amgbusse"
                            },
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "30436",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225276",
        "number": "SLAVIC 117",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "118N",
        "title": "Other People's Words: Folklore and Literature",
        "description": "What happens when you collect and use other people's words? This class considers folklore and literature based on it, focusing on the theme of objects that come to life and threaten their makers or owners. We read Russian fairy tales and Nikolai Gogol's stories, the Golem legend and Ovid's and Shaw's Pygmalion, and Svetlana Aleksievich's Voices from Chernobyl, a collection of the words of survivors who reflect on life after a human invention has destroyed many of its keepers. We read essays by Jacob Grimm, Roman Jakobson, Vladimir Propp, Lenore Keeshig-Tobias, and others, to understand what folklore can mean and how the oral and the recorded word can interact. Students collect living folklore from a group of their choosing and analyze it using the theories we study in class (or other theories, if you want); wherever you are, you will tailor your research to the communities to which you have access. This course fulfills the second-level Writing and Rhetoric Requirement (WRITE 2) and emphasizes oral and multimedia presentation. You will develop skills to produce shorter and longer prerecorded presentations.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "Writing 2"
        ],
        "objectID": "218834",
        "number": "SLAVIC 118N",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "121",
        "title": "Ukraine at a Crossroads (REES 221, SLAVIC 221)",
        "description": "Literally meaning &quot;borderland,&quot; Ukraine has embodied in-betweenness in all possible ways. What is the mission of Ukraine in Europe and in Eurasia? How can Ukraine become an agent of democracy, stability, and unity? What does Ukraine's case of multiple identities and loyalties offer to our understanding of the global crisis of national identity? In this course, we will consider the historical permeability of Ukraine's territorial, cultural, and ethnic borders as an opportunity to explore the multiple dimensions of its relations with its neighbors. In addition to studying historical,  literary, and cinematic texts, we discuss nationalism, global capitalism, memory politics, and propaganda in order to understand post-Euromaidan society. All required texts are in English. No knowledge of Ukrainian is required. NOTE: To satisfy a WAYS requirement, this course must be taken for at least 3 units.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220167",
        "number": "SLAVIC 121",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "123",
        "title": "Getting the Picture: Photojournalism in Russia and the U.S. (AMSTUD 123, COMM 123, REES 223, SLAVIC 323)",
        "description": "The vast majority of photographs printed and consumed around the world appeared on the pages of magazines and newspapers. These pictures were almost always heavily edited, presented in carefully devised sequences, and printed alongside text. Through firsthand visual analysis of the picture presses of yesteryear, this course considers the ongoing meaning, circulation, and power of images as they shape a worldview in Russia as well as the US. In looking at points of contact between two world powers, we will cover the works of a wide array of authors, photographers, photojournalists and photographed celebrities (Lev Tolstoy, Margaret Bourke-White, Russian satirists Ilf and Petrov, John Steinbeck and Richard Capa, and many others). We will explore the relationship between photojournalistic practice of the past with that of our present, from the printed page to digital media, as well as the ethical quandaries posed by the cameras intervention into/shaping of modern history. No knowledge of Russian is required.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "223392",
        "number": "SLAVIC 123",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "128",
        "title": "Literature of the former Yugoslavia (COMPLIT 128, REES 128)",
        "description": "What do Slavoj Zizek, Novak Djokovic, Marina Abramovic, Melania Trump, Emir Kusturica, and the captain of the Croatian national football team have in common?  All were born in a country that no longer exists, the Socialist Federal Republic of Yugoslavia (1945-1992). This course will introduce masterpieces of Yugoslav literature and film, examining the social and political complexities of a multicultural society that collapsed into civil war (i.e. Bosnia, Kosovo) in the 1990s.  In English with material available in Serbo-Croatian and Slovenian.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221512",
        "number": "SLAVIC 128",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "129",
        "title": "Russian Versification: Poetry as System (SLAVIC 329)",
        "description": "The study of verse is foundational to literary theory and poetics. The practical goal of the course is to acquaint the students with specific features of Russian prosody and verse in its historical development and to survey such basic concepts as meter and rhythm, iamb and trochee, ternary meters and dolniks, accentual verse and free verse, rhyme and stanza in order to grasp their difference within Russian poetry from what we encounter in ancient Greek and Latin, as well as modern European literatures. The material of the course helps better understand the different stages in the history of Russian literature. We also address various approaches to poetry translation and the use of oriental verse forms (Persian, Japanese etc.) in Russian modern and modernist literature. Taught in English, readings in Russian. Prerequisite: Two years of Russian.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "214465",
        "number": "SLAVIC 129",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "131",
        "title": "Russia in Color (ARTHIST 247, ARTHIST 447, SLAVIC 331)",
        "description": "This course explores the application, evolution, and perception of color in art, art history, literature, and popular culture - in (Soviet) Russia and emigration. Working closely with the Cantor Arts Center collection at Stanford, this course pairs artifacts art with theoretical and cultural readings (media theory, philosophy, literature, science). With a particular focus on Russian and East European objects (including those by Russian icons, Soviet posters, and prints by Wassily Kandinsky and Marc Chagall), the course will include a basic introduction to color terminology, guest lectures on the technologies color printing, the science of color perception, and a hands-on practicum in color mixing/pigmentation. In addition to direct encounters with material and artifact, our course will also seek to better understand the digital experience of art objects in general, and color in particular. No knowledge of Russian is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "223605",
        "number": "SLAVIC 131",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "140",
        "title": "The Other Europe: Literature from East Central Europe (SLAVIC 340A)",
        "description": "East Central Europe, both despite and because of its history of shape-shifting borders, has long been the locus of extraordinarily diverse humanity.  There are few other regions where so many ethnicities, languages, and religions exist side by side -- or even closer than that  -- with one another.  It is also a region carved and re-carved into subject pieces by empires: Ottoman, Habsburg and Russian before World War I, violently torn between Nazi Germany and the Soviet Union during World War II, and forcibly coerced into a Bloc until the last decade of the 20th century.  Polish poet and Nobel laureate Czeslaw Milosz asserted that &quot;the most striking feature in Central European literature is its awareness of history&quot;: of history's somehow coexistent inexorability and caprice, and of its capacity for a full spectrum of absurdity, from tragic to banal to comic. This course will introduce works in translation by 20th- and 21st-century East Central European writers (Tokarczuk, Ugresic, Kassabova, Knezevic, and others) -- supplemented with selections from film, visual art, and music -- and consider how these creative works respond to the complexities of the region&iquest;s history, cultural diversity, and individual and collective identities.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31658",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "260-244",
                        "instructors": [
                            {
                                "name": "Nafpaktitis, M.",
                                "sunet": "nafpakt"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225568",
        "number": "SLAVIC 140",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "145",
        "title": "Survey of Russian Literature: The Age of Experiment (SLAVIC 345E)",
        "description": "This course discusses the transition from predominately poetic to predominately prosaic creativity in the Russian literature of the first half of the 19th century Russian literature and the birth of the great Russian novel. It is focused on the peculiarities of poetics and narrative style in the literary works of three towering figures of the period in question - Alexander Pushkin, Mikhail Lermontov, and Nikolai Gogol -- and examines the changes in the Russian literary scene affected by them. An emphasis is placed on close reading of literary texts and analysis of literary techniques employed in them. We will discuss the various approaches and possibilities in presenting authorial positions and characterization in literature; ways of experimenting with narrative and playing with the reader; the creation of the historical and psychological novel and the use of different narrative devices for diverse artistic purposes. Taught in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "10988",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "240-110",
                        "instructors": [
                            {
                                "name": "Averbach, R.",
                                "sunet": "wurl"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "213772",
        "number": "SLAVIC 145",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "146",
        "title": "The Great Russian Novel: Tolstoy, Dostoevsky, and more (SLAVIC 346)",
        "description": "Why are people obsessed with big Russian books? What can literature do with life, death, and transgression? This course explores the psychological and philosophical intensity of novels like Crime and Punishment in tandem with the aesthetic development of 19th century Russian realism. We will investigate both violence and voice, both gender and genre, both morality and medium, through close reading and discussion of novelistic masterpieces by authors including Leo Tolstoy, Fyodor Dostoevsky, and Ivan Turgenev. Readings and discussion will be in English, with an optional Russian section for Russian speakers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "11276",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "30892",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-A-II"
        ],
        "objectID": "119562",
        "number": "SLAVIC 146",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "147",
        "title": "Modern Russian Literature and Culture: The Age of War and Revolution (SLAVIC 347)",
        "description": "What makes Russian modernism special? Or is there anything special about Russian modernism? And how did modernist poets, prose writers, and filmmakers respond to the turbulent events of the first half of the 20th century, when Russia was shaken by revolution and war? This course aims to answer these questions through close readings of works by authors like Vladimir Mayakovsky, Isaac Babel, Osip Mandelstam, Mikhail Zoshchenko, Andrei Platonov, Yuri Olesha, and Mikhail Bulgakov, as well as early Soviet film. Aesthetic issues such as hero, plot, language, and poetic and narrative devices will be addressed with the aid of contemporaneous literary theory (e.g., Shklovsky, Tynianov, Eikhenbaum, Bakhtin). Novels and theory will be read in English. NOTE: This course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-A-II"
        ],
        "objectID": "119563",
        "number": "SLAVIC 147",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "148",
        "title": "Slavic Literature and Culture since the Death of Stalin (REES 348, SLAVIC 348)",
        "description": "The course offers a survey of Soviet and post-Soviet literary texts and films created by Russian, Ukrainian and Belarusian artists and marginalized or repressed by the Soviet regime. The first part of the course will focus on the topics of opposition and dissent, generational conflict, modernization, Soviet everyday life, gender, citizenship and national identity, state-published and samizdat literature, &quot;village&quot; and &quot;cosmopolitan&quot; culture, etc. The second part of it will be devoted to the postmodernist aesthetics and ideology in the dismantlement of totalitarian society, as well in the process of shaping post-Soviet identities. The reading materials range from the fictional, poetic, and publicistic works written by Noble-prize  (Solzhenitsyn, Brodsky, Alexievich) and other major writers of the period to the drama, film, and popular culture.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29361",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "213773",
        "number": "SLAVIC 148",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "149",
        "title": "Tails from the Russian Empire: Animals in Russian and Yiddish Literatures (JEWISHST 149)",
        "description": "Unless you subscribe to certain extreme life philosophies, animals probably constitute some of your existence and environment - whether living with pets, hearing birds around campus, or confronting our human selves every morning, most of us would struggle to completely avoid animals in daily life. In this course, we explore different types of media and texts - though predominantly Russian and Yiddish literatures from 19th-century Russia in English translation - ventriloquizing, problematizing, and otherwise instrumentalizing non-human animals. Through our animal readings on narration and theory, we reconsider concepts of relation, humanism, sustainability, responsibility. Students can apply their refined understandings to create art pieces of digital humanities projects using the Textile Makerspace.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30598",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kim, E.",
                                "sunet": "kimer"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225270",
        "number": "SLAVIC 149",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "155",
        "title": "St. Petersburg: Imagining a City, Building a City (URBANST 156)",
        "description": "St. Petersburg, the world's most beautiful city, was designed to display an 18th-century autocrat's power and to foster ties between Russia and the West - on the tsar's terms. It went through devastating floods and a deadly siege; it birthed the &quot;Petersburg myth,&quot; poems and prose that explore the force of the state and the individual's ability to resist. This class addresses the struggle between the authorities and the inhabitants; the treacherous natural environment; the city as a node in national and international networks of communication; the development of urban transportation networks; and the supply of goods. NOTE: <i>This course is required of students attending the overseas seminar to St. Petersburg in September 2018.</i>Class times to be determined upon the availability of all enrolled students. Please contact instructor(s) via email if you have any questions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "219669",
        "number": "SLAVIC 155",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "156",
        "title": "Vladimir Nabokov:  Displacement and the Liberated Eye (COMPLIT 115, COMPLIT 315, SLAVIC 356)",
        "description": "How did the triumphant author of &quot;the great American novel&quot; &quot;Lolita&quot; evolve from the young author writing at white heat for the tiny sad Russian emigration in Berlin?  We will read his short stories and the novels &quot;The Luzhin Defense, Invitation to a Beheading, Lolita, Lolita&quot; the film, and &quot;Pale Fire&quot;, to see how Nabokov generated his sinister-playful forms as a buoyant answer to the &quot;hypermodern&quot; visual and film culture of pre-WWII Berlin, and then to America's all-pervading postwar &quot;normalcy&quot; in his pathological comic masterpieces &quot;Lolita&quot; and &quot;Pale Fire&quot;. Buy texts in translation at the Bookstore; Slavic grad students will supplement with reading and extra sessions in original Russian.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum"
        ],
        "objectID": "140782",
        "number": "SLAVIC 156",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "160",
        "title": "Cultural Hybridity in Central-Eastern Europe (COMPLIT 231B, SLAVIC 360)",
        "description": "Historically shaped by shifting borders and mixing of various cultures and languages, identities in-between have been in abundance in Central-Eastern Europe. This course offers a comprehensive study of the oeuvre of several major Central-European authors of modernity: the Ukrainian-Russian Nikolai Gogol (1809-1852), the Czech-German-Jewish Franz Kafka (1883-1924), the Austrian-Galician-Jewish Leopold von Sacher-Masoch (1836-1895), the Ukrainian-Galician Olha Kobylyans&iquest;ka (1863-1942), the Russian-German Lou Andreas-Salom&eacute; (1861-1937), the Jewish-Polish-Galician Bruno Schulz (1892-1942), and the Polish-Argentinean Witold Gombrowicz (1904-1969). Performing their selves in two or more cultures, these writers were engaged in identity games and produced hybrid texts with which they intervened into the major culture as others. In the course, we will apply post-structuralist and post-colonial concepts such as minor language, heterotopia, in-betweenness, mimicry, indeterminacy, exile, displacement, and transnationalism to the study of the writers oeuvres. We will also master the sociolinguistic analysis of such multi-lingual phenomena as self-translation, code-switching, and calquing and examine various versions of the same text to uncover the palimpsest of hybrid identities.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "218368",
        "number": "SLAVIC 160",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "171",
        "title": "Chernobyl: from Soviet Utopia to Post-Soviet Apocalypse (REES 322, SLAVIC 371)",
        "description": "The course will introduce students to the Chernobyl nuclear disaster through the history of the late Soviet utopian project of the &quot;atomic cities&quot; to the intellectual, aesthetic, and artistic responses that the Chernobyl catastrophe generated in the post-Soviet Ukrainian, Belarusian, and Russian societies. During the course, we will study environmental, social, and ecological consequences of the Chernobyl disaster and analyze its many representations across a range of media and cultures. In the end of the course, we will create a portrait of Chernobyl in the collaborative multimedia project &quot;The Control Room #4&quot; which will assemble the representation of Chernobyl in fictional, cinematographic, oral histories, map projects, VR, photography, and other media in order to show how the disaster resonates across space and time. We will consider such issues as urban and technological utopias of the late Soviet Union, representations of the disaster; ethics; health and disease; the body and its deconstruction; ecology and climate; the appropriation of disaster narratives and disaster tourism; the media and cover-ups; and faith and religion.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "223393",
        "number": "SLAVIC 171",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "173",
        "title": "Children's Literature:  Russia, Eastern Europe, and Beyond (SLAVIC 373)",
        "description": "This course traverses the world of Russian and Eastern European literature for children. In our look at a wide variety of children's cultural artifacts (from text to film), we will analyze the ways in which stories for children, and stories about children, form the foundation for literacy and cultural education. We will be transported by the magic of fairy tales as we compare the Brothers Grimm to Russian folk tales. We will analyze pedagogical and artistic methods in illustrated primers, picture books, and magazines made for American and Soviet youth. We will examine the media and politics that shape the adaptation of oral storytelling to the animation of the silver screen. Through these and many other sites of comparison between Russia, Eastern Europe and world traditions, we seek to understand the specific cultural codes of childhood in its historical development, as well as what might constitute a universal notion of being a child. No knowledge of Russian is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223606",
        "number": "SLAVIC 173",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "179",
        "title": "Literature from Medieval Rus' and Early Modern Russia (SLAVIC 379)",
        "description": "This course traces the history of Russian literature before the eighteenth century. It is divided into two sections. The first section examines literature from Kyivan Rus' (up to the thirteenth century), the medieval conglomerate to which Belarus, Russia and Ukraine all trace their cultural heritage. The second section examines old Russian literature specifically, from the fourteenth to seventeenth centuries. We pay close attention to the development of literary genres, moral/religious and aesthetic features and their relationship, and the beginnings of Russian belles lettres. Our approach to the texts will be two-fold. On the one hand, we will spend some time situating the sources within their historical contexts. On the other hand, we will explore the interpretive possibilities of premodern literature using formal analysis and critical theory. Knowledge of an East Slavic language is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "119790",
        "number": "SLAVIC 179",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "181",
        "title": "Philosophy and Literature (CLASSICS 42, COMPLIT 181, ENGLISH 81, FRENCH 181, GERMAN 181, ILAC 181, ITALIAN 181, PHIL 81)",
        "description": "Can novels make us better people? Can movies challenge our assumptions? Can poems help us become who we are? We'll think about these and other questions with the help of writers like Toni Morrison, Marcel Proust, Jordan Peele, Charlie Kaufman, Rachel Cusk, William Shakespeare, and Samuel Beckett, plus thinkers like Nehamas, Nietzsche, Nussbaum, Plato, and Sartre. We'll also ask whether a disenchanted world can be re-enchanted; when, if ever, the truth stops being the most important thing; why we sometimes choose to read sad stories; whether we ever love someone for who they are; who could possibly want to live their same life over and over again; what it takes to make ourselves fully moral; whether it's ever good to be conflicted; how we can pull ourselves together; and how we can take ourselves apart. (This is the required gateway course for the Philosophy and Literature major tracks. Majors should register in their home department.)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "13440",
                "currentClassSize": "0",
                "maxClassSize": "93",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "McMurtry Art Building Oshman",
                        "instructors": [
                            {
                                "name": "Peacocke, A.",
                                "sunet": "peacocke"
                            },
                            {
                                "name": "Landy, J.",
                                "sunet": "landy"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II"
        ],
        "objectID": "204034",
        "number": "SLAVIC 181",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "183",
        "title": "Jews in the Contemporary World: Culture, Pop Culture, and Representation (CSRE 185B, HISTORY 185B, JEWISHST 185B, REES 185B)",
        "description": "(HISTORY 185B is 5 units; HISTORY 85B is 3 units.)  From Barbra Streisand to Volodymyr Zelenskyy, from The Dybbuk to Broad City, and from Moscow to LA, this course applies a multicultural perspective on different experiences of Jewishness in the 20th and 21st centuries. The discussion is centered on the ways in which these experiences are represented in various types of media: in literature or on TikTok, in poetry or on Instagram, in film and on television. The themes of the course include (but are not limited to) the interplay of national, religious, ethnic, linguistic, and political identities,  intersectionality, the definitions and boundaries of Jewish cultures, Queer and variously gendered experiences of Jewishness, as well as antisemitism and stereotyped representations of Jewishness. The course introduces students to the analysis of a diverse array of media as cultural texts and historical sources. Students are encouraged to apply their new skills to media of their choice.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "GER:EC-GlobalCom",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "115235",
        "number": "SLAVIC 183",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "187",
        "title": "Classical Russian Poetry (SLAVIC 387)",
        "description": "A survey of Russian poetry from Lomonosov to Vladinmir Solov'ev. Close reading of lyrical poems.  Prerequisite: 3rd Year Russian Language",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "119788",
        "number": "SLAVIC 187",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "188",
        "title": "20th century Russian Poetry: From Aleksandr Blok to Joseph Brodsky (SLAVIC 388)",
        "description": "Developments in and 20th-century Russian poetry including symbolism, acmeism, futurism, and literature of the absurd. Emphasis is on close readings of individual poems. Readings in Russian, taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "213771",
        "number": "SLAVIC 188",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "194",
        "title": "De-Colonizing Theater in Eastern Europe and Russia (SLAVIC 394)",
        "description": "In &quot;De-Colonizing Theater,&quot; we will uncover fertile interactions among the innovative, rebellious drama and theater practices of central-eastern European countries and Russia as they have co-inhabited mobile territories and histories (1824-2024). Texts and their modern performances (filmed or video) will be available to be read and viewed in the original languages (Russian, Polish, Ukrainian, Yiddish, Czech, Lithuanian), and of course in translation. Mixed lecture/seminar format, with two presentations and one paper.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30826",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Greenleaf, M.",
                                "sunet": "mad"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225379",
        "number": "SLAVIC 194",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "195",
        "title": "Russian and East European Theater (SLAVIC 395)",
        "description": "Evolution of modernist Russian/Eur. dramaturgy, theatrical practices, landmark productions from Chekhov-Meyerhold-Grotowski to present; re-performance of classics; techniques of embodiment. Taught in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum"
        ],
        "objectID": "208367",
        "number": "SLAVIC 195",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "196",
        "title": "Readings in Yiddish Literature 1 (SLAVIC 396)",
        "description": "Yiddish literature, at a second-year language level. Readings chosen based on student interest; contact instructor with questions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "222184",
        "number": "SLAVIC 196",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "197",
        "title": "Readings in Yiddish Literature 2 (SLAVIC 397)",
        "description": "Yiddish literature, at a second-year language level. Continuation of SLAVIC 196. Readings chosen based on student interest; contact instructor with questions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "222185",
        "number": "SLAVIC 197",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "198",
        "title": "Writing Between Languages:  The Case of Eastern European Jewish Literature (JEWISHST 148, JEWISHST 348, SLAVIC 398)",
        "description": "Eastern European Jews spoke and read Hebrew, Yiddish, and their co-territorial languages (Russian, Polish, etc.).  In the modern period they developed secular literatures in all of them, and their writing reflected their own multilinguality and evolving language ideologies.  We focus on major literary and sociolinguistic texts.  Reading and discussion in English; students should have some reading knowledge of at least one relevant language as well. This course must be taken for a minimum of 3 units and a letter grade to be eligible for WAYS credit. In 2020-21, a 'letter' or 'CR' grade will satisfy the WAYS requirement.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-Hum",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "212346",
        "number": "SLAVIC 198",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "199",
        "title": "Individual Work for Undergraduates",
        "description": "Open to Russian majors or students working on special projects. May be repeated for credit. Prerequisite: consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "31172",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fleishman, L.",
                                "sunet": "lazar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10368",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "11422",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "11064",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "11065",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11423",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Greenleaf, M.",
                                "sunet": "mad"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11066",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Greenleaf, M.",
                                "sunet": "mad"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10370",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11067",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "14641",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "11424",
                "currentClassSize": "0",
                "maxClassSize": "6",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "15544",
                "currentClassSize": "0",
                "maxClassSize": "6",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213788",
        "number": "SLAVIC 199",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 12
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "203",
        "title": "Russia and Ukraine: Empire, Nation, Myth (HISTORY 223G, HISTORY 323G)",
        "description": "Explores theories of national myths and nationalism; identifies the founding myths of Russia and Ukraine and the medieval and early modern events they are based on. Extensive primary source readings. Focuses primarily up through eighteenth century, with some reading of nineteenth-century national statements.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "30490",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224148",
        "number": "SLAVIC 203",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "204",
        "title": "Politics of Identity in Ukraine",
        "description": "This course will examine various aspects of the politics of identity in Ukraine before and during Russia's invasion of the country. It will explore how the state and non-state actors such as media, businesses, churches and NGOs have molded citizens' ethnonational, linguo-cultural, social, local/regional, and other identities. At the heart of analysis will be the politics of language and their relation to ethnonational identity and power relations, the former prioritizing Ukrainian and the latter often giving advantage to Russian. At the same time, the course will also examine the politics of ethnicity, citizenship, memory, religion, and foreign policy. We will discuss legislation, political statements, media materials, protest campaign slogans, urban landscape tokens, and other textual and visual representations of certain policies asserting certain identities. We will learn how these practices constructed Ukraine as different from Russia and how the latter's attempt to impose - politically, culturally, and militarily &iquest; the similarity of the two peoples ultimately led Ukrainians to embrace a more radically anti-Russian identity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30762",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "260-301",
                        "instructors": [],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225531",
        "number": "SLAVIC 204",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "221",
        "title": "Ukraine at a Crossroads (REES 221, SLAVIC 121)",
        "description": "Literally meaning &quot;borderland,&quot; Ukraine has embodied in-betweenness in all possible ways. What is the mission of Ukraine in Europe and in Eurasia? How can Ukraine become an agent of democracy, stability, and unity? What does Ukraine's case of multiple identities and loyalties offer to our understanding of the global crisis of national identity? In this course, we will consider the historical permeability of Ukraine's territorial, cultural, and ethnic borders as an opportunity to explore the multiple dimensions of its relations with its neighbors. In addition to studying historical,  literary, and cinematic texts, we discuss nationalism, global capitalism, memory politics, and propaganda in order to understand post-Euromaidan society. All required texts are in English. No knowledge of Ukrainian is required. NOTE: To satisfy a WAYS requirement, this course must be taken for at least 3 units.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220167",
        "number": "SLAVIC 221",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "222",
        "title": "Andrei Platonov's \"Chevengur\": Text and Contexts",
        "description": "'The power of devastation [Platonov's texts] inflict upon their subject matter exceeds by far any demands of social criticism and should be measured in units that have very little to do with literature as such,' wrote Joseph Brodsky. The graduate course examines Andrei Platonov's ultimate novel &quot;Chevengur&quot; together with political and cultural discourses that framed its production. Primary and secondary readings are in Russian.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221580",
        "number": "SLAVIC 222",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "223",
        "title": "Russian & East European Literary Theory: Formalism, Bakhtin, & Beyond",
        "description": "This course explores the role of Russian and East European thinkers in creating modern literary theory, a discipline which arguably began in this region. Can we speak of &quot;Russian theory&quot; or &quot;East European theory,&quot; analogous to labels such as &quot;French theory&quot;? While emphasizing the Formalists (Shklovsky, Tynianov, Eikhenbaum, Jakobson) and the Bakhtin circle (Bakhtin, Voloshinov), we will also read their predecessors (Potebnia, Humboldt, Veselovsky) and later thinkers inspired by them (Lydia Ginzburg, Yuri Lotman) as well as their contemporary interlocutors who shaped structuralist and Marxist schools of theory (Jan Mukaovsky, Georg Luk&aacute;cs). Key issues will include the concept of literary or poetic language, the definition of &quot;form&quot; and its relationship with &quot;content,&quot; the extent of literature's autonomy with respect to historical developments and social forces, the importance of genre, and the nature of literary scholarship. Theoretical texts will be closely read. Knowledge of Russian or another Slavic language is helpful but not required: readings will be offered in English translation.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "224391",
        "number": "SLAVIC 223",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "225",
        "title": "Communist and Capitalist Fantasies: Science Fiction in the Soviet Union and the United States",
        "description": "What can science fiction tell us about life and art in the 20th century, in the Soviet Union and the United States? Speculative fiction (including sci-fi, fantasy, utopia, dystopia) combines irony and idealism, belief in science and skepticism about it. It appealed to people living under communism and capitalism. The course will relate fiction to the specific culture and politics in both countries, while also drawing transnational connections. We ask why writers and readers, filmmakers and viewers loved this art so much, despite living in what seemed to be very different places. Soviet and Eastern-European writers and filmmakers will include Mikhail Bulgakov, Stanis&iquest;aw Lem, and Andrei Tarkovsky. The Americans may include Kurt Vonnegut, Philip K. Dick, Isaac Asimov, and Octavia Butler. Additional readings in Marx, Lenin, and H.G. Wells.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "221581",
        "number": "SLAVIC 225",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "226",
        "title": "Bakhtin and his Legacy",
        "description": "&quot;Quests for my own word are in fact quests for a word that is not my own, a word that is more than myself,&quot; writes Mikhail Bakhtin towards the end of his life. It was this ceaseless pursuit of another word that allowed Bakhtin, one of the most distinguished literary critics of the twentieth century, to author several influential literary theory concepts, many of which deal with the ideas of multiplicity, diversity and unfinalizability. The seminar explores these core concepts through close reading of key texts in English and investigates their reverberations in the writings of other thinkers such as Kristeva, de Man and Derrida",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "216198",
        "number": "SLAVIC 226",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "228",
        "title": "Russian Nationalism: Literature and Ideas (REES 328, SLAVIC 328)",
        "description": "Russia is huge and linguistically and religiously diverse. Yet the ideology of nationalism --the idea that culturally unified groups should rule their own territories-- took root in Russia in the early 19th century and is powerful today. What made this happen? Political thinkers, writers, and other artists have argued for the superiority of the Russian nation. Meanwhile, the tsarist, Soviet, and post-Soviet governments have worked to reconcile the ideology of nationalism with the realities of the administration of a diverse state. This course examines the roots of nationalism itself and the paradox of Russian nationalism, looking at literary and political writers including Dostoevsky, Stalin, and Solzhenitsyn.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "220843",
        "number": "SLAVIC 228",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "230",
        "title": "18th Century Russian Literature",
        "description": "This course traces major trends in 18th-century Russian literature, from baroque and neoclassical poetry to sentimentalist prose. Although the course introduces students to the major historical and literary contexts of the period, it is primarily concerned with developing students' close-reading strategies. We focus mainly on connected questions of genre, prosody and style, thematics and also narrative voice, particularly from the perspectives of gender and class.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29392",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214311",
        "number": "SLAVIC 230",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "231",
        "title": "Tarkovsky",
        "description": "The relatively slim body of work produced by the great Russian director Andrei Tarkovsky helped redefine the possibilities of the art of cinema. Older and younger generations of directors continue to be inspired by his trademark long shot, unconventional narrative techniques, everence for landscape and nature, and by general spatio-temporal discontinuity. The course provides a systematic examination of the director's complete oeuvre (seven feature films and his works for radio and opera) along with his main theoretical treatise Sculpting in Time.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "219404",
        "number": "SLAVIC 231",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "249",
        "title": "Post-Soviet Literature in Ukraine and Russia",
        "description": "What is the place of postmodernism in post-Soviet Ukraine and Russia? How do these historically related cultures respond to the post-Soviet transition? The course aims to answer the questions through close reading of the literary masterpieces of Ukrainian and Russian postmodernist writers: Andrei Kurkov, Yuri Andrukhovych, Serhiy Zhadan, Liudmila Ulitskaia, Victor Pelevin, Vladimir Sorokin and others. Slavic graduate students read texts in Russian, all other students - in English translation.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224605",
        "number": "SLAVIC 249",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "251",
        "title": "Dostoevsky: Narrative Performance and Literary Theory",
        "description": "In-depth engagement with a range of Dostoevsky's genres: early works  (epistolary novella &quot;Poor Folk&quot; and experimental &quot;Double&quot;), major novels (&quot;Crime and Punishment&quot;, &quot;The Idiot&quot;), less-read shorter works (&quot;A Faint Heart,&quot; &quot;Bobok,&quot; and &quot;The Meek One&quot;), and genre-bending &quot;House of the Dead&quot; and &quot;Diary of a Writer&quot;. Course applies recent theory of autobiography, performance, repetition and narrative gaps, to Dostoevsky's transformations of genre, philosophical and dramatic discourse, and narrative performance. Slavic students read primary texts in Russian, other participants in translation. Course conducted in English. For graduate students; undergraduates with advanced linguistic and critical competence may enroll with consent of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "119565",
        "number": "SLAVIC 251",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "256",
        "title": "Language and Identity in Ukraine",
        "description": "TBD",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224581",
        "number": "SLAVIC 256",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "267",
        "title": "Film and Theater",
        "description": "The course on contemporary Ukrainian film and theater introduces students to the Ukrainian cinematographic tradition of the Soviet period through the present day.  During the study of Ukrainian cinema of the Soviet period, we will analyze the work of iconic Ukrainian film directors, such as Alexander Dovzhenko, Sergey Paradzhanov, Roman Baloyan, and Kira Muratova. We will trace the reflection in their films of the Soviet reality in which the dissident artists lived and worked. We will also consider the impact of their films on democratization of Soviet society. In the second half of the quarter students examine the themes and trends of the Ukrainian cinema from 1991 to the present day, as they resonate in the films of Valentyn Vasyanovych, Sergei Loznitsa, Antonio Lukich, Dmitry Tomashpolsky, and Nadiya Parfan and discuss the relationship between cinematography and society in times of crisis. We will consider how changes in priorities and values in Ukrainian society resulting from the current conflict have affected the repertoire of Ukrainian theaters, particularly that of the Lesya Ukrainka Theater (formerly the Russian Drama Theatre), Theater-on-Podil, and the Ivan Franko National Theatre.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224940",
        "number": "SLAVIC 267",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "302",
        "title": "The Geography of Yiddish Literature (JEWISHST 302)",
        "description": "How does location matter for Yiddish creativity? This class looks at descriptions of places in Yiddish poetry and prose. It compares the Yiddish writing produced in Russia (and the Soviet Union), Poland, Israel/Palestine, and North America. If students want, more places can be added. For students with at least some knowledge of Yiddish; readings in Yiddish and English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29053",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "240-201",
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225271",
        "number": "SLAVIC 302",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "303",
        "title": "Dissent and Protest in Post-Soviet Culture (REES 303)",
        "description": "Considering power and resistance in contemporary Russia and post-Soviet republics across disciplines will allow us to engage with larger, theoretical questions about state-citizen interactions beyond the margins of the liberal project: How do political activists speak to the state? In turn, how does the state encourage, respond to, and censor activist speech? Drawing on examples from Putin's Russia and post-Soviet Ukraine, Belarus, and Kazakhstan will develop methodologies for studying how state power is undermined &quot;from below&quot; by ordinary citizens seeking to shape politics and policy. We will take protests seriously as events; consider interactions between protest participants and the social spaces in which protests take place; and situate events with respect to ordinary moments of cultural and political life. The course is structured around active student discussion with a few supplementary lectures and zoom interviews with political activists and artists in exile. Advanced knowledge of Russian is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30602",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            },
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225272",
        "number": "SLAVIC 303",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "322",
        "title": "Sergei Eisenstein: Theory, Practice, Method (FILMEDIA 422)",
        "description": "The work of Sergei Eisenstein has been central to the study of film since before his death in 1948, but some of his most significant work was first published only in the new millennium and is generating rich interdisciplinary scholarship. This seminar explores contemporary Eisenstein scholarship together with Eisenstein's more recently published writings. It aims to place the Eisenstein we are coming to know in the twenty-first century in dialogue with longstanding as well as contemporary debates in film and media theory.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223190",
        "number": "SLAVIC 322",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "323",
        "title": "Getting the Picture: Photojournalism in Russia and the U.S. (AMSTUD 123, COMM 123, REES 223, SLAVIC 123)",
        "description": "The vast majority of photographs printed and consumed around the world appeared on the pages of magazines and newspapers. These pictures were almost always heavily edited, presented in carefully devised sequences, and printed alongside text. Through firsthand visual analysis of the picture presses of yesteryear, this course considers the ongoing meaning, circulation, and power of images as they shape a worldview in Russia as well as the US. In looking at points of contact between two world powers, we will cover the works of a wide array of authors, photographers, photojournalists and photographed celebrities (Lev Tolstoy, Margaret Bourke-White, Russian satirists Ilf and Petrov, John Steinbeck and Richard Capa, and many others). We will explore the relationship between photojournalistic practice of the past with that of our present, from the printed page to digital media, as well as the ethical quandaries posed by the cameras intervention into/shaping of modern history. No knowledge of Russian is required.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223392",
        "number": "SLAVIC 323",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "325",
        "title": "Readings in Russian Realism (REES 210)",
        "description": "For graduate students or upper-level undergraduates. What did Realism mean for late imperial Russian writers? What has it meant for twentieth-century literary theory? As we seek to answer these questions, we read Tolstoy, Dostoevsky, Turgenev, and Chekhov, alongside their brilliant but less often taught contemporaries such as Goncharov, Saltykov-Shchedrin, Leskov, Garshin, Korolenko, Gorky, Andreev, and Bunin.  Taught in English; readings in Russian. Prerequisite: Three years of Russian.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "119842",
        "number": "SLAVIC 325",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "327",
        "title": "Boris Pasternak and the Poetry of the Russian Avant-garde",
        "description": "An emphasis is made on close reading of the poetry of Boris Pasternak, Marina Tsvetaeva and Vladimir Mayakovsky. Taught in Russian.  Prerequisite: 3rd Year Russian Language",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "119845",
        "number": "SLAVIC 327",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "328",
        "title": "Russian Nationalism: Literature and Ideas (REES 328, SLAVIC 228)",
        "description": "Russia is huge and linguistically and religiously diverse. Yet the ideology of nationalism --the idea that culturally unified groups should rule their own territories-- took root in Russia in the early 19th century and is powerful today. What made this happen? Political thinkers, writers, and other artists have argued for the superiority of the Russian nation. Meanwhile, the tsarist, Soviet, and post-Soviet governments have worked to reconcile the ideology of nationalism with the realities of the administration of a diverse state. This course examines the roots of nationalism itself and the paradox of Russian nationalism, looking at literary and political writers including Dostoevsky, Stalin, and Solzhenitsyn.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "220843",
        "number": "SLAVIC 328",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "329",
        "title": "Russian Versification: Poetry as System (SLAVIC 129)",
        "description": "The study of verse is foundational to literary theory and poetics. The practical goal of the course is to acquaint the students with specific features of Russian prosody and verse in its historical development and to survey such basic concepts as meter and rhythm, iamb and trochee, ternary meters and dolniks, accentual verse and free verse, rhyme and stanza in order to grasp their difference within Russian poetry from what we encounter in ancient Greek and Latin, as well as modern European literatures. The material of the course helps better understand the different stages in the history of Russian literature. We also address various approaches to poetry translation and the use of oriental verse forms (Persian, Japanese etc.) in Russian modern and modernist literature. Taught in English, readings in Russian. Prerequisite: Two years of Russian.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "214465",
        "number": "SLAVIC 329",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "331",
        "title": "Russia in Color (ARTHIST 247, ARTHIST 447, SLAVIC 131)",
        "description": "This course explores the application, evolution, and perception of color in art, art history, literature, and popular culture - in (Soviet) Russia and emigration. Working closely with the Cantor Arts Center collection at Stanford, this course pairs artifacts art with theoretical and cultural readings (media theory, philosophy, literature, science). With a particular focus on Russian and East European objects (including those by Russian icons, Soviet posters, and prints by Wassily Kandinsky and Marc Chagall), the course will include a basic introduction to color terminology, guest lectures on the technologies color printing, the science of color perception, and a hands-on practicum in color mixing/pigmentation. In addition to direct encounters with material and artifact, our course will also seek to better understand the digital experience of art objects in general, and color in particular. No knowledge of Russian is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223605",
        "number": "SLAVIC 331",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "332",
        "title": "The Burden of Memory: Theory, Texts, Politics",
        "description": "This course explores the growing field of memory studies and various modes of memory-forgetting in the post-Soviet society and culture. The 'memory boom' in post-1991 Russia and Easter Europe has significantly altered the way the post-socialist subjects remember, forget, or imagine their Soviet legacy. The course proposes a critical appraisal of memory studies as an opportunity for engaging in a genuine interdisciplinary endeavor. It starts by defining the field of research at the intersection of history, anthropology, sociology, and cultural theory and examines the emergence of 'memory' as an object of study within these disciplines. In the second part of the course, we will study literary representation of memory and forgetting through the concepts of post-memory, second-generation memory, memory of eye-witnesses and perpetrators, memory of the displaced persons, and amnesia and memory loss fiction. And finally, we will engage in comparing the social practices of selective remembering and forgetting of the memory of the WWII and Soviet legacy in present-day Russia, Ukraine, and Belarus.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "28323",
                "currentClassSize": "0",
                "maxClassSize": "8",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "260-301",
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223504",
        "number": "SLAVIC 332",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "340A",
        "title": "The Other Europe: Literature from East Central Europe (SLAVIC 140)",
        "description": "East Central Europe, both despite and because of its history of shape-shifting borders, has long been the locus of extraordinarily diverse humanity.  There are few other regions where so many ethnicities, languages, and religions exist side by side -- or even closer than that  -- with one another.  It is also a region carved and re-carved into subject pieces by empires: Ottoman, Habsburg and Russian before World War I, violently torn between Nazi Germany and the Soviet Union during World War II, and forcibly coerced into a Bloc until the last decade of the 20th century.  Polish poet and Nobel laureate Czeslaw Milosz asserted that &quot;the most striking feature in Central European literature is its awareness of history&quot;: of history's somehow coexistent inexorability and caprice, and of its capacity for a full spectrum of absurdity, from tragic to banal to comic. This course will introduce works in translation by 20th- and 21st-century East Central European writers (Tokarczuk, Ugresic, Kassabova, Knezevic, and others) -- supplemented with selections from film, visual art, and music -- and consider how these creative works respond to the complexities of the region&iquest;s history, cultural diversity, and individual and collective identities.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32324",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "260-244",
                        "instructors": [
                            {
                                "name": "Nafpaktitis, M.",
                                "sunet": "nafpakt"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225568",
        "number": "SLAVIC 340A",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "342",
        "title": "Topics in Early Modern Russia and Ukraine (HISTORY 322E, REES 223E)",
        "description": "Explores and contrasts Ukraine and Russia ca 1450-1800, when most of Ukraine had not yet been conquered by Russia: governmental structures, religion and culture, ideology, social organization, agrarian economy.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224147",
        "number": "SLAVIC 342",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "345E",
        "title": "Survey of Russian Literature: The Age of Experiment (SLAVIC 145)",
        "description": "This course discusses the transition from predominately poetic to predominately prosaic creativity in the Russian literature of the first half of the 19th century Russian literature and the birth of the great Russian novel. It is focused on the peculiarities of poetics and narrative style in the literary works of three towering figures of the period in question - Alexander Pushkin, Mikhail Lermontov, and Nikolai Gogol -- and examines the changes in the Russian literary scene affected by them. An emphasis is placed on close reading of literary texts and analysis of literary techniques employed in them. We will discuss the various approaches and possibilities in presenting authorial positions and characterization in literature; ways of experimenting with narrative and playing with the reader; the creation of the historical and psychological novel and the use of different narrative devices for diverse artistic purposes. Taught in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "10989",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "240-110",
                        "instructors": [
                            {
                                "name": "Averbach, R.",
                                "sunet": "wurl"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213772",
        "number": "SLAVIC 345E",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "346",
        "title": "The Great Russian Novel: Tolstoy, Dostoevsky, and more (SLAVIC 146)",
        "description": "Why are people obsessed with big Russian books? What can literature do with life, death, and transgression? This course explores the psychological and philosophical intensity of novels like Crime and Punishment in tandem with the aesthetic development of 19th century Russian realism. We will investigate both violence and voice, both gender and genre, both morality and medium, through close reading and discussion of novelistic masterpieces by authors including Leo Tolstoy, Fyodor Dostoevsky, and Ivan Turgenev. Readings and discussion will be in English, with an optional Russian section for Russian speakers.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "12123",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "119562",
        "number": "SLAVIC 346",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "347",
        "title": "Modern Russian Literature and Culture: The Age of War and Revolution (SLAVIC 147)",
        "description": "What makes Russian modernism special? Or is there anything special about Russian modernism? And how did modernist poets, prose writers, and filmmakers respond to the turbulent events of the first half of the 20th century, when Russia was shaken by revolution and war? This course aims to answer these questions through close readings of works by authors like Vladimir Mayakovsky, Isaac Babel, Osip Mandelstam, Mikhail Zoshchenko, Andrei Platonov, Yuri Olesha, and Mikhail Bulgakov, as well as early Soviet film. Aesthetic issues such as hero, plot, language, and poetic and narrative devices will be addressed with the aid of contemporaneous literary theory (e.g., Shklovsky, Tynianov, Eikhenbaum, Bakhtin). Novels and theory will be read in English. NOTE: This course must be taken for a minimum of 3 units and a letter grade to be eligible for Ways credit.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "119563",
        "number": "SLAVIC 347",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "348",
        "title": "Slavic Literature and Culture since the Death of Stalin (REES 348, SLAVIC 148)",
        "description": "The course offers a survey of Soviet and post-Soviet literary texts and films created by Russian, Ukrainian and Belarusian artists and marginalized or repressed by the Soviet regime. The first part of the course will focus on the topics of opposition and dissent, generational conflict, modernization, Soviet everyday life, gender, citizenship and national identity, state-published and samizdat literature, &quot;village&quot; and &quot;cosmopolitan&quot; culture, etc. The second part of it will be devoted to the postmodernist aesthetics and ideology in the dismantlement of totalitarian society, as well in the process of shaping post-Soviet identities. The reading materials range from the fictional, poetic, and publicistic works written by Noble-prize  (Solzhenitsyn, Brodsky, Alexievich) and other major writers of the period to the drama, film, and popular culture.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29362",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213773",
        "number": "SLAVIC 348",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "356",
        "title": "Vladimir Nabokov:  Displacement and the Liberated Eye (COMPLIT 115, COMPLIT 315, SLAVIC 156)",
        "description": "How did the triumphant author of &quot;the great American novel&quot; &quot;Lolita&quot; evolve from the young author writing at white heat for the tiny sad Russian emigration in Berlin?  We will read his short stories and the novels &quot;The Luzhin Defense, Invitation to a Beheading, Lolita, Lolita&quot; the film, and &quot;Pale Fire&quot;, to see how Nabokov generated his sinister-playful forms as a buoyant answer to the &quot;hypermodern&quot; visual and film culture of pre-WWII Berlin, and then to America's all-pervading postwar &quot;normalcy&quot; in his pathological comic masterpieces &quot;Lolita&quot; and &quot;Pale Fire&quot;. Buy texts in translation at the Bookstore; Slavic grad students will supplement with reading and extra sessions in original Russian.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "140782",
        "number": "SLAVIC 356",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "360",
        "title": "Cultural Hybridity in Central-Eastern Europe (COMPLIT 231B, SLAVIC 160)",
        "description": "Historically shaped by shifting borders and mixing of various cultures and languages, identities in-between have been in abundance in Central-Eastern Europe. This course offers a comprehensive study of the oeuvre of several major Central-European authors of modernity: the Ukrainian-Russian Nikolai Gogol (1809-1852), the Czech-German-Jewish Franz Kafka (1883-1924), the Austrian-Galician-Jewish Leopold von Sacher-Masoch (1836-1895), the Ukrainian-Galician Olha Kobylyans&iquest;ka (1863-1942), the Russian-German Lou Andreas-Salom&eacute; (1861-1937), the Jewish-Polish-Galician Bruno Schulz (1892-1942), and the Polish-Argentinean Witold Gombrowicz (1904-1969). Performing their selves in two or more cultures, these writers were engaged in identity games and produced hybrid texts with which they intervened into the major culture as others. In the course, we will apply post-structuralist and post-colonial concepts such as minor language, heterotopia, in-betweenness, mimicry, indeterminacy, exile, displacement, and transnationalism to the study of the writers oeuvres. We will also master the sociolinguistic analysis of such multi-lingual phenomena as self-translation, code-switching, and calquing and examine various versions of the same text to uncover the palimpsest of hybrid identities.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "218368",
        "number": "SLAVIC 360",
        "units": [
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "370",
        "title": "Pushkin",
        "description": "Pushkin's poems, prose, and drafts in dialogue with contemporaries and cultural milieu. Emphasis on innovation and controversy in genre, lyrical form and personal idiom, shaping a public discourse. Taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "119860",
        "number": "SLAVIC 370",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "371",
        "title": "Chernobyl: from Soviet Utopia to Post-Soviet Apocalypse (REES 322, SLAVIC 171)",
        "description": "The course will introduce students to the Chernobyl nuclear disaster through the history of the late Soviet utopian project of the &quot;atomic cities&quot; to the intellectual, aesthetic, and artistic responses that the Chernobyl catastrophe generated in the post-Soviet Ukrainian, Belarusian, and Russian societies. During the course, we will study environmental, social, and ecological consequences of the Chernobyl disaster and analyze its many representations across a range of media and cultures. In the end of the course, we will create a portrait of Chernobyl in the collaborative multimedia project &quot;The Control Room #4&quot; which will assemble the representation of Chernobyl in fictional, cinematographic, oral histories, map projects, VR, photography, and other media in order to show how the disaster resonates across space and time. We will consider such issues as urban and technological utopias of the late Soviet Union, representations of the disaster; ethics; health and disease; the body and its deconstruction; ecology and climate; the appropriation of disaster narratives and disaster tourism; the media and cover-ups; and faith and religion.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223393",
        "number": "SLAVIC 371",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "373",
        "title": "Children's Literature:  Russia, Eastern Europe, and Beyond (SLAVIC 173)",
        "description": "This course traverses the world of Russian and Eastern European literature for children. In our look at a wide variety of children's cultural artifacts (from text to film), we will analyze the ways in which stories for children, and stories about children, form the foundation for literacy and cultural education. We will be transported by the magic of fairy tales as we compare the Brothers Grimm to Russian folk tales. We will analyze pedagogical and artistic methods in illustrated primers, picture books, and magazines made for American and Soviet youth. We will examine the media and politics that shape the adaptation of oral storytelling to the animation of the silver screen. Through these and many other sites of comparison between Russia, Eastern Europe and world traditions, we seek to understand the specific cultural codes of childhood in its historical development, as well as what might constitute a universal notion of being a child. No knowledge of Russian is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "223606",
        "number": "SLAVIC 373",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "379",
        "title": "Literature from Medieval Rus' and Early Modern Russia (SLAVIC 179)",
        "description": "This course traces the history of Russian literature before the eighteenth century. It is divided into two sections. The first section examines literature from Kyivan Rus' (up to the thirteenth century), the medieval conglomerate to which Belarus, Russia and Ukraine all trace their cultural heritage. The second section examines old Russian literature specifically, from the fourteenth to seventeenth centuries. We pay close attention to the development of literary genres, moral/religious and aesthetic features and their relationship, and the beginnings of Russian belles lettres. Our approach to the texts will be two-fold. On the one hand, we will spend some time situating the sources within their historical contexts. On the other hand, we will explore the interpretive possibilities of premodern literature using formal analysis and critical theory. Knowledge of an East Slavic language is required.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "119790",
        "number": "SLAVIC 379",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "387",
        "title": "Classical Russian Poetry (SLAVIC 187)",
        "description": "A survey of Russian poetry from Lomonosov to Vladinmir Solov'ev. Close reading of lyrical poems.  Prerequisite: 3rd Year Russian Language",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "119788",
        "number": "SLAVIC 387",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "388",
        "title": "20th century Russian Poetry: From Aleksandr Blok to Joseph Brodsky (SLAVIC 188)",
        "description": "Developments in and 20th-century Russian poetry including symbolism, acmeism, futurism, and literature of the absurd. Emphasis is on close readings of individual poems. Readings in Russian, taught in English.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "213771",
        "number": "SLAVIC 388",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "394",
        "title": "De-Colonizing Theater in Eastern Europe and Russia (SLAVIC 194)",
        "description": "In &quot;De-Colonizing Theater,&quot; we will uncover fertile interactions among the innovative, rebellious drama and theater practices of central-eastern European countries and Russia as they have co-inhabited mobile territories and histories (1824-2024). Texts and their modern performances (filmed or video) will be available to be read and viewed in the original languages (Russian, Polish, Ukrainian, Yiddish, Czech, Lithuanian), and of course in translation. Mixed lecture/seminar format, with two presentations and one paper.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30827",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Greenleaf, M.",
                                "sunet": "mad"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225379",
        "number": "SLAVIC 394",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "395",
        "title": "Russian and East European Theater (SLAVIC 195)",
        "description": "Evolution of modernist Russian/Eur. dramaturgy, theatrical practices, landmark productions from Chekhov-Meyerhold-Grotowski to present; re-performance of classics; techniques of embodiment. Taught in English.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "208367",
        "number": "SLAVIC 395",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "396",
        "title": "Readings in Yiddish Literature 1 (SLAVIC 196)",
        "description": "Yiddish literature, at a second-year language level. Readings chosen based on student interest; contact instructor with questions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "222184",
        "number": "SLAVIC 396",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "397",
        "title": "Readings in Yiddish Literature 2 (SLAVIC 197)",
        "description": "Yiddish literature, at a second-year language level. Continuation of SLAVIC 196. Readings chosen based on student interest; contact instructor with questions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "222185",
        "number": "SLAVIC 397",
        "units": [
            2,
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "398",
        "title": "Writing Between Languages:  The Case of Eastern European Jewish Literature (JEWISHST 148, JEWISHST 348, SLAVIC 198)",
        "description": "Eastern European Jews spoke and read Hebrew, Yiddish, and their co-territorial languages (Russian, Polish, etc.).  In the modern period they developed secular literatures in all of them, and their writing reflected their own multilinguality and evolving language ideologies.  We focus on major literary and sociolinguistic texts.  Reading and discussion in English; students should have some reading knowledge of at least one relevant language as well. This course must be taken for a minimum of 3 units and a letter grade to be eligible for WAYS credit. In 2020-21, a 'letter' or 'CR' grade will satisfy the WAYS requirement.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "212346",
        "number": "SLAVIC 398",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "399",
        "title": "INDIVIDUAL WORK",
        "description": "Open to Russian majors or students working on special projects. May be repeated for credit. Prerequisite: consent of instructor.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "31173",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fleishman, L.",
                                "sunet": "lazar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10373",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "11060",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "11061",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11291",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Greenleaf, M.",
                                "sunet": "mad"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11062",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Greenleaf, M.",
                                "sunet": "mad"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10375",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "11063",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10376",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "11292",
                "currentClassSize": "0",
                "maxClassSize": "6",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "15543",
                "currentClassSize": "0",
                "maxClassSize": "6",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "15569",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213789",
        "number": "SLAVIC 399",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ],
        "totalSections": 12
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "680",
        "title": "Curricular Practical Training",
        "description": "CPT course required for international students completing degree. Prerequisite: Slavic Languages and Literatures Ph.D. candidate.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27928",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30006",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29738",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220056",
        "number": "SLAVIC 680",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "801",
        "title": "TGR PROJECT",
        "description": null,
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [],
        "gers": [],
        "objectID": "217105",
        "number": "SLAVIC 801",
        "units": [
            0
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SLAVIC",
        "code": "802",
        "title": "TGR Dissertation",
        "description": "Doctoral students who have been admitted to candidacy, completed all required courses and degree requirements other than the University oral exam and dissertation, completed 135 units or 10.5 quarters of residency (if under the old residency policy), and submitted a Doctoral Dissertation Reading Committee form, may request Terminal Graduate Registration status to complete their dissertations.",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "31174",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fleishman, L.",
                                "sunet": "lazar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "11317",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "10431",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "T/D",
                "notes": null,
                "classId": "11115",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lawton, D.",
                                "sunet": "dlawton"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "T/D",
                "notes": null,
                "classId": "11116",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "11318",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Greenleaf, M.",
                                "sunet": "mad"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "T/D",
                "notes": null,
                "classId": "11117",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Greenleaf, M.",
                                "sunet": "mad"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "10433",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "T/D",
                "notes": null,
                "classId": "11118",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "10434",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "T/D",
                "notes": null,
                "classId": "11319",
                "currentClassSize": "0",
                "maxClassSize": "6",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ilchuk, Y.",
                                "sunet": "yilchuk"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "T/D",
                "notes": null,
                "classId": "13625",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Safran, G.",
                                "sunet": "gsafran"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213790",
        "number": "SLAVIC 802",
        "units": [
            0
        ],
        "totalSections": 12
    }
]