[
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "110Q",
        "title": "Making Sense of Strategy",
        "description": "Get the strategy right, and the chance for success is great. Nowhere is this more evident than in today's world of major challenges. Strategy is at the heart of problem solving and achieving objectives, yet few people can define strategy, much less understand how to conceptualize, design, and execute effective strategies that yield the best outcomes.This course focuses on interesting and engaging case studies, each of which illustrates a key ingredient of strategy. Some are well-known historical events, while others are less obvious, but all have a strategic lesson to share. They are quite diverse, from the planning of a high-risk rescue in the Colorado Rockies, to a product crisis in a Fortune 50 company, to a little-known failed military mission of WWII, to a commercial airline disaster. The ability to think through challenging and varied scenarios is both instructive and mind-stretching. There will be some pre-reading on each case study and there may be a field trip for students to put their lessons into practice. The course is designed to be highly interactive; all to enable students to unravel the mystery and power of strategic thinking. Students will also have the opportunity to select and analyze a case reflecting interests of their own. This course can help students not only prepare for a career in a range of fields, but also as they meet the challenges of their current coursework. Problem-solving skills are central in every walk of life; this seminar can help students build a stronger foundation for sound decision-making.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/. No Exam. Capacity limited to 16 students. Mandatory attendance. Absences impact grade. 2 Group 2 Individual Projects/Papers. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Final 30% Projects/Papers 20% Participation 50%. Seminar.",
                "classId": "32535",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Demarest, D.",
                                "sunet": "demarest"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/. No Exam. Capacity limited to 16 students. Mandatory attendance. Absences impact grade. 2 Group 2 Individual Projects/Papers. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Final 30% Projects/Papers 20% Participation 50%. Seminar.",
                "classId": "30954",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Shaker, S.",
                                "sunet": "slachan"
                            },
                            {
                                "name": "Demarest, D.",
                                "sunet": "demarest"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "212681",
        "number": "STRAMGT 110Q",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "202",
        "title": "Strategic Leadership: Crafting and Leading Strategy",
        "description": "This course is about the process of crafting, assessing and implementing strategies to win in the market. It is designed to help you understand, shape, and lead your organization's strategy by providing you with a framework for thinking about the issues that shape your organization's economic prosperity. In addition to an analytical framework, the course will provide you with insight into the process of formulating and assessing strategy for roles with cross-functional responsibility at all levels. The emphasis will be on how to articulate what the organization's strategy is, how to create alignment between the strategy, organizational design, and market environment, and the process of growing, managing and transforming organizations. The course is particularly well suited for students who have limited exposure to strategic analysis and/or who anticipate pursuing roles with primary responsibility for the success of products and services in both new and established organizations.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "P/F Not Allowed. Open to MBA1 students. Take-home Final. Mandatory attendance. Absences impact grade. Not Open to Non-GSB Students. Case and Problem Discussion. Participation 30% Final 30% Assign/Quizzes 40%.",
                "classId": "31468",
                "currentClassSize": "0",
                "maxClassSize": "72",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "9:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sorensen, J.",
                                "sunet": "sorensen"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 35100.0,
                        "days": "Tuesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "CAS",
                "notes": "P/F Not Allowed. Open to MBA1 students. Take-home Final. Mandatory attendance. Absences impact grade. Not Open to Non-GSB Students. Case and Problem Discussion. Participation 30% Final 30% Assign/Quizzes 40%.",
                "classId": "31469",
                "currentClassSize": "0",
                "maxClassSize": "72",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sorensen, J.",
                                "sunet": "sorensen"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222052",
        "number": "STRAMGT 202",
        "units": [
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "205",
        "title": "Strategic Leadership: Creating and Sustaining Growth",
        "description": "Many organizations are fundamentally committed to growth. This course examines how leaders and their organizations can create and sustain growth. Initially, entrepreneurial companies grow by discovering product-market fit, and then capitalize on that discovery by aligning their strategy and organization to their environment. As they mature, established companies grow by innovating anew, exploring possibilities and changing their organizations into new alignments with new opportunities. This course covers how leaders shape the process of discovery, change, and growth, and how strategy and organization combine to scale success. The course is geared toward students who seek to become entrepreneurs, students who want to join a growing firm in a strategic role, and for students who want to innovate to create new growth opportunities in an established firm.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222051",
        "number": "STRAMGT 205",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "210",
        "title": "Managerial Skills",
        "description": "In the Managerial Skills Labs we examine several common managerial challenges faced by executives. Together with Faculty, students explore these topics using five case examples, each asking students to evaluate a series of situations, develop alternatives for their resolution, and ultimately recommend and implement a course of action from the point of view of the company's owner/manager. We have selected small to midsized businesses as the context for these discussions in order to highlight the impact that key decisions and their implementation can have on the broader organization. Class preparation should include not only analysis and conclusions, but also specific recommendations on implementation. Students should come to class prepared to role play important conversations between management and other key individuals.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "211486",
        "number": "STRAMGT 210",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "258",
        "title": "MSx: Strategic Management",
        "description": "This course deals with the overall general management of the business enterprise. Extensive case studies of a variety of companies of differing size, industry, and current conditions provide the basis for the comprehensive analysis and establishment of a strategic management approach for the organization. Frameworks are presented for strategy identification and evaluation; assessing industry attractiveness; evaluating the firm's capabilities, resources, and position; determining the optimal horizontal and vertical scope of the firm; entering into strategic alliances and joint ventures; and formulating and implementing strategy in multi-business organizations.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "100783",
        "number": "STRAMGT 258",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "259",
        "title": "MSx: Generative Leadership",
        "description": "There are three major sections to this course - Design Thinking, The Improvisational Mindset, and High Performance Communication. || Design Thinking || Outcome: Participants learn to employ User Centered Design as promoted by the Stanford d.school. They become adept at Empathizing with the end user, practicing focused Need Finding, Defining the Problem, Ideating, Rapidly Prototyping and Adapting to Feedback. || Experiences: Participants learn the Design Thinking process through a hands-on, collaborative design challenge, like redesigning the Briefcase for a specific user. || The Improvisational Mindset || Outcome: The participants increase their ability to respond flexibly to novel situations and to generate innovative solutions on a collaborative, creative team. The mindset is cultivated by practicing 5 key principles. Say &quot;Yes, and&quot;. Treat Mistakes as Gifts. Inspire your Partner. Dare to be Obvious. Notice the World. || Experiences: The key principles are taught through a series of immersive theater exercises derived from Johnstone, Spolin, and Ryan. Valuable readings include IMPROV WISDOM, by Patricia Madson and journal articles on improv and brainstorming. || High Performance Communication || Outcome: The final segment of the class is a chance to apply the principles of User Centered Design and the Improvisational Mindset to design and deliver messages that go beyond just transmitting information - they get results. Participants successfully use a version of the Design Thinking process to rapidly develop content that is tuned to the audience's needs, and that they can deliver in a way that is agile and responsive to real time feedback. || Experiences: Generative Leadership culminates in a group presentation designed to influence key stakeholders. To be successful, participants will have to draw on all sections of the course. AS WE SPEAK is our text.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "213722",
        "number": "STRAMGT 259",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "302",
        "title": "Systems Leadership",
        "description": "Leaders of today live in an increasingly uncertain world, and the challenges of the times are drastic. At some level, all leadership right now is crisis leadership - getting one's team and organization through unprecedented times. Sometimes the ability to lead through these changes is due to talent; other times, luck plays the more important role. Technological and political changes are upending assumptions and conventional wisdoms that have guided the world for decades. Tomorrow's business leaders need to navigate multiple dimensions and horizons in order to guide their organizations to success: they need to excel in strategy and execution, understanding details and context, navigating digital and physical, and many other dualities. This course explores how leaders at the world's leading companies are driving frame-breaking transformational change inside of organizations that have grown up with a physical foundation, or who have a digital foundation and are moving into the physical domain as a new entrant. The issues facing business leaders across multiple industries require insights on how to drive technological, cultural and ecosystem changes under unprecedented duress. The changes brought about by these dynamics require the development of new types of leaders which we call Systems Leaders. These people seek to maximize and thrive in the chaos of the times. Systems Leaders are adept at systems thinking - in having the ability to analyze the complexity in markets and organizations by paying attention to how the component parts interrelate to each other. The course will delve into the need for systems thinking at multiple levels - of products, organizations, cultures and individuals. By systems thinking we mean having a thorough understanding of how customer success is optimized by knowing how all of the elements of an organization work with both internal and external constituents. This course is a 3-unit version of STRAMGT 502.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224910",
        "number": "STRAMGT 302",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "308",
        "title": "Entrepreneurship from Diverse Perspectives",
        "description": "This seminar showcases the diversity of entrepreneurs and the range of entrepreneurial paths they pursue. Thirty-five entrepreneurs and venture capitalists, primarily from historically underestimated groups (HUGs), will share their personal and professional journeys, and how each embodies the entrepreneurial mindset. Candid class discussions and an experiential project, complemented by case studies, readings, and videos, will immerse you in the entrepreneurial process. This includes finding an idea and forming and building a team, evaluating existing ideas or early businesses, being an inclusive leader, raising money, assembling a board, and overcoming setbacks and challenges. The individual project is to profile a founder or venture capitalist from a HUG and how they embody the entrepreneurial mindset. For the group project, teams will have the option of working on an idea for a company, or assessing a company using the venture investment framework taught during the class.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "No Exam. 1 Group 1 Individual Project/Paper. Open to MBA, MSx, and GSB PhD students. Mandatory attendance. Absences impact grade. CSI certificate course. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Final 33% Midterm 33% Participation 34%. Seminar.",
                "classId": "30846",
                "currentClassSize": "56",
                "maxClassSize": "55",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Mandelbaum, F.",
                                "sunet": "fernm"
                            },
                            {
                                "name": "Hudson, C.",
                                "sunet": "chudson"
                            },
                            {
                                "name": "Kankolongo Ngoba, N.",
                                "sunet": "ngb2812"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216215",
        "number": "STRAMGT 308",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "309",
        "title": "Strategies of Effective Product Management",
        "description": "This is a course about exploring the methods and processes for product management, largely in technology companies, and a look at what can lead to the most effective ways to coordinate customer needs, ensure accurate product development, and how to develop and use the appropriate tools needed to successfully sell products and services to customers from the perspective of the Product Manager. The course covers ways to think about product management depending on the type of product being delivered (new product introduction vs. reinvigorating an existing product) and also the skills and tools used by product managers for effective product management.This course is an extended version of STRAMGT 509.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "219668",
        "number": "STRAMGT 309",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "319",
        "title": "Equity By Design: Building Diverse and Inclusive Organizations",
        "description": "This course equips you to create and build equitable organizations. We will discuss the power of inclusion as it relates to the employee and customer experience.  We will study effective strategies for building diverse and inclusive companies, and will address the barriers that can often exist. We'll look at approaches to organizational design that limit unconscious bias and produce more objective decisions across the employee experience - from engaging and hiring candidates to retaining employees and helping them thrive.  Finally, we'll dive into how to create inclusive cultures and a sense of belonging. Experts in diversity and inclusion, and executives at companies that have successfully incorporated inclusion programs, will join us for the class discussions.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "219726",
        "number": "STRAMGT 319",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "321",
        "title": "Create a New Venture: From Idea to Launch I",
        "description": "S321/S322 is an integrated lab course in Entrepreneurship designed to teach students the process of creating a new viable venture - from Idea to Launch.  It is a dynamic and interactive course organized around projects undertaken by teams of 3 to 4 registered students from the MSx and MBA programs, together with other graduate students from within Stanford who bring expertise of particular relevance to the idea being pursued, e.g. engineering, CS or medicine. This course is designed not only for students with immediate entrepreneurial aspirations but also for any student considering starting an entrepreneurial venture at some point in his or her career.  The course is a two-quarter class, with admission to the class by team and idea. In the winter quarter, teams will research, craft, test and morph their idea into a viable business concept. In the spring quarter, they will further test, refine their concept and develop a strategy and plan to attract financial, human and other resources. At the end of the spring quarter, teams will present their plan to a panel of experts and potential investors to simulate the funding process.  The course builds on important research, successes, and findings as they relate to the process of new venture creation. The teaching method is through a structured process of relevant mini-lectures, exercises and active in-depth team learning by doing (LBD). Extensive field research and prototype product development are integral to the course. Learning is further enhanced through meetings with the instructor, coaching by their assigned experienced mentors, experts, and review by peers.  Informal student meetings/mixers will be held in the autumn quarter to further facilitate the formation of teams and assist in idea generation. The application process for S321/322,-Create A New Venture: from Idea to Launch- is described on the course website.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "213926",
        "number": "STRAMGT 321",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "322",
        "title": "Create a New Venture: From Idea to Launch II",
        "description": "S321/S322 is an integrated lab course in Entrepreneurship designed to teach students the process of creating a new viable venture - from Idea to Launch.  It is a dynamic and interactive course organized around projects undertaken by teams of 3 to 4 registered students from the MSx and MBA programs, together with other graduate students from within Stanford who bring expertise of particular relevance to the idea being pursued, e.g. engineering, CS or medicine. This course is designed not only for students with immediate entrepreneurial aspirations but also for any student considering starting an entrepreneurial venture at some point in his or her career.  The course is a two-quarter class, with admission to the class by team and idea. In the winter quarter, teams will research, craft, test and morph their idea into a viable business concept. In the spring quarter, they will further test, refine their concept and develop a strategy and plan to attract financial, human and other resources. At the end of the spring quarter, teams will present their plan to a panel of experts and potential investors to simulate the funding process.  The course builds on important research, successes, and findings as they relate to the process of new venture creation. The teaching method is through a structured process of relevant mini-lectures, exercises and active in-depth team learning by doing (LBD). Extensive field research and prototype product development are integral to the course. Learning is further enhanced through meetings with the instructor, coaching by their assigned experienced mentors, experts, and review by peers.  Informal student meetings/mixers will be held in the autumn quarter to further facilitate the formation of teams and assist in idea generation. The application process for S321/322, 'Create A New Venture: from Idea to Launch' is described on the course website.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "213927",
        "number": "STRAMGT 322",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "325",
        "title": "Impact: From Idea to Enterprise",
        "description": "This class is for students who want start or work at an impact venture, or to invest in or grant to such an enterprise. The class deals with situations from the perspective of the entrepreneur/manager, and the funder. Students will:n- Learn to evaluate impact and business opportunities in social enterprises - Understand the potential tension between impact and revenue/profit in impact enterprises and how to manage it - Start, grow, and manage a team and a board of directors for a social enterprise - Become versed in the landscape of impact funders - Be introduced to how entrepreneurs create social change - Be exposed to the personal journeys and careers of impact entrepreneursnFor purposes of this course an impact venture is 'an organization whose mission is to provide a sustainable solution to a social problem.' The focus on mission makes impact enterprises different in kind from commercial enterprises. That said, it is the instructors' views that, in most ways, impact ventures should be treated and managed like commercial ventures, and this course reflects this perspective. Even so, there are some important differences which are critical to understand to effectively launch, manage or fund an impact enterprise. We will highlight these throughout our sessions. All the cases and class discussions will be exclusively about enterprises and organizations in the impact venture space, some for-profit, and some non-profit, but all run more or less like commercial businesses, e.g., the enterprise focus is on delivering solutions for 'customers' or 'recipients' to solve a social problem, create value and generating revenue (and/or profit). Impact: From Idea to Enterprise is integrative and will allow students to apply many facets of their business school education. We will have a mixture of case discussions, lectures, student-led exercises, panel discussions, and guest speakers. The final project involves engagement with a current impact venture and its management. The instructors, Laura Hattendorf and Russell Siegelman, are both Lecturers in Management at GSB with practical experience in the startup and impact venture space.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "Non-GSB students need instructor approval to enroll. No Exam. 1 Group 2 Individual Projects/Papers. Participation 35% Projects/Papers 65%. Open to MBA, MSx, and GSB PhD students. Mandatory attendance. Absences impact grade. CSI certificate course. Capacity limited to 60 students. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "31444",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hattendorf, L.",
                                "sunet": "lhattend"
                            },
                            {
                                "name": "Siegelman, R.",
                                "sunet": "russells"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216231",
        "number": "STRAMGT 325",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "329",
        "title": "The Grand Bazaar on Clouds: Strategy for Marketplaces",
        "description": "In this class, we will analyze the economics and strategy of marketplaces for goods and services. We will consider the forces that have led to the proliferation of these marketplaces, as well as the strategic choices that determine which ones succeed. We will also study the strategy of managing these marketplaces: how should matching work, how can marketplace design solve problems of congestion or market thinness, how to get feedback and design a well-functioning rating system, and how a platform should trade off the welfare of the different sides of the market as it enters and grows. We will discuss marketplace design ideas that can improve trust and create a safe environment. We will also learn how to design non-monetary markets such as school choice, kidney exchange, and food banks. Finally, we will discuss the regulatory challenges of these marketplaces, especially with regard to labor income, price control, and monopoly power. Applications include ride-sharing and transportation; room-sharing and vacation rentals; Neobanks; creator/passion economy; B2B marketplaces; dating; and organized labor markets.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "223609",
        "number": "STRAMGT 329",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "330",
        "title": "Entrepreneurship and Venture Capital: Partnership for Growth",
        "description": "This course is designed for students interested in entrepreneurship, early-stage investing, and/or venture capital. Venture capital is going through a dramatic cycle as venture capital investment doubled from 2021 to 2022, then dropped by a third from 2021 into 2022, ending with the slowest quarter of investing in 9 years. Together with the collapse of Silicon Valley Bank, it is a challenge for both the entrepreneur and the investor. We believe there is opportunity within that chaos and our course is designed to show you how to navigate and stand out in the current environment. Our course gives you that tactical edge with a special combination of two class projects, guest speakers and case-based instruction.  You will be able to apply what you learn as we (and the guest speakers) offer candid and instant feedback. The course is fast paced with very current content. You will hear from over 15 investors and a half dozen entrepreneurs. The course is designed to complement other popular GSB courses about entrepreneurship such as Start-up Garage, Formation of New Ventures, and Lean Launchpad. Notably, students are permitted to use the same business idea in our course's team project that they use for those courses (with instructor permission). If you do not have a business idea or market sector interest, we will team you with another student with similar interests. We offer class topics that are typically not covered in other business school courses - such as how to find and use the power of early stage advisors and board members in building and funding a company, how Environmental, Social and Governance (ESG) can make or break the evaluation of your early-stage company, how to find that ideal co-founder and figure out the equity split amongst the founding team, and what do VCs say behind closed doors at the VC's partners; meeting after the founder gives their funding pitch? We encourage challenging and meaningful class discussion to take the guests off-script and focus on sharing the street smarts of the entrepreneur and investor community. The course attracts students from diverse backgrounds (we intentionally reserve 10 seats for graduate students from outside the GSB). Students range in experience from serial entrepreneurs to students who are experimenting with entrepreneurship for the first time. We also see students with significant investment experience share their start-up investor experience as they add to the class dynamic.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "All Non-GSB students must be graduate students and admitted by instructor permission only.  More than 1 absence after the first two classes may impact grade. No Exam. MBA1 & GSB PhD students need instructor permission. 1 Group 1 Individual Project/Paper. Capacity limited to 50 students. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. P/F Allowed. Participation 40% Projects/Papers 60%. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "1007",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ziebelman, P.",
                                "sunet": "peterz"
                            },
                            {
                                "name": "Munce, C.",
                                "sunet": "cfmunce"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 40800.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217325",
        "number": "STRAMGT 330",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "335",
        "title": "Transforming Education through Entrepreneurship",
        "description": "In this course, students will investigate opportunities and challenges of entrepreneurial ventures trying to increase access to educational opportunity, improve the quality of learning experiences for underserved students and disrupt systemic inequities in preK-12 education. Class discussions will explore frameworks for understanding how to maximize educational impact by ensuring efficacy, increasing financial sustainability, and building scale. Cases are focused on organizations in early childhood, primary and secondary education, and feature a variety of ventures (including schools, technology, educator training, and supplemental services) and organizational models (for-profit, not-for-profit, and benefit corporation) in the U.S. and globally. Note: This is not a &quot;how to&quot; class on starting an education venture; it focuses on the strategic challenges of maximizing impact. This course is designed for students who want to be part of creating a more equitable society and improving opportunities for youth, whether by becoming entrepreneurs, leaders, Board members, donors or investors in education organizations. Attendance at the first class meeting is required.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Participation 50% Projects/Papers 50%. 1 Group 2 Individual Projects/Papers. P/F Not Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Capacity limited to 40 students. Open to MBA, MSx, and GSB PhD students. Mandatory attendance. Absences impact grade. CSI certificate course. Case and Problem Discussion.",
                "classId": "29314",
                "currentClassSize": "22",
                "maxClassSize": "39",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lee, G.",
                                "sunet": "gclee"
                            },
                            {
                                "name": "Dubon, M.",
                                "sunet": "mdubon"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217341",
        "number": "STRAMGT 335",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "340",
        "title": "POWer: Building the Entrepreneurial Mindset from the Perspective of Women",
        "description": "This seminar will showcase women entrepreneurs and venture capitalists. We will explore the challenges and opportunities they encountered in starting and growing their ventures, and the personal and professional choices they have made. The sessions will include cases, readings, videos, panel discussions, role plays and breakout groups with the entrepreneurs and venture capitalists. The class will help you understand and build your entrepreneurial and growth mindset.  You will leave the class with an individual roadmap and tools to help you be entrepreneurial throughout your career.  Men are encouraged to enroll.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "202061",
        "number": "STRAMGT 340",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "345",
        "title": "Impact: Taking Social Innovation to Scale",
        "description": "Fortunately, the world is full of great ideas and breakthrough product and process innovations, many of which might make enormous positive impact on many people around the world. Unfortunately, it takes more than just a great innovation for that impact to be realized. A social entrepreneur must figure out how what kind of organization (for-profit, non-profit, partnerships, other) it needs to advance the idea, what is its fit-for-purpose business model, how to finance and support the endeavor with traditional and/or innovative forms of financing, where and how to implement the innovation, and, critically, how to eventually scale it up to have the greatest impact. Looking beyond the initial design and startup phase, this class explores the range of issues social innovation leaders must decide to shape, finance, and scale their services or products, to build the models, metrics, partnerships, and strategies that give them the best opportunity for new social innovations to reach the hundreds of millions of people who need them the most. The class is taught again by Steve Davis, former Executive Strategy Advisor for the Bill &amp; Melinda Gates Foundation, former CEO of a leading NGO in global health innovation PATH, and former Director of Social Innovation at McKinsey &amp; Company. It takes an interdisciplinary approach to look at the factors that pull innovation forward, push it from behind, and (often to the world's detriment) block its successful implementation and scaling. First grounding the discussion in research on innovation and social change, we then apply business principles, real world experiences, and several case studies to examine the way good ideas get stuck, and how good ideas can turn into innovation that matters. The course is divided into three modules - Shaping; Financing; Scaling - exploring key concepts, best practices, and critical decision points along the journey to scale. The class combines lectures, case studies, visiting practitioners and team projects focused on the business case for shaping, financing, and scaling specific social innovations. The goal is to help the next generation of social innovation leaders think more about some of the mistakes of the past, lessons for the future, and new ways of approaching old problems, all from a practitioner's point of view.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "222180",
        "number": "STRAMGT 345",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "351",
        "title": "Building and Managing Professional Sales Organizations",
        "description": "The focus of this class is on the challenges and key issues associated with the creation and management of a professional sales organization.  Our emphasis is developing and managing the selling effort of business-to-business and business-to-consumer capital goods and services.  There will be relatively little emphasis on sales technique (i.e., students should not expect a course on &quot;How to be a Better Salesperson&quot;).  The course is organized to follow the development of the sales function from strategic inception through to execution and implementation:  choosing a go-to-market model (e.g., direct sales, no/low touch, VARs, OEMs, hybrid models); building and structuring the sales organization (e.g., sales learning curve, organizational structure, allocating territories and quotas); and managing the sales force (e.g., hiring/firing, compensation, forecasting, culture).  We will address these topics in the context of both early stage ventures and later stage enterprises.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. 1 Group 1 Individual Project/Paper. P/F Not Allowed. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. Participation 33% Projects/Papers 67%. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "31049",
                "currentClassSize": "0",
                "maxClassSize": "68",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Levine, P.",
                                "sunet": "pjlevine"
                            },
                            {
                                "name": "Lattin, J.",
                                "sunet": "jlattin"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "CAS",
                "notes": "No Exam. 1 Group 1 Individual Project/Paper. P/F Not Allowed. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. Participation 33% Projects/Papers 67%. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "31050",
                "currentClassSize": "0",
                "maxClassSize": "68",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Levine, P.",
                                "sunet": "pjlevine"
                            },
                            {
                                "name": "Lattin, J.",
                                "sunet": "jlattin"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "204144",
        "number": "STRAMGT 351",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "353",
        "title": "Entrepreneurship: Formation of New Ventures",
        "description": "This course is offered for students who seek to understand the dynamics of new ventures from the point of view of the entrepreneur/manager rather than the passive investor. At some stage this understanding will enhance your decision making about whether to pursue a career in playing a key role in creating or building a new venture. It will also enhance your understanding if you will be negotiating with executives at new ventures. Many cases involve visitors, since the premise is that opportunity and action have large idiosyncratic components. Students must assess opportunity and action in light of the perceived capabilities of the individuals and the nature of the environments they face. The course is integrative and will allow students to apply many facets of their business school education.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. P/F Not Allowed. Participation 30% Projects/Papers 70%. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. 3 Group Projects/Papers. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "1053",
                "currentClassSize": "0",
                "maxClassSize": "70",
                "schedules": [
                    {
                        "startTime": "4:25:00 PM",
                        "endTime": "6:10:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Foster, G.",
                                "sunet": "gfoster"
                            },
                            {
                                "name": "Brady, S.",
                                "sunet": "sbrady"
                            }
                        ],
                        "startTimestamp": 59100.0,
                        "endTimestamp": 65400.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Participation 50% Projects/Papers 50%. GSB PhD students need instructor permission. P/F Not Allowed. 2 Group Projects/Papers. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "1053",
                "currentClassSize": "0",
                "maxClassSize": "70",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Nakache, P.",
                                "sunet": "pnakache"
                            },
                            {
                                "name": "Brady, S.",
                                "sunet": "sbrady"
                            },
                            {
                                "name": "Ellis, J.",
                                "sunet": "jellis1"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Tuesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Participation 50% Projects/Papers 50%. GSB PhD students need instructor permission. P/F Not Allowed. 2 Group Projects/Papers. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "1068",
                "currentClassSize": "66",
                "maxClassSize": "67",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saloner, G.",
                                "sunet": "saloner"
                            },
                            {
                                "name": "Brady, S.",
                                "sunet": "sbrady"
                            },
                            {
                                "name": "Bagalso, R.",
                                "sunet": "rbagalso"
                            },
                            {
                                "name": "Ellis, J.",
                                "sunet": "jellis1"
                            },
                            {
                                "name": "Alvarez, G.",
                                "sunet": "gisellea"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "100987",
        "number": "STRAMGT 353",
        "units": [
            4
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "354",
        "title": "Entrepreneurship and Venture Capital",
        "description": "Many of America's most successful entrepreneurial companies have been substantially influenced by professionally managed venture capital. This relationship is examined from both the entrepreneur's and the venture capitalist's perspective. From the point of view of the entrepreneur, the course considers how significant business opportunities are identified, planned, and built into real companies; how resources are matched with opportunity; and how, within this framework, entrepreneurs seek capital and other assistance from venture capitalists or other sources. From the point of view of the venture capitalist, the course considers how potential entrepreneurial investments are evaluated, valued, structured, and enhanced; how different venture capital strategies are deployed; and how venture capitalists raise and manage their own funds. The course includes a term-long project where students work in teams (4-5 students per team) to write a business plan (or a business model canvas) for a venture of the team's choosing.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "Enrolled students must attend first day of class unless pre-excused in writing. No Exam. Participation 50% Projects/Papers 50%. P/F Not Allowed. 1 Group Project/Paper. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "1008",
                "currentClassSize": "0",
                "maxClassSize": "76",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kupor, S.",
                                "sunet": "superkup"
                            },
                            {
                                "name": "Wendell, P.",
                                "sunet": "pwendell"
                            },
                            {
                                "name": "Nasr, R.",
                                "sunet": "rnasr"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 40800.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "100992",
        "number": "STRAMGT 354",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "355",
        "title": "Managing Growing Enterprises",
        "description": "This course is offered for students who aspire to lead growing businesses. The seminar, which is limited to 40-45 students, has a strong implementation focus, and deals in some depth with certain selected, entrepreneurial issues, viewed from the perspective of the owner/manager. Broad utilization is made of case materials, background readings, visiting experts, and role playing.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "Final grade is subject to reduction by one full category (i.e., from Pass to Low Pass) for class absence beyond one. No Exam. Open to MBA2 students. P/F Not Allowed. Capacity limited to 45 students. Partcipation 65% Projects/Papers 35%. Mandatory attendance. Absences impact grade. 2 Individual Projects/Papers. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "1045",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "9:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Andrews, C.",
                                "sunet": "coleya"
                            },
                            {
                                "name": "Dulski, J.",
                                "sunet": "jdulski"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 35100.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Open to MBA2 students. P/F Not Allowed. Capacity limited to 45 students. Mandatory attendance. Absences impact grade. 2 Individual Projects/Papers. Participation 60% Projects/Papers 40%. Case and Problem Discussion.",
                "classId": "1044",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Weaver, G.",
                                "sunet": "gweaver"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "Attendance required. Grade will be lowered one full category for each Unexcused absence beyond one. No Exam. Open to MBA2 students. P/F Not Allowed. Capacity limited to 45 students. Partcipation 65% Projects/Papers 35%. Mandatory attendance. Absences impact grade. 2 Individual Projects/Papers. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "1057",
                "currentClassSize": "41",
                "maxClassSize": "41",
                "schedules": [
                    {
                        "startTime": "1:15:00 PM",
                        "endTime": "2:35:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kelly, P.",
                                "sunet": "pbkelly"
                            },
                            {
                                "name": "Sonora, P.",
                                "sunet": "sonorap"
                            }
                        ],
                        "startTimestamp": 47700.0,
                        "endTimestamp": 52500.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "CAS",
                "notes": "No Exam. Open to MBA2 students. P/F Not Allowed. Capacity limited to 45 students. Partcipation 65% Projects/Papers 35%. Mandatory attendance. Absences impact grade. 2 Individual Projects/Papers. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "1046",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Andrews, C.",
                                "sunet": "coleya"
                            },
                            {
                                "name": "Dulski, J.",
                                "sunet": "jdulski"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "CAS",
                "notes": "No Exam. Open to MBA2 students. P/F Not Allowed. Capacity limited to 45 students. Mandatory attendance. Absences impact grade. 2 Individual Projects/Papers. Participation 60% Projects/Papers 40%. Case and Problem Discussion.",
                "classId": "1045",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "1:15:00 PM",
                        "endTime": "2:35:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Weaver, G.",
                                "sunet": "gweaver"
                            }
                        ],
                        "startTimestamp": 47700.0,
                        "endTimestamp": 52500.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "CAS",
                "notes": "No Exam. Open to MBA2 students. P/F Not Allowed. Capacity limited to 45 students. Partcipation 65% Projects/Papers 35%. Mandatory attendance. Absences impact grade. 2 Individual Projects/Papers. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "1047",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "1:15:00 PM",
                        "endTime": "2:35:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kelly, P.",
                                "sunet": "pbkelly"
                            }
                        ],
                        "startTimestamp": 47700.0,
                        "endTimestamp": 52500.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "CAS",
                "notes": "No Exam. P/F Not Allowed. Partcipation 65% Projects/Papers 35%. Open to MSx students. Mandatory attendance. Absences impact grade. 2 Individual Projects/Papers. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "32578",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "9:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dodson, D.",
                                "sunet": "ddodson1"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 35100.0,
                        "days": "Tuesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "CAS",
                "notes": "No Exam. P/F Not Allowed. Partcipation 65% Projects/Papers 35%. Open to MSx students. Mandatory attendance. Absences impact grade. 2 Individual Projects/Papers. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "32579",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dodson, D.",
                                "sunet": "ddodson1"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "100997",
        "number": "STRAMGT 355",
        "units": [
            3
        ],
        "totalSections": 8
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "356",
        "title": "Startup Garage: Design",
        "description": "(BIOE 376) Startup Garage is an intensive, hands-on, project-based course where students apply design thinking, lean startup methodology, and the Business Model Canvas to conceive, design, and field-test new business concepts that address real world needs. Teams get out of the building and interact directly with users, stakeholders, and advisors to deeply understand one or more unmet customer needs. They proceed to design, prototype, and test their proposed solutions, validate the value proposition, develop a business model, and identify risks. Teams working on impact-focused ventures apply the same methodology to address the needs of their beneficiaries. Students develop entrepreneurial skills as they learn critical, cutting-edge techniques for testing new venture ideas. Offered by the Graduate School of Business. PREREQUISITE: Team application required. Details and application: http://startupgarage.stanford.edu/details.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "No Exam. Permission required for all GSB students. 1 Group Project/Paper. Capacity limited to 48 students. Mandatory attendance. Absences impact grade. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop. Design Reviews 35% Assignments 30% Final 35%.",
                "classId": "29505",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "9:45:00 AM",
                        "location": "DINKG10",
                        "instructors": [
                            {
                                "name": "Chen, E.",
                                "sunet": "ericc"
                            },
                            {
                                "name": "Waldorf, G.",
                                "sunet": "gwaldorf"
                            },
                            {
                                "name": "Wallace, C.",
                                "sunet": "collinw"
                            },
                            {
                                "name": "Prakash, A.",
                                "sunet": "ajayp"
                            },
                            {
                                "name": "Glickman, M.",
                                "sunet": "mattgli"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 35100.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "WKS",
                "notes": "No Exam. Permission required for all GSB students. 1 Group Project/Paper. Capacity limited to 48 students. Mandatory attendance. Absences impact grade. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop. Design Reviews 35% Assignments 30% Final 35%.",
                "classId": "29506",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "9:45:00 AM",
                        "location": "Econ 140",
                        "instructors": [
                            {
                                "name": "Lisbonne, B.",
                                "sunet": "blis"
                            },
                            {
                                "name": "Perkash, M.",
                                "sunet": "mperkash"
                            },
                            {
                                "name": "Gur, S.",
                                "sunet": "saar"
                            },
                            {
                                "name": "Scull, J.",
                                "sunet": "jmscull"
                            },
                            {
                                "name": "Laws, M.",
                                "sunet": "mlaws"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 35100.0,
                        "days": "Tuesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "WKS",
                "notes": "No Exam. Permission required for all GSB students. 1 Group Project/Paper. Capacity limited to 48 students. Mandatory attendance. Absences impact grade. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop. Design Reviews 35% Assignments 30% Final 35%.",
                "classId": "29507",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": "Econ 140",
                        "instructors": [
                            {
                                "name": "Nakache, P.",
                                "sunet": "pnakache"
                            },
                            {
                                "name": "Deshpande, S.",
                                "sunet": "sathomas"
                            },
                            {
                                "name": "Baker, K.",
                                "sunet": "kbaker2"
                            },
                            {
                                "name": "Eison, J.",
                                "sunet": "jeison"
                            },
                            {
                                "name": "Galen, D.",
                                "sunet": "dgalen"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "101001",
        "number": "STRAMGT 356",
        "units": [
            4
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "364",
        "title": "Health Information Technology and Strategy",
        "description": "Health Information technology was intended to help reduce cost and improve the quality of health care services. To date, this is little evidence that this goal has been achieved. This course is designed to explore economic frameworks that can help us to understand how health IT can achieve it's intended goals. These frameworks build from general business and economic models used successfully in other industries. The course will utilize both business cases and lecture to prepare students to propose potential novel applications of health information technology solutions. Each student will have a team-based final project.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Capacity limited to 36 students. Participation 20% Projects/Papers 80%. 1 Group Project/Paper. Open to MBA, MSx, and GSB PhD students. Mandatory attendance. Absences impact grade. CSI certificate course. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "29494",
                "currentClassSize": "21",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "4:25:00 PM",
                        "endTime": "5:45:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Baxter, L.",
                                "sunet": "lbaxter"
                            },
                            {
                                "name": "Schulman, K.",
                                "sunet": "schul"
                            }
                        ],
                        "startTimestamp": 59100.0,
                        "endTimestamp": 63900.0,
                        "days": "Monday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221287",
        "number": "STRAMGT 364",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "366",
        "title": "Startup Garage: Testing and Launch",
        "description": "(Same as BIOE 377) In this intensive, project-based course, teams continue to develop their ventures based on a prototype, business model, and value proposition that they validated in advance of the course. They build out more elaborate versions of their prototypes and Business Model Canvas, run experiments on de-risking the venture, and test hypotheses about the product, business model, value proposition, customer acquisition, revenue generation, etc. Students develop entrepreneurial skills as they 1) get feedback from users, investors, and advisors, 2) work through their operating plans and unit economics, 3) test go-to-market strategies, 4) make decisions about pivoting, 5) consider equity splits, 6) learn term sheet negotiations, and 7) practice pitching. At the end, teams deliver a fundraising pitch to a panel of investors. PREREQUISITE: STRAMGT 356 / BIOE 376 or team application. Details and application: http://startupgarage.stanford.edu/details.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "No Exam. Permission required for all GSB students. 1 Group Project/Paper. Capacity limited to 48 students. Mandatory attendance. Absences impact grade. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop. Design Reviews 35% Assignments 30% Final 35%.",
                "classId": "1067",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "9:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Grais, L.",
                                "sunet": "lgrais"
                            },
                            {
                                "name": "Perkash, M.",
                                "sunet": "mperkash"
                            },
                            {
                                "name": "Wallace, C.",
                                "sunet": "collinw"
                            },
                            {
                                "name": "Baker, K.",
                                "sunet": "kbaker2"
                            },
                            {
                                "name": "Glickman, M.",
                                "sunet": "mattgli"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 35100.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "WKS",
                "notes": "No Exam. Permission required for all GSB students. 1 Group Project/Paper. Capacity limited to 48 students. Mandatory attendance. Absences impact grade. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop. Design Reviews 35% Assignments 30% Final 35%.",
                "classId": "1068",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "9:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lisbonne, B.",
                                "sunet": "blis"
                            },
                            {
                                "name": "Gur, S.",
                                "sunet": "saar"
                            },
                            {
                                "name": "Laws, M.",
                                "sunet": "mlaws"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 35100.0,
                        "days": "Tuesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "WKS",
                "notes": "No Exam. Permission required for all GSB students. 1 Group Project/Paper. Capacity limited to 48 students. Mandatory attendance. Absences impact grade. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop. Design Reviews 35% Assignments 30% Final 35%.",
                "classId": "1069",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Nakache, P.",
                                "sunet": "pnakache"
                            },
                            {
                                "name": "Deshpande, S.",
                                "sunet": "sathomas"
                            },
                            {
                                "name": "Baker, K.",
                                "sunet": "kbaker2"
                            },
                            {
                                "name": "Eison, J.",
                                "sunet": "jeison"
                            },
                            {
                                "name": "Galen, D.",
                                "sunet": "dgalen"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "206052",
        "number": "STRAMGT 366",
        "units": [
            4
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "368",
        "title": "Impact: Strategic Leadership of Nonprofit Organizations and Social Ventures",
        "description": "Our primary objective in this course is to prepare and equip you to play a high-impact leadership role in the social sector, as a founder, executive, board member, and/or donor/philanthropist. This course seeks to provide a survey of the strategic, governance, and management issues facing a wide range of social sector organizations and their executive and board leaders, in the era of venture philanthropy and social entrepreneurship. The students will also be introduced to core managerial issues uniquely defined by this sector such as development/fundraising, investment management, performance management and nonprofit finance. The course also provides an overview of the sector, including its history and economics. Cases involve a range of nonprofits, from smaller, social entrepreneurial to larger, more traditional organizations, including education, social service, environment, health care, religion, international NGO's and performing arts. In exploring these issues, this course reinforces the frameworks and concepts of strategic management introduced in the core first year courses. In addition to case discussions, the course employs role plays, study group exercises and many extraordinary guest speakers who are luminaries in the social sector.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "101041",
        "number": "STRAMGT 368",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "371",
        "title": "Strategic Management of Technology and Innovation",
        "description": "This course focuses on the strategic management of technology-based innovation in the firm. The purpose is to provide students with concepts, frameworks, and experiences that are useful for taking part in the management of innovation processes in both startups and large technology-focused organizations. The course examines how leaders can manage fast-changing technological innovations effectively. Specific topics include: assessing the innovative capabilities of the firm, managing the technical function in a company, navigating the interfaces between functional groups in the development function in the firm, understanding and managing technical entrepreneurs, building technology-based distinctive competencies and competitive advantages, technological leadership versus followership in competitive strategy, institutionalizing innovation, attracting and keeping entrepreneurs.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "101052",
        "number": "STRAMGT 371",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "381",
        "title": "Leading Strategic Change in the Health Care Industry",
        "description": "In this seminar we will study the structure and dynamics of the U.S. health care industry, especially in the face of ongoing regulatory change, and ways it intersects with the global health care industry. The seminar's aim is to develop participants' ability to create strategically informed action plans that are imaginative, inspiring and workable in this highly dynamic environment. The seminar's pedagogy involves informed debate to evaluate and hone well-researched views by the participants and instructors, as well as the writing and presentation of position papers by small groups of seminar participants on the key dynamics of the industry.In the course of the seminar discussions, we aim to deepen our understanding of strategic dynamics and transformational change at the societal, industry and organizational levels of analysis. After developing a complete picture of the structure of the health care industry and the strategic relationships among the key players (&quot;the strategic landscape&quot;), the seminar will focus on how health care reform and other external forces will affect the strategic opportunities and challenges of four types of players in the strategic landscape: (1) incumbents; (2) entrepreneurial startups; (3) cross-boundary disruptors; and (4) international health care providers. World-class leaders in health care will be brought in to supplement our understanding of each one of these players. Student teams will be formed to focus on one of the four types of players. Each team will prepare a research paper focused on determining how their type of player can take advantage of the regulatory, technological, social, cultural and demographic changes, and who will be the likely winners and why.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "211080",
        "number": "STRAMGT 381",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "502",
        "title": "Systems Leadership",
        "description": "Leaders of today live in an increasingly uncertain world, and the challenges brought upon by changes in technology, shifting societal norms, great power conflict, and the global pandemic are drastic. At some level, all leadership right now is crisis leadership - getting one's team and organization through unprecedented times. Sometimes the ability to lead through these changes is due to talent; other times, luck plays the more important role. COVID added another layer of disconnect to the world of disruption. Every person and company had to change; not always for the better. And, broadly, competency slipped (see https://www.linkedin.com/pulse/first-competent-jeff-immelt/ for more on this issue). Leaders need to 'recharge' themselves and their organizations. This course explores how leaders at the world's leading companies are driving frame-breaking transformational change inside of organizations that have grown up with a physical foundation, or who have a digital foundation and are moving into the physical domain as a new entrant. In addition, in the emerging post-pandemic world, the issues facing leaders across multiple industries require insights on how to drive technological, cultural and ecosystem changes under unprecedented duress. The macro trends that are currently dominating the business world include the need for leaders to understand the best attributes of companies that have both digital and physical roots, as well as how to balance these macro issues in times of great uncertainty. Leaders need to make choices on where to deploy resources, those parts of the technical stack where they will seek to own technology (and where they will partner), and how they can influence, organize and shape their ecosystems. The changes brought about by these dynamics require the development of new types of leaders. Historically, professional managers have sought calm waters to run their businesses. Consultants and analysts have looked to break up companies to 'unlock value.' But Systems Leaders seek to maximize and thrive in the chaos of the time",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "Attendance in the first session is required for both enrolled and waitlisted students. Non-GSB students must be graduate students. All enrolled and waitlist must attend the first two sessions. No Exam. Participation 50% Projects/Papers 50%. P/F Not Allowed. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. 1 Individual Project/Paper. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "1048",
                "currentClassSize": "0",
                "maxClassSize": "84",
                "schedules": [
                    {
                        "startTime": "4:25:00 PM",
                        "endTime": "6:10:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Siegel, R.",
                                "sunet": "resiegel"
                            },
                            {
                                "name": "Immelt, J.",
                                "sunet": "jrimmelt"
                            }
                        ],
                        "startTimestamp": 59100.0,
                        "endTimestamp": 65400.0,
                        "days": "Monday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220048",
        "number": "STRAMGT 502",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "503",
        "title": "Spontaneous Management",
        "description": "In this class, you will learn techniques for improving your spontaneity, creativity, presence, and collaboration skills, all of which contribute to your becoming a more effective and inspirational leader. This class combines research on social psychology and techniques from improvisational theater to help you develop your leadership skills.  The interactive exercises are based on the techniques that improv actors use on stage when they make up scenes, songs, or even entire plays on the spot. Improv teaches you to do many things at once: be completely present, think on your feet, quickly get in sync with others, read the room, and be agile at using what the situation presents you. As a leader in business, you will benefit from this same skill set.  Whether you are presenting to your board, brainstorming &amp; designing with colleagues, or mentoring new talent - learning some building blocks of improv will give you valuable new tools for interacting effectively with others.  The course will cover topics such as spontaneity, risk taking, authenticity, nonverbal behavior, storytelling, effective brainstorming, understanding and using status, and creative collaboration.",
        "repeatable": "false",
        "grading": "GSB Pass/Fail",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "All Non-GSB students must be graduate students. Participation 100%. No Exam. P/F Mandatory. Capacity limited to 40 students. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop.",
                "classId": "32088",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schifrin, D.",
                                "sunet": "debra1"
                            },
                            {
                                "name": "Wheeler, S.",
                                "sunet": "wheelerc"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "All Non-GSB students must be graduate students. Participation 100%. No Exam. P/F Mandatory. Capacity limited to 40 students. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop.",
                "classId": "30842",
                "currentClassSize": "35",
                "maxClassSize": "35",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schifrin, D.",
                                "sunet": "debra1"
                            },
                            {
                                "name": "Wheeler, S.",
                                "sunet": "wheelerc"
                            },
                            {
                                "name": "Flores, K.",
                                "sunet": "kmflores"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "WKS",
                "notes": "All Non-GSB students must be graduate students. Participation 100%. No Exam. P/F Mandatory. Capacity limited to 40 students. Open to MBA and MSx students. Mandatory attendance. Absences impact grade. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Workshop.",
                "classId": "32089",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Schifrin, D.",
                                "sunet": "debra1"
                            },
                            {
                                "name": "Wheeler, S.",
                                "sunet": "wheelerc"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219456",
        "number": "STRAMGT 503",
        "units": [
            2
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "507",
        "title": "From Invention to Innovation: The Process of Translation",
        "description": "The class intends to address specific challenges: 1) The challenges facing businesses are strongly rate-limited by the translation problems of new ideas, and inventions often do not make it into the market place or are disrupted at multiple levels in ways that are generally unpredictable; 2) The challenge of understanding how disruptive innovations take place in the context of the larger frame of translation. The concept of translation can be cast as the following equation, which will be discussed in the class: Innovation = (Inventiona+ C) &times; Translationb (Where a, b, and C are greater than zero) In light of these challenges, this class will address the following strategic questions and use it to propose a framework for innovation that will increase the probability of successful translation. The class will attempt to address the following questions and extract the principles for enabling translation. 1. What is Translation and why is it necessary? (Examples of Translation from the instructors and visiting lecturers) 2. What does it take for Translation that connects concepts to reality to succeed? 3. What factors prevent Translation from succeeding? 4. What general theoretical framework can we construct to encompass the various types of disruptive innovation?",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224486",
        "number": "STRAMGT 507",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "510",
        "title": "Conversations in Management",
        "description": "This case-based course is offered for students who want to refine their ability to manage challenging professional conversations.  The class will focus on the preparation for and execution of role-played dialogue as well as on postmortem analysis.  Most of the respondent roles will be external to one's company, and some will be front line or mid-level people with limited educational credentials.  Broad utilization will be made of background readings and an occasional visiting expert.",
        "repeatable": "false",
        "grading": "GSB Pass/Fail",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "One absence permitted provided instructor is consulted in advance. Students must attend first class unless excused in advance in writing. No Exam. Participation 50% Projects/Papers 50%. P/F Mandatory. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. 1 Individual Project/Paper. Not Open to Non-GSB Students. Case and Problem Discussion. Capacity limited to 22 students.",
                "classId": "1013",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Grousbeck, H.",
                                "sunet": "grous"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Capacity limited to 32 students. P/F Not Allowed. Mandatory attendance. Absences impact grade. Participation 60% Projects/Papers 40%. Open to MBA2 and MSx students. 1 Individual Project/Paper. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "1010",
                "currentClassSize": "0",
                "maxClassSize": "32",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Taweel, K.",
                                "sunet": "ktaweel"
                            },
                            {
                                "name": "Ellis, J.",
                                "sunet": "jellis1"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Tuesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "One absence permitted provided instructor is consulted in advance. Students must attend first class unless excused in advance in writing. No Exam. Participation 50% Projects/Papers 50%. P/F Mandatory. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. 1 Individual Project/Paper. Not Open to Non-GSB Students. Case and Problem Discussion. Capacity limited to 22 students.",
                "classId": "1018",
                "currentClassSize": "29",
                "maxClassSize": "29",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Detter, T.",
                                "sunet": "tdetter"
                            },
                            {
                                "name": "Grousbeck, H.",
                                "sunet": "grous"
                            },
                            {
                                "name": "Sonora, P.",
                                "sunet": "sonorap"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "CAS",
                "notes": "One absence permitted provided instructor is consulted in advance. Students must attend first class unless excused in advance in writing. No Exam. Participation 50% Projects/Papers 50%. P/F Mandatory. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. 1 Individual Project/Paper. Not Open to Non-GSB Students. Case and Problem Discussion. Capacity limited to 22 students.",
                "classId": "1014",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rosenthal, S.",
                                "sunet": "dodie"
                            },
                            {
                                "name": "Grousbeck, H.",
                                "sunet": "grous"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "CAS",
                "notes": "No Exam. Participation 50% Projects/Papers 50%. P/F Mandatory. Capacity limited to 25 students. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. 1 Individual Project/Paper. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "1019",
                "currentClassSize": "26",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Steele, D.",
                                "sunet": "desteele"
                            },
                            {
                                "name": "Grousbeck, H.",
                                "sunet": "grous"
                            },
                            {
                                "name": "Sonora, P.",
                                "sunet": "sonorap"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216946",
        "number": "STRAMGT 510",
        "units": [
            2
        ],
        "totalSections": 5
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "511",
        "title": "Protecting Ideas",
        "description": "Today, the assets of many businesses are largely intangible, such as brands, data, software and trade secrets. More and more we live in an economy based on intangibles and much of business involves creating, exploiting and managing those intangible assets. Intellectual property rights (patents, trade secrets, copyright, trademarks design rights and so on) and data rights are a set of legal rights and assets that establish ownership of and protect tangible and intangible assets from copying and other acts for example copying of software or counterfeiting of designer handbags. Equally, intellectual property in the hands of third parties may pose a risk to a business developing a new product or brand. Most businesses start with an idea. It is critical to understand when and under what circumstances ideas, creative works and technology can be protected from third party use by intellectual property, and what limits apply to that protection. It is equally critical to recognize what must be done to secure ownership. In this course you will learn about IP rights-what they are, what they do, their limitations and how they are useful from a strategic perspective-well beyond the typical idea of a patent being nothing more than an invitation to a messy and expensive lawsuit. We will also discuss the all-too-common mistakes that can frustrate these objectives. To put these issues into a business setting, we will be joined by experienced business executives and investors in markets ranging from biosciences to software to sound engineering.  This course is designed for business students, not law students. It is the objective of this course to help business students to think critically about when and how to invest in intellectual property protection, to recognize its limits, and to avoid the common mistakes that can frustrate such investments and undermine the value of the company. Although we will have to introduce you to legal concepts, the focus of the course is on putting these concepts into a business setting and explaining how IP may be used strategically-enabling you to be part of the conversation with legal and intellectual property experts and to consider how IP can support management of the assets and strategy of a business or other enterprise. No prior knowledge or experience with intellectual property is needed. The format of this course is under review for best adaption to the possibility of distance learning but will include reading before each class, live or recorded presentations by the guest speakers, and Q&amp;A and discussion. Guest speakers will share their experiences in the areas of IP investment, management, deployment, strategy and risk.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "217552",
        "number": "STRAMGT 511",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "512",
        "title": "The Yin and Yang of Family Business Transitions",
        "description": "This seminar provides students with practical solutions to some of the challenges faced in family business transitions. Family businesses are by far the dominant form of commerce world-wide, albeit the majority are small &quot;mom and pop shops.&quot; Some research shows that large businesses, whatever the form of ownership, have an average lifespan of around forty years, while small businesses (at least in Japan and Europe) average around twelve years. So, if businesses in general do not survive, then it is a wonder that any family business can survive from one generation to another, let alone two, three, four or more. There are three essential requirements to succeed in a family business transition. First, it may seem obvious that the business must succeed, but it is less obvious what advantages a family business has over its non-family-owned counterparts. Second, the ownership structure must effectively maintain family cohesion and support the business. Finally, family members need to organize in thoughtful ways to work effectively with one another. The beauty of a family business is that it can be more profitable than companies with non-family ownership. Two fundamentals, at least, provide this advantage - a strong value system and a long-term economic perspective. The operative word above, however, is &quot;can&quot;; it is by no means a foregone conclusion that a family business will be more successful. Families must thoughtfully develop their advantages, while at the same time avoiding the pitfalls that are inherent in any family business .Accordingly, this course is offered for students whose families own a family business or who are interested in the special challenges faced by family businesses. International students are encouraged to register as different cultural perspectives to family business will enrich the experience for everyone. Particular focus will be given to the transitions from one generation to another and the lessons learned that can be applied during the entire life of the business.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "For Non-GSB students, only Graduate-level students permitted and require instructor permission. No Exam. Mandatory attendance. Absences impact grade. Participation 60% Projects/Papers 40%. Open to MBA2 and MSx students. 1 Individual Project/Paper. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Seminar. Capacity limited to 22 students.",
                "classId": "29363",
                "currentClassSize": "22",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Francis, P.",
                                "sunet": "pfranci2"
                            },
                            {
                                "name": "Lumagui, S.",
                                "sunet": "sharonml"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214610",
        "number": "STRAMGT 512",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "514",
        "title": "Product/Market Fit",
        "description": "The premise of this course is the success of a startup (and even a large company launching a new product) is most dependent on finding a market that is desperate for its product. Focusing on product/market fit conflicts with the conventional view that a startup's limited resources should be applied to perfecting the execution of day to day activities. Interestingly almost every successful product driven technology company followed a similar path to find its product/market fit, but it was usually by accident. In this course we attempt to define the consistent process each successful company pursued, which in most cases is highly counterintuitive, and how to apply it to different situations. Our class highlights the potential conflict between pursuing a conventional approach and optimizing product/market fit.  In order to really bring out this conflict, we employ a seminar format with only 25 students so every issue can be evaluated in detail. Our lessons are limited to information technology-based companies, but we have been told they may be more broadly applicable.  That being said, this course has been designed for someone who is truly interested in technology-based entrepreneurship.  Students who choose to take this course must be committed to read all the assigned articles and books to have the proper foundation to address the frequent counterintuitive learnings. In some cases that might require an entire (although relatively short) book be read for an individual class. A written assignment addressing at least one of the learnings from each reading will be required to be submitted at least four hours prior to each class. Failure to submit even one of the written assignments will result in a U. In addition to the daily written assignments, there will be a large individual project required at the end of the course. In other words, this course requires far more commitment than a typical GSB course, especially for one that offers only two credits.  However I promise this course will be invaluable should you choose an operating or investment career in the technology business.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Students on the waitlist must attend the first two classes to be admitted from the waitlist. No Exam. Open to MBA2 students. P/F Not Allowed. 10 Individual Projects/Papers. Participation 67% Projects/Papers 33%. Capacity limited to 25 students. Mandatory attendance. Absences impact grade. Not Open to Non-GSB Students. Seminar.",
                "classId": "1055",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "4:25:00 PM",
                        "endTime": "6:10:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rachleff, A.",
                                "sunet": "rachleff"
                            }
                        ],
                        "startTimestamp": 59100.0,
                        "endTimestamp": 65400.0,
                        "days": "Monday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223025",
        "number": "STRAMGT 514",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "516",
        "title": "Fundamentals of Effective Selling",
        "description": "The primary objective of this course is to introduce students to the fundamentals of how to sell.  The course is appropriate for anyone who wants to understand and show proficiency with the skills required in different selling situations, both traditional (i.e., direct sales of products and services) and non-traditional (e.g., selling oneself in an interview, raising money for a new venture, convincing a job candidate to join your company, etc.).  The course looks at the entire selling process of prospecting, qualification, discovery, understanding value, customizing presentations, objection handling, and closing. This is not a typical GSB case-study-based course.  Students who have taken previous versions of this class describe it as a practical, hands-on, skills-based class.  Students will work by themselves outside of class to prepare for group exercises and role-plays that will take place in class.  These exercises are designed to give students practice with selling fundamentals in each stage of the selling process, and to give them the opportunity to observe and provide feedback to others.  Our goal is to provide students the time in class to focus on doing stuff (e.g., practice using curiosity) rather than just thinking about and talking about stuff. After taking this course, you should understand what is involved in all of the following steps of the selling process: - Preparing a value-based prospecting script. - Using an advanced questioning methodology and note-taking strategy for discovering a customer's most important business priorities and motivations.- Developing a curiosity-based approach to handling objections in all stages of the selling process. - Creating and delivering effective customized presentations. - Understanding the most effective ways to create engagement and interaction when selling. - Developing a strategy and building the confidence to ask the hard questions when closing a deal. - Using a value-based mutual plan to control the sales cycle and move a deal forward.&iquest;\tIdentifying the most valuable categories for qualifying an opportunity.- Accelerating the process of relationship building. - Understanding a customer&iquest;s entire decision making process (DMP). - Discovering limiting beliefs and seeing how they impact your ability to accomplish your objectives. - Applying these fundamentals of effective selling to your personal selling situations with confidence.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "Must be able to attend all six class sessions. No Exam. P/F Not Allowed. Participation 30% Projects/Papers 70%. Mandatory attendance. Absences impact grade. 3 Individual Projects/Papers. Open to MBA2 and MSx students. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "29365",
                "currentClassSize": "80",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bagalso, R.",
                                "sunet": "rbagalso"
                            },
                            {
                                "name": "Rhein, B.",
                                "sunet": "brhein"
                            },
                            {
                                "name": "Lattin, J.",
                                "sunet": "jlattin"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Friday"
                    },
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bagalso, R.",
                                "sunet": "rbagalso"
                            },
                            {
                                "name": "Rhein, B.",
                                "sunet": "brhein"
                            },
                            {
                                "name": "Lattin, J.",
                                "sunet": "jlattin"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214609",
        "number": "STRAMGT 516",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "519",
        "title": "Equity By Design: Building Diverse and Inclusive Organizations",
        "description": "This course equips you to create, build and lead equitable organizations.  We will learn the power of iD&amp;I - that is, how we can be change agents by involving key stakeholders, casting the right vision, and constructing the right interactions to unlock the true potential of diversity in teams and organizations.  We will discuss the power of inclusion as itrelates to the employee and customer experience. We will study effective strategies for designing diverse and inclusive companies, and will address the barriers and myths related to meritocracy. We'll look at approaches to organizational design that limit unconscious bias and produce more objective decisions across the employee experience - from engaging and hiring candidates to retaining employees and helping them thrive. We'll dive into how to create inclusive cultures and a sense of belonging. Finally, we will learn tools and techniques to empower change for ourselves and others. Experts in diversity and inclusion, and executives at companies that have successfully incorporated inclusion programs, will join us for the class discussions.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "218646",
        "number": "STRAMGT 519",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "520",
        "title": "The Industrialist's Dilemma",
        "description": "This course explores how digital disruptions are having tectonic shifts on large, successful and established companies, whether they have a digital foundation or not. Both new and existing high technology firms such as Google, Amazon, Stripe, Airbnb and others are reshaping industries as disparate as life sciences and transportation.  The management principles, competitive strategies, partnerships, and core competencies of the 20th century are being challenged in a world of bits and the global network in which all companies are forced to compete.  In this course we will explore some of the fundamental technological changes impacting these industries, such as scaling assets without owning them, partnerships with digital leaders and new distribution strategies for goods and services.  We will hear from executives of both leading Fortune 500 companies and new disruptors about what it takes to survive and thrive in this new digital economy.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "217343",
        "number": "STRAMGT 520",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "524",
        "title": "Longevity:  Business Implications and Opportunities",
        "description": "People age 50 and over account for over 50% of consumer spending in the US and 83% of household wealth, with both number expected to increase significantly due to a combination of increased longevity and the aging of the baby boomer generation.  It is the largest and one of the fastest growing business opportunities US and worldwide.  Many business managers and entrepreneurs, however, do not consider the over 50 demographic in their plans, and those that do often do not understand how best to design products and services for this group.  It is a huge missed opportunity.  This class will explore how managers and entrepreneurs should consider the older population in their strategies, in product and service design, in managing their work force, and in their own careers.  Class topics will include: - The over age 50 opportunity and how it will grow over the coming years - The map of life and segmenting the older population - Considerations for developing products and services that are multi-generational and appealing to older consumers - New business opportunities created by the growth in the over 50 population, social trends, and technology - Managing older workers -Career considerations in a world where individuals live longer and healthier lives. The course is offered in Spring Quarter, and uses a mix of cases developed for the class, guest speakers from established companies and entrepreneurs, and lectures",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "221821",
        "number": "STRAMGT 524",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "529",
        "title": "Marketplaces for Goods and Services",
        "description": "In this class we will analyze the economics and strategy of marketplaces and platforms for goods and services.  We will consider the forces that have led to the proliferation of these marketplaces, as well as the economics behind which ones are likely to succeed and become profitable.  We will analyze the economic costs and benefits of these marketplaces for society, and consider the regulatory environment and challenges.  We will also study the microeconomics of managing these marketplaces: how should matching work, how can marketplace design solve problems of congestion or market thinness, and how a platform should trade off the welfare of the different sides of the market as it enters and grows.  Applications include ride-sharing and transportation; room-sharing and vacation rentals; on-demand labor and services such as babysitting, massage, manual labor, and dog-sitting; dating; and organized labor markets.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "218627",
        "number": "STRAMGT 529",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "532",
        "title": "Intellectual Property: Financial and Strategic Management",
        "description": "In today's competitive marketplace, companies -- from Fortune 500 firms to early stage start-ups -- rely on intellectual property (IP) to keep them one step ahead of the game. Yet, critical IP decisions are usually made by lawyers with very little input from management. The purpose of this class is to provide business leaders with the tools, models and institutional knowledge to actively participate in managing and growing their company's IP assets as strategic business assets (with a focus on patents). This class will explore the value of corporate IP assets by thinking strategically on how to effectively leverage the knowledge, trade secrets, patents, technologies, trademarks, structures and processes that are critical across industries. We will focus on the elements of a successful IP strategy, and how that strategy is shaped by economic, technology, legal, regulatory, and market factors. Through a combination of case studies (including a group strategy project), analysis of current events, class discussion and guest speakers, we will cover a variety of issues shaping a successful IP strategy in today's global business environment. Some of the topics covered include: * Building and managing an IP portfolio that is aligned with business objectives;* Understanding the forces shaping the IP marketplace in the US and in foreign markets;* The innovation cycle and technology transfer mechanisms;* Using big data analytics in making IP decisions;* IP portfolio monetization strategies (e.g., licensing, sale, enforcement);* IP considerations in Mergers &amp; Acquisitions;* IP valuation and current trends in patent transactions;* Managing corporate IP litigation risk (patent trolls, incumbent litigation);* IP strategies for start-ups &amp; entrepreneurs.Ms. Efrat Kasznik is an IP valuation and strategy expert with more than twenty years of experience advising companies of all sizes, from startups to Fortune 100s, on extracting value from their IP. She is the founder and President of Foresight Valuation Group, an IP consulting and startup advisory firm providing valuation and strategy services for a range of purposes, including M&amp;A, financial reporting, technology commercialization decisions, tax compliance, transfer pricing, and litigation damages. Ms. Kasznik has been a co-founder, CFO and advisor to several startups and incubators in the US and Europe. She is listed on the IAM 300 list of World Leading IP Strategists, and is on the Board of the Licensing Executives Society, USA-Canada.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "216544",
        "number": "STRAMGT 532",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "537",
        "title": "Leading Change in Public Education",
        "description": "Public education in America is at a crossroads.  Does our education system have what it takes to produce graduates who are prepared for college, career, and citizenship in our increasingly digital and pluralistic world?  Will income and ethnic achievement gaps continue to be pervasive and persistent in our nation's largest urban cities? Will family zip code determine educational destiny for the next generation of students? Which strategies and reforms are truly demonstrating results and which are merely passing fads? As in all large-scale enterprises undergoing rapid, transformative change, leadership matters greatly.  Fortunately, over the last decade, the reform of American public education has been led by a number of innovative and results-oriented leaders at the state, district and charter levels.  These leaders are bringing additional urgency, strategies, and ideas designed to prepare America's schools and students for the century ahead.  Some ideas are proving to be critical levers for change, others are facing significant political challenges, and others have not delivered on expected results.  Many of them hold lessons for how future educational leaders can contribute to transforming public education for the next generation of K-12 students.  This course will focus on school system leadership for education reform. The course will provide an overview of the critical issues facing K-12 public education in America today, and what is going on across the U.S. during this transformative period of change.  Once this context is set, students will study education leaders and systems change strategies from the last 10-15 years at the state, district and charter levels.  We will focus on leaders across five domains: Leadership in crisis situations, strategic leadership, 'china-breaking' leadership, sustaining leadership, and next generation leadership.  We will also look at leadership examples from outside K-12 education to broaden our thinking about what leadership styles and strategies could be successfully applied to education.  Students will debate the strategies and efficacy of how different leaders approached systems-level change and will form their own working hypotheses of what is needed to help transform the American education system.  Case studies in school system leadership will form the primary basis for classroom assignments and discussion.  We will examine what went right and what went wrong in each case, focusing particularly on the decisions that school system leaders faced and the implications of their decisions.  Most cases will be supplemented with research publications, technical notes, news clips, and/or videos to deepen students' understanding of the context or issues discussed in the cases.  Dan Katzir worked for Bain &amp; Company, Teach for America, Sylvan Learning Systems and the Eli and Edythe Broad Foundation before joining Alliance College-Ready Public Schools as its CEO in 2015.  He is an experienced case study teacher and the editor of The Redesign of Urban School Systems: Case Studies in District Governance.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No undergraduates. No Exam. P/F Not Allowed. Open to MBA and MSx students. Final 20% Participation 40% Projects/Papers 40%. Mandatory attendance. Absences impact grade. CSI certificate course. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Case and Problem Discussion.",
                "classId": "32684",
                "currentClassSize": "0",
                "maxClassSize": "62",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Katzir, D.",
                                "sunet": "katzir1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215117",
        "number": "STRAMGT 537",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "541",
        "title": "Insight to Outcome",
        "description": "Getting from &quot;strategic insight&quot; to &quot;desired outcome&quot; (achieving the right result) continues to be a core challenge for many organizations and leaders. In this course, we develop a framework and approach for the &quot;insight to outcome&quot; sequence, study some of the key levers available to managers, and learn from some common pitfalls. The bulk of the course will be devoted to the practical application of the approach to a number of important business processes, such as merger integration, corporate and business unit transformation, and strategy development. Some class sessions will involve class visits by topical experts in these applications. This course will appeal to students interested in an exploratory course - more of a &quot;how to think about it&quot; course than a &quot;toolkit&quot; course. Grades will be based on class participation and a group project. Class size is limited to 40. Course previously offered as OB 536.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "223691",
        "number": "STRAMGT 541",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "542",
        "title": "Marketplaces for Goods and Services: Trust, Branding, and Regulation",
        "description": "This course is the second course in the sequence of marketplaces for goods and services (the first course is STRAMGT 529). The course will dig deep into issues of building trust and marketplace branding, as well as regulatory challenges of online marketplaces. The first two thirds of the class will focus on the challenges these marketplaces face in developing trust and delivering high-quality service, as well as fighting with fraudulent activities on the platform. We will discuss marketplace design ideas that can improve trust and create a safe environment, and analyze the economics of rating systems. The rest of the class is focused on the economics of regulatory issues around marketplaces. We will review the theory of monopoly power and negative externalities, and apply them to online marketplaces. We will also discuss recent labor market regulatory developments around these platforms. Applications include ride-sharing and transportation; room-sharing and vacation rentals; dating; passion economy; food deliveries; and organized labor markets.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "223052",
        "number": "STRAMGT 542",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "543",
        "title": "Entrepreneurial Acquisition",
        "description": "For aspiring entrepreneurs who don't have a burning idea or desire to start a company from scratch, acquiring a small business can provide a direct route to running and growing a business. This class will explore entrepreneurial acquisition (EA).  As the course covers topics such as what makes a good industry, raising capital, how to source deals, dealing with investors, due diligence, and negotiation, the course is also applicable to those interested in private equity, venture capital, start-ups, and general management.  The class relies heavily on the case method, and each class includes guests (often the case protagonists) who bring practical and current experience to the classroom.  The two group projects are intended to be highly practical, simulating real-world situations.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Participation 50% Projects/Papers 50%. P/F Not Allowed. Capacity limited to 45 students. 2 Group Projects/Papers. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "1054",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kelly, P.",
                                "sunet": "pbkelly"
                            },
                            {
                                "name": "Risk, G.",
                                "sunet": "geraldr"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Participation 50% Projects/Papers 50%. P/F Not Allowed. Capacity limited to 45 students. 2 Group Projects/Papers. Mandatory attendance. Absences impact grade. Open to MBA1 and MSx students. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "32198",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dodson, D.",
                                "sunet": "ddodson1"
                            },
                            {
                                "name": "Risk, G.",
                                "sunet": "geraldr"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Participation 50% Projects/Papers 50%. P/F Not Allowed. Capacity limited to 45 students. 2 Group Projects/Papers. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. Not Open to Non-GSB Students. Case and Problem Discussion.",
                "classId": "1069",
                "currentClassSize": "44",
                "maxClassSize": "44",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dodson, D.",
                                "sunet": "ddodson1"
                            },
                            {
                                "name": "Risk, G.",
                                "sunet": "geraldr"
                            },
                            {
                                "name": "Ellis, J.",
                                "sunet": "jellis1"
                            },
                            {
                                "name": "Alvarez, G.",
                                "sunet": "gisellea"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "210032",
        "number": "STRAMGT 543",
        "units": [
            2
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "545",
        "title": "Taking Social Innovation to Scale",
        "description": "How do you get the best new social innovations to reach the hundreds of millions of people who need it the most? And how do ensure that they are developed, deployed and scaled in a way that is relevant, appropriate and sustainable? Innovators tackling the world's most difficult problems often ignore, misunderstand, and under-invest in the critical business challenges involved in crossing &quot;the middle of the value chain.&quot; This is innovation's valley of death: product and system adaption and evaluation; evidence generation and design validation; business and partnership planning; formal or informal regulatory approval and registration. How do you design, introduce, and optimize the intervention's uptake before it can be taken to scale by markets, governments or other systems?  The class is taught be Steve Davis, President &amp; CEO of PATH (www.path.org), a leader in global health innovation, and former global Director of Social Innovation at McKinsey &amp; Company. We take an inter-disciplinary approach to look at the factors that pull innovation forward, push it from behind, and (often to the world's detriment) block its successful implementation and scaling. First grounding the discussion in research on innovation and social change, we then apply business principles, real world experiences and several important case studies in global health to examine the way good ideas get stuck, and how good ideas can turn into innovation that matters. We focus on root causes for failure, success factors, and business practices and tools to enable millions of lives to be impacted by social innovation. The seminar combines lectures, case studies, visiting practitioners and team projects focused on the business case for scaling specific social innovations. The goal is to help the next generation of social innovation leaders think more about some of the mistakes of the past, lessons for the future, and new ways of approaching old problems, all from a practitioner's point of view.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "215871",
        "number": "STRAMGT 545",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "547",
        "title": "Riding The Next Wave in Developing Economies",
        "description": "Today, innovative ventures in developing economies are providing compelling new products and services to a growing middle-class as well as to the lower part of the economic pyramid. These offerings provide consumers ways to better their lives and companies to grow their businesses.  As older industries around the world are being disrupted, and entrepreneurial ecosystems in developing economies are evolving, entrepreneurs and investors now have reference points and 'basecamps' to explore unique opportunities. These newly formed networks that include universities, incubators, accelerator programs, angel investor organizations and small venture capital firms are still lacking in breadth and depth, despite their attempts to follow the lead of Silicon Valley. Consequently, investors and founders face distinct and more numerous challenges that they would not encounter in Silicon Valley, such as small local markets, lack of scale-up funding, uncertain exit opportunities, inadequate talent pools and complex legal and political environments.Yet these developing economies are growing and becoming more connected. We are witnessing new technology-based products in these locations allowing problems to be solved at a scale never seen before. AI and machine learning, blockchain, smart sensors, IoT devices, natural language  interfaces and AR and VR are just a few of the technologies not only being developed in Silicon Valley, but all over the world. Of course, smartphones, with their multi-faceted sensors, are now becoming ubiquitous. These trends present opportunities such as: replicating business models proven elsewhere; leapfrogging legacy technologies; targeting the base of the pyramid; and starting venture capital firms. Despite this fertile ground for new endeavors, success not only requires an exceptional product/market fit but great execution to start and scale a venture in problematic and sometimes adverse environments.This case-driven course is designed to help students identify new opportunities in developing economies around the world and across industries and to expose them to the challenges they will face. It is targeted at students who are thinking about creating, joining or investing in new ventures in developing economies.The cases and guests will reveal entrepreneurial challenges through the eyes of founders and investors who have seized these opportunities at different stages of the venture: ideation, launch and scaling.  This course is designed to showcase innovative companies in high growth industries such as consumer internet, financial services, health care and education.  It will feature the latest trends and opportunities in Asia, Eastern Europe, Middle East, Africa and Latin America. By taking this course, you will be better equipped to observe, explain and participate in developing economy ecosystems and the opportunities and challenges they present.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Capacity limited to 45 students. Mandatory attendance. Absences impact grade. CSI certificate course. Open to MBA2 and MSx students. P/F Allowed. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Final 30% Participation 70%. Case and Problem Discussion.",
                "classId": "30756",
                "currentClassSize": "43",
                "maxClassSize": "43",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Antoni, F.",
                                "sunet": "fantoni"
                            },
                            {
                                "name": "Ciesinski, S.",
                                "sunet": "sjc21"
                            },
                            {
                                "name": "Alvarez, G.",
                                "sunet": "gisellea"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday Thursday"
                    },
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Antoni, F.",
                                "sunet": "fantoni"
                            },
                            {
                                "name": "Ciesinski, S.",
                                "sunet": "sjc21"
                            },
                            {
                                "name": "Alvarez, G.",
                                "sunet": "gisellea"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215872",
        "number": "STRAMGT 547",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "549",
        "title": "Search Fund Garage",
        "description": "Search Fund Garage is an intensive, hands-on, project-based course for students planning to pursue a search fund directly after or within a few years of graduation. Students will learn from the instructors, course peers, and class visitors, particularly top current search entrepreneurs, CEOs, and investors. This course is designed to assist students who are seriously pursuing a search fund. Those who have taken Entrepreneurial Acquisition (S543) or researched search funds extensively, including holding discussions with current searchers, investors, and CEO's, will benefit the most from this advanced, experiential course. By the end of the course, students will be prepared to or will already have raised search capital and launched their search, if they choose to do so. The course is not a good fit for students who do not know the basics of search funds (such as from taking S543) or are not likely to pursue a search fund upon or within a few years of graduation. Pursuing self-developed work plans that target the aspects of the search fund path most relevant to them at the time of the course, students will target industry segments and business models, evaluate investors, structure their search entity, set up their search process and outreach materials, perhaps begin to contact business owners, and develop wisdom about what makes a deal attractive or unattractive, among other experiences. Students will hear from class guests, including current searchers, standing CEO's of search-acquired companies, active investors, and former searchers (some of whom &quot;failed&quot; at buying a company) in order to inform their various decisions as they pursue a search fund. Each student will receive feedback on how they can be a more effective search fund entrepreneur. Teams of two are fine but not necessary. Most students join the class as individuals and all will be graded individually.This course is offered by the Graduate School of Business. It builds on the processes taught in Entrepreneurial Acquisition (S543) and detailed in the Stanford Primer on Search Funds (2020). The course provides a supportive yet challenging environment that will help students step outside of their comfort zone and accelerate learning. By the end of the course each will be better prepared to launch a search than many of the searchers who have come before.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "Students should have taken STRAMGT 543 or be extremely familiar with search funds, such as completing a GSBGEN 390 about a search fund topic. No Exam. MBA1 students need instructor permission. P/F Not Allowed. Mandatory attendance. Absences impact grade. Open to MBA2 and MSx students. 1 Individual Project/Paper. Capacity limited to 20 students. Not Open to Non-GSB Students. Workshop.",
                "classId": "1010",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kelly, P.",
                                "sunet": "pbkelly"
                            },
                            {
                                "name": "Risk, G.",
                                "sunet": "geraldr"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221026",
        "number": "STRAMGT 549",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "555",
        "title": "Managing Growing Enterprises",
        "description": "This seminar is offered for students who, in the near term, aspire to the management and full or partial ownership of a new or newly acquired business. The seminar will deal in some depth with certain selected, generic entrepreneurial issues, viewed from the perspective of the owner/manager. Broad utilization will be made of case materials, background readings, visiting experts, and role playing. Throughout the course, emphasis will be placed on the application of analytical tools to administrative practice. This course is a condensed version of the four unit sections (S355) of the same course title. The course prioritizes the material from S355, covering much of the same material, but not to the depth covered in the four unit sections",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "203831",
        "number": "STRAMGT 555",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "571",
        "title": "Strategic Management of Technology and Innovation in Enterprise Software Firms",
        "description": "Enterprise Software companies have experienced unprecedented growth since 2000.  Enterprise software, one could argue, has been a key enabler of transformative change and constructive disruption across industries while helping companies become more efficient.  Most industry analysts will agree that enterprise software has played an influential role in driving innovation while creating significant economic value.  Managing the growth of enterprise software companies however is complex and requires a unique set of competencies across the interconnected functions in the organization.  This case-driven course will explore how enterprise software companies have managed growth at various stages of their evolution from startup phase to multibillion-dollar global companies.  The main purpose of this course is to provide students (independent of their background) with deep insight on what leaders in enterprise software need to know about technological innovation strategy to successfully run enterprise software companies.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "All non-GSB students must be graduate students. No Exam. Participation 50% Projects/Papers 50%. P/F Not Allowed. 1 Group Project/Paper. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Mandatory attendance. Absences impact grade. Open to MBA2, MSx, and GSB PhD students. Capacity limited to 24 students. Case and Problem Discussion.",
                "classId": "31053",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Joshi, R.",
                                "sunet": "raj99"
                            },
                            {
                                "name": "Burgelman, R.",
                                "sunet": "profrab"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223561",
        "number": "STRAMGT 571",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "572",
        "title": "Strategic Management of Technology and Innovation in Established Firms",
        "description": "The main purpose of this course is to highlight the key innovation challenges faced by established firms: exploiting existing opportunities, exploiting new opportunities, and balancing the exploitation of existing and new opportunities throughout the firm's evolution. In particular, we will focus here on the conflicts inherent in having to manage these various challenges simultaneously. This course will also focus on entrepreneurship in large established companies: 'corporate entrepreneurship' aka 'intrapreneurship.' It examines the role of corporate entrepreneurs and how to manage project champions/venture managers, and what some of the organizational design issues are related to corporate entrepreneurship. In particular, we will study the strategic challenges that extremely successful companies face in trying to break out of co-evolutionary lock-in with their mainstream product-market environment, the strategic tensions arising between efforts to develop new businesses based on external acquisition versus internal development of new technologies, the strategic leadership challenges associated with trying to develop new growth opportunities that require significant cultural change, and the strategic leadership challenges associated with linking new business opportunities to corporate strategy.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "CAS",
                "notes": "No Exam. Participation 50% Projects/Papers 50%. P/F Not Allowed. 1 Group Project/Paper. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Mandatory attendance. Absences impact grade. Open to MBA2, MSx, and GSB PhD students. Case and Problem Discussion.",
                "classId": "29315",
                "currentClassSize": "21",
                "maxClassSize": "70",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "9:45:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Joshi, R.",
                                "sunet": "raj99"
                            },
                            {
                                "name": "Burgelman, R.",
                                "sunet": "profrab"
                            },
                            {
                                "name": "Dubon, M.",
                                "sunet": "mdubon"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 35100.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223591",
        "number": "STRAMGT 572",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "573",
        "title": "Moore's Law and the Convergence of Computing and Communications; Strategic Thinking in Action",
        "description": "This six-session (2-unit) Bass seminar focuses on strategic leadership and builds on core strategic leadership coursework in the MBA program. The course uses the seminar format with expectations of extensive contributions from all students to the discussion in each session. Through seminar discussions, we aim to deepen our understanding of strategic dynamics and transformational change at the industry and organizational levels of analysis in dynamic environments. The seminar's aim is to improve participants' ability to develop strategically informed action plans that are imaginative, inspiring and workable. The seminar's conceptual frameworks include traditional tools of strategic and competitive analysis from the core MBA course on strategic leadership, conceptual frameworks developed by the instructors that help understand the role of strategy-making in the evolution and transformation of organizations and industries, and theoretical frameworks that help understand the interplays between technology strategy and corporate strategy. Three of the six session will feature discussions with senior executives from key industry players.  The seminar's pedagogy involves informed debate including with the guest executives to evaluate and hone well-researched views by the participants as well as the writing and presentation of position papers by small groups of seminar participants concerning the seminar's analytical topics. In this fall's seminar we will examine the evolution of the global semiconductor industry in light of the ongoing impact of Moore's Law and the convergence of computing and wireless communications industries, and how it has been and will be affected by strategic actions of entrepreneurial startups, incumbent corporations, and governments in multiple geographies. Several interrelated topics will be discussed as they impact three key industry segments of the global semiconductor industry that are the focus of the seminar.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "No Exam. Participation 50% Projects/Papers 50%. P/F Not Allowed. 1 Group Project/Paper. Mandatory attendance. Absences impact grade. Open to MBA2, MSx, and GSB PhD students. Capacity limited to 24 students. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Seminar.",
                "classId": "29316",
                "currentClassSize": "25",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cogan, G.",
                                "sunet": "gcogan"
                            },
                            {
                                "name": "Burgelman, R.",
                                "sunet": "profrab"
                            },
                            {
                                "name": "Dubon, M.",
                                "sunet": "mdubon"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "212096",
        "number": "STRAMGT 573",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "574",
        "title": "Strategic Thinking in Action - In Business and Beyond II (Automotive Industry Disruption)",
        "description": "This six-session Bass seminar is about strategic leadership driving the transformation of the advanced automotive industry. It will build on what students have learned in their MBA core strategic leadership course but will also provide additional conceptual frameworks developed by the instructors to help examine the major seminar topics. The seminar's pedagogy involves informed debate to evaluate and hone well-researched views by the participants. Consequently, there will be an expectation of extensive contributions from all students to the discussion in all of the sessions.  Small groups of seminar participants will also be expected to write and present position papers concerning the seminar's analytical topics. The industry scope of the seminar is twofold: First, it is about autonomous, electric, and shared vehicles. And second, it is about the manufacturer and supplier incumbents as well as the tech industry and startup new-entrants. In the course of the seminar discussions, we aim to deepen our understanding of strategic dynamics and transformational change at the societal, industry and organizational levels of our analysis.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "No Exam. Participation 50% Projects/Papers 50%. P/F Not Allowed. Mandatory attendance. Absences impact grade. Open to MBA2, MSx, and GSB PhD students. Capacity limited to 24 students. CSI certificate course. 1 Individual Project/Paper. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Seminar.",
                "classId": "29317",
                "currentClassSize": "19",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "2:50:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Beiker, S.",
                                "sunet": "beiker"
                            },
                            {
                                "name": "Burgelman, R.",
                                "sunet": "profrab"
                            },
                            {
                                "name": "Dubon, M.",
                                "sunet": "mdubon"
                            }
                        ],
                        "startTimestamp": 53400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "212098",
        "number": "STRAMGT 574",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "577",
        "title": "Creativity in the Business Ecosystem",
        "description": "This course teaches core strategy fundamentals such as Industry Analysis, Organization of the Firm, and Innovation in a Multi-Business Firm by focusing on the question of where creativity occurs in the business ecosystem. A cross-disciplinary perspective on creativity is presented and applied throughout different industries and functions within them, such as Product Development/Management and Advertising Creativity.  The class examines industry applications, which may include the production and/or bundling of content, direct to consumer brands and products, and hardware and/or software technology.  Classes include a mix of lectures, cases, simulations, and interactive creativity exercises. Assessment is based on a group project, participation, and a final exam.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "223847",
        "number": "STRAMGT 577",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "579",
        "title": "The Political Economy of China",
        "description": "The evolving organization of the Chinese economy, with special emphasis on the following topics: the integration of the Communist Party organization with government entities and enterprises; the evolution of ownership; corporate restructuring and corporate governance; banking and finance; taxation and government revenue; the strengths and weaknesses of the national development model and the current domestic and international challenges to China's economic rise.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "218648",
        "number": "STRAMGT 579",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "581",
        "title": "Leading Strategic Change in the Health Care Industry",
        "description": "In this seminar we will study the structure and dynamics of the U.S. health care industry, especially in the face of ongoing regulatory change, and ways it intersects with the global health care industry. The seminar's aim is to develop participants' ability to create strategically informed action plans that are imaginative, inspiring and workable in this highly dynamic environment. The seminar's pedagogy involves informed debate to evaluate and hone well-researched views by the participants and instructors, as well as the writing and presentation of position papers by small groups of seminar participants on the key dynamics of the industry.In the course of the seminar discussions, we aim to deepen our understanding of strategic dynamics and transformational change at the societal, industry and organizational levels of analysis. After developing a complete picture of the structure of the health care industry and the strategic relationships among the key players (&quot;the strategic landscape&quot;), the seminar will focus on how health care reform and other external forces will affect the strategic opportunities and challenges of four types of players in the strategic landscape: (1) incumbents; (2) entrepreneurial startups; (3) cross-boundary disruptors; and (4) international health care providers. World-class leaders in health care will be brought in to supplement our understanding of each one of these players. Student teams will be formed to focus on one of the four types of players. Each team will prepare a research paper focused on determining how their type of player can take advantage of the regulatory, technological, social, cultural and demographic changes, and who will be the likely winners and why. This is a 2-unit version of STRAMGT 381.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Attendance is required, whether registered or on waitlist. Students who do not attend the first session should drop from the class or waitlist. Non-GSB students must be graduate students. No Exam. Participation 50% Projects/Papers 50%. P/F Not Allowed. 1 Group Project/Paper. Mandatory attendance. Absences impact grade. Open to MBA2, MSx, and GSB PhD students. Capacity limited to 24 students. CSI certificate course. Non-GSB students: See gsb.stanford.edu/NonGSBReg. Seminar.",
                "classId": "29364",
                "currentClassSize": "23",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "4:25:00 PM",
                        "endTime": "6:10:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pearl, R.",
                                "sunet": "rmpearl"
                            },
                            {
                                "name": "Burgelman, R.",
                                "sunet": "profrab"
                            },
                            {
                                "name": "Dubon, M.",
                                "sunet": "mdubon"
                            }
                        ],
                        "startTimestamp": 59100.0,
                        "endTimestamp": 65400.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223589",
        "number": "STRAMGT 581",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "582",
        "title": "Building Strategic Competence: Observations from Battlegrounds Overseas and in Washington, D.C.",
        "description": "This course addresses the issues faced in assuming executive responsibility, developing clear visions and missions, understanding complex problem sets, building teams, and developing strategies to overcome obstacles and take advantage of opportunities.  It is offered for students who might lead large, complex organizations or pursue opportunities leading to partial or full ownership and control of a business as well as those who want to serve in senior positions in government.  The course draws on the experience of the lecturer as a general officer in the Army and as the 26th Assistant to the President for National Security Affairs to illuminate critical aspects of leadership, strategy development, and effective implementation.  The course places personal experiences in historical context and in context of select leadership and management literature.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "221820",
        "number": "STRAMGT 582",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "583",
        "title": "The Challenges in/with China",
        "description": "The general objective of the course is to develop a better understanding of the changing socio-economic and political situation in China (with its challenges both for China and for the rest of the world) in order to make less difficult to define and implement sustainable strategies for managing effectively in China and for handling the complex and sensitive  interdependence between China and the US, between China and the rest of the world. From assessing, critically, the performance of China today, its achievements and challenges, students will get an insight in the current complex dynamics of China nrenaissance/transformation and we will discuss alternative scenarios, with their business and socio-political consequences on the medium term. From this analysis and with a prospective perspective in mind, we will discuss responsible management practices required to build, overtime, a mutually rewarding, growing interdependence. More specifically, the course will initially identify the multi-causality behind China's achievements and discuss some of the dysfunctions associated, today, with such performance. The conditions of management effectiveness required to enter and succeed overtime in the Chinese market will be identified while the challenges faced by competition - particularly in terms of management of innovation - and by the global expansion of Chinese firms overseas will be illustrated. The course will rely upon different pedagogical methods; it will create conditions to share and leverage participants' experience and it will make use of cases and research results. Auditors will be admitted, but they will have to be present (and prepared) in all the sessions.",
        "repeatable": "false",
        "grading": "GSB Student Option LTR/PF",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "213925",
        "number": "STRAMGT 583",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "584",
        "title": "Impact: Assessing High Impact Business Models in Emerging Markets",
        "description": "In recent years, we've seen an explosion of innovative business models blazing new trails in emerging markets. Many of these models are achieving commercial success while transforming the lives of low-income populations. Using nine cases of both early-stage, entrepreneur-led ventures and later-stage, public or large-cap firms, this course will examine best practices for scaling new enterprises in emerging markets. It will do so primarily through the lens of a potential investor. It will also explore what is required to spark, nurture and scale entire sectors that serve rapidly growing, often low-income markets. What does it mean to work in markets with limited infrastructure? What common mistakes are made - whether in business model design, in supply chains, or in dealing with government - and how can we avoid them? Which are the best business models to serve markets that corporations have traditionally ignored, and in which government has failed to deliver? Who might be threatened by the success of these new businesses? The seminar is a good match for Stanford students interested in working or investing in emerging markets. It will be taught by Matt Bannick, who led Omidyar Network (a $1 billion impact investing fund) and is the former President of eBay International and of PayPal.",
        "repeatable": "false",
        "grading": "GSB Letter Graded",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "213734",
        "number": "STRAMGT 584",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "691",
        "title": "PhD Directed Reading (ACCT 691, FINANCE 691, GSBGEN 691, HRMGT 691, MGTECON 691, MKTG 691, OB 691, OIT 691, POLECON 691)",
        "description": "This course is offered for students requiring specialized training in an area not covered by existing courses. To register, a student must obtain permission from the faculty member who is willing to supervise the reading.",
        "repeatable": "true",
        "grading": "GSB Pass/Fail",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [],
        "gers": [],
        "objectID": "101403",
        "number": "STRAMGT 691",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "692",
        "title": "PhD Dissertation Research (ACCT 692, FINANCE 692, GSBGEN 692, HRMGT 692, MGTECON 692, MKTG 692, OB 692, OIT 692, POLECON 692)",
        "description": "This course is elected as soon as a student is ready to begin research for the dissertation, usually shortly after admission to candidacy. To register, a student must obtain permission from the faculty member who is willing to supervise the research.",
        "repeatable": "true",
        "grading": "GSB Pass/Fail",
        "unitsMin": "1",
        "unitsMax": "15",
        "sections": [],
        "gers": [],
        "objectID": "101406",
        "number": "STRAMGT 692",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
        ]
    },
    {
        "year": "2023-2024",
        "subject": "STRAMGT",
        "code": "802",
        "title": "TGR Dissertation (ACCT 802, FINANCE 802, GSBGEN 802, HRMGT 802, MGTECON 802, MKTG 802, OB 802, OIT 802, POLECON 802)",
        "description": null,
        "repeatable": "true",
        "grading": "GSB Pass/Fail",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [],
        "gers": [],
        "objectID": "101410",
        "number": "STRAMGT 802",
        "units": [
            0
        ]
    }
]