[
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "1A",
        "title": "Know Your Planet: Research Frontiers",
        "description": "Discover the challenges that face our planet today and the people working on solving those problems now. Planet Earth is our only home and so it is critical that we understand what is driving global change. In this course, we focus on climate and sustainability. You&iquest;ll get an introduction to the cutting edge research of Stanford faculty, who are leading the effort to ask and answer these critical questions about our planet. Open to all students.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29924",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218829",
        "number": "SUSTAIN 1A",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "1B",
        "title": "Know Your Planet: Earth in the Laboratory",
        "description": "Learning about earth and planetary materials (minerals, rocks, and fluids) is fundamental as much for the understanding of observed properties as for the sustainable use and selection of raw materials.  Are you interested in the challenges that we face as Earth citizens, but not sure how scientists answer Earth&iquest;s big questions in a small laboratory? In this course, we will tackle the big questions in little spaces &iquest; and students will be introduced to how real labs answer questions involving the characterization of Earth and Planetary materials across scales of observations &iquest; from the composition and structure of rocks building blocks to the flow, elastic, and magnetic properties of the whole-rock composite material. You will meet faculty working on a diverse array of problems, take tours of their laboratories, and be exposed to interactive activities to understand how observations in the laboratory are at the heart of scientific discovery. Open to all freshmen and sophomores across disciplines.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30062",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222767",
        "number": "SUSTAIN 1B",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "1C",
        "title": "Know Your Planet: Science in the Field",
        "description": "Science isn't just in labs or on computer screens. From mountains, deserts, and forests to oceans, ice fields, and clouds, Stanford researchers work in a wide variety of locations, studying processes and phenomena where they happen. This course will give students the opportunity to engage with some of those researchers. You'll hear about different ways fieldwork is done, the questions being researched and what fieldwork means today. This course consists of a lecture by a different Doerr School of Sustainability researcher each week. There will also be up to 2-hours of readings, virtual field trips, or other associated activities outside of the class time each week. Open to all students.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29648",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218832",
        "number": "SUSTAIN 1C",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "1D",
        "title": "Know Your Planet: Big Earth",
        "description": "Get a taste of how we use big data to solve Earth&iquest;s big problems. Interested in Big Data and how to apply it to global environmental and sustainability challenges? This course provides an introduction to Big Data and its applications in solving global challenges such as meeting global energy needs, food and water security, climate change, and natural hazards. This course provides an introduction to the cutting edge research of Stanford faculty, who are leading the effort to ask and answer these critical questions about our planet using big data to do so. Open to all students.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "218830",
        "number": "SUSTAIN 1D",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "2",
        "title": "Climate and Society",
        "description": "How and why is the climate changing? How might a changing climate affect human society? And what can we do to alter the course of climate change and adapt to any climatic changes that do occur? This course provides an introduction to the natural science and social science of climate change. The focus is on what science tells us about the causes, consequences, and solutions to climate change, as well as on how scientific progress is made on these issues.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16562",
                "currentClassSize": "0",
                "maxClassSize": "140",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Diffenbaugh, N.",
                                "sunet": "omramom"
                            },
                            {
                                "name": "Burke, M.",
                                "sunet": "mburke"
                            },
                            {
                                "name": "Lobell, D.",
                                "sunet": "dlobell"
                            },
                            {
                                "name": "King, J.",
                                "sunet": "jking21"
                            },
                            {
                                "name": "Foster, A.",
                                "sunet": "animaya"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "217336",
        "number": "SUSTAIN 2",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "5",
        "title": "Geokids: Earth Sciences Education",
        "description": "Service learning through the Geokids program.  Eight weeks of supervised teaching to early elementary students about Earth sciences.  Hands-on teaching strategies for science standards-based instruction. Cardinal Course certified by the Haas Center for Public Service",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "16247",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saltzman, J.",
                                "sunet": "saltzman"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 42600.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31246",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Mitchell Earth Sciences B4",
                        "instructors": [
                            {
                                "name": "Saltzman, J.",
                                "sunet": "saltzman"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 42600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "212444",
        "number": "SUSTAIN 5",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "51N",
        "title": "Ecologies of Communication (DLCL 21N, ENGLISH 21N)",
        "description": "What remnants of our culture will future generations discover and decipher and how will they interpret these? How will they access the technologies we have created? How will they understand the environmental changes that current humans have caused? And how will their encounters with the past inform their own future? This IntroSem explores a humanistic perspective on sustainability, viewing the human record itself as a resource and exploring how it might be sustained in an ethical and meaningful way. Broadly, we ask what is the science behind sustaining the ecology of historic heritage?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "224225",
        "number": "SUSTAIN 51N",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "81",
        "title": "Doerr School of Sustainability Spring Break Field Trip",
        "description": "Spring break field trip to various locations in Eastern California (may include Owens Valley, eastern Sierras, White Mountains, Death Valley).  Exact locations will vary by term. Topics may cover natural history, geology, and ecology.  Students will learn tools for self-directed learning (including problem solving, critical thinking, observation skills, giving and receiving feedback) and will have the opportunity to practice those skills through a variety of activities including field sketching, team problem solving, reading maps, and navigating in teams.  Expect moderately strenuous hiking, living in a communal dorm-style environment, and group chores.  Engaged participation expected, no prior knowledge or experience required, open to all majors.  No course fee.  Food, lodging, and necessary equipment is provided at no cost to student participants.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222130",
        "number": "SUSTAIN 81",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "83",
        "title": "Nature Journaling",
        "description": "This course will introduce students to the fundamentals of nature journaling. Nature journaling is a practice of observing and recording the natural world, much as one might record their lives in a daily journal. Nature journaling provides a path for sharpening curiosity and attention as it deepens understanding and appreciation of nature. In this class, students will learn the basics of observation, inquiry, and engagement with your surroundings. You will learn basic drawing techniques to help achieve those learning outcomes. Using common resources (pens, pencils, paper) students will record observations, drawings, diagrams, descriptions and maps. This course is designed to be interactive and community based. Students will share photos of their journal pages and will give and receive constructive feedback from both instructors and peers. Content will include botany, wildlife, geology, and astronomy, while still primarily focusing on the process of observing and recording. No prior knowledge or experience is required. Assignments can be done in the wilderness, in your backyard, or even in your house.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "222369",
        "number": "SUSTAIN 83",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "85",
        "title": "Virtual California",
        "description": "This course will give students a sense of place about California through virtual environments and guest lectures that show the geography, geology, ecology, and natural history that help make California a place, not just a space on a map. Students will participate in a variety of activities in the virtual environments, on their own and in small groups. Each week will be 80 min of synchronous lecture and 80 minutes of small group activities using virtual field sites. All work will be done in class, no other homework or readings outside of class are required. The virtual field sites only require an internet browser to view. This is an experiential course, students will be expected to attend and actively participate. No prior knowledge required. Intended for frosh/soph.Example of the virtual field sites that will be used in the course:https://web.stanford.edu/group/field-education/virtual_california/example/output/index.html",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30142",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223243",
        "number": "SUSTAIN 85",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "100",
        "title": "Research Preparation for Undergraduates",
        "description": "For undergraduates planning to conduct research during the summer with faculty in the Doerr School of Sustainability. Readings, oral presentations, proposal development.  May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15855",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Saltzman, J.",
                                "sunet": "saltzman"
                            },
                            {
                                "name": "Maher, K.",
                                "sunet": "kmaher"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "209950",
        "number": "SUSTAIN 100",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "101A",
        "title": "Decision Making for Sustainable Energy",
        "description": "All people and societies face challenges and opportunities for living sustainably in our world.  We must make many difficult and complex decisions in our lives as individuals, citizens, and leaders. Through participation in this course, students will develop the tools and knowledge to make wiser decisions.  Students will work through three real sustainable energy problems: How could you reduce the carbon footprint of an average person in the US to the global per capita average? How can Stanford reach its carbon Net Zero goals for various sources of emissions? and How could you make the US electric power sector 100% carbon free by 2035? For each problem, students will work separately and together to identify possible options; evaluate the range of costs and benefits of each; identify economic, social, environmental, and technological barriers and opportunities. They will learn what information is relevant, how to get and use it, how to make and justify good decisions in the context of sustainability. Grading for this initial offering of this course will be satisfactory/NC, based on completing multiple individual and group assignments in a way that meets course standards. The course is accessible to all undergraduate students, including frosh and sophomores.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "224839",
        "number": "SUSTAIN 101A",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "101C",
        "title": "Climate 101",
        "description": "This course provides an introduction to Earth's climate system, including how climate has changed in the past, how it is changing now, and how it could change in the future. Topics include quantifying signal-to-noise ratio for detecting long-term change in climate variables; calculating Earth's energy balance; calculating sources and sinks of carbon; understanding the history of climate variations and changes over Earth's history; quantifying the contribution of different greenhouse gases and human activities to historical and future climate change; understanding extreme weather events in the past, present and future, and quantifying the time to different global warming thresholds given different socio-economic scenarios. Students will be asked to engage in analysis of climate datasets to understand climate processes and climate change. No prerequisites.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28958",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "300-300",
                        "instructors": [
                            {
                                "name": "Diffenbaugh, N.",
                                "sunet": "omramom"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-AQR"
        ],
        "objectID": "224939",
        "number": "SUSTAIN 101C",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "101D",
        "title": "Sustainable Innovation for Disaster Resilience",
        "description": "Disaster resilience embodies two concepts: adaptation and recovery. As climate change exacerbates the occurrence and intensity of environmental disasters, innovators and decision makers must collaborate to help vulnerable communities and the build environment adapt to and recover from shocks and stresses in a sustainable way without compromising long-term development. This course is tailored to solution-oriented students who are comfortable focusing on wicked problems, and care about the complexity of sustainable and equitable innovation. The course intends to teach students how to lead the design and implementation of products and services that will help real people who are experiencing disaster, with an emphasis on those facing disproportionate effects due to historical contexts.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31637",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Lathrop 299",
                        "instructors": [
                            {
                                "name": "Osman, K.",
                                "sunet": "osmank"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "225386",
        "number": "SUSTAIN 101D",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "103",
        "title": "Human and Planetary Health (MED 103, PUBLPOL 183, SOC 103)",
        "description": "Two of the biggest challenges humanity has to face - promoting human health and halting environmental degradation - are strongly linked.  The emerging field of Planetary Health recognizes these inter-linkages and promotes creative, interdisciplinary solutions that protect human health and the health of the ecosystems on which we depend. Through a series of lectures and case-study discussions, students will develop an in-depth understanding of the 'Planetary Health' concept, its foundation, goals, priority areas of action, methods of investigation, and the most relevant immediate challenges. Students enrolling in just the Lecture should enroll for 3 units. Students enrolling in the Lecture and Discussion should enroll for 4 units.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31537",
                "currentClassSize": "0",
                "maxClassSize": "110",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "STLC 114",
                        "instructors": [
                            {
                                "name": "Burke, K.",
                                "sunet": "ksburke"
                            },
                            {
                                "name": "Veidis, E.",
                                "sunet": "eveidis"
                            },
                            {
                                "name": "De Leo, G.",
                                "sunet": "deleo"
                            },
                            {
                                "name": "Luby, S.",
                                "sunet": "sluby"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "31746",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "31747",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "Shriram 366",
                        "instructors": [
                            {
                                "name": "Burke, K.",
                                "sunet": "ksburke"
                            },
                            {
                                "name": "Veidis, E.",
                                "sunet": "eveidis"
                            },
                            {
                                "name": "De Leo, G.",
                                "sunet": "deleo"
                            },
                            {
                                "name": "Luby, S.",
                                "sunet": "sluby"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 62400.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "DIS",
                "notes": null,
                "classId": "31748",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI",
            "WAY-SMA"
        ],
        "objectID": "222771",
        "number": "SUSTAIN 103",
        "units": [
            3,
            4
        ],
        "totalSections": 4
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "115",
        "title": "Wrigley Field Program in Hawaii Preparation",
        "description": "Preparatory course for the Wrigley Field Program in Hawaii. This course will introduce students to the faculty and topics that will be covered during the fall program. It will also include logistics content, readings, and an introduction to Hawaiian history and culture. Instructor approval required. Open only to students accepted to the Wrigley program.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "222335",
        "number": "SUSTAIN 115",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "116",
        "title": "Ecology of the Hawaiian Islands (BIO 116)",
        "description": "Terrestrial and marine ecology and conservation biology of the Hawaiian Archipelago.  Taught in the field in Hawaii as part of quarter-long sequence of courses including Earth Sciences and Anthropology.  Topics include ecological succession, plant-soil interactions, conservation biology, biological invasions and ecosystem consequences, and coral reef ecology.  Restricted to students accepted into the Wrigley Field Program in Hawaii.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "GER: DB-NatSci"
        ],
        "objectID": "210977",
        "number": "SUSTAIN 116",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "117",
        "title": "Earth Sciences of the Hawaiian Islands (EARTHSYS 117, ESS 117)",
        "description": "Progression from volcanic processes through rock weathering and soil-ecosystem development to landscape evolution.  The course starts with an investigation of volcanic processes, including the volcano structure, origin of magmas, physical-chemical factors of eruptions.  Factors controlling rock weathering and soil development, including depth and nutrient levels impacting plant ecosystems, are explored next.  Geomorphic processes of landscape evolution including erosion rates, tectonic/volcanic activity, and hillslope stability conclude the course.  Methods for monitoring and predicting eruptions, defining spatial changes in landform, landform stability, soil production rates, and measuring biogeochemical processes are covered throughout the course. This course is restricted to students accepted into the Earth Systems of Hawaii Program.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "211162",
        "number": "SUSTAIN 117",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "118",
        "title": "Heritage, Environment, and Sovereignty in Hawaii (CSRE 118E, NATIVEAM 118)",
        "description": "This course explores the cultural, political economic, and environmental status of contemporary Hawaiians. What sorts of sustainable economic and environmental systems did Hawaiians use in prehistory? How was colonization of the Hawaiian Islands informed and shaped by American economic interests and the nascent imperialism of the early 20th century? How was sovereignty and Native Hawaiian identity been shaped by these forces? How has tourism and the leisure industry affected the natural environment? This course uses archaeological methods, ethnohistorical sources, and historical analysis in an exploration of contemporary Hawaiian social economic and political life. Restricted to students accepted into the Wrigley Field Program in Hawaii.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "211098",
        "number": "SUSTAIN 118",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "120",
        "title": "Leading Organizational Change for Sustainability",
        "description": "The Living Lab Fellowship in campus sustainability brings together a talented group of advanced undergraduates to doctoral-level students to make meaningful progress toward achieving Stanford University's operational sustainability goals. Leading Organizational Change is a two-unit, one-quarter elective course offered Autumn quarter. The course constitutes the academic component of the Living Lab Fellowship Program. This course is only open to students who have applied and been accepted to the Living Lab Fellowship Program. Interested students apply by Spring quarter of the preceding year and undergo a competitive application process, after which successful applicants are invited to take part in the program. The ability to lead change within organizations is essential for solving the complex and urgent challenges of our time. By most estimates, the majority of change efforts fail. However, the techniques used to successfully lead change across different industries and sectors (private, nonprofit, public) can be taught, learned, and practiced. This course will demonstrate why change fails, teach fellows to avoid common pitfalls, introduce powerful frameworks and strategic approaches for leading successful change, and provide fellows with tools that can be applied at any scale. Using the Stanford campus as a living laboratory where material from the course can be meaningfully applied, this course emphasizes learning through doing. Fellows are encouraged to practice and apply concepts, give and receive feedback, and practice self-reflection to grow as facilitators of positive and successful change. By the end of this course, fellows will deepen their understanding of the challenges, techniques, and opportunities associated with leading change in organizations and will be equipped to continue to build their capacity to lead successful change and foster healthy, just, sustainable, and resilient organizations. Through this course, each fellow develops an Organizational Opportunity Project (OrgOpp) that is based on a pre-identified operational sustainability need at Stanford. To develop their OrgOpp project proposal, fellows use the Why/What/How framework to develop the proposal, gain approval from key stakeholder(s), conduct an assessment, and make recommendations for the Path Forward. The coursework is designed to be real, meaningful, and impactful. Critical to the success of the fellows in the course is their willingness to listen deeply, iterate on their work, and commit to providing value to the university. In order to make meaningful change, one must be bold, persistent, visionary, and also humble, willing to be flexible, make mistakes, be patient, listen deeply, and serve the greater good.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31580",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cain, B.",
                                "sunet": "bcain"
                            },
                            {
                                "name": "Engbring, G.",
                                "sunet": "engbring"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225609",
        "number": "SUSTAIN 120",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "128",
        "title": "Upstreaming Health (DESIGN 261, HUMBIO 128U)",
        "description": "Reimagine systems to make everyday life healthier by design. Good health doesn't begin the minute someone walks into a doctor's office. If we want everyday life to become healthier by default, we need to shift our interventions from downstream to upstream, from healthcare to the places where we live, learn, work, and play. Upstreaming health means making a deliberate effort to create patterns of everyday life that keep people well - physically, emotionally, financially, and socially. In Upstreaming Health, we will explore systems that influence health, health equity, and sustainability, integrating concepts from public health, systems thinking, and design justice and use tools from product and policy design to answer the question: How might we upstream health for all people? Through community-engaged projects, students will prototype possibilities for upstreaming health at a population-level.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "16313",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Singer, S.",
                                "sunet": "ssinger"
                            },
                            {
                                "name": "Cheung, J.",
                                "sunet": "jkcheung"
                            },
                            {
                                "name": "Downs, S.",
                                "sunet": "sjdowns"
                            },
                            {
                                "name": "Bloom, G.",
                                "sunet": "gobloom"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224132",
        "number": "SUSTAIN 128",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "130",
        "title": "Empirical Environmental Economics (ECON 177)",
        "description": "Are you interested in environmental and energy policy? Do you want to improve your data science skills? If so, Empirical Environmental Economics is for you.  In the first few weeks of class, you'll use data and microeconomic modeling to quantify the harms from pollution, including estimating the social cost of carbon emissions. For the rest of the quarter, you'll use more data and microeconomic modeling to evaluate major environmental policies such as pollution taxes, cap-and-trade programs, and subsidies for clean technologies. You will consider overall benefits and costs as well as the distributional equity, which can inform discussions of environmental justice. You will learn and practice useful data science skills, including applied econometrics/causal inference methods (e.g., difference-in-differences, instrumental variables, and regression discontinuity) and equilibrium modeling. The class has weekly problem sets involving data analysis in R, plus a final paper. Class sessions feature active learning, discussions, and small-group case studies. You should only enroll if you expect to attend regularly and complete the problem sets on time. Prerequisites: You must have experience with regression analysis (e.g., ECON 102 or 108, CS 129, EARTHSYS 140, HUMBIO 88, POLISCI 150C, or STATS 60 or 101). If you plan to take microeconomics (e.g., ECON 1, 50, or 51), we recommend you take those either beforehand or concurrently. If you have no economics background, you may still be comfortable in class if you are strong in math, statistics, and/or computer science. If you have not used R before, that is OK: we will guide you from the beginning. If you have used R before, you can still learn a lot in this class through the applications.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28955",
                "currentClassSize": "0",
                "maxClassSize": "65",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:50:00 PM",
                        "location": "200-305",
                        "instructors": [
                            {
                                "name": "Allcott, H.",
                                "sunet": "allcott"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 60600.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "28956",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225031",
        "number": "SUSTAIN 130",
        "units": [
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "131",
        "title": "Imagining Adaptive Societies (CSRE 161, CSRE 261, ENGLISH 131D, SUSTAIN 231)",
        "description": "The ecological, social, and economic crises of the Anthropocene suggest it is time for us to re-imagine how best to organize our communities, our institutions, and our societies. Despite the clear shortcomings, our society remains stuck in a rut of inaction. During periods of rapid social and economic change, segments of society become gripped by a nostalgia for idealized pasts that never really existed; such nostalgia acts as a powerful force that holds back innovation and contributes to a failure of imagination. How, then, might we imagine alternative social arrangements that could allow us to thrive sustainably in an environment of greater equity? Moshin Hamid reminds us that literature allows us to break from violent nostalgia while imagining better worlds, while Ursula K. Le Guin notes that &quot;imaginative fiction trains people to be aware that there are other ways to do things, other ways to be; that there is not just one civilization, and it is good, and it is the way we have to be.&quot; There are - there has to be - other and better ways to be. In this multi-disciplinary class, we turn to speculative fiction as a way of imagining future societies that are adaptable, sustainable, and just and can respond to the major challenges of our age. In addition to reading and discussing a range of novels and short stories, we bring to bear perspectives from climate science, social science, and literary criticism. We will also be hosting several of the authors to talk about their work and ideas.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32452",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jones, J.",
                                "sunet": "jhj1"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224713",
        "number": "SUSTAIN 131",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "140",
        "title": "Environmental Humanities: Finding Our Place on a Changing Planet (BIO 184, ENGLISH 140D)",
        "description": "The rapid degradation of our planet threatens the health and survival of communities and ecosystems around the world. How did we get here? What cultural, philosophical, and ethical challenges underlie the separation of humanity from nature and precipitate unprecedented ecological destruction? How can we make sense of this, and how can we reimagine a more connected future? Through engaging the work of environmental philosophers, cultural ecologists, artists, humanities scholars, Indigenous leaders, and others with land-based knowledge, this course will prompt you to think deeply about humanity's place in the world and explore strategies to change our course. Together, we will explore contrasting cultural paradigms around human-nature relationships and apply learnings to action - including through final projects that involve external audiences in meaningful environmental contemplation or impact.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "224580",
        "number": "SUSTAIN 140",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "143",
        "title": "Finance, Corporations, and Society (ECON 143, INTLPOL 227, POLISCI 127A, PUBLPOL 143)",
        "description": "As society faces major challenges, democracies and &quot;free-market&quot; capitalism appear to be in crisis. This interdisciplinary course will explore the complex interactions between corporations, governments, and individuals, drawing on insights from the social sciences, business, and law to understand how institutions and collective actions translate to a set of rules and to outcomes for people and nature. The course aims to help students become savvier in their interactions with our economic and political systems and understand the governance issues that are critical to whether and how well institutions in the private and public sectors serve us. Topics include financial decisions, financial markets, banks and institutional investors; corporations and corporate governance; political economy and the rule of law as it applies to people and to organizations, and the role and functioning of the media. We will connect the material to specific issues such as climate change and justice, and discuss current events regularly throughout the course. Students will have the opportunity to explore a situation of their choosing in more depth through group final projects. Visitors with relevant experiences will regularly enrich our class discussion.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "27749",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Econ 140",
                        "instructors": [
                            {
                                "name": "Lion-Transler, C.",
                                "sunet": "clion"
                            },
                            {
                                "name": "Admati, A.",
                                "sunet": "admati"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "27748",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "200-205",
                        "instructors": [
                            {
                                "name": "Lion-Transler, C.",
                                "sunet": "clion"
                            },
                            {
                                "name": "Admati, A.",
                                "sunet": "admati"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "216092",
        "number": "SUSTAIN 143",
        "units": [
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "156",
        "title": "Media and the Environment (FILMEDIA 216, FILMEDIA 416, SUSTAIN 356)",
        "description": "How are environmental issues represented in various media, from cinema and television to videogames, VR, and experimental art? And how are these media themselves involved in environmental change? In this course, we look at media and the environment as interlocking parts of a system, inseparable from one another. We might start by asking how, for example, documentary and narrative films portray environmental crises like oil spills, wildfires, or extinction events. From there, however, we will need to investigate the ways that media themselves constitute environments, both metaphorically and literally. We swim in media; it is the air we breathe. Virtually all of our experience and communication take place within the spaces of media. Meanwhile, media-technologies and their infrastructures are increasingly entangled with the material environment: from rare earth metals in our electronic devices to undersea cables that bring us the Internet, digital media in particular are an increasingly significant driver of environmental change. In addition to reading and engaging with a variety of media objects, students will have the opportunity to create their own media objects (video essays, VR projects, experimental artworks, etc.) that shed light on the interrelations of media and the environment.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "16290",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denson, S.",
                                "sunet": "denson"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "5:30:00 PM",
                        "endTime": "8:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denson, S.",
                                "sunet": "denson"
                            }
                        ],
                        "startTimestamp": 63000.0,
                        "endTimestamp": 73200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224329",
        "number": "SUSTAIN 156",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "200A",
        "title": "Your Professional Development",
        "description": "Navigating the transition from student to professional is a daunting and often times unpredictable journey. This course is designed to help start the process of career planning and development early on. Beginning with navigating career uncertainty, through thoughtful self-assessment, to building your professional portfolio - this course builds a solid foundation on which to explore your long-term career goals.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "221120",
        "number": "SUSTAIN 200A",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "200B",
        "title": "Your Personal Development",
        "description": "Success in both your professional and personal life requires emotional, financial, and social intelligence. This course is designed to build on those soft skills that will better prepare you to successfully navigate your life. Develop skills in areas ranging from emotional intelligence, decision making courage, living well under pressure, managing procrastination, conflict resolution, relationship building, influencing, ethics &amp; integrity, and financial literacy.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29872",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221332",
        "number": "SUSTAIN 200B",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "200P",
        "title": "Your Professional Development Practicum",
        "description": "Developing a strong portfolio of skills and tools takes resources and partners. This practicum enables the freedom to explore and develop a specific component of your professional portfolio with instructor support. You will set a professional development goal at the start of the quarter and then build a self-directed set of experiences that engage on-campus resources, professional society opportunities, and/or external partners to explore and develop new skills. Completion will include reflection on the experience, feedback from peers and mentors, and a concrete product that expands your professional toolkit. This practicum is recommended for latter stage graduate students, or following completion of SUSTAIN 200A.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "30114",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "29869",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221270",
        "number": "SUSTAIN 200P",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "203",
        "title": "Diversity and Inclusion in the Geosciences",
        "description": "This course will prepare students to address the participation and inclusion challenges uniquely faced in the geosciences. By bringing awareness to specific tools and tactics which improve learning and working environments, we hope to help others develop inclusive environments where diversity is valued and celebrated. Diverse thinking coupled with inclusive practices improves science and team performance. In the past 40 years, the geosciences have had the lowest diversity of all STEM fields within higher education. Using insights from recent literature and perspectives from guest speakers, we will evaluate current practices and identify those that hold promise in improving broader participation and inclusion in the geosciences. Discussions will focus on actions that individuals can take to promote greater inclusion within every level of higher education in the earth sciences.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30094",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221093",
        "number": "SUSTAIN 203",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "210",
        "title": "Energy Equity Policy Lab",
        "description": "The Executive Order for Tackling the Climate Crisis (14008) establishes a procedural policy, Justice 40, that applies principles of recognition and distributive equity to hundreds of federal policies and programs. With many different expressions, decision-makers in companies, communities, research institutions, and every level of policy-making are integrating strategies that are rapidly expanding the landscape of opportunity - and helping to level the playing field for investment at the same time. Participants in this interdisciplinary policy lab course will have an opportunity to collaborate in a fast paced and highly applied learning environment focused on a specific challenge to policy implementation. Similar to clinics with community-engaged learning, the specific context for engagement with external partners to the policy lab will change each quarter. See the syllabus for this course on Syllabus.Stanford.Edu to preview the focus each quarter.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224784",
        "number": "SUSTAIN 210",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "222",
        "title": "Ethical and Effective Philanthropy for Sustainable Development (ETHICSOC 232T, POLISCI 236, POLISCI 236S)",
        "description": "What is the most effective way to support sustainable development? In a team-based, experiential project, students will select a nonprofit organization to receive a class donation of $50,000 to support learning to think ethically and strategically about promoting sustainable development. For example, should we prioritize developing clean energy technology, changing climate policies, advocating for environmental education and justice, or reducing immediate harm to human health? These are the difficult choices facing philanthropists, whose global giving to sustainable development now exceeds 110bn dollars per year. Students will develop a pitch about why an organization should receive the donation and how they would evaluate the grant's success, based on course readings and lectures on topics such as effective altruism, outcomes-based philanthropy, trust-based giving, and philanthropy from an environmental justice lens. We will also reflect on the appropriate role for private philanthropy and nonprofits versus business and government in solving social problems. **This course is designed for undergraduate students**",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "16300",
                "currentClassSize": "0",
                "maxClassSize": "9",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Michalchik, V.",
                                "sunet": "safa"
                            },
                            {
                                "name": "Bromley, P.",
                                "sunet": "triciam"
                            },
                            {
                                "name": "Salia, R.",
                                "sunet": "rsalia"
                            },
                            {
                                "name": "Gavrila, G.",
                                "sunet": "sgavrila"
                            },
                            {
                                "name": "Santos, H.",
                                "sunet": "hsantos1"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "212666",
        "number": "SUSTAIN 222",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "223",
        "title": "Confronting Emotions in the Climate Sciences (MED 246)",
        "description": "Traditional climate change courses introduce students to a wide array of scientifically and emotionally challenging subjects without acknowledging the significant distress that climate learners often experience from studiously bearing witness to ecological degradation, and the social injustices this deepens. Students enrolled in the proposed course will study a rapidly growing body of scholarship and activism related to emotive and existential responses to climate change. They will explore the psychosocial complexities that the Anthropocene proposes through key texts, films, and guest lectures that draw on climate psychology, philosophy, art, literature and history. A key outcome of this course is identifying pedagogical tools that can be implemented to foster wellbeing within the climate science community and its adjacent fields. Through self reflection, journaling, and group work, students will develop new self-care skills and collective mental health 'protection and promotion' strategies. A primary goal of the course is to understand how trauma-informed learning modules can support the scientific objectives of graduate students. Final projects will include the development of evidence-based instructional and mentoring recommendations for students studying any aspect of climate science. The course is designed to engage students in participatory scholarship; assessment of the effectiveness of various learning modules on student wellbeing and motivation towards their research will be conducted using pre-post style surveys and qualitative interview methods. (Cardinal Course certified by the Haas Center)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "16773",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pellitier, P.",
                                "sunet": "ptpell"
                            },
                            {
                                "name": "Minondo, A.",
                                "sunet": "aminondo"
                            },
                            {
                                "name": "Wray, B.",
                                "sunet": "bdw18"
                            },
                            {
                                "name": "Palumbo-Liu, D.",
                                "sunet": "palboliu"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224629",
        "number": "SUSTAIN 223",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "226",
        "title": "Global Social Change, Sustainable Development, and Education (EDUC 136, EDUC 306D, SOC 231)",
        "description": "Focuses on the relations between education and sustainable development from a comparative cross-national perspective. The course covers questions and debates around education for sustainable development and the nature of &quot;the global&quot;; global influences on national institutions of sustainable development; and key themes in the cross-national study of education for sustainable development such as stratification and achievement, gender, human rights, and the global authority of science and experts.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "124479",
        "number": "SUSTAIN 226",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "231",
        "title": "Imagining Adaptive Societies (CSRE 161, CSRE 261, ENGLISH 131D, SUSTAIN 131)",
        "description": "The ecological, social, and economic crises of the Anthropocene suggest it is time for us to re-imagine how best to organize our communities, our institutions, and our societies. Despite the clear shortcomings, our society remains stuck in a rut of inaction. During periods of rapid social and economic change, segments of society become gripped by a nostalgia for idealized pasts that never really existed; such nostalgia acts as a powerful force that holds back innovation and contributes to a failure of imagination. How, then, might we imagine alternative social arrangements that could allow us to thrive sustainably in an environment of greater equity? Moshin Hamid reminds us that literature allows us to break from violent nostalgia while imagining better worlds, while Ursula K. Le Guin notes that &quot;imaginative fiction trains people to be aware that there are other ways to do things, other ways to be; that there is not just one civilization, and it is good, and it is the way we have to be.&quot; There are - there has to be - other and better ways to be. In this multi-disciplinary class, we turn to speculative fiction as a way of imagining future societies that are adaptable, sustainable, and just and can respond to the major challenges of our age. In addition to reading and discussing a range of novels and short stories, we bring to bear perspectives from climate science, social science, and literary criticism. We will also be hosting several of the authors to talk about their work and ideas.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32451",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jones, J.",
                                "sunet": "jhj1"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224713",
        "number": "SUSTAIN 231",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "237",
        "title": "Sustainable Human Behavior",
        "description": "What is sustainability? It is not just about air travel, ocean health or reducing plastic waste. It is about rethinking our role as humans and leaders in this ever-changing world and developing a mindset that leads to positive habits and creates strong relationships to nurture our planet. In a world where success is frequently regarded as a stopping point rather than a stepping stone to future endeavors, this mindset is critical to leading a life of purpose and meaning. In this class we invite you to rethink: - a sustainable self, by moving away from focusing on the short-run win associated with attaining a goal to the longer-term benefits associated with continued improvement after the goal has been achieved thereby sustaining healthy habits. - sustainable connections, by helping people feel they are valued members of a winning team on an inspired mission. - sustainable planet, in small ways that ripple out small communities and the planet; the hope is to create a culture of shared prosperity. The goal of the class is to facilitate dialogue, knowledge exchange, and collaboration among students and guests to create a sustainable toolkit to cultivate positive habits for our future based on a sense of shared prosperity. Lastly, we'll map out how to use time in ways that will help build sustainable lives (calm mind and healthy body), impactful teams and a beautiful planet, so each of our lives will have meaningful, lasting impact in the world. (SUSTAIN 237 is the same course as GSBGEN537) Apply now for Stanford GSB's SUSTAIN 237: Sustainable Human Behavior. : https://forms.gle/k3g8G3Dp8G7W3NHBA. Application due Monday 3/6 @ 8AM. Sneak peek at the (rough) syllabus https://drive.google.com/file/d/1XbiKWzhkOwP1X-2j7a8fFluxlrMGojzM/view?usp=share_link To find out more about the class - visit https://shb.stanford.edu/ Sign up in Axess once your application is accepted. Questions? Email Keala at kealaa@stanford.edu. You will be notified by March 8th whether you are admitted and will sign up in Axess if your application is accepted. We look forward to reading your applications!",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "30833",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Aaker, J.",
                                "sunet": "jaaker"
                            },
                            {
                                "name": "Huang, S.",
                                "sunet": "huangsc"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224919",
        "number": "SUSTAIN 237",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "242",
        "title": "Negotiations",
        "description": "This is an introductory course on negotiations. It is partly experiential: in every session students will engage in negotiation exercises. Data from these exercises will be discussed in the following session. This experiential component will be supported by readings and short lectures on game theory and cognitive &amp; social psychology that will provide a research foundation for analyzing the exercises.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32309",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Bendor, J.",
                                "sunet": "fbendor"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224947",
        "number": "SUSTAIN 242",
        "units": [
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "305A",
        "title": "Teaching in the field:  Basic skills for working with students in the field",
        "description": "This workshop series introduces the basics of teaching, working, and living in the field with students, from first aid to university policies to pedagogy. We will discuss skills and techniques necessary to keep students safe, to maximize their learning outcomes, and to promote best practices for field teaching, particularly within the natural sciences. Open to all graduate students.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "219151",
        "number": "SUSTAIN 305A",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "305B",
        "title": "Teaching in the Field: Field Practical",
        "description": "Participate in the logistics and academic content of a SUSTAIN field trip and serve as primary trip leaders.  Discussions prior to, and during, the field trip that cover pedagogic, safety, risk management, and social issues that pertain to teaching field trips. Specific topics will be chosen based on the interest and abilities of enrolled students.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "221176",
        "number": "SUSTAIN 305B",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "321",
        "title": "Organizations and Sustainability",
        "description": "This course reviews social science research on the role of organizations in environmental sustainability. Modern human activity is known to be dramatically changing the earth's ecosystem with far-reaching consequences: altering the climate, reducing biodiversity, challenging our ability to provide sufficient food and water, increasing mass migrations, harming our oceans, threatening human health, and potentially leading to increasing violence and chances of war. Our ability to limit and adapt to these changes will depend on the behavior of organizations: corporations, not for profits, governments, non-governmental organizations, political advocacy and social movement organizations. The course organizes the various literatures of 'organization theory' that pertain to sustainability, giving the students an intellectual structure on which to build their own understanding. The course is intended for PhD students planning to pursue a career as researchers in academia or industry.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224890",
        "number": "SUSTAIN 321",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "324",
        "title": "Philanthropy and Civil Society (EDUC 374, POLISCI 334, SOC 374)",
        "description": "Cross-listed with Law (LAW 7071), Political Science (POLISCI 334) and Sociology (SOC 374). Associated with the Center for Philanthropy and Civil Society (PACS). Year-long workshop for doctoral students and advanced undergraduates writing senior theses on the nature of civil society or philanthropy. Focus is on pursuit of progressive research and writing contributing to the current scholarly knowledge of the nonprofit sector and philanthropy. Accomplished in a large part through peer review. Readings include recent scholarship in aforementioned fields. May be repeated for credit for a maximum of 3 units.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "16192",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": "Encina West 101",
                        "instructors": [
                            {
                                "name": "Reich, R.",
                                "sunet": "reich"
                            },
                            {
                                "name": "Willer, R.",
                                "sunet": "willer"
                            },
                            {
                                "name": "Powell, W.",
                                "sunet": "woodyp"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "16772",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Reich, R.",
                                "sunet": "reich"
                            },
                            {
                                "name": "Willer, R.",
                                "sunet": "willer"
                            },
                            {
                                "name": "Powell, W.",
                                "sunet": "woodyp"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "16286",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Reich, R.",
                                "sunet": "reich"
                            },
                            {
                                "name": "Willer, R.",
                                "sunet": "willer"
                            },
                            {
                                "name": "Powell, W.",
                                "sunet": "woodyp"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "102079",
        "number": "SUSTAIN 324",
        "units": [
            1,
            2,
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "328",
        "title": "Policy Practicum: Integrating Water and Land Use Policy in the West:  The Missing Link",
        "description": "The western United States is currently experiencing what may be the longest and most severe &quot;megadrought&quot; in modern U.S. history.  Current U.S. drought data shows virtually all of the Southwest in severe, extreme, or extraordinary drought.  Reservoirs on the Colorado River are reaching record lows, and many farmers throughout the West have had their deliveries cut dramatically or face potentially massive cutbacks.  Media discussion of episodic, emergency &quot;droughts&quot; has been replaced by a recognition of the permanent &quot;aridification&quot; of the West under climate change.  Resolving the West's growing water crisis will require far greater linkage of water management and land use.  Land use drives water demand, while water availability constrains land use.  While water and land use are integrally related in fact, water and land-use policies in practice are far from integrated.  Developments are approved without reference to water availability, and water agencies often have to scramble to find and fund new projects to augment or conserve water.  New land developments or more intensive farming can lead to increased groundwater pumping that can cause neighboring residents' wells to run dry. In other cases, a failure to link water and land use can lead to abrupt building bans and/or emergency rationing. To meet the needs of a more water constrained future under climate change, a more integrated approach to water management and land use is warranted.  While John Wesley Powell once recommended close integration of water and land use, western states have historically ignored the imperative.  In the past decade or so, some states have ventured more fully into the connection between land use and water.  Some states, for example, have enacted &quot;Show Me the Water&quot; statutes that require land developments above a certain size to demonstrate that they have 50 to 100 years' worth of water available before permits can be issued.  In other places, states require land use authorities to consider water issues in developing their plans (or issuing well permits), either though consulting with their overlapping water agencies, or through developing a water &quot;element&quot; to their plans.  This sensible approach is far from universal.  We know very little, however, about how well these various approaches have worked.  Working with the Babbitt Center for Land and Water at the Lincoln Land Institute (the leader in this field) and other experts in the West, students will review and assess whether the policies that have been enacted have made a difference in practice and will develop recommendations for how water and land use can be better integrated going forward. CONSENT APPLICATION: To apply for this course, students must complete and submit a Consent Application Form available at https://law.stanford.edu/education/courses/consent-of-instructor-forms.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224736",
        "number": "SUSTAIN 328",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "329",
        "title": "Policy Practicum:  Smoke",
        "description": "Clients: Various California legislative and executive branch decision makers.  Wildfire smoke has emerged as one of the most pressing air pollution and public health threats in the Western United States. Last year, despite decades of progress in reducing air pollution from transport, industry, and electric power, wildfires caused the highest number of &quot;spare the air&quot; declarations ever called by local Air Quality Management Districts in California. Oregon, Washington and Colorado all suffered similar &quot;airpocalypse&quot; fire seasons. Recent model-based estimates of mortality from wildfire smoke-derived particulate matter suggest that between 1200 and 3000 seniors likely died from the fires this summer. Current law and regulation not only doesn't consider particulate matter derived from wildfire smoke to be a target for regulation, it also imposes burdensome permitting requirements on one of the most effective risk-mitigation strategies: prescribed fire.  This course will build on student work from last spring, where students explored regulatory obstacles to an expansion of prescribed burning in California and began developing a simplified air quality health benefits model to estimate the potential public health and economic benefits of better fuels management. This fall, we will continue refining the air quality model and, on the regulatory side, we will investigate potential new policy approaches to streamlining the approval process for prescribed burning projects while protecting environmental values with a particular focus on new approaches to NEPA and CEQA compliance for prescribed fire and cultural burning. The course is intended for students interested in multi-disciplinary approaches to public policy problems. No background in either the Clean Air Act or wildfire policy is required.  Students will engage in weekly lecture and discussion of wildfire smoke science and policy, including student presentations. Students will also meet additionally once per week with Professors Sivas and Wara in working sessions to discuss progress on team projects. Students will present the results of their research to California legislative and executive branch staff engaged in developing new approaches to wildfire policy.  Elements used in grading:  Attendance, Performance, Class Participation, Written Assignments, Final Paper.  CONSENT APPLICATION: To apply for this course, students must complete and submit a Consent Application Form available at https://law.stanford.edu/education/courses/consent-of-instructor-forms/. See Consent Application Form for instructions and submission deadline.Same as LAW 808D",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224662",
        "number": "SUSTAIN 329",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "330",
        "title": "Leading Environmental Sustainability by Design",
        "description": "This course is intended for Master&iquest;s level students. It surveys our planet&iquest;s greatest sustainability challenges, and some of the possible ways that humankind might overcome each through proactive leadership. The course material includes readings from multiple disciplines: from the natural sciences, the social sciences, and from business and policy studies. By the end of the course, you should have a basic understanding of the global biological, cultural, social, and economic processes involved in environmental sustainability. Our objective is for you to carry forward this understanding into your career, to enable you to make a difference for the future of our world.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30447",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "12:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Barnett, W.",
                                "sunet": "fbarnett"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 46200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225319",
        "number": "SUSTAIN 330",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "331",
        "title": "Ethics in the Anthropocene (BIO 197, BIO 313)",
        "description": "Today, in the Anthropocene, humankind impacts the environment on a massive scale, with severe outcomes for species, ecosystems, and landscapes. The consequences of this impact raise many ethical questions, with new dilemmas forcing us to consider new moral values and re-consider old ones. In this course, we will become acquainted with environmental and conservation ethics and philosophy, and acquire the toolkit of concepts and ideas that will allow us to tackle the current environmental ethical debates. We will explore the role of ethics in the environmental and conservation sciences by discussing the philosophical foundations for moral values in the Anthropocene, as well as by examining practical current-day issues, such as reintroductions, invasive species and conservation advocacy.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29833",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220876",
        "number": "SUSTAIN 331",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "332",
        "title": "Climate Tech for Rapid Decarbonization",
        "description": "This course examines alternative pathways for economies around the world to achieve deep decarbonization within a couple of decades. The overall perspective is to analyze the global decarbonization process at the intersection of technological improvements, financial fundamentals and the parameters set by public policies.The first part of the course will be concerned with the science and the political economy of climate change, greenhouse gas emissions and the proliferation of net-zero pledges by governments and corporations. Included in this part is a closer look at countries for which the production and export of fossil fuels is a key economic activity. We then turn to the competitiveness of carbon-free or low-carbon technologies in different segments of the economy, including i) power generation, ii) energy storage, iii) transportation, iv) industrial production and v) food and Ag Tech. The final part of the course turns to the emergence of energy technologies with future commercial potential, including hydrogen, fission/fusion, carbon capture and utilization and synthetic hydrocarbons.The course will rely on lectures from each of the three instructors, guest presentations and select case studies. (SUSTAIN 332 is the same course as GSBGEN 332)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224898",
        "number": "SUSTAIN 332",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "339",
        "title": "Sustainability and Business",
        "description": "We focus on the importance of economics and business for environmental conservation and policies to work: (a) Policies will not pass legislation unless it is cost-effective and relatively inexpensive, (b) lobby opposition from business can be intense but will vary systematically depending on how the policies are designed, (c) environmental problems represent inefficiencies that can generate both social surplus and profit/business opportunities when the problems are addressed, and companies are experts in solving such inefficiencies, (d) environmental problems require new technology and profit-maximizing innovators often have the strongest incentives and abilities to develop new technologies. For all these reasons, proponents for environmental sustainability can and must embrace what economics and business can offer. The class draws on teaching material at the GSB.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "225576",
        "number": "SUSTAIN 339",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "340",
        "title": "Becoming an Effective Leader",
        "description": "To achieve your career goals in working toward meaningful sustainability solutions, you need technical expertise and a talent for innovation, to be sure. At the same time, you also need to know how to get things done -- how to lead and manage others to achieve a common objective. That is the purpose of this course -- to arm you with practical leadership skills. This course is an adapted version of the required leadership course (called &quot;Organizational Behavior&quot;) taught to first-year MBA students at the Graduate School of Business. It has been offered only to GSB students until now, when, after teaching it for the past 17 years, I will be offering it exclusively to students in the Sustainability School. Each of the sessions in this course is highly interactive, relying on role plays, group exercises, simulations, and class discussions to make the experience even more valuable. I want to help you understand how to lead others more effectively across a range of situations by sharing the best insights from behavioral science - covering topics that include decision making, negotiating conflict, communicating effectively, managing collaborative work, and motivating teams. After taking this course, students will be better able to: (1) craft more compelling communication that encourages others to recognize the value of their ideas; (2) build strong, dynamic, and highly motivated teams; and (3) manage collaboration challenges with a combination of sensitivity and political savvy.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29265",
                "currentClassSize": "0",
                "maxClassSize": "72",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "200-034",
                        "instructors": [
                            {
                                "name": "Flynn, F.",
                                "sunet": "fflynn"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225427",
        "number": "SUSTAIN 340",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "345",
        "title": "Global Leaders and Innovators in Human and Planetary Health: Sustainable Societies Lab (HRP 285, MED 285)",
        "description": "Are you interested in innovative ideas and strategies for addressing urgent challenges in human and planetary health and creating sustainable societies? This 7 session lecture series features a selection of noteworthy leaders, innovators, and experts across diverse sectors/topics in health and the environment such as: health innovation and environmental sustainability, social and environmental justice and equality, social innovation and entrepreneurship ecosystems, foundations and venture capital, tech innovation, media and AI, biotech and ag-tech,  pandemics, public health and community wellbeing, food systems and agricultural innovation, hunger and nutrition, clean water and air, nonprofits and community action, public policy innovation and systems change, and the role of academia and you. Co-convened and co-designed by faculty, fellows and students collaborating across several Stanford centers, departments, schools, the course invites the discussion of global problems, interdisciplinary perspectives, and systemic solutions for the climate crisis and human health. The course will address root causes of the climate crisis and urgent challenges of human and planetary health, including sociological constraints, political objectives, economic incentives, technological limitations, and preservation of global stability, and suggest models of leadership, innovation and sustainable social change. We will also delve into efforts to catalyze long-term sustainability across the private, nonprofit, and public sectors. Students from all backgrounds are encouraged to enroll - registration is open to all Stanford students and fellows. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31438",
                "currentClassSize": "0",
                "maxClassSize": "125",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "STLC 114",
                        "instructors": [
                            {
                                "name": "Singer, S.",
                                "sunet": "ssinger"
                            },
                            {
                                "name": "Bloom, G.",
                                "sunet": "gobloom"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220930",
        "number": "SUSTAIN 345",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "348",
        "title": "Public Policy for Climate Innovation",
        "description": "This course considers the form and content that climate innovation policies should take as well as implementation strategies to help climate tech companies cross the proverbial &quot;valley of death&quot;.  The course begins with an evaluation of the advantages and disadvantages of different regulatory approaches to environmental innovation, such as technology forcing standards, command and control oversight, subsidies, carbon taxes and choice architecture &quot;nudges&quot;.  Subsequently, specific examples of global and national regulatory dynamics that affect technology development are discussed in areas such as renewable energy, energy storage, solid waste reduction, food production, cement and steel production, hydrogen, autonomous/ electric vehicles, shipping, and the fashion industry. Relevant experiences of different countries will be presented including Danish policies to encourage a local wind-turbine industry, German programs to expand solar energy and Israeli government initiatives to foster sustainable Watech and Food tech companies.  Potential outcomes of the recently enacted the U.S. Inflation Reduction Act will then be considered. The final section of the course involves analysis of specific case studies assessing Climate Tech companies in different stages of their development.  Students will research a range of clean tech companies&iquest; experience and consider the way policies affect their business plans, financing, research portfolios and ultimate success or failure.  The course will be based on instructor&iquest;s lectures, interactive, virtual presentations by climate tech managers, a field trip to local climate tech companies&iquest; facilities and presentation of group projects.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "224950",
        "number": "SUSTAIN 348",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "349",
        "title": "The Financial Economics of Climate and Sustainability",
        "description": "The purpose of the course is to (a) introduce graduate students to questions and methods in the rapidly evolving fields of climate/sustainable finance; (b) connect researchers from across the globe interested in this topic to stimulate more rigorous, relevant, and collaborative work. Addressing climate change demands changes in natural, social, and economic systems and will require greater collaboration. In that spirit, this course is being offered by a team of professors from different schools and universities across the globe. Each instructor will deliver one or more lectures and there will be students from a number of different schools. Our teaching group consists of current and former AFA and EFA presidents and some of the leading climate finance scholars, including Laura Starks (current AFA President), Patrick Bolton (former AFA President), Stefano Giglio, Marcin Kacperczyk (former EFA President), Caroline Flammer, Geoff Heal, Stefan Reichelstein, Ben Caldecott and Peter Tufano. Pre-requisites and finance context: The course will assume that participants have a background in core graduate-level finance. The course will cover topics from a variety of subfields in finance (asset pricing, financial intermediation, household finance, corporate finance). The introductory block of three classes is intended to orient students to the science of climate change as well as to refresh key concepts from economics and finance; the remaining classes will dive into detail on current research in different subfield. We will conclude with a discussion of open topics in this field. We expect that the course will be useful to doctoral students in finance, economics, and accounting. As a global class, we will largely be on Zoom. Beyond weekly preparation and participation, students will be expected to write a paper either laying out a potential research topic or synthesizing a set of related papers that were not discussed in class.  (COURES IS THE SAME AS GSBGEN 693)",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "224899",
        "number": "SUSTAIN 349",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "350",
        "title": "The Sustainability of the Human Record (ENGLISH 370, GERMAN 375)",
        "description": "What happens in the year 12,021 when future generations seek to understand the extensive record of human endeavour, experience, and life, today and previously? What will constitute a future Rosetta Stone that makes accessible surviving monuments, texts, and languages of 2021; that ensures future people will know how to avoid the deadly nuclear dumps and climate breakdown created now? How can we seek to guarantee in the present that the technologies upon which we rely will be legible and accessible in even mere decades to come?This course will focus on the recording and preservation of, and access to, human communication through its long history and into the next century. How is communication created, produced, and received? How sustainable are the many media and devices through which it is transmitted? What are the key components to sustaining an understanding of the human record without which one might argue very little really matters?",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224224",
        "number": "SUSTAIN 350",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "352",
        "title": "Power in the Anthropocene: Pasts, Presents, Futures (ANTHRO 302D, HISTORY 302D)",
        "description": "The Anthropocene designates the present geological epoch, in which humans have irreversibly changed planet Earth, with impacts discernible in the atmosphere, biosphere, and more. The term has also become a &quot;charismatic mega-category&quot; in the humanities and social sciences, where some critique the very concept, while others focus on how power dynamics, political economy, racial capitalism, and human/non-human relations manifest--and often accelerate--Anthropocenic transformations. This PhD-level course dives into these debates, drawing on work in a wide range of fields in the humanities, social sciences, arts, and natural science (the latter with works accessible to non-expert audiences). The course involves considerable reading. Written assignments will be varied and often experimental. The format of the final assignment will be flexible, with options that can be adapted to the needs and interests of individual students.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224183",
        "number": "SUSTAIN 352",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "356",
        "title": "Media and the Environment (FILMEDIA 216, FILMEDIA 416, SUSTAIN 156)",
        "description": "How are environmental issues represented in various media, from cinema and television to videogames, VR, and experimental art? And how are these media themselves involved in environmental change? In this course, we look at media and the environment as interlocking parts of a system, inseparable from one another. We might start by asking how, for example, documentary and narrative films portray environmental crises like oil spills, wildfires, or extinction events. From there, however, we will need to investigate the ways that media themselves constitute environments, both metaphorically and literally. We swim in media; it is the air we breathe. Virtually all of our experience and communication take place within the spaces of media. Meanwhile, media-technologies and their infrastructures are increasingly entangled with the material environment: from rare earth metals in our electronic devices to undersea cables that bring us the Internet, digital media in particular are an increasingly significant driver of environmental change. In addition to reading and engaging with a variety of media objects, students will have the opportunity to create their own media objects (video essays, VR projects, experimental artworks, etc.) that shed light on the interrelations of media and the environment.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "16289",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denson, S.",
                                "sunet": "denson"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "5:30:00 PM",
                        "endTime": "8:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Denson, S.",
                                "sunet": "denson"
                            }
                        ],
                        "startTimestamp": 63000.0,
                        "endTimestamp": 73200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224329",
        "number": "SUSTAIN 356",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "376",
        "title": "Startup Garage: Design (BIOE 376)",
        "description": "Startup Garage is an intensive, hands-on, project-based course where students apply human-centric design, lean startup methodology, and the Business Model Canvas to conceive, design, and field-test new business concepts that address real world needs. Teams get out of the building and interact directly with users, industry participants, and advisors to deeply understand one or more unmet customer needs. They proceed to design, prototype, and test their proposed products or services and a business model. Teams working on impact-focused ventures will apply the same methodology to address the needs of their beneficiaries. Students develop entrepreneurial skills as they learn critical, cutting-edge techniques about launching a venture. The course is offered by the Graduate School of Business. PREREQUISITE: Team application required. See details and apply at http://startupgarage.stanford.edu/details (login required).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "31538",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "9:45:00 AM",
                        "location": "DINKG10",
                        "instructors": [
                            {
                                "name": "Chen, E.",
                                "sunet": "ericc"
                            },
                            {
                                "name": "Waldorf, G.",
                                "sunet": "gwaldorf"
                            },
                            {
                                "name": "Wallace, C.",
                                "sunet": "collinw"
                            },
                            {
                                "name": "Prakash, A.",
                                "sunet": "ajayp"
                            },
                            {
                                "name": "Glickman, M.",
                                "sunet": "mattgli"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 35100.0,
                        "days": "Monday Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "LEC",
                "notes": null,
                "classId": "31539",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": "8:00:00 AM",
                        "endTime": "9:45:00 AM",
                        "location": "Econ 140",
                        "instructors": [
                            {
                                "name": "Lisbonne, B.",
                                "sunet": "blis"
                            },
                            {
                                "name": "Perkash, M.",
                                "sunet": "mperkash"
                            },
                            {
                                "name": "Gur, S.",
                                "sunet": "saar"
                            },
                            {
                                "name": "Scull, J.",
                                "sunet": "jmscull"
                            },
                            {
                                "name": "Laws, M.",
                                "sunet": "mlaws"
                            }
                        ],
                        "startTimestamp": 28800.0,
                        "endTimestamp": 35100.0,
                        "days": "Tuesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "LEC",
                "notes": null,
                "classId": "31540",
                "currentClassSize": "0",
                "maxClassSize": "48",
                "schedules": [
                    {
                        "startTime": "10:00:00 AM",
                        "endTime": "11:45:00 AM",
                        "location": "Econ 140",
                        "instructors": [
                            {
                                "name": "Nakache, P.",
                                "sunet": "pnakache"
                            },
                            {
                                "name": "Deshpande, S.",
                                "sunet": "sathomas"
                            },
                            {
                                "name": "Baker, K.",
                                "sunet": "kbaker2"
                            },
                            {
                                "name": "Eison, J.",
                                "sunet": "jeison"
                            },
                            {
                                "name": "Galen, D.",
                                "sunet": "dgalen"
                            }
                        ],
                        "startTimestamp": 36000.0,
                        "endTimestamp": 42300.0,
                        "days": "Tuesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "214591",
        "number": "SUSTAIN 376",
        "units": [
            4
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "377",
        "title": "Startup Garage: Testing and Launch (BIOE 377)",
        "description": "In this intensive, hands-on project based course, teams continue to develop their ventures based on a user need that they validated in preparation for the course. They build out more elaborate versions of their prototypes and Business Model Canvas; test hypotheses about the product/service, business model, value proposition, customer acquisition, revenue generation, and fundraising; and deliver a seed round financing pitch to a panel of investors. Students develop entrepreneurial skills as they 1) Get out of the building and gather insights from users, investors, and advisors, 2) Make decisions about pivoting, 3) Work through their operating plans and unit economics, 4) Test go-to-market strategies, 5) Consider equity splits, 6) Learn term sheet negotiations, and 7) Practice their pitches. PREREQUISITE: SUSTAIN 376 or a team application. See details and apply at http://startupgarage.stanford.edu/details (login required).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "214849",
        "number": "SUSTAIN 377",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "400",
        "title": "Directed Research",
        "description": "Independent research for graduate student projects.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27674",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29686",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29381",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "16659",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kovscek, A.",
                                "sunet": "kovscek"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "16112",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Biondi, B.",
                                "sunet": "biondo"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "16113",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Dunham, E.",
                                "sunet": "edunham"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "16114",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gerritsen, M.",
                                "sunet": "gerritsn"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "16115",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Suckale, J.",
                                "sunet": "jsuckale"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "16116",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Tchelepi, H.",
                                "sunet": "tchelepi"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213864",
        "number": "SUSTAIN 400",
        "units": [
            3
        ],
        "totalSections": 9
    },
    {
        "year": "2023-2024",
        "subject": "SUSTAIN",
        "code": "401",
        "title": "Curricular Practical Training",
        "description": "Curricular Practical Training",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "15931",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "16604",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "16024",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Phillips, K.",
                                "sunet": "kphill"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "PRA",
                "notes": null,
                "classId": "16111",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "213863",
        "number": "SUSTAIN 401",
        "units": [
            1
        ],
        "totalSections": 4
    }
]