[
    {
        "year": "2023-2024",
        "subject": "SUST",
        "code": "210",
        "title": "Pursuing Sustainability: Managing Complex Social Environmental Systems (ESS 230)",
        "description": "This course considers and utilizes systems frameworks and models for thinking about and pursuing sustainability (defined by the goal of inclusive intra- and intergenerational well-being) in complex, adaptive, intertwined social-environmental systems. It argues that meeting the goal of sustainability requires drawing on assets (or resources) from five major groups ? human, social, manufactured, natural and knowledge capital assets ? while at the same time building and sustaining them over time. The course illustrates, using lectures, readings, and case study analyses, why analyzing and managing those assets within complex and dynamic integrated systems is challenging, and discusses the characteristics of complex systems that make achieving sustainability goals so challenging. It provides an overview of how to intervene in complex systems to pursue sustainability, including visioning, collaboration, and change theories; governing for sustainability; and strategies, tools, and metrics that assist with the pursuit of sustainability goals. The course draws on readings from one core text (Matson et al. 2016) as well as from a variety of other published literature and case studies. Priority given to SUST students. Enrollment open to seniors and graduate students only. Please contact Bhe Balde (ebalde@stanford.edu) for permission code.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "16016",
                "currentClassSize": "0",
                "maxClassSize": "70",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "Ceras 300",
                        "instructors": [
                            {
                                "name": "Sotnik, G.",
                                "sunet": "gsotnik"
                            },
                            {
                                "name": "Matson, P.",
                                "sunet": "pmatson"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 37200.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219481",
        "number": "SUST 210",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUST",
        "code": "220",
        "title": "Case Studies in Leading Change for Sustainability",
        "description": "This course teaches essential leadership orientations and effective approaches for advancing sustainability globally. It examines case studies and examples of leading change in the private sector, and in cross-sector collaborations involving government, business and non-profit organizations. The course teaches students the Connect, Adapt and Innovate (CAN) orientations and other skills which enhance students' ability to cultivate resilience and well-being in their lives and to lead change in complex systems. Strategies and approaches studied include B Corporations, social entrepreneurship, indigenous community-business collaborations, biomimicry, circular economy, sharing economy, corporate sustainability strategy, the UN sustainable development goals, metrics of progress beyond GDP, and transformative multi-stakeholder partnerships. Through conceptual frameworks, hands-on exercises, class discussion, reflection and interactions with sustainability leaders, students practice decision-making under uncertainty, systems thinking, resilience thinking and transformative leadership. Working in teams, students will apply their learnings in collaborative class projects. To help cultivate a highly engaged course community, please send responses to the following questions to Julia Novy (julia3@stanford.edu); admitted students will receive a permission code to be used for course enrollment. 1. What is one of the most significant challenges you've faced and how did you approach it? 2. What would you like to get out of this course? 3. What will you contribute?",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Enrollment priority given to currently enrolled SUST students. Application required to enroll in course; please see course description for details.",
                "classId": "16750",
                "currentClassSize": "0",
                "maxClassSize": "65",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Novy, J.",
                                "sunet": "julia3"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219482",
        "number": "SUST 220",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUST",
        "code": "225",
        "title": "Decision Making for Sustainability",
        "description": "Pursuing sustainability entails making individual and collective decisions in complex and adaptive environments under varying degrees of uncertainty. This course prepares students for making such decisions by combining complex adaptive systems theory with modern decision science and best practices in applied decision-making, strategy development, and planning. The course delves into the complex and adaptive nature of critical decision environments, transformative social change, the roles of information and uncertainty, cognitive biases and heuristics, and intra- and inter-group dynamics. Each student will select a sustainability challenge to focus on throughout the course and develop an adaptive plan for addressing the challenge while learning about multi-actor engagement, problem definition, scenario analysis, and strategy and pathway development. The course takes an experiential approach to learning. Classes consist of lectures and pair- and group-based activities. Please apply to be considered: https://rb.gy/6r66e",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Priority given to current SUST students.",
                "classId": "30779",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "160-127",
                        "instructors": [
                            {
                                "name": "Sotnik, G.",
                                "sunet": "gsotnik"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224712",
        "number": "SUST 225",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUST",
        "code": "234",
        "title": "Integrative Design, Entrepreneurship & Venture Capital for Sustainability",
        "description": "This course aims to empower students with knowledge, orientations, and skills to evaluate pressing sustainability challenges and design entrepreneurial solutions that advance sustainability and deliver lasting positive change. Through case studies, frameworks, and hands-on projects, students learn about the entrepreneurial ecosystem of start-ups and venture capital, nonprofits and philanthropy, and other business models that can achieve co-benefits and sustainable outcomes. Students delve into the entrepreneurial founding and fundraising process and utilize a holistic integrative design approach to examine systems, engage stakeholders, and ultimately develop business models with the goal of delivering scalable and sustainable positive impact. The course combines lectures, videos, readings, guest speakers, discussion sessions, and group project-based learning. Students work in small teams to examine and engage in designing, prototyping, testing, and iterating on specific solutions, interventions, and business model innovations. The course culminates in a group project and final presentation prepared collaboratively by each team.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32074",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lin, M.",
                                "sunet": "mikelin3"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Priority given to current SUST students.",
                "classId": "30744",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "STLC 118",
                        "instructors": [
                            {
                                "name": "Lin, M.",
                                "sunet": "mikelin3"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225064",
        "number": "SUST 234",
        "units": [
            3
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "SUST",
        "code": "240",
        "title": "Sustainability Leadership Practicum",
        "description": "At the intersection of sustainability science and practice, the course provides master's students in the Sustainability Science and Practice (SUST) Program with an opportunity to apply and internalize the knowledge, mindsets, and skills learned in the program while leading change and advancing sustainability. Students identify and plan their own 80-hour practicum opportunities with sustainability-focused organizations, during which they collaborate on projects while applying foundational SUST learnings. Additionally, each student analyzes the sustainability challenge their organization is dedicated to addressing, examines their organization's ability to address the challenge, recommends how the organization can improve its ability to address the challenge in a transformative way, and reflects on their own experience and growth as a sustainability leader. Each student completes the course with a paper and presentation that share the student's analysis, recommendations, and self-reflections with the SUST community. Ultimately, the practicum is designed to develop each student's identity and capacity as a transformative leader through practice.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": "Enrollment Open to Sustainability Science & Practice MA/MS Students Only.",
                "classId": "16161",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Novy, J.",
                                "sunet": "julia3"
                            },
                            {
                                "name": "Sotnik, G.",
                                "sunet": "gsotnik"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": "Enrollment Open to Sustainability Science & Practice MA/MS Students Only.",
                "classId": "16751",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Novy, J.",
                                "sunet": "julia3"
                            },
                            {
                                "name": "Sotnik, G.",
                                "sunet": "gsotnik"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "16254",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Novy, J.",
                                "sunet": "julia3"
                            },
                            {
                                "name": "Sotnik, G.",
                                "sunet": "gsotnik"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219484",
        "number": "SUST 240",
        "units": [
            1,
            2,
            3,
            4
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "SUST",
        "code": "261",
        "title": "Art and Science of Decision Making",
        "description": "When we make high-quality decisions, we improve the probability of outcomes we want. By combining the art of qualitative framing and structuring with the science of quantitative assessment and analysis, we will have pragmatic ways to: identify those core issues driving the value of our decisions, craft an inspirational vision, create viable alternatives, mitigate biases in probabilistic information, clarify both tangible and intangible preferences, develop appropriate risk/reward models, evaluate decisions for a broad range of uncertain scenarios, appraise values of gathering additional information, and ensure commitment to implementation plans and budgets. Common-sense rules and decision-making tools provide the essential focus, discipline, and passion we need for clarity of action on big, important decisions ? from personal choices to organizational decisions about business strategies or public policies. A normative approach prescribes how decisions can be made defensible using a logical basis of deliberative reasoning when we face a dynamic, complex, and uncertain future world. Transformational change can then implement the optimal decisions by following a dynamic process of project management. Course requirements include a midterm exam, a final exam, and an individual, quarter-long tutorial to frame, structure, assess, and analyze your personal career and lifestyle decisions for the initial 5 years after leaving Stanford. Key factors often include net discretionary income, savings and investments, macroeconomic trends, job satisfaction, personal life satisfaction, avocation pursuits, and relationships with family and friends. To achieve your desired results in this course, you are implored by the teaching team to &quot;procrastinate your procrastination.&quot;",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "16255",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Robinson, B.",
                                "sunet": "burkerob"
                            },
                            {
                                "name": "Cruz, A.",
                                "sunet": "acruz23"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 40800.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "220118",
        "number": "SUST 261",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "SUST",
        "code": "290",
        "title": "Curricular Practical Training",
        "description": "CPT course required for international students completing degree.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28254",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30307",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30115",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "16160",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Novy, J.",
                                "sunet": "julia3"
                            },
                            {
                                "name": "Sotnik, G.",
                                "sunet": "gsotnik"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "16752",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Novy, J.",
                                "sunet": "julia3"
                            },
                            {
                                "name": "Sotnik, G.",
                                "sunet": "gsotnik"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "16256",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Novy, J.",
                                "sunet": "julia3"
                            },
                            {
                                "name": "Sotnik, G.",
                                "sunet": "gsotnik"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223132",
        "number": "SUST 290",
        "units": [
            1
        ],
        "totalSections": 6
    },
    {
        "year": "2023-2024",
        "subject": "SUST",
        "code": "291",
        "title": "SUST INDIVIDUAL STUDY",
        "description": "Individual work in the field of Sustainability Science and Practice under supervision of a SUST faculty member on a subject of mutual interest.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28267",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30331",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "30149",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "16183",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Sotnik, G.",
                                "sunet": "gsotnik"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "16314",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223295",
        "number": "SUST 291",
        "units": [
            1,
            2,
            3,
            4
        ],
        "totalSections": 5
    },
    {
        "year": "2023-2024",
        "subject": "SUST",
        "code": "297",
        "title": "Introduction to Systems Transformation",
        "description": "This immersive course exposes students in the Sustainability Science and Practice coterminal master's program to systems thinking and innovation approaches that are needed in order to bring about large-scale system transformation. Scaled and complex challenges embodied in the U.N. Sustainable Development Goals are multi-stakeholder, multifactorial, inter-related, and systemic, and can only be addressed through innovations at the systems level. This hands-on session provides an introduction to innovation approaches and the mindsets that are needed to transform system behavior at scale in the real world. Students will identify skills that they will need to acquire in order to lead change toward a resilient and sustainable future. Enrollment limited to Sustainability Science and Practice master's students. Contact Bhe Balde (ebalde@stanford.edu) for permission code. Instructors: Banny Banerjee and Annette Zou.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "Enrollment is limited to current SUST students. It is highly recommended that SUST students take at least 1 design course prior to enrolling. This course will meet Fridays, October 13 & 20 from 12-6pm, and Saturday, October 14 from 9am-5pm. Full, in-person attendance is required.",
                "classId": "30743",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "6:00:00 PM",
                        "location": "Lathrop 292",
                        "instructors": [
                            {
                                "name": "Banerjee, B.",
                                "sunet": "banny"
                            },
                            {
                                "name": "Zou, A.",
                                "sunet": "azou"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 64800.0,
                        "days": "Friday"
                    },
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "5:00:00 PM",
                        "location": "Lathrop 292",
                        "instructors": [
                            {
                                "name": "Banerjee, B.",
                                "sunet": "banny"
                            },
                            {
                                "name": "Zou, A.",
                                "sunet": "azou"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 61200.0,
                        "days": "Saturday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": null,
                "classId": "16257",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Banerjee, B.",
                                "sunet": "banny"
                            },
                            {
                                "name": "Zou, A.",
                                "sunet": "azou"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221314",
        "number": "SUST 297",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "SUST",
        "code": "801",
        "title": "TGR PROJECT",
        "description": "Program consent required.",
        "repeatable": "true",
        "grading": "TGR",
        "unitsMin": "0",
        "unitsMax": "0",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "28012",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "30105",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "T/D",
                "notes": null,
                "classId": "29861",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221190",
        "number": "SUST 801",
        "units": [
            0
        ],
        "totalSections": 3
    }
]