[
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "12",
        "title": "Century of Violence",
        "description": "What is modern about modern mass violence? This course explores the evolution, varieties, and logic of mass violence from the early 20th century to the present day. You will engage with and analyze primary accounts of such violence by victims, observers, perpetrators, and courts. We will then consider the effectiveness of various efforts to confront genocides and crimes against humanity in international courts and institutions, past and present. We start with the emergence of genocide as a modern, international issue; proceed with colonial massacres in early 20th century Africa; move to the Armenian genocide in the Ottoman Empire and WWI; Nazi and Nazi-inspired racial murder; communist-induced mass violence in the Soviet Union and Asia; ethnic cleansing in former Yugoslavia; and end with an examination of the recent genocides in Rwanda, Sudan, and the Middle East.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-SI"
        ],
        "objectID": "213224",
        "number": "THINK 12",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "15",
        "title": "How Does Your Brain Work?",
        "description": "How do the biology and chemistry of the brain create the mind that lets us talk, walk, laugh, love, learn, remember, and forget? What can neuroscience say about what makes us human? How can we ask questions about the brain that are observable, testable, and answerable? The human brain is the most complex organ we know. To understand the biology of brain function, this course will use highly interactive lectures and discussions to examine the validity of common beliefs about the brain, discuss how the brain and the nervous system are organized, how individual elements of the brain function, and how together these units produce action. The brain, like all other biological structures, has evolved over time in response to natural selection by adapting to diverse behavioral and environmental constraints. We use evolutionary comparisons to illuminate important questions about brain function, including what the origins and consequences of brain damage are, how and where drugs act, and how you collect, interpret, and understand information about the world. You will learn both how the science of the brain has emerged through understanding important experiments and observations and how you can formulate and test your own experimental questions about the brain.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-SMA"
        ],
        "objectID": "213227",
        "number": "THINK 15",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "19",
        "title": "Rules of War",
        "description": "When, if ever, is war justified?  How are ethical norms translated into rules that govern armed conflict?  Are these rules still relevant in light of the changing nature of warfare? We will examine seminal readings on just war theory, investigate the legal rules that govern the resort to and conduct of war, and study whether these rules affect the conduct of states and individuals.  We will examine alternative ethical frameworks, competing disciplinary approaches to war, and tensions between the outcomes suggested by ethical norms, on the one hand, and legal rules, on the other.  Students will engage actively with these questions by participating in an interactive role-playing simulation, in which they will be assigned roles as government officials, advisors, or other actors.  The class will confront various ethical, legal, and strategic problems as they make decisions about military intervention and policies regarding the threat and use of force in an international crisis.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "213231",
        "number": "THINK 19",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "23",
        "title": "The Cancer Problem: Causes, Treatments, and Prevention",
        "description": "How has our approach to cancer been affected by clinical observations, scientific discoveries, social norms, politics, and economic interests? Approximately one in three Americans will develop invasive cancer during their lifetime; one in five Americans will die as a result of this disease. This course will expose you to multiple ways of approaching the cancer problem, including laboratory research, clinical trials, population studies, public health interventions, and health care economics. We will start with the 18th century discovery of the relationship between coal tar and cancer, and trace the role of scientific research in revealing the genetic basis of cancer. We will then discuss the development of new treatments for cancer as well as measures to screen for and prevent cancer, including the ongoing debate over tobacco control. Using cancer as a case study, you will learn important aspects of the scientific method including experimental design, data analysis, and the difference between correlation and causation.  You will learn how science can be used and misused with regard to the public good. You will also learn about ways in which social, political, and economic forces shape our knowledge about and response to disease.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-AQR",
            "WAY-SMA"
        ],
        "objectID": "213235",
        "number": "THINK 23",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "24",
        "title": "Evil",
        "description": "What is evil? Are we naturally good or evil? How should we respond to evil? There are many books and courses that focus on the good life or the virtues. Yet despite their obvious apparent presence in our life and world, evil and the vices are rarely taken as explicit topics. We will read philosophical and literary texts that deal with the question of evil at a theoretical level, but will also focus on some practical implications of these issues. By exploring evil, we will confront larger questions about the nature of human beings, the appropriate aims of the good society, the function of punishment, and the place of morality in art.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II",
            "WAY-ER"
        ],
        "objectID": "213236",
        "number": "THINK 24",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "31",
        "title": "Race in American Memory",
        "description": "How have Americans remembered the Civil War - what it meant, what it accomplished, and what it failed to accomplish?  How did Americans reimagine the United States as a nation after the war?  Who belonged in the national community and who would be excluded? In 1865, the peace treaty was signed at Appomattox and the Thirteenth Amendment outlawed slavery, but the battle over memory and national identity had just begun.  The questions that the Civil War addressed - and failed to address - continue to affect our lives today.  We will focus on how Americans negotiated issues of cultural memory and national identity through a close analysis of historical texts, novels, poems, films, paintings, cartoons, photographs, and music.  Our interpretations will foreground the particular themes of race and nationhood, freedom and citizenship, and changing notions of individual and collective identity. Our assumption in this course is that history is not available to us as a set of events - fixed, past, and unchanging. Rather, history is known through each generation's interpretations of those events, and these interpretations are shaped by each generation's lived experience. What stories get told? Whose stories? And in what ways?  The stories we choose to tell about the past can shape not only our understanding of the present, but also the kind of future we imagine and strive to realize.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "213242",
        "number": "THINK 31",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "43",
        "title": "What is Love?",
        "description": "Is love a spiritual or a bodily phenomenon? Is the concept of love timeless or ever changing? How does thinking about love lead us to ask other important philosophical and social questions? In this course we will examine the classical roots, medieval developments, and contemporary permutations of Western ideas of romantic love. With an eye to thinking about representations of love in our own culture, we consider some of the foundational love books of the Western tradition. From Plato's Symposium to Chester Brown's graphic novel Paying For It, we ask the fundamental question of whether and how we might distinguish between spiritual and physical desire. We consider how medieval and contemporary writers dealt with the relation of love to sex, power, money, marriage, and gender. We discuss these works of the past, for example the illicit love in the courtly romance Tristan, in tandem with representations of clandestine love from the present day, such as the portrayal of same-sex love in Brokeback Mountain.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "215407",
        "number": "THINK 43",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "44",
        "title": "Belief",
        "description": "Why do people believe in God? What does it mean for people to experience the supernatural? How do we understand belief in God? How do people convey experiences that are by definition extra-ordinary to others? In this course we ask the big (and unanswerable) question why people believe in God. Some scholars argue that belief results from direct experience, such as visions or moments of transcendence, that testify to God's existence. Others suggest that belief in the supernatural is better explained by the way the human mind has evolved or people's experience of the social world. In this class, we will pair medieval literature on Christian mysticism and magic with readings from modern psychology and anthropology. We will look at the dominant answers provided by each discipline. For example, belief might result from our sensory experience of the world, or it might have developed as part of our cognitive apparatus in response to fear. Our aim is to show how different disciplines can work together to cast light on a basic question of human existence.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "215408",
        "number": "THINK 44",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "45",
        "title": "Thinking About the Universe: What do we know? How do we know it?",
        "description": "What is the origin and ultimate fate of the universe? Can we know what came before the universe? Are there ultimate limits to human knowledge about the universe and are we reaching them? Cosmology (the study of the universe) raises profound questions about us, our place in the universe, and about the limits of our knowledge. It was only in the 20th century that cosmology developed from metaphysical and theological speculation to become an observational science and a recognized part of physics. In this course, students will explore questions about the Universe, its beginnings, its structure, its extent, its fate, from several perspectives - philosophical, experimental, and theoretical. We will discuss current research and the ongoing debates about the laws of nature on subatomic scales and the perplexing questions they raise regarding the universe and the limits of scientific inquiry.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-SMA"
        ],
        "objectID": "215409",
        "number": "THINK 45",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "46",
        "title": "Why So Few? Gender Diversity and Leadership",
        "description": "Why there are so few women leaders and what is the cost to society for women's underrepresentation in positions of power? How can organizations and individuals increase women's leadership and be more inclusive of the diverse people that make up our society? Women make up half the population and have earned more than half of all the undergraduate degrees in the U.S. since the early 1980s; yet women comprise only 17% of US Congress, 4% of Fortune 500 CEOs, 16% of the board of directors of major corporations, 22% of tenured faculty at Stanford, and less than a fifth of law firm partners. For women of color, these numbers are considerably lower. Yet, research shows that gender diversity increases the creativity and innovation of groups. In this course, we will directly address the questions of why there are so few women leaders and what can be done, at an organizational and individual level, to increase their representation. Using the lens of sociology, we will think critically about leadership, influence, power, status, gender stereotypes, mentorship, and negotiation. Once we understand the mechanisms underpinning the lack of women leaders, we will discuss and critique potential interventions. A unique aspect of this course will be to apply some of the scholarly research on gender and leadership to our lives outside the classroom. We will be using modules based on those used in businesses schools and corporate executive training. Students will develop practical, real-world skills to increase their own leadership capacities by working on projects and taking part in interactive sessions on negotiation and team dynamics.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "215410",
        "number": "THINK 46",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "47",
        "title": "Inventing Government: Ancient and Modern",
        "description": "How might the study of the successes and failures of democratic and republican government in ancient Greece and Rome help us to fix what is broken in our own political systems? Democracy and republic are ancient names for revolutionary approaches to government of, by, and for citizens. Today, almost every state proclaims itself to be a democracy, a republic -- or both. Democratic and republican revolutions transformed ancient Greece and Rome - and later transformed the modern world. We explore how political thinkers, from Machiavelli to Madison and Mill, used the lessons of ancient politics to design bold new systems of government. Ancient politics may still hold lessons for us. We analyze what is broken in modern government (corruption, polarization, gridlock), how it broke, and how the tool kit of ancient political history might help us to analyze and repair the damage.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-ER",
            "WAY-SI"
        ],
        "objectID": "215411",
        "number": "THINK 47",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "48",
        "title": "Reading the Body: How Medicine and Culture Define the Self",
        "description": "How have our perceptions of what is considered normal/abnormal; beautiful/ugly; infected/uninfected changed over time? How do these changing medical and cultural representations of the body reflect larger societal shifts? How does illness change our perceptions of our bodies and our identities? Viewed through the lens of medicine, the body is a text that offers clues to health and illness, yet clinical readings are never entirely objective. Culture informs and distorts how we discern, accept, reject, and analyze our bodies. Looking at literary, medical, ethical, and anthropological texts, we ask how representations of the body affects the way we experience illness, embody gender and racial identities, and understand our rights (or lack of rights) to control our own bodies. We will critically examine our perceptions about the body and debate some of the most complex and sensitive issues surrounding the body, from the ethics of medical research trials to end of life decisions.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-EDP"
        ],
        "objectID": "215412",
        "number": "THINK 48",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "49",
        "title": "Stories Everywhere",
        "description": "Do we perceive the world through stories? Are we made of stories? Can we make sense of the world without narrative? The telling of stories is not just a form of entertainment but an essential human activity that moves and persuades us, compelling us to action and reflection. In this course, we will probe how moral, cognitive and historical forces give stories their power. You will be introduced to the basic theory and art of storytelling, enabling you to understand and master the fundamentals of narrative structure, plot, and character. This will allow you to practice producing your own stories through both interpretative and creative writing assignments. The class will also give students the chance to participate in various story-making activities and work with the Stanford Storytelling Project, San Francisco StoryCorps, School of the Arts and the Stanford Innocence Project to create assignments that would be useful to both private and nonprofit organizations.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "215413",
        "number": "THINK 49",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "50",
        "title": "Empathy",
        "description": "This course will introduce freshmen to a range of ways of thinking about empathy.  How do we know and understand the other?  How does knowledge of another's experience and circumstances enable us to make moral decisions and take moral actions?  It will take students on an intellectual investigation of the topic of empathy from the Buddhist emphasis on compassion in the fifth century BCE to Jesus' teaching of parables in the first century CE to Enlightenment philosophy to Silicon Valley&iquest;s adoption of empathy in the twenty-first century.  The main focus will be on the modern period (from the 18th to 20th century) and students will be asked to approach different genres of text through the lens of empathy. The course will culminate with a one-week creative workshop on the question of empathy.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-CE",
            "WAY-EDP"
        ],
        "objectID": "216657",
        "number": "THINK 50",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "51",
        "title": "The Spirit of Democracy",
        "description": "This course provides an overview of the challenges and aspirations facing ideals of democracy. It deals both with competing visions of what democracy might be, and their actual realization not only in the US but around the world. It will begin with the debate over the American founding and move eventually to the &quot;third wave&quot; of democratization around the world in the late 20th century as well as its more recent retrenchment.  The problems of democratic reform are continuing and recurrent around the world. Democratic institutions are subject to a living dialogue and we intend to engage the students in these debates, at the level of democratic theory and at the level of specific institutional designs.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-SI"
        ],
        "objectID": "216658",
        "number": "THINK 51",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "53",
        "title": "Food Talks: The Language of Food",
        "description": "In this course, we examine how the ways we talk about food offers us a window into history, psychology, culture and economics.  We ask students to think critically about language and taste as well as explore the hidden meanings and influence of the language that surrounds us.  Students will analyze the language of food through menus, recipes, Yelp reviews, TV food shows, as well as the history and etymology of food words.  Some of our examples will be drawn from East Asian food and culture in addition to, and as a point of contrast with, foods and cultures that may be more familiar to students.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "216660",
        "number": "THINK 53",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "54",
        "title": "100,000 Years of War",
        "description": "If you had been born 10,000 years ago, the chance that someone would kill you was more than 1 in 10, but if you were born in the twentieth century AD it was more like 1 in 100, despite that century&iquest;s world wars, genocides, and nuclear weapons. In the 2010s, it is just 1 in 150. This course tries to explain this astonishing shift away from violence. We will look at the history of war from the Stone Age to the robot age, including the conflicts of the 2010s; and we will draw on everything from anthropology and archaeology to biology and psychology, as we try to answer one of the biggest questions of all: will there ever be a world without war?  Students learn how to approach a big, complex, and often very politicized question in an analytical manner.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-SI"
        ],
        "objectID": "216661",
        "number": "THINK 54",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "55",
        "title": "Understanding China through Film",
        "description": "How did China move from an imperial and colonized country to an independent modern nation?  How did the Chinese people transform its tradition, create new ways of life and values, and move toward modernity?  What can the films tell us about the most significant events in modern Chinese culture and history?We will learn about major social and cultural transformations in modern Chinese through film.  We will analyze films as a window on the ongoing narrative of a people making history and responding to a changing circumstances of revolution, reform, political movements, and modernization.  Students will study film images as an art that is intertwined with ordinary people, their lived experiences, cultural habit, moral values, and political consciousness. The course will highlight four major periods: the May Fourth New Culture (1919-1930), the socialist era, the Cultural Revolution, and the reform era of globalization since the 1980s. We will learn to be sensitive to film as a visual and dramatic medium that brings to life Chinese history and culture.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II"
        ],
        "objectID": "217846",
        "number": "THINK 55",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "56",
        "title": "Health Care, Ethics, and Justice",
        "description": "Is there a right to a basic level of health care? Are there limits to how much should be spent on health care? How should resources, like human organs, be allocated?What obligations does the U.S. have regarding health care in resource-poor environments, such as underdeveloped nations?We live in a world of constrained resources. Nowhere are these constraints more controversial and significant than in health care where lives literally hang in the balance of the decisions we make. This course will provide students with the tools to address these questions through the theoretical framework of justice and ethics. We will address the question of allocation at the level of health policy and health economics before applying the concepts to the institutional and bedside level. Using real world examples, you will be asked to actively engage in debating controversial topics such as organ transplants and how to assign scarce ICU beds. Using both empirical data and the framework of ethics, you will be asked to consider how a health care committee, or a hospital, or an individual doctor might make decisions.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-ER"
        ],
        "objectID": "217847",
        "number": "THINK 56",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "57",
        "title": "Progress: Pro and Contra",
        "description": "Where and when did we start believing in human progress? Does progress imply that history has a particular direction or end-goal?nMuch of our everyday thinking about politics, society, and history depends on some implicit or explicit concept of progress. Have we reached a point where we need to replace the idea of progress with that of sustainability? These are some of the questions this course will raise as it looks at how ideas of progress inform western thinking about science, history, evolution, and politics. It will engage with thinkers who argued in favor of the idea of progress as well as thinkers who attacked its presumptions. Reading and critically evaluating philosophical, scientific, and literary texts, we will investigate the different consequences of our residual belief in progress, as well as the consequences of our possible abandonment of that belief.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II"
        ],
        "objectID": "217848",
        "number": "THINK 57",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "59",
        "title": "Worlds of Sound: Learning to Listen",
        "description": "We live in a world of sound. Even deafening silence has a profound sonic quality. In ways that we do not always recognize, our social practices lead us to understand certain sounds as desired signals and filter out others as unwanted noise. How are we hearing the world right now? How have the Coronavirus pandemic, the Black Lives Matter movement, and the other developments of 2020 changed the world of sound in which we live? How have they changed the ways we listen? This class challenges freshmen to become aware of their own listening practices and how those practices affect their perception of the world. We think about how our bodies, our technology, the state, and the market affect what and how we hear. We explore what makes us remember some sounds more than others. Students in this class will write about their own experiences of listening as they develop their own archive of the sounds of Fall 2020; they will produce autoethnographic writing that they can use later to remember this unique historical moment.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II"
        ],
        "objectID": "218900",
        "number": "THINK 59",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "60",
        "title": "American Enemies",
        "description": "It would seem that an enemy should be easy to identify, but this course proposes that this involves deliberation, choice, and an assessment of consequences.  We will explore modern American experiences in defining enemies, here defined as mortal threats to the state and the national collective.  We will focus on ideas, thinking and assumptions rather than historical chronology.  Who are enemies?  How are they defined and by whom?  How are enemies characterized and perceived?  The narrative content of the course would be a historical study of the American engagement with enemies from 1942 to 1990.  We will begin with the war or terror, return to consider the experience of the Japanese enemy of World War II, and then come up through the years of the Cold War and beyond.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "218901",
        "number": "THINK 60",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "61",
        "title": "Living with Viruses",
        "description": "By examining this interplay of viruses and culture, this course challenges students to think beyond conventional disciplinary distinctions through questions about the impact of biology on human behavior as well as the potential of humans to shape biology through genetic engineering. The specific goals of this course are to engage students to examine the microbial world and how they interact with it.  We will examine three overreaching questions: How do viruses effect our lives? How have they shaped our culture? How will they shape our future?  Topics covered will include the question of whether a virus is alive, the importance of immunity, and the role of viruses in not only human culture but what makes us distinctly human.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-SMA"
        ],
        "objectID": "218902",
        "number": "THINK 61",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "62",
        "title": "The Cause is Uncertain",
        "description": "While virtually every death certificate lists a cause of death, what actually caused that death to occur is an unexpectedly more complex question.  This course will focus specifically on causality claims about health and interrogate the methods used to support such claims.  At the same time, by focusing on causality claims about health issues, from cholera to breast cancer and AIDS--the course asks how we might come to useful causal knowledge in the absence of being able to perform those manipulations that have been the hallmark of experimental science.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-SI"
        ],
        "objectID": "218990",
        "number": "THINK 62",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "63",
        "title": "Justice and the University",
        "description": "How do the fundamental purpose of the university, the pursuit of knowledge, and the pursuit of justice coincide? Or do they conflict and pull us in different directions? Our goal in this class will be to focus on the intersection of justice and knowledge by examining how issues of liberty, equality, and security arise on college campuses. University campuses have a long history as sites of activism across a wide variety of domains and this course will cover a number of them including trigger warnings and safe spaces; free speech; ethics in research; Dreamer Act and college access for undocumented persons. Our goal in this course is to get students to think critically about tradeoffs among society's most treasured goals. When these goals come into tension, how should decisions be made about which goal must give way? We aim to teach students how to identify and think about these conflicts and how to craft arguments, both written and oral, in support of their positions, using a variety of source materials.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-ER"
        ],
        "objectID": "218992",
        "number": "THINK 63",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "64",
        "title": "Healing, Illness, Stories",
        "description": "This course focuses on multiple genres of narratives about illness and recovery: memoirs, graphic novels, poetry, fiction, essay, and documentary film.  It asks what the power, if any, of narrative is in healing.  Drawing upon the fields of literature and the practice of medicine, students will begin to grapple with the power of stories in illuminating the experience of illness and disability and in offering the possibilities for (self) transformation.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "DIS",
                "notes": null,
                "classId": "29746",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "LEC",
                "notes": null,
                "classId": "29747",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II"
        ],
        "objectID": "220166",
        "number": "THINK 64",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "65",
        "title": "Preventing Human Extinction",
        "description": "Is human extinction inevitable? Is it necessarily bad for the planet? What might we do to avert human extinction? 99.9% of all species that have inhabited the planet are extinct, suggesting our extinction is also a distinct probability. Yet, the subject of human extinction is one that poses deeply disturbing implications for the thinkers themselves, namely us humans.  This course will explore a series of plausible scenarios that could produce human extinction within the next 100 years and simultaneously consider the psychological, social, and epistemological barriers that keep us from seriously considering (and potentially averting) these risks.  Students will . . .",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-SI",
            "WAY-SMA"
        ],
        "objectID": "220145",
        "number": "THINK 65",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "66",
        "title": "Design that Understands Us",
        "description": "We find ourselves in an age of rapidly evolving technology, where the world we inhabit, increasingly, is the world we make.  At Stanford, you will find many courses that ask you to make things&iquest;everything from algorithms, products, policies, to artworks.  What is rarer is to be given the space to stop and really think about why&iquest;for what and for whom&iquest;we design these things, and whether we should continue to design in ways demanded by commercial and political actors.  This critical thinking course examines the nature, purpose, and meaning of design in human life, and asks the fundamental questions of &iquest;what is design?&iquest;, &iquest;why do we do it?&iquest;, and &iquest;how do design, technology, and society shape one another?&iquest;. We will explore design as a series of choices and the ways in which we make these choices. This course will consider different models of design in our world today: from need-based design (as we are often taught) to the fashioning of tools that help us flourish as human beings. You will learn about various aesthetic and ethical frameworks and a fundamental language of design, so that you can begin to critically analyze everyday examples of media, tools, toys, and games&iquest;and apply such lenses to designing conscientiously. You will learn to think about the design of social networks, artificial intelligence, musical instruments, games, virtual reality, and other examples&iquest;in terms of needs and values, ethics and aesthetics. In short, through this course, you will learn to more clearly and critically view our technology-drenched human world&iquest;and to exercise your ethical and artful imagination to reimagine better worlds.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II",
            "WAY-CE"
        ],
        "objectID": "220161",
        "number": "THINK 66",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "67",
        "title": "What Makes Music Classical?",
        "description": "This course asks a question that can elicit a variety of responses. Classical music means different things to different people. For some it connotes Western art music of a particular historical era. According to this understanding, classical music follows baroque music and is superseded by romantic music; it develops a style, the classical style, as perfected by Haydn and Mozart. For others classical music has broader significance, referring to a cultural practice that predates the eighteenth century, going as far back as Gregorian chant and extending through the present. There are a variety of factors that define that practice, some more enduring than others: transmission through musical notation, theories of tonal systems, techniques of composition. Formal analysis, though often considered a sub-discipline of music theory and hence purely descriptive and objective, is hardly value free. Aesthetic interests and prejudices come into play, whether implicitly or explicitly.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II"
        ],
        "objectID": "220162",
        "number": "THINK 67",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "68",
        "title": "Our Genome",
        "description": "Genomes reveal a wealth of information with implications far beyond the linear sequence of the DNA. We will consider two questions related to the genome, coupled with examples from real-life consequences. Firstly, what does the genome say about our past: where we came from and how we might fit into the tapestry of the human race? We will look at examples from history and anonymized patients to highlight the consequences of these question for people. Next we will consider what the genome tells us about the future: how might it foretell our individual future and how might this be translated into patient treatment? We will examine the promises, pitfalls, and implications for the advances in medicine and healthcare promised by genomic research.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-SMA"
        ],
        "objectID": "221373",
        "number": "THINK 68",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "THINK",
        "code": "69",
        "title": "Emotion",
        "description": "In this course, we address basic issues about emotions and their place in human life from the perspectives of philosophy and psychology. We ask four fundamental questions: What is emotion? What is the appropriate place for emotions in our lives? How should we manage our emotions? Do emotions threaten the integrity of the agent?  For instance, in asking how we manage our emotions, students will consider the Stoic view that emotions must be extirpated alongside psychological perspectives on the theoretical and empirical frameworks on emotion regulation.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "College",
            "THINK",
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "221374",
        "number": "THINK 69",
        "units": [
            4
        ]
    }
]