[
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "27D",
        "title": "The Detective and the City",
        "description": "This seminar will analyze the social reality of three historic cities (London in the 1890s, San Francisco and Los Angeles in the 1920s and 30s, and Shanghai in the 1990s) through the prism of popular crime fiction featuring four great literary detectives (Arthur Conan Doyle's Sherlock Holmes, Dashiell Hammett's Sam Spade, Roman Polanski's Jake Gittes, and Qiu Xiaolong's Chief Inspector Chen). As a student in this course, you will explore why crime fiction is so popular, why the fear of crime - or perhaps just a fascination with crime --  is so much a part of modern urban culture, and why the police detective and the private investigator have become iconic code heroes of pulp fiction, movies, TV shows, and even video games. If you take this class, you will have the opportunity to write a paper and present your research on one of the classic literary detectives, another literary detective of your own choosing, or on one of today's related manifestations of the same impulse in popular visual culture featuring superheroes, vampires, and the zombie apocalypse.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "225104",
        "number": "URBANST 27D",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "27Q",
        "title": "The Detective and the City",
        "description": "This seminar is based on the idea that there are many urban literatures and that Urban Studies, as a broadly interdisciplinary field, needs to look at fiction, music, visual art, cinema, and other forms of expression beyond just the standard social sciences for evidence of the human experience of living in cities. We will analyze the social reality of several historic cities (London in the 1890s, San Francisco and Los Angeles in the 1920s and 30s, and Shanghai in the 1990s) through the prism of popular crime fiction featuring four great literary detectives (Arthur Conan Doyle's Sherlock Holmes, Dashiell Hammett's Sam Spade, Roman Polanski's Jake Gittes, and Qiu Xiaolong's Chief Inspector Chen). As a student in this course, you will explore why crime fiction is so popular, why the fear of crime - or perhaps just a fascination with crime -- is so much a part of modern urban culture, and why the police detective and the private investigator have become iconic code heroes of popular culture You will participate in classroom discussions, write a final paper, and present your research on a subject of your own choice &iquest; maybe one of the literary or cinematic detectives already mentioned, or perhaps another literary/cinematic detective of your own choosing, or even on one of today's related manifestations of the same impulse in popular literature or visual culture featuring superheroes, vampires, and the zombie apocalypse.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ISS",
                "notes": "Introductory Seminar. Preference to sophomore and new transfer students; first-year students admitted if space available. Advance sign-up process and deadlines at https://exploreintrosems.stanford.edu/.",
                "classId": "14547",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Thornton 211",
                        "instructors": [
                            {
                                "name": "Stout, F.",
                                "sunet": "fstout"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "217092",
        "number": "URBANST 27Q",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "65SI",
        "title": "Transportation and the Future City (CEE 65SI)",
        "description": "What should a 'city of the future' look like? This weekly speaker series will provide a broad overview to the fields of transportation engineering and city planning and how they intersect with the overarching issues of sustainability, energy, technology, equity, and climate change. Guest speakers from the transportation industry will introduce the week's topic, dive into relevant applications and case studies, and discuss their professional backgrounds and/or organizations.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ACT",
                "notes": "Course coordinator: Brandon Kenery.",
                "classId": "14930",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Glanz, D.",
                                "sunet": "dglanz"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224068",
        "number": "URBANST 65SI",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "66Q",
        "title": "Local Government in Action",
        "description": "The purpose of this course is to give First Years and Sophomores a better understanding of the importance and relevance of local government, as well as the knowledge, resources, confidence, and experience to explore careers in public service. It is based on last year&iquest;s PubPol 21/22SI. It will include a broad-based introduction to local government with guest speakers and case studies. Students will also work with local community partners to provide policy recommendations for real world projects (last year they included civic infrastructure in Stockton, electric vehicle infrastructure in Pacifica, and environmental justice and sustainability in Mountain View). An example of a project deliverable from last year&iquest;s course, the white paper developed for the City of Pacifica, can be found here. Dan Rich, Lecturer and former city manager, will be the Principal Instructor for the course, supported by three students involved in last year&iquest;s class.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "224922",
        "number": "URBANST 66Q",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "83N",
        "title": "City, Space, Literature (ENGLISH 83N)",
        "description": "This course presents a literary tour of various cities as a way of thinking about space, representation, and the urban. Using literature and film, the course will explore these from a variety of perspectives. The focus will be thematic rather than chronological, but an attempt will also be made to trace the different ways in which cities have been represented from the late nineteenth century to recent times.  Ideas of space, cosmopolitanism, and the urban will be explored through films such as The Bourne Identity and The Lunchbox, as well as in the writings of  Arthur Conan Doyle, Walter Mosley, Virginia Woolf, James Joyce, Fiston Mwanza Mujila, Karen Tei Yamashita, and Mohsin Hamid, among others.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "221487",
        "number": "URBANST 83N",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "101A",
        "title": "The New York City Seminar (Remote)",
        "description": "*This class is being offered in collaboration with Stanford in New York, Bing Overseas Studies Program, and must be taken in conjunction with an internship. Registration code required.n nThe (Remote) NYC Seminar will employ a structured, experiential education model to enrich the value of a remote internship experience arranged in advance through Stanford in New York. Through goal setting, deep reflection on experiences, and expression and documentation of learning outcomes, students will gain greater awareness of work-related interests, skills, and abilities and how they integrate with intellectual and personal interests and pursuits. Through readings, virtual experiences, and class discussions, the seminar will also consider the critical qualities and tensions that make New York City special and how the fields and organizations represented by student internships contribute to making New York what it is and vice versa. For more information, please contact stanfordNY@stanford.edu.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "222582",
        "number": "URBANST 101A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "103C",
        "title": "Housing Visions (CEE 33C)",
        "description": "This course provides an introduction to American Housing practices, spanning from the Industrial Age to the present. Students will examine a range of projects that have aspired to a range of social, economic and/or environmental visions.  While learning about housing typologies, students will also evaluate the ethical role that housing plays within society.  The course focuses on the tactical potentials of housing, whether it is to provide a strong community, solve crisis situations, integrate social services, or encourage socio-economic mixture.  Students will learn housing design principles and organizational strategies, and the impact of design on the urban environment.  They will discuss themes of shared spaces and defensible spaces; and how design can accommodate the evolving demographics and culture of this country. For example, how can housing design address the changing relationship between living and working?  What is the role of housing and ownership in economic mobility? These issues will be discussed within the context the changing composition of the American population and economy.  n nThis course will be primarily discussion-based, using slideshows, readings and field trips as a departure points for student-generated conversations. Each student will be asked to lead a class discussion based on his/her research topic. Students will evaluate projects, identifying which aspects of the initial housing visions were realized, which did not, and why.  Eventually, students might identify factors that lead to &iquest;successful&iquest; projects, and/or formulate new approaches that can strengthen or redefine the progressive role of housing: one inclusive of the complex social, economic, and ethical dimensions of design.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "220790",
        "number": "URBANST 103C",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "108H",
        "title": "Housing Affordability Crisis in California:  Causes, Impacts, and Solutions (PUBLPOL 108H)",
        "description": "This course will divided into three sections that when combined provide 1) the overall narrative of the precedents and adverse impacts of the worldwide, US west coast and California housing crises and the frameworks for California to create a balanced housing market without causing extreme displacement; 2) an overview of the planning, regulatory and development environments in California along with an opportunities/threats analysis to illuminate current opportunities to achieve a balanced housing market; and 3) an overview of the federal, state, regional and local housing policy environments and areas of policy work addressing and responding to the California housing crisis.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15307",
                "currentClassSize": "0",
                "maxClassSize": "38",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "LeSar, J.",
                                "sunet": "jlesar64"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221997",
        "number": "URBANST 108H",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "109",
        "title": "Physics of Cities (CEE 6)",
        "description": "An introduction to the modern study of complex systems with cities as an organizing focus. Topics will include: cities as interacting systems; cities as networks; flows of resources and information through cities; principles of organization, self-organization, and complexity; how the properties of cities scale with size; and human movement patterns. No particular scientific background is required, but comfort with basic mathematics will be assumed. Prerequisites: MATH 19 and 20, or the equivalent",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29604",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SMA"
        ],
        "objectID": "218312",
        "number": "URBANST 109",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "110",
        "title": "Introduction to Urban Studies (HISTORY 107)",
        "description": "Today, for the first time in history, a majority of people live in cities. By 2050, cities will hold two-thirds of the world's population. This transformation touches everyone, and raises critical questions. What draws people to live in cities? How will urban growth affect the world's environment? Why are cities so divided by race and by class, and what can be done about it? How do cities change who we are, and how can we change cities? In this class, you will learn to see cities in new ways, from the smallest everyday interactions on a city sidewalk to the largest patterns of global migration and trade. We will use specific examples from cities around the world to illustrate the concepts that we learn in class. The course is intended primarily for freshmen and sophomores.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29105",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-AmerCul",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "130926",
        "number": "URBANST 110",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "111A",
        "title": "The Politics of the American City",
        "description": "This course will focus on American urban politics &iquest;- the distinctive nature of local government, its relationship to state government and the separation of powers between states and the federal government. Certain theories about political decision-making and power sharing will be explored. We will try to develop a national perspective on the political dynamics of urban governments and we will probe certain policy areas such as economic development to understand how political choice is embedded within the allocation of resources to meet human needs. The growing transformation among American urban areas due to the rise of the global economy will also be examined. The course will be composed of lectures, class discussions and graded exercises.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29550",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "217252",
        "number": "URBANST 111A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "112",
        "title": "The Urban Underclass (CSRE 149A, SOC 149, SOC 249)",
        "description": "(Graduate students register for 249.) We explore the history of residential segregation, urban policy, race, discrimination, policing and mass incarceration in the US. What are the various causes and consequences of poverty? How do institutions that serve the poor work and sometimes fail? We will read deeply into the social, political, and the legal causes of today&iquest;s conflicts.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28400",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "DIS",
                "notes": null,
                "classId": "28399",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-AmerCul",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "124509",
        "number": "URBANST 112",
        "units": [
            4
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "113",
        "title": "Introduction to Urban Design: Contemporary Urban Design in Theory and Practice",
        "description": "Comparative studies in neighborhood conservation, inner city regeneration, and growth policies for metropolitan regions. Lect-disc and research focusing on case studies from North America and abroad, team urban design projects. Two Saturday class workshops in San Francisco: 2nd and 4th Saturdays of the quarter.  Terms: Win | Units: 5 | UG Reqs: GER:DBSocSci | Grading: Letter (ABCD/NP)",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15180",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Glanz, D.",
                                "sunet": "dglanz"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-CE",
            "WAY-SI"
        ],
        "objectID": "130971",
        "number": "URBANST 113",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "114",
        "title": "Urban Culture in Global Perspective (ANTHRO 126)",
        "description": "Core course for Urban Studies majors. A majority of the world's population now live in urban areas and most of the rapid urbanization has taken place in mega-cities outside the Western world. This course explores urban cultures, identities, spatial practices and forms of urban power and imagination in Asia, Africa and Latin America. Participants will be introduced to a global history of urban development that demonstrates how the legacies of colonialism, modernization theory and global race thinking have shaped urban designs and urban life in most of the world. Students will also be introduced to interpretative and qualitative approaches to urban life that affords an understanding of important, if unquantifiable, vectors of urban life: stereotypes, fear, identity formations, utopia, social segregation and aspirations. Significant work outside of class time is expected of the student for this course.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "14343",
                "currentClassSize": "0",
                "maxClassSize": "45",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:50:00 AM",
                        "location": "Lathrop 299",
                        "instructors": [
                            {
                                "name": "Hansen, T.",
                                "sunet": "tbhansen"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 39000.0,
                        "days": "Monday Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": "Discussion will meet in 40-41J.",
                "classId": "14165",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "5:30:00 PM",
                        "endTime": "6:20:00 PM",
                        "location": "STLC 105",
                        "instructors": [
                            {
                                "name": "Sigley, A.",
                                "sunet": "asigley"
                            }
                        ],
                        "startTimestamp": 63000.0,
                        "endTimestamp": 66000.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": "Discussion will meet in 50-51A.",
                "classId": "14166",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": "100-101K",
                        "instructors": [
                            {
                                "name": "Chen, R.",
                                "sunet": "ronyc"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "207461",
        "number": "URBANST 114",
        "units": [
            5
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "115",
        "title": "Urban Education (AFRICAAM 112, CSRE 112X, EDUC 112, EDUC 212, SOC 129X, SOC 229X)",
        "description": "(Graduate students register for EDUC 212 or SOC 229X). Combination of social science and historical perspectives trace the major developments, contexts, tensions, challenges, and policy issues of urban education.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "28836",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "9:00:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Ceras 308",
                        "instructors": [
                            {
                                "name": "pearman, f.",
                                "sunet": "apearman"
                            }
                        ],
                        "startTimestamp": 32400.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-EDP"
        ],
        "objectID": "201446",
        "number": "URBANST 115",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "123A",
        "title": "Designing Research for Social Justice: Writing a Community-Based Research Proposal (CSRE 146A)",
        "description": "This course will support students in designing and writing a community-engaged research proposal. In contrast to &quot;traditional&quot; forms of research, community-engaged research uses a social justice lens in seeking to apply research to benefit communities most impacted. Community-engaged researchers also aim to challenge the power relationship between &quot;researchers&quot; and &quot;researched&quot; by working side by side with community partners in the design, conceptualization, and actualization of the research process. In this course, students will learn how to write a community-engaged research proposal. This involves forming a successful community partnership, generating meaningful research questions, and selecting means of collecting and analyzing data that best answer your research questions and support community partners. The course will also support students in developing a grounding in the theory and practice of community-engaged research, and to consider the ethical questions and challenges involved. By the end of the course, students should have a complete research proposal that can be used to apply for a number of summer funding opportunities including the Chappell Lougee Scholarship, the Community-Based Research Fellowship, Cardinal Quarter fellowships, and Major Grants.  Please note that completion of the course does not guarantee funding-- rather, the course supports you in learning how to write a strong community-engaged research proposal that you can use to apply to any number of fellowships). This course is also useful for students in any academic year who are interested in pursuing community-engaged theses or capstone projects.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "204083",
        "number": "URBANST 123A",
        "units": [
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "123B",
        "title": "Community Engaged Research - Principles, Ethics, and Design (CSRE 146B, CSRE 346B)",
        "description": "This course is designed to support students planning to participate in community engaged research experiences during the summer 2023 term. Course materials and discussions will promote deep engagement with, and reflection on, the principles, practices, and ethics of community engaged research as a unique orientation to scholarly inquiry and social action that centers the interests and assets of the communities with whom researchers partner.  On a practical level, the course will help students develop or clarify a collaborative research design process and build professional and project-specific skills in consultation with their mentors and community collaborators. This is a required course for students participating in the Haas Center for Public Service Community-based Research Fellows Program, but enrollment is open to all Stanford students. We particularly encourage the involvement of students who will be participating in partnership-based research activities over the summer.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "15037",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hurd, C.",
                                "sunet": "churd"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "216124",
        "number": "URBANST 123B",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "124",
        "title": "Spatial Approaches to Social Science (ANTHRO 130D, ANTHRO 230D, POLISCI 241S)",
        "description": "This multidisciplinary course combines different approaches to how GIS and spatial tools can be applied in social science research. We take a collaborative, project oriented approach to bring together technical expertise and substantive applications from several social science disciplines. The course aims to integrate tools, methods, and current debates in social science research and will enable students to engage in critical spatial research and a multidisciplinary dialogue around geographic space.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-AQR",
            "WAY-SI"
        ],
        "objectID": "211001",
        "number": "URBANST 124",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "125",
        "title": "Shades of Green: Exploring and Expanding Environmental Justice in Practice (CSRE 125E, EARTHSYS 125, EARTHSYS 225)",
        "description": "Historically, discussions of race, ethnicity, culture, and equity in the environment have been shaped by a limited view of the environmental justice movement, often centered on urban environmental threats and separated from other types of environmental and climate advocacy. This course will seek to expand on these discussions by exploring topics such as access to outdoor spaces, definitions of wilderness, inclusion in environmental organizations, gender and the outdoors, the influence of colonialism on ways of knowing, food justice and ethics, and the future of climate change policy. The course will also involve a community partnership project. In small groups students will work with an environmental organization to problem-solve around issues of equity, representation, and access. We value a diversity of experiences and epistemologies and welcome undergraduates from all disciplines. Since this is a practical course, there will be a strong emphasis on participation and commitment to community partnerships. This course requires instructor approval, please submit an application by March 16th at midnight. Application available at https://docs.google.com/forms/d/e/1FAIpQLScUPqBjGGkM18JSAjG1ecZgXlIS9pFUIUebLMyfthSLx9K-QQ/viewform?usp=sf_link",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "14767",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Diver, S.",
                                "sunet": "sibs"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP"
        ],
        "objectID": "218595",
        "number": "URBANST 125",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "126A",
        "title": "Ethics and Leadership in Public Service (CSRE 126C, EDUC 126A, ETHICSOC 79)",
        "description": "This course explores ethical questions that arise in public service work, as well as leadership theory and skills relevant to public service work. Through readings, discussions, in-class activities, assignments, and guest lectures, students will develop a foundation and vision for a future of ethical and effective service leadership. This course serves as a gateway for interested students to participate in the Haas Center's Public Service Leadership Program.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29465",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lobo, K.",
                                "sunet": "klobo"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Monday Wednesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "208204",
        "number": "URBANST 126A",
        "units": [
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "127A",
        "title": "Community Organizing: People, Power & Change",
        "description": "Organizers ask three questions: who are my people, what challenges do they face, and how can they turn their resources into the power they need to meet these challenges? Organizing requires leadership: accepting responsibility for enabling others to achieve shared purpose in the face of uncertainty. Organizers identify, recruit, and develop leadership; build community around that leadership; and build power from the resources of that community. In this fellowship course, students will build their coaching and leadership skills to support other students in the craft of community organizing. Students will be introduced to the five core leadership practices: public narrative, building relationships, structure, strategy, and action. In the first module, students will learn what coaching is and how to coach one another through leadership challenges. We will then focus on public narrative in the context of organizing. Students will learn to tell their own public narrative, coach one another on their public narratives, and learn how to use public narrative to analyze responses to leadership challenges. Students will receive the opportunity to coach other students at a public narrative workshop week 4 of the quarter. We will build off of the knowledge and skills students gain in the first module by diving into the remaining leadership practices: relationships, structure, strategy, and action. Students will apply the organizing principles by viewing the fellowship experience as a campaign - who is our constituency? What is our strategic goal? How will we reach it? Students will leave the retreat with a draft of our collective strategic plan. In the remaining three sessions, students will take the lead in facilitating and practicing the activities and skills modeled during the retreat in preparation for coaching at the Winter Intensive.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": "This class meets in the CIRCLE Common Room on the 3rd Floor of Old Union.",
                "classId": "14818",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Hahn Tapper, L.",
                                "sunet": "lhahn"
                            },
                            {
                                "name": "Kokenis, T.",
                                "sunet": "tkokenis"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223967",
        "number": "URBANST 127A",
        "units": [
            2,
            3,
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "127B",
        "title": "Leadership, Organizing and Action: Intensive (CSRE 127B, ETHICSOC 127B, LEAD 127B)",
        "description": "Two Consecutive Weekend Course: Community Organizing makes a difference in addressing major public challenges that demand full engagement of the citizenry, especially those whose voices are marginalized. In this course you will learn and practice the leadership skills needed to mobilize your communities for positive social change. We identify leadership as accepting responsibility to enable others to achieve shared purpose in the face of uncertainty. As organizers you will learn how to develop capacity within your community and analyze power dynamics to develop a strategic plan. By the end of this course, you will create an organizing campaign that builds power rooted in the resources of your community. The class will be an intensive held the first two weekends of winter quarter, Jan 12-14 and Jan 19-21, 2024. Class begins on Friday in the afternoon and runs through early Sunday evening. In weeks 3-10 there will be team meetings schedule TBD along with one final all class gathering Week 7 or 10.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": "The class will be an intensive held the first two weekends of winter quarter, Jan 12-14 and Jan 19-21, 2024. This class meets in the CIRCLE Common Room on the 3rd Floor of Old Union.",
                "classId": "15404",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hahn Tapper, L.",
                                "sunet": "lhahn"
                            },
                            {
                                "name": "Kokenis, T.",
                                "sunet": "tkokenis"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224851",
        "number": "URBANST 127B",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "127C",
        "title": "Leadership, Organizing and Action: Campaign Coaching (ETHICSOC 127C)",
        "description": "Community Organizing makes a difference in addressing major public challenges that demand full engagement of the citizenry, especially those whose voices are marginalized. In this course you will learn and practice the leadership skills of campaign coaching in order to facilitate others to mobilize their communities for positive social change. Enrollment by consent of instructor.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class meets in the CIRCLE Common Room on the 3rd Floor of Old Union.",
                "classId": "15399",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hahn Tapper, L.",
                                "sunet": "lhahn"
                            },
                            {
                                "name": "Kokenis, T.",
                                "sunet": "tkokenis"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224868",
        "number": "URBANST 127C",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "130",
        "title": "Planning Calif: the Intersection of Climate, Land Use, Transportation & the Economy (CEE 136, CEE 236, PUBLPOL 130, PUBLPOL 230)",
        "description": "Cities and urban areas have always been transformed by major external changes like pandemics and public health crises. California is both in the midst of its greatest economic recession since the Great Depression and experiencing a pandemic that has the potential to reshape many aspects of life. Planning for cities and regions, however, is a long game that requires follow-through on decisions made sometimes over many decades. How do we balance the shocks to our assumptions from the current Covid world with the need to plan long-term for issues like affordable housing and equitable cities, and perhaps most fundamentally, prepare our cities and communities for the inevitability of climate change and climate impact? nnnnThis course takes an interdisciplinary view of the key contemporary planning topics in California. It does so from looking at the intersection of climate laws, land use changes, the need for housing, travel patterns and the availability of high quality jobs and employment. This course will give you an understanding of the roles of key levels of government, from the state to the region/metropolitan scale, to the city and county, down to the neighborhood and parcel level. it will give students insight into leading themes and issues of the day in California such as the future of downtowns, the role of high speed rail, the impact of telework, automation in the construction of housing, drawing from examples in San Jose and San Francisco, the Central Valley, the state legislature, Southern California. Within each of these topics we will look at the impact of decisions on equity as well as climate and the economy. nnnnThe instructors are Kristy Wang, formerly SPUR&iquest;s Community Planning Policy Director, and Egon Terplan, Senior Advisor for Economic Development and Transportation in the California Governor&iquest;s Office, formerly SPUR&iquest;s Regional Planning Director. (Affiliations for identification purposes only)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29931",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218876",
        "number": "URBANST 130",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "131",
        "title": "Very Impactful People (V.I.P.):  Social Innovation & the Impact Entrepreneur",
        "description": "Engage with founders of leading high-impact ventures. Guest impact entrepreneurs will share their journeys to launch social and environmental innovations. The weekly line-up will feature accomplished, values-driven founders. Students will be exposed to the perspectives and endeavors of global high-impact entrepreneurs who address social and environmental needs in the U.S. and internationally through for-profit, nonprofit and hybrid models. Each week students will have the opportunity to directly converse with guest impact entrepreneurs. This class will expose students to pioneering thought leaders, diverse career paths, networking and potential internship and job opportunities.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "10984",
                "currentClassSize": "0",
                "maxClassSize": "80",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "300-300",
                        "instructors": [
                            {
                                "name": "Edwards, M.",
                                "sunet": "edwards1"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "200829",
        "number": "URBANST 131",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "132",
        "title": "Concepts and Analytic Skills for the Social Sector (EARTHSYS 137)",
        "description": "How to develop and grow innovative nonprofit organizations and for-profit enterprises which have the primary goal of solving social and environmental problems. Topics include organizational mission, strategy, market/user analysis, communications, funding, recruitment and impact evaluation. Perspectives from the field of social entrepreneurship, design thinking and social change organizing. Opportunities and limits of using methods from the for-profit sector to meet social goals. Focus is on integrating theory with practical applications, including several case exercises and simulations. One-day practicum where students advise an actual social impact organization. Enrollment limited to 20.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Please note, this class will end at 1pm.",
                "classId": "7666",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-SI"
        ],
        "objectID": "117048",
        "number": "URBANST 132",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "133",
        "title": "Social Enterprise Workshop (EARTHSYS 133)",
        "description": "Social Enterprise Workshop:  A team based class to design solutions to social issues.  In the class students will identify issues they are interested in, such as housing, food, the environment, or college access.  They will join teams of like-minded students.  Working under the guidance of an experienced social entrepreneur, together they will develop a solution to one part of their issue and write a business plan for that solution.  The class will also feature guests who are leaders in the field of social entrepreneurship who will share their stories and help with the business plans.  The business plan exercise can be used for both nonprofits and for-profits.  Previous students have started successful organizations and raised significant funds based on the business plans developed in this class.  There are no prerequisites, and students do not need to have an idea for a social enterprise to join the class. Enrollment limited to 20. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "27281",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": "300-303",
                        "instructors": [
                            {
                                "name": "Scher, L.",
                                "sunet": "scher"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "202293",
        "number": "URBANST 133",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "134",
        "title": "Justice and Cities (POLISCI 233)",
        "description": "Cities have most often been where struggles for social justice happen, where injustice is most glaring and where new visions of just communities are developed and tested. This class brings political theories of justice and democracy together with historical and contemporary empirical work on city design, planning, and policies to ask the following questions: What makes a city just or unjust? How have people tried to make cities more just? What has made these efforts succeed or fail? Each session will include a case study of a particular city, largely with a focus on the United States. Students will develop research projects examining a city of their choice through the lens of a particular aspect of justice and injustice.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-ER"
        ],
        "objectID": "219302",
        "number": "URBANST 134",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "135",
        "title": "Challenging the Status Quo: Social Entrepreneurs Advancing Democracy, Development and Justice (AFRICAST 142, AFRICAST 242, CSRE 142C, INTNLREL 142)",
        "description": "This community-engaged learning class is part of a broader Program on Social Entrepreneurship at the Haas Center for Public Service. It will use practice to better inform theory about how innovation can help address societies biggest challenges. Working with the instructor and three visiting nonprofit social entrepreneurs in residence, students will use case studies of successful and failed social change strategies to explore relationships between social entrepreneurship, race, democracy and justice. This course interrogates approaches like design theory, measuring impact, fundraising, leadership, storytelling and policy advocacy and explores how they can address issues like ending homelessness, fighting the COVID-19 pandemic and achieving racial justice, with a particular focus on California. This is a community-engaged learning class in which students will learn by working on projects that support the social entrepreneurs' efforts to promote social change. Students should register for either 3 OR 5 units only. Students enrolled in the full 5 units will have a service-learning component along with the course. Students enrolled for 3 units will not complete the service-learning component. Limited enrollment. Attendance at the first class is mandatory in order to participate in service learning.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class will take place in the DK room at the Haas Center.",
                "classId": "14084",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Janus, K.",
                                "sunet": "kakelly"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 58800.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "212837",
        "number": "URBANST 135",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "136",
        "title": "The Sharing Economy (PUBLPOL 136)",
        "description": "The rapid growth of the sharing economy, sometimes also called the peer to peer economy, is made possible by the ubiquity of smart phones, inefficiency of ownership, and measures designed to create and measure trust among participants.  The course will explore not only the rapid rise of certain companies but also the shadow side of commercialized relationships.  We will examine the economics and development consequences of the sharing economy, primarily with an urban focus, along an emphasis on the design of platforms and markets, ownership, the nature of work, environmental degradation and inequality.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "217715",
        "number": "URBANST 136",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "138",
        "title": "Smart Cities & Communities",
        "description": "A city is essentially an organism,  a complex system of systems and it inhabitants. A nexus of forces - IoT, data, systems of insight, and systems of engagement - present an unprecedented opportunity to increase the efficiency of urban systems, improve the efficacy of public services, and to assure the resiliency of the community against both chronic stresses and acute shocks.nnThe course will provide you with an understanding of the foundational elements of a smart city and address the breadth of systems that comprise it: built infrastructure, energy, water, transportation, food production/distribution, and public/social services. Case studies will be used to illustrate the approaches, benefits, and risks involved.  It will discuss what IT can and cannot do, and most importantly given the control and privacy implications of many &iquest;smart&iquest; IT systems, what the smart city should and should not do. nnPanel discussions and  guest speakers from the public sector and industry leading technology providers will  give students an opportunity to engage with the architects and operators of Smart Cities.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "219653",
        "number": "URBANST 138",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "140F",
        "title": "Casablanca - Algiers - Tunis : Cities on the Edge (COMPLIT 236A, CSRE 140S, FRENCH 236, FRENCH 336, HISTORY 245C, JEWISHST 236A)",
        "description": "Casablanca, Algiers and Tunis embody three territories, real and imaginary, which never cease to challenge the preconceptions of travelers setting sight on their shores. In this class, we will explore the myriad ways in which these cities of North Africa, on the edge of Europe and of Africa, have been narrated in literature, cinema, and popular culture. Home to Muslims, Christians, and Jews, they are an ebullient laboratory of social, political, religious, and cultural issues, global and local, between the nineteenth and twenty-first centuries. We will look at mass images of these cities, from films to maps, novels to photographs, sketching a new vision of these magnets as places where power, social rituals, legacies of the Ottoman and French colonial pasts, and the influence of the global economy collude and collide. Special focus on class, gender, and race.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29788",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-EDP"
        ],
        "objectID": "220414",
        "number": "URBANST 140F",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "141",
        "title": "Gentrification (CSRE 141)",
        "description": "Neighborhoods in the Bay Area and around the world are undergoing a transformation known as gentrification. Middle- and upper-income people are moving into what were once low-income areas, and housing costs are on the rise. Tensions between newcomers and old timers, who are often separated by race, ethnicity, or sexual orientation, can erupt; high rents may force long-time residents to leave. In this class we will move beyond simplistic media depictions to explore the complex history, nature, causes and consequences of this process. Students will learn through readings, films, class discussions, and engagement with a local community organization.  (Cardinal Course certified by the Haas Center)",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29529",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "217226",
        "number": "URBANST 141",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "141A",
        "title": "Urban Schools, Social Policy, and the Gentrifying City (CSRE 291, EDUC 390)",
        "description": "This course is designed to help students develop a more sophisticated understanding of educational inequality in the contemporary U.S. city. This course will survey existing literature about the intersection of gentrification and urban schooling, focusing on policies and practices that gave rise to the current urban condition, theory and research about urban redevelopment, collateral consequences for schools and communities, and how these issues relate to the structure and governance of urban schools as well as to the geography of opportunity more broadly.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "222084",
        "number": "URBANST 141A",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "143",
        "title": "MAXIMUM CITY: Post-Colonial Mumbai at the Crossroads of Global and South Asian Culture (ANTHRO 128B)",
        "description": "There are few cities more emblematic of the rapid urbanization of today's global population than Mumbai, India, formerly known as Bombay. With over 20 million residents, Mumbai today stands as the most populous city in one of the world's most populous countries, an ever-expanding metropolis marked by starkclass disparities and a heterogenous collage of religious, ethnic, and caste communities struggling to find space on a narrow peninsula painstakingly reclaimed from the Arabian Sea. The city's glitz, glamour, and diversity have long made it an object of fascination for both Indians and foreigners alike. Not only is Mumbai a major engine of culture and politics within India, but the city also has a long history of furnishing imagery of South Asian life to the wider world, whether as a site for documentaries and novels or through colorful Bollywood films. In this course, students will have the opportunity to use Mumbai as a jumping-off point to explore South Asian culture and society, as well as contemporary themes in global urban studies: How do issues such as gentrification, rural-urban migration, segregation, the globalization of capitalism, and decolonialization play out in a city such as Mumbai? What happens to supposedly timeless identities such as religion, caste, and ethnicity when they are subjected to the pressures of intense urbanization? What kinds of data can we use to answer these questions, and what are their respective strengths and limitations?We will address these questions through a wide range of materials, including film, literature, and academic texts. By the end of the quarter, students should not only find themselves with expanded knowledge of South Asia, Mumbai, and global urbanism, but also with increased confidence regarding the types of data, methodology, and analysis they can employ in their own projects. No prior knowledge of South Asia or urban studies is assumed for this course.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "224417",
        "number": "URBANST 143",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "144U",
        "title": "Cape to Cairo: Decolonization and African Urban Life 1940s-1960s (AFRICAAM 46, CSRE 46, HISTORY 46S)",
        "description": "Decolonization across Africa was complicated, messy and sometimes violent. It was also an important moment for (re) imagining and (re)structuring society resulting in fascinating historical encounters among different groups. This course explores decolonization through the lens of different African urban spaces. In doing so, we shall focus on the major conflicts, debates and issues that emerged in the moment of decolonization. Additionally, we shall explore the different ways Africans survived, lived and thrived in the cities. Finally, we shall explore the relationships between the colonial and postcolonial eras through African urban spaces.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224522",
        "number": "URBANST 144U",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "146",
        "title": "Retaking the Commons: Public Space and Heritage for Sustainable Cities",
        "description": "As cities develop and grow, green spaces, heritage sites, parks, and historic neighborhoods have come under increasing pressure. While common pool resources are held in the public trust, who governs them? Who advocates for them, and who enjoys them? Using economic, social, environmental and cultural lenses, this course explores how maintaining civic spaces, protecting heritage resources, and re-imagining the role of &iquest;public goods&iquest; in the life of a city can yield more sustainable and beneficial outcomes. We also consider best practices from UNESCO and UN HABITAT, and the crucial role of citizenship and democracy. Recommended field work in Hong Kong in September 2017",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "219360",
        "number": "URBANST 146",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "147",
        "title": "Archaeology of Human Rights (ANTHRO 112A)",
        "description": "This introductory seminar provides a critical vantage point about human rights discourse from an archaeological perspective. The seminar is organized around four main questions: (1) Is cultural heritage a human right? (2) What are archaeologists learning about how the material and temporal dimensions of power and resistance? (3) How is archaeological evidence being used in investigations of human rights violations? (4) Can research about the past shape the politics of the present? Topics to be discussed include archaeological research on mass internment, colonialism, enslavement and coerced labor, ethnic cleansing, homelessness, gender discrimination, indigenous rights, and environmental justice.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "219474",
        "number": "URBANST 147",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "148",
        "title": "Who Owns Your City?: Institutional Real Estate Seminar",
        "description": "An intensive one-week hands-on introductory seminar designed to allow students to understand and interact with all aspects of the real estate investment process, including property development, local government interplay, value creation, [deal analysis, innovation, and disruptive tech.] Course activities will include asset tours, case studies, and project deep dives. This class is intended for all students looking to better understand real estate as an investment asset class and acritical part of the modern global economy. Note: This course will meet during spring break, and enrollment is by permission of instructor. To apply for permission to enroll, please fill out this form: https://docs.google.com/forms/d/e/1FAIpQLSdBc52haIfkWVk9T49ZwEjk3lqV1mSakUPUWos05FGNpCahUA/viewform?usp=sf_link . Application opens January 2, 2023; deadline is 11:59 pm on February 15, 2023.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class meets during spring break 3/27 through 3/31 in room 100-101K.",
                "classId": "14802",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219754",
        "number": "URBANST 148",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "148A",
        "title": "Cities and Creativity: Cultural and Architectural Interpretations of Madrid",
        "description": "This class is being offered in collaboration with Stanford in Madrid, Bing Overseas Studies Program. Focused on the artistic and architectural aspects of cities, this course fosters students' creative sensibilities through six basic approaches:  experiment, research, analyze, interpret, think and do. These approaches will help students understand the sociocultural dimension of the human being within the urban context, where the inherent vitality of creativity lies. The case of Madrid is used as a framework for analysis and interpretation, since it provides the extraordinary opportunity to carry out activities and online experiences charged with significance in the setting of the city. Understanding the architecture of cities as an artistic result of society in each historic period helps to assess their formative capacity and their sociocultural impact. The aim is to analyze and interpret the cultural and educational mission of the city, using theoretical supports and researching relevant urban and architectural places of Madrid, seeing the city as a whole organism that for centuries has gone through an uninterrupted modernization process, as an outcome of society&acute;s creativity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30131",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II"
        ],
        "objectID": "223202",
        "number": "URBANST 148A",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "149",
        "title": "Monitoring the Crisis (PSYCH 145A, PUBLPOL 141, SOC 141, SOC 241)",
        "description": "A course devoted to understanding how people are faring as the country's health and economic crisis unfolds. The premise of the course is that, as important and valuable as surveys are, it's a capital mistake to presume that we know what needs to be asked and that fixed-response answers adequately convey the depth of what's happening. We introduce a new type of qualitative method that allows for discovery by capturing the voices of the people, learn what they're thinking and fearing, and understand the decisions they're making. Students are trained in immersive interviewing by completing actual interviews, coding and analyzing their field notes, and then writing reports describing what's happening across the country. These reports will be designed to find out who's hurting, why they're hurting, and how we can better respond to the crisis. Students interested should submit the following application: https://docs.google.com/forms/d/e/1FAIpQLSfdOZsnpOCg4zTRbVny0ikxpZEd1AFEEJh3K9KjvINyfbWMGw/viewformnnThe course is open to students who have taken it in earlier quarters, with repeating students allowed to omit the training sessions and, in lieu of those sessions, complete additional field work and writing. Field work will include unique interviews with new participants each lab period, along with corresponding coding, analyses, and reports.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "222507",
        "number": "URBANST 149",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "150",
        "title": "From Gold Rush to Google Bus: History of San Francisco (AMSTUD 150X, HISTORY 252E)",
        "description": "This class will examine the history of San Francisco from Native American and colonial settlement through the present. Focus is on social, environmental, and political history, with the theme of power in the city. Topics include Native Americans, the Gold Rush, immigration and nativism, railroads and robber barons, earthquake and fire, progressive reform and unionism, gender, race and civil rights, sexuality and politics, counterculture, redevelopment and gentrification. Students write final project in collaboration with ShapingSF, a participatory community history project documenting and archiving overlooked stories and memories of San Francisco. (Cardinal Course certified by the Haas Center)",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29340",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "213523",
        "number": "URBANST 150",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "152",
        "title": "Building Modernity: Urban Planning and European Cities in the Twentieth Century (HISTORY 237C)",
        "description": "This seminar explores the history of urban planning in twentieth-century Europe. We will discuss visions of ideal cities and attempts at their implementation in the context of democratic and authoritarian systems as well as capitalism and socialism. Through case studies from eastern and western Europe--from Berlin in Germany to Nowa Huta in Poland--we will examine how broader historical trends played out in, and were shaped by, specific local circumstances. The seminar is intended for advanced undergraduate students.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221809",
        "number": "URBANST 152",
        "units": [
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "153",
        "title": "CAPITALS: How Cities Shape Cultures, States, and People (COMPLIT 100, DLCL 100, FRENCH 175, GERMAN 175, HISTORY 206E, ILAC 175, ITALIAN 175)",
        "description": "This course takes students on a trip to major capital cities, at different moments in time: Renaissance Florence, Golden Age Madrid, Colonial Mexico City, Enlightenment and Romantic Paris, Existential and Revolutionary St. Petersburg, Roaring Berlin, Modernist Vienna, and bustling Buenos Aires. While exploring each place in a particular historical moment, we will also consider the relations between culture, power, and social life. How does the cultural life of a country intersect with the political activity of a capital? How do large cities shape our everyday experience, our aesthetic preferences, and our sense of history? Why do some cities become cultural capitals? Primary materials for this course will consist of literary, visual, sociological, and historical documents (in translation); authors we will read include Boccaccio, Dante, Sor Juana, Montesquieu, Baudelaire, Gogol, Irmgard Keun, Freud, and Borges. Note: To be eligible for WAYS credit, you must take the course for a Letter Grade.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "32425",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "10:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Pesic, A.",
                                "sunet": "andreip"
                            },
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 37200.0,
                        "days": "Monday Wednesday Friday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "32437",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "6:30:00 PM",
                        "endTime": "7:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 66600.0,
                        "endTimestamp": 69600.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "DIS",
                "notes": null,
                "classId": "32438",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:20:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Cotsapas, P.",
                                "sunet": "phoebusc"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 40800.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "218539",
        "number": "URBANST 153",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "155",
        "title": "Just Transitions Policy Lab (CSRE 155, EARTHSYS 119)",
        "description": "Building off the work of the Stanford Coalition for Planning an Equitable 2035 (SCoPE), the just transitions policy lab will address transportation justice, housing justice, and labor equity concerns that have been identified by neighboring communities to Stanford and our service workers as part of local land use planning and policy processes. Building on the success of earlier housing justice policy lab initiatives, this course will support ongoing policy engagement in local land use planning process, including housing and transportation justice issues. Key concepts addressed will include environmental justice (EJ) and just transitions frameworks, as well as building awareness of the Bay Area housing crisis. The course will culminate in class projects that will involve working with community partners to address information gaps on worker experiences and housing and transportation needs. We will meet for a weekly 3-hour session. Sessions will prioritize 1) foundational concepts in environmental justice 2) current issues in our community related to housing, transportation, and labor equity, 2) peer learning through collective engagement in readings and project planning, 4) community connections related to SCoPE initiatives that deepen existing relationships, and 5) policy analysis related to local land use planning processes.  The teaching team will be accepting brief student applications for course participation prior to Winter quarter. To apply for this course, please fill out this google form: https://forms.gle/D3BPeiSEDK9kviJW8 Due December 2 at 11:59pm.Cardinal Course certified by the Haas Center for Public Service.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "15243",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Diver, S.",
                                "sunet": "sibs"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224781",
        "number": "URBANST 155",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "155A",
        "title": "Environmental Justice Colloquium (EARTHSYS 194A, HUMRTS 194A)",
        "description": "This colloquium brings the voices and vision of leading Environmental Justice (EJ) advocates to the Stanford community, in order to educate, inspire, and transform our understanding of environmental science.  Environmental Justice advances a positive vision for policies and actions that fight environmental racism. EJ approaches involve centering the voices and leadership of marginalized communities in 1) ensuring equitable access to environmental benefits, and 2) preventing or mitigating the disproportionate impacts of environmental harms for all communities, regardless of gender, class, race, ethnicity, or other social positions. This colloquium highlights the work of leading EJ thinkers and practitioners, speaking from frontline organizations on a wide range of topics. These topics include acting on toxic exposures and health disparities for community resilience, climate justice and youth action, Indigenous land and water rights, green cities and Afrofuturism, food justice and intersecting social movements, queer ecologies, and more. The colloquium will host a weekly speaker with course meetings held every Wednesday. Colloquium presentations will begin promptly at 12pm.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "COL",
                "notes": null,
                "classId": "13745",
                "currentClassSize": "0",
                "maxClassSize": "100",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": "300-300",
                        "instructors": [
                            {
                                "name": "Diver, S.",
                                "sunet": "sibs"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222700",
        "number": "URBANST 155A",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "156",
        "title": "St. Petersburg: Imagining a City, Building a City (SLAVIC 155)",
        "description": "St. Petersburg, the world's most beautiful city, was designed to display an 18th-century autocrat's power and to foster ties between Russia and the West - on the tsar's terms. It went through devastating floods and a deadly siege; it birthed the &quot;Petersburg myth,&quot; poems and prose that explore the force of the state and the individual's ability to resist. This class addresses the struggle between the authorities and the inhabitants; the treacherous natural environment; the city as a node in national and international networks of communication; the development of urban transportation networks; and the supply of goods. NOTE: <i>This course is required of students attending the overseas seminar to St. Petersburg in September 2018.</i>Class times to be determined upon the availability of all enrolled students. Please contact instructor(s) via email if you have any questions.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "219669",
        "number": "URBANST 156",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "156A",
        "title": "The Changing American City (CSRE 156, SOC 156A, SOC 256A)",
        "description": "After decades of decline, U.S. cities today are undergoing major transformations. Young professionals are flocking to cities instead of fleeing to the suburbs. Massive increases in immigration have transformed the racial and ethnic diversity of cities and their neighborhoods. Public housing projects that once defined the inner city are disappearing, and crime rates have fallen dramatically. Do these changes signal the end of residential segregation and urban inequality? Who do these changes benefit? This course will explore these issues and strategies to address them through readings and discussion, analyzing a changing neighborhood in a major city in the Bay Area in groups (which will include at least one site visit), and studying a changing neighborhood or city of their choice for their final project. The course does not have pre-requisites.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "219597",
        "number": "URBANST 156A",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "158",
        "title": "Spatial Thinking Through Black Writing (ENGLISH 252)",
        "description": "This class will introduce students to various spatial theorists such as Mikhail Bakhtin, Joseph Frank, Michel Foucault, etc. along with concepts such as spatial traversal, means of locomotion, and spatial morphologies through the novels and short stories of Black writers worldwide, including James Baldwin, Zadie Smith, Sam Selvon, Walter Moseley, Richard Wright, Chinua Achebe, Ivan Vladislavic, Naguib Mahfouz, and others.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30614",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225300",
        "number": "URBANST 158",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "163",
        "title": "Land Use: Planning for Sustainable Cities (AMSTUD 163, EARTHSYS 168, PUBLPOL 163)",
        "description": "Through case studies with a focus on the San Francisco Bay Area, guest speakers, selective readings and interactive assignments, this survey course seeks to demystify the concept of land use for the non-city planner. This introductory course will review the history and trends of land use policies, as well as address a number of current themes to demonstrate the power and importance of land use. Students will explore how urban areas function, how stakeholders influence land use choices, and how land use decisions contribute to positive and negative outcomes.  By exploring the contemporary history of land use in the United States, students will learn how land use has been used as a tool for discriminatory practices and NIMBYism. Students will also learn about current land use planning efforts that seek to make cities more sustainable, resilient and equitable to address issues like gentrification, affordable housing, and sea level rise.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "WAY-SI"
        ],
        "objectID": "130984",
        "number": "URBANST 163",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "164",
        "title": "Sustainable Cities (EARTHSYS 160)",
        "description": "Community-engaged learning course that exposes students to sustainability concepts and urban planning as a tool for determining sustainable outcomes in the Bay Area. The focus will be on land use and transportation planning to housing and employment patterns, mobility, public health, and social equity. Topics will include government initiatives to counteract urban sprawl and promote smart growth and livability, political realities of organizing and building coalitions around sustainability goals, and increasing opportunities for low-income and communities of color to achieve sustainability outcomes. Students will participate in remote team-based projects in collaboration with Bay Area community partners. Prerequisites: Consent of the instructor. (Cardinal Course certified by the Haas Center.) Apply here: https://docs.google.com/forms/d/e/1FAIpQLSfhY1w5A_PCjmKdMcGNaZ6Hic24T2zvgF7CfcGrL2tWCWnQGg/viewform",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "13131",
                "currentClassSize": "0",
                "maxClassSize": "12",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "12:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kos, R.",
                                "sunet": "rickkos"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 44400.0,
                        "days": "Monday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "211342",
        "number": "URBANST 164",
        "units": [
            4,
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "165",
        "title": "Sustainable Transportation: Policy and Planning in Practice (EARTHSYS 165)",
        "description": "The transportation network is an essential, if often invisible, part of communities. Only when traffic piles up, the subway shuts down, or the sidewalk is closed do we notice the services and infrastructure that are critical to everyday movement. Beyond the everyday effects, transportation planning decisions also have long term consequences for the environment (transportation is the leading source of greenhouse gas emissions in the United States); the economy (transportation is the fourth largest household expenditure after healthcare, housing, and food); and community wellbeing (traffic collisions are the leading cause of death for young people in the United States). This course will interrogate the role of transportation in fostering sustainable communities paying particular attention to how policy and planning decisions contribute to or hinder equitable access, economic vibrancy, environmental protection. Through a combination of lectures, field work, guest speakers, and real-world client projects, this course will provide an introduction to the field of transportation policy and planning. Student will learn about and get hands-on practice with topics such as  bicycle and pedestrian design, safety analysis, traffic operations and modeling software, transit planning, and emerging trends such as autonomous vehicles, micromobility, and congestion pricing.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29283",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "6:00:00 PM",
                        "endTime": "8:50:00 PM",
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 64800.0,
                        "endTimestamp": 75000.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "GER:DB-SocSci",
            "WAY-SI"
        ],
        "objectID": "204548",
        "number": "URBANST 165",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "166",
        "title": "How Cities Can Save the World (PUBLPOL 165)",
        "description": "In our cities, we find the greatest concentrations of the world's great problems - poverty, homelessness, violent crime, and GHG emissions, to name a few.  So too, cities present many of the most innovative, impactful solutions to these challenges.  In this seminar, we'll look at three great challenges that confront Americans - the dearth of affordable housing, the growing impacts of climate change, and violent crime - in the urban context.  We'll explore the legal, fiscal, and political limitations that constrain the terrain of local policymaking, and we will assess best practices among cities for enacting meaningful change within that landscape.  Readings and discussion will overwhelmingly focus on U.S. cities, but we will consider a few examples from abroad as well.  We will seek to move beyond familiar ideological battles to emphasize outcomes, evidence-based solutions, and analytical rigor.  From contemporary academic studies and journals, news articles, case law, and guest speakers, students will gain an appreciation for cities as policy laboratories for pragmatic solutions that often elude binary labelling as &quot;progressive&quot; or &quot;conservative.&quot;  Students will be better prepared to understand and engage in cities as civic leaders, legal advisors or adversaries, participants in economic transactions, and constituents.  This class is limited to 25 students, with an effort made to have students from SLS (15 by lottery) and 10 non-law students by consent of the instructor.  Admitted non-law students should forward instructor consent to Grete Howland greteh@stanford.edu for a permission number to enroll in PUBLPOL 165 or Sonia Chan Schan23@stanford.edu to enroll in URBANST 166.  Elements used in grading:  Class Participation, Written Assignments, and Final Paper.  Cross-listed with Law School (LAW 7119) and Urban Studies (URBANST 166).",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "225007",
        "number": "URBANST 166",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "168",
        "title": "RACE, NATURE, AND THE CITY (CSRE 168, EARTHSYS 169, SOC 168A)",
        "description": "This course provides an introduction to the study of race and place within urban political ecology (UPE). Geographer Natasha Cornea defines UPE as a 'conceptual approach that understands urbanization to be a political, economic, social, and ecological process, one that often results in highly uneven and inequitable landscapes' in and beyond cities. The primary focus will be cities in the Americas, but we will draw on insights from scholars studying the mutually constitutive nature of race and place in other regions. In line with critical theories that frame intersectional experiences of race, the course readings also take into account class, gender, sexuality, and nation.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30176",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223443",
        "number": "URBANST 168",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "169",
        "title": "Race, Ethnicity, and Water  in Urban California (AFRICAAM 169A, AMSTUD 169, CSRE 260)",
        "description": "Is water a human right or an entitlement? Who controls the water, and who should control the water, in California? Private companies? Nonprofits? Local residents? Federal, state, or local governments? This course will explore these questions in the context of urban California more generally, the players and the politics to make sense of a complex problem with deep historical roots; one that defines the new century in California urban life. This is a Cardinal Course certified by the Haas Center. The required readings and discussions cover cities from Oakland to Los Angeles, providing a platform for students to explore important environmental issues, past and present, affecting California municipalities undergoing rapid population change.  In addition, our research focus will be on the cities located on the Central Coast of California: agricultural Salinas, Watsonville, and Castroville and towns along the Salinas Valley; tourist based Monterey, Pebble Beach, Carmel, Pacific Grove; the bedroom community of Prunedale to the north, and former military towns, Marina and Seaside, as all of these ethnically, socioeconomically diverse communities engage in political struggles over precious, and ever scarcer water resources, contend with catastrophic events such as droughts and floods, and fight battles over rights to clean water, entitlement, environmental racism, and equity.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "GER:DB-SocSci",
            "GER:EC-AmerCul",
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "115504",
        "number": "URBANST 169",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "169B",
        "title": "Race and Ethnicity in Urban California: Research Seminar (AMSTUD 169B, CSRE 260B, SOC 169B)",
        "description": "This course is part of an ongoing research project that examines the consequences of social, demographic, economic, and political changes in ethnic and race relations in in urban California.  Students taking this course will construct will investigate a particular issue, place, policy, or event of special interest and write a 15-20-page paper.  Through individualized research projects, our aim is to understand how and why policies and practices developed that isolated and marginalized communities of color leading to environmental racism, housing inequality, public health crises, socioeconomic (im)mobility, over-policing, and underserving, and (un)fair representation in city politics and governments.  We will also focus on solutions. We look at the creative, challenging, and diverse ways grassroots organizers, academics, and governments at every level can work in partnership to reshape policy and rectify injustice in a variety of urban and suburban environments in California. Each paper should conclude with ideas about how to make constructive change.  This course has been designated as a Cardinal Course by the Haas Center for Public Service. Cardinal Courses apply classroom knowledge to pressing social and environmental problems through reciprocal community partnerships. The units received through this course can be used towards the 12-unit requirement for the Cardinal Service transcript notation.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "RES",
                "notes": null,
                "classId": "30371",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "RES",
                "notes": null,
                "classId": "32306",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-EDP",
            "WAY-SI"
        ],
        "objectID": "223445",
        "number": "URBANST 169B",
        "units": [
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "171",
        "title": "Urban Design Studio (CEE 131D)",
        "description": "The practical application of urban design theory. Projects focus on designing neighborhood and downtown regions to balance livability, revitalization, population growth, and historic preservation.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "28989",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "204889",
        "number": "URBANST 171",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "172A",
        "title": "Introduction to Urban, Rural, and Regional Planning",
        "description": "This course integrates professional planning approaches and tools with foundational and theoretical practices of recognizing and reading landscapes and working with diverse communities. Weekly modules introduce disciplines within the Urban and Regional Planning field, such as community engagement and governance, health, housing, transportation, design, resource management, and disaster resilience. While designed for undergraduates, class incorporates some graduate-level activities and encourages critical thinking. Students reflect on the places that shaped them, develop a clear-eyed understanding of how planning processes have caused both current and historic social and environmental harms, and explore methods to repair these impacts while testing the limits of the planning field.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "29240",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": "160-319",
                        "instructors": [
                            {
                                "name": "Raya, M.",
                                "sunet": "mraya"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 48000.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "216108",
        "number": "URBANST 172A",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "173",
        "title": "The Urban Economy (PUBLPOL 174)",
        "description": "Applies the principles of economic analysis to historical and contemporary urban and regional development issues and policies.  Explores themes of urban economic geography, location decision-making by firms and individuals, urban land and housing markets, and local government finance.  Critically evaluates historical and contemporary government policies regulating urban land use, housing, employment development, and transportation. Thematic focus on impacts of the pandemic and long-term work-from-home employment patterns on urban form, density, and fiscal policies.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "27689",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "Littlefield 107",
                        "instructors": [
                            {
                                "name": "Wolfe, M.",
                                "sunet": "mrwolfe"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "214248",
        "number": "URBANST 173",
        "units": [
            4
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "174",
        "title": "Defining Smart Cities: Visions of Urbanism for the 21st Century (CEE 125, CEE 225)",
        "description": "Technological innovations have and will disrupt all domains of urban life, from housing to healthcare to city management to transportation. This seminar is aimed at future technologists, entrepreneurs, policymakers, and urban planners to define and evaluate the smartness of a city through three lenses: technology, equity, and policy. Through readings, seminar discussions, guest speakers, and a final project, we will explore how a smart city can leverage technology for a higher quality of life, less inequality in access to services, and tighter human communities. You will come away with a framework for understanding how to maximize the social good of emerging technologies. Course material is appropriate for students from all disciplines. Students who enroll in the course for 4 units will participate in an off-campus field component during Spring Break.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "4",
        "sections": [],
        "gers": [],
        "objectID": "216985",
        "number": "URBANST 174",
        "units": [
            3,
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "175",
        "title": "Confronting Our Housing and Homelessness Crises: Policy, Politics, and the Law (PUBLPOL 171)",
        "description": "In virtually every major U.S. city, the lack of affordable housing or homelessness (or both) constitutes the most urgent concern to residents. Amid ample hang-wringing by politicians, pundits, and the press, the human toll of the housing affordability crises has only worsened.  This class will focus on solutions to this crisis. Solutions abound, but implementing them at scale requires understanding--and navigating--the legal, economic, and political constraints faced by decision makers. It's in large cities where we see the problem most acutely, but where we also see America's most innovative solutions. So, this class--taught by the former mayor of one of America's dozen largest cities-- will have a decidedly urban focus. While the local entitlement and development process will provide a starting point, the class will also delve into key elements of state and federal policy and law that shape the local responses to these crises. An eclectic set of sources --studies, court opinions, consultant reports, economic meta-analyses, news accounts and an occasional guest lecturer--will support class discussion. The class will be taught with a bias against the ideological, eschewing progressive or conservative &quot;quick fixes,&quot; and emphasizing problem-solving, pragmatism, an openness to opposing viewpoints, and a willingness to acknowledge the trade-offs in every approach. Students will be expected to persuasively advocate for specific solutions--in class discussion and in writing--and to demonstrate an understanding of the limitations of those solutions. Elements used in grading:  Class Participation, Written Assignments. This class is limited to 35 students, with an effort made to have students from SLS (25 students by lottery) and up to 10 non-law students by consent of the instructor. This course is cross-listed with LAW 7128.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "32343",
                "currentClassSize": "0",
                "maxClassSize": "10",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225656",
        "number": "URBANST 175",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "176",
        "title": "New Technologies and Urban Change",
        "description": "Cities are always changing, most times gradually, but sometimes very rapidly and with significant effects on urban space, form, culture, and society. Among the forces that have historically driven urban change are the dynamics of immigration, both local and international,  and the impacts of new technologies. These two forces are closely related. Indeed, acting as a magnet for increased immigration may itself be one of the most important impacts of techno-logical innovation on urban development. The purpose of this course is to explore the way new technologies have impacted -- and continue to impact -- urban society. The first half of the course will consist of a series of lectures and discussions of how technologies have changed cities in the past: in the ancient world, in the early industrial period, and in the period of the twentieth-century regional metropolis. The second half of the course will consist of weekly oral reports by 3-4-person student working groups researching specific examples of how current and still-emerging new technologies are transforming cities and city life today and how those changes may need to be addressed by either new public policies and/or new personal or community accommodations.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "220660",
        "number": "URBANST 176",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "178",
        "title": "The Science and Practice of Effective Advocacy (CSRE 178P, PUBLPOL 178)",
        "description": "How can purposeful collective action change government policy, business practices and cultural norms? This course will teach students about the components of successful change campaigns and help develop the practical skills to carry out such efforts. The concepts taught will be relevant to both issue advocacy and electoral campaigns, and be evidence-based, drawing on lessons from social psychology, political science, communications, community organizing and social movements. The course will meet twice-a-week for 90 minutes, and class time will combine engaged learning exercises, discussions and lectures. There will be a midterm and final. Students will be able to take the course for 3 or 5 units. Students who take the course for 5 units will participate in an advocacy project with an outside organization during the quarter, attend a related section meeting and write reflections.  For 5 unit students, the section meeting is on Tuesdays, from 3:00 to 4:00 p.m.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "29703",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "29702",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "219648",
        "number": "URBANST 178",
        "units": [
            3,
            4,
            5
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "179",
        "title": "The Social Life of Neighborhoods (AFRICAAM 76B, AMSTUD 276, CSRE 176B, SOC 176, SOC 276)",
        "description": "How do neighborhoods come to be? How and why do they change? What is the role of power, money, race, immigration, segregation, culture, government, and other forces? In this course, students will interrogate these questions using literatures from sociology, geography, and political science, along with archival, observational, interview, and cartographic (GIS) methods. Students will work in small groups to create content (e.g., images, audio, and video) for a self-guided &iquest;neighborhood tour,&iquest; which will be added to a mobile app and/or website.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "4",
        "unitsMax": "4",
        "sections": [],
        "gers": [
            "WAY-SI"
        ],
        "objectID": "221158",
        "number": "URBANST 179",
        "units": [
            4
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "180A",
        "title": "Urban Agroecology (EARTHSYS 181A)",
        "description": "Urban agriculture takes many forms in cities around the world and provides significant amounts of food and other resources and benefits for urban communities. This Earth Systems practicum explores the application of agroecological principles to the design and stewardship of urban farms and gardens. Students will explore social and ecological dimensions of urban agriculture including issues of environmental justice, diversity, equity, and inclusion while gaining land stewardship and small-scale food production skills at the Stanford Educational Farm.  This is a 20-week (Winter and Spring quarters) Cardinal Course. Students will work with a community-based organization over both quarters to gain practical experience in the field. Students are required to enroll in and complete both Winter (EARTHSYS 181A, 2 units) and Spring (EARTHSYS 181B, 2 units) courses to receive credit for a total of 4 units. Space is limited and a brief application is required: https://stanforduniversity.qualtrics.com/jfe/form/SV_cJdl7V8aXE2AOUu",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "30517",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224649",
        "number": "URBANST 180A",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "180B",
        "title": "Urban Agroecology (EARTHSYS 181B)",
        "description": "Urban agriculture takes many forms in cities around the world and provides significant amounts of food and other resources and benefits for urban communities. This Earth Systems practicum explores the application of agroecological principles to the design and stewardship of urban farms and gardens. Students will explore social and ecological dimensions of urban agriculture including issues of environmental justice, diversity, equity, and inclusion while gaining land stewardship and small-scale food production skills at the Stanford Educational Farm.  This is a 20-week (Winter and Spring quarters) Cardinal Course. Students will work with a community-based organization over both quarters to gain practical experience in the field. Students are required to enroll in and complete both Winter (EARTHSYS 181A, 2 units) and Spring (EARTHSYS 181B, 2 units) courses to receive credit for a total of 4 units. Space is limited and a brief application is required.",
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "30372",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224650",
        "number": "URBANST 180B",
        "units": [
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "181",
        "title": "Urban Agroecology (EARTHSYS 181, EARTHSYS 281, ESS 181, ESS 281)",
        "description": "Urban agriculture takes many forms in cities around the world and provides significant amounts of food and other resources and benefits for urban communities. This Earth Systems practicum explores the application of agroecological principles to the design and stewardship of urban farms and gardens. Students will explore social and ecological dimensions of urban agriculture including issues of environmental justice while gaining land stewardship and small-scale food production skills at the Stanford Educational Farm and in the community.Course full for spring 2022, will be offered again Winter 2023.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [],
        "gers": [],
        "objectID": "207917",
        "number": "URBANST 181",
        "units": [
            3
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "183",
        "title": "Team Urban Design Studio (CEE 131E)",
        "description": "This new class offers an exciting variation on the 'individual project' studio format. Students work as a team to propose a single consensus solution to a real-world design challenge. This collaborative studio experience more closely reflects the creative process in the design and planning professions where a group of individuals works together to brainstorm, shape, develop, and illustrate a community design solution. There are a number of benefits to this team-oriented approach: it is a more nurturing environment for students that do not have design backgrounds, it allows for more peer-to-peer learning, and it takes best advantage of varied student skill sets. But perhaps the greatest benefit is that a team of students working together on a common project will be able to develop a more comprehensive solution than any one student working alone. This means that the class &quot;deliverable&quot; at the end of quarter could be detailed enough to be of significant value to a stakeholder or client group from the larger community. This studio class, working under the guidance of an experienced instructor, functions like a design firm in providing professional-grade deliverables to real-world community design &quot;clients'.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "PRA",
                "notes": null,
                "classId": "14511",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "12:00:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Glanz, D.",
                                "sunet": "dglanz"
                            }
                        ],
                        "startTimestamp": 43200.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "218691",
        "number": "URBANST 183",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "184",
        "title": "Paris: Capital of the Modern World (FRENCH 140, FRENCH 340, HISTORY 230C)",
        "description": "This course explores how Paris, between the eighteenth and twentieth centuries, became the political, cultural, and artistic capital of the modern world. It considers how the city has both shaped and been shaped by the tumultuous events of modern history- class conflict, industrialization, imperialism, war, and occupation. It will also explore why Paris became the major world destination for intellectuals, artists and writers. Sources will include films, paintings, architecture, novels, travel journals, and memoirs. Course taught in English with an optional French section.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "4",
        "unitsMax": "5",
        "sections": [],
        "gers": [
            "WAY-A-II",
            "WAY-SI"
        ],
        "objectID": "213087",
        "number": "URBANST 184",
        "units": [
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "190A",
        "title": "Public Service and Social Impact: Pathways to Purposeful Careers (CSRE 190A, ENGLISH 180, INTNLREL 74, POLISCI 74B, PUBLPOL 75B, SOC 190A, SYMSYS 193)",
        "description": "How do I translate my interests and skills into a career in public service and social impact? This course will introduce you to a wide range of roles that help shape public policy and civic life, including government, education, nonprofits, social enterprises, and arts/media.  It can be taken for one or two units. For one unit, you participate in a weekly, interactive speaker series designed to give you a sense for what different public service careers are like. Each week, guests describe their organizations and roles, highlight key intellectual issues and policy challenges, discuss their career paths, and describe skills crucial for the job. For a second unit, you participate in a hands-on weekly session designed to help you translate this knowledge into action. You will identify roles and organizations that might be a good match for you, build your network through informational interviewing, receive career coaching, and acquire the tools you need to launch your job or internship search. This course is intended for all students and all majors. Course content will be relevant to students soon entering the job market as well as those facing choices about courses of study and internships. Class sessions will be 60 minutes. This course is co-sponsored by the Haas Center for Public Service, the School of Humanities and Sciences, and Stanford in Government. Students taking the course for one unit (Tuesday lecture) must enroll in the -01 course option, and students taking the course for two units (Tuesday lecture and Thursday seminar) must enroll in the -02 course option.  IR approved.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30312",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30999",
                "currentClassSize": "0",
                "maxClassSize": "90",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:30:00 PM",
                        "location": "300-300",
                        "instructors": [
                            {
                                "name": "Litvak, L.",
                                "sunet": "lalitvak"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 63000.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "DIS",
                "notes": null,
                "classId": "30311",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "SEM",
                "notes": null,
                "classId": "30998",
                "currentClassSize": "0",
                "maxClassSize": "35",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:30:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Litvak, L.",
                                "sunet": "lalitvak"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 63000.0,
                        "days": "Tuesday"
                    },
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:30:00 PM",
                        "location": "Lathrop 282",
                        "instructors": [
                            {
                                "name": "Litvak, L.",
                                "sunet": "lalitvak"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 63000.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223178",
        "number": "URBANST 190A",
        "units": [
            1,
            2
        ],
        "totalSections": 4
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "193",
        "title": "Directed Research in Urban Studies",
        "description": "--",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [],
        "gers": [],
        "objectID": "224719",
        "number": "URBANST 193",
        "units": [
            1,
            2,
            3,
            4,
            5
        ]
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "194",
        "title": "Internship in Urban Studies",
        "description": "For Urban Studies majors only. Students organize an internship in an office of a government agency, a community organization, or a private firm directly relevant to the major. Reading supplements internship. Paper summarizes internship experience and related readings.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "4",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27232",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29108",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28771",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10993",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10584",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McAdam, D.",
                                "sunet": "mcadam"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10585",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Griggs, G.",
                                "sunet": "ggriggs"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10586",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10587",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Litvak, L.",
                                "sunet": "lalitvak"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10588",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edwards, M.",
                                "sunet": "edwards1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "131000",
        "number": "URBANST 194",
        "units": [
            2,
            3,
            4
        ],
        "totalSections": 9
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "195",
        "title": "Special Projects in Urban Studies",
        "description": null,
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "27233",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29109",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28772",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10702",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Griggs, G.",
                                "sunet": "ggriggs"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10576",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McAdam, D.",
                                "sunet": "mcadam"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "12595",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chan, D.",
                                "sunet": "deland"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10577",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Griggs, G.",
                                "sunet": "ggriggs"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10607",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Glanz, D.",
                                "sunet": "dglanz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10609",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McDermott, M.",
                                "sunet": "mcderm"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "12284",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chan, D.",
                                "sunet": "deland"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "131001",
        "number": "URBANST 195",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 10
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "196",
        "title": "Community-Engaged Scholars Program Seminar (EDUC 196)",
        "description": "Limited to students writing an honors thesis, Master's thesis, or capstone project and admitted to the year-round Community Engage sponsored by the Haas Center for Public Service. What standards in addition to those expected by the academy apply to research conducted as a form of public service? How can communities benefit from research? Theory and practice of research as a form of public service readings, thesis workshops, and public presentation of completed research. May be repeated for credit.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class will meet in the Donald Kennedy Room at the Haas Center for Public Service.",
                "classId": "31078",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": "6:30:00 PM",
                        "endTime": "8:20:00 PM",
                        "location": "Departmental Room",
                        "instructors": [
                            {
                                "name": "Hurd, C.",
                                "sunet": "churd"
                            }
                        ],
                        "startTimestamp": 66600.0,
                        "endTimestamp": 73200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "131005",
        "number": "URBANST 196",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "197",
        "title": "Directed Reading",
        "description": null,
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29110",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28773",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "11733",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Litvak, L.",
                                "sunet": "lalitvak"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10396",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "9391",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "11759",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Scher, L.",
                                "sunet": "scher"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "11778",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Chan, D.",
                                "sunet": "deland"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10397",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Scher, L.",
                                "sunet": "scher"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10596",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Glanz, D.",
                                "sunet": "dglanz"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "12109",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10598",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Litvak, L.",
                                "sunet": "lalitvak"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "12389",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Hsu, K.",
                                "sunet": "khsu"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10690",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edwards, M.",
                                "sunet": "edwards1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10610",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McDermott, M.",
                                "sunet": "mcderm"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "12390",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Frank, Z.",
                                "sunet": "zfrank"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10723",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Litvak, L.",
                                "sunet": "lalitvak"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10744",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Boudet, H.",
                                "sunet": "hilschaf"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "12780",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jackson, D.",
                                "sunet": "dj75"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10992",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gast, G.",
                                "sunet": "gastg"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10761",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Scher, L.",
                                "sunet": "scher"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "131004",
        "number": "URBANST 197",
        "units": [
            1,
            2,
            3,
            4,
            5
        ],
        "totalSections": 44
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "199",
        "title": "Senior Honors Thesis",
        "description": null,
        "repeatable": "true",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "1",
        "unitsMax": "10",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "29111",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": null,
                "classId": "28774",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "12778",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Jackson, D.",
                                "sunet": "dj75"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10398",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McAdam, D.",
                                "sunet": "mcadam"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "02",
                "component": "INS",
                "notes": null,
                "classId": "10314",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "McAdam, D.",
                                "sunet": "mcadam"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "12779",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Thielke, C.",
                                "sunet": "ccormier"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10399",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Stout, F.",
                                "sunet": "fstout"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": null,
                "classId": "10315",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Stout, F.",
                                "sunet": "fstout"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10400",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": null,
                "classId": "10316",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10401",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edwards, M.",
                                "sunet": "edwards1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "05",
                "component": "INS",
                "notes": null,
                "classId": "10317",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Edwards, M.",
                                "sunet": "edwards1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10581",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Camarillo, A.",
                                "sunet": "camar"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "06",
                "component": "INS",
                "notes": null,
                "classId": "10442",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Gast, G.",
                                "sunet": "gastg"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10582",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Voss, B.",
                                "sunet": "bvoss"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "07",
                "component": "INS",
                "notes": null,
                "classId": "10589",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Rosenfeld, M.",
                                "sunet": "mrosenfe"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10583",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Lougee, C.",
                                "sunet": "lougee"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "08",
                "component": "INS",
                "notes": null,
                "classId": "10739",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Goldman, S.",
                                "sunet": "sgoldman"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "10584",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fonrobert, C.",
                                "sunet": "fonrober"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "09",
                "component": "INS",
                "notes": null,
                "classId": "10743",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Barr, D.",
                                "sunet": "barr"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "131006",
        "number": "URBANST 199",
        "units": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10
        ],
        "totalSections": 92
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "201A",
        "title": "Capstone Internship in Urban Studies",
        "description": "Restricted to Urban Studies majors. Students work at least 80 hours with a supervisor, establish learning goals, and create products demonstrating progress. Reflection on service and integration of internship with senior research plans. Must be completed by start of Winter Quarter senior year. May continue for additional quarter as 194. Service Learning Course (certified by Haas Center). Corequisite: URBANST 201 or consent of instructor.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "3",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "ITR",
                "notes": null,
                "classId": "14678",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "ITR",
                "notes": null,
                "classId": "15184",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "ITR",
                "notes": null,
                "classId": "14689",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "207498",
        "number": "URBANST 201A",
        "units": [
            3
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "202A",
        "title": "Junior Seminar: Preparation for Research",
        "description": "Required of all juniors in Urban Studies planning on writing an honors thesis . Students write a research prospectus and grant proposal, which may be submitted for funding. Research proposal in final assignment may be carried out in Spring or Summer Quarter; consent required for Autumn Quarter research.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Meets Writing in the Major Requirement.",
                "classId": "13383",
                "currentClassSize": "0",
                "maxClassSize": "20",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Coyne, B.",
                                "sunet": "bkcoyne"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Wednesday Friday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221818",
        "number": "URBANST 202A",
        "units": [
            5
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "URBANST",
        "code": "203",
        "title": "Senior Seminar",
        "description": "Conclusion of capstone sequence. Students write a substantial paper based on the research project developed in 202. Students in the honors program may incorporate paper into their thesis. Guest scholar chosen by students.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "5",
        "unitsMax": "5",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "27879",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": "Lathrop 190",
                        "instructors": [
                            {
                                "name": "Kahan, M.",
                                "sunet": "mkahan"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Tuesday Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "219211",
        "number": "URBANST 203",
        "units": [
            5
        ],
        "totalSections": 1
    }
]