[
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "81",
        "title": "Claiming Your Stanford Experience: Encountering People, Ideas, and Places (LIFE 81)",
        "description": "Engage your Stanford experience at a deeper, more authentic level through conversations with luminary Stanford faculty and experiential, creative immersions into signature Stanford places and spaces. Using a weekly fireside chat format with a cross-section of Stanford thought leaders, probe their ideas, scholarship, and research, ranging in scope from the humanities and arts to the social sciences, natural sciences, and engineering. Explore how their disciplinary points-of-view inform ways of seeing, understanding, and making sense of the world. Additionally, encounter an array of Stanford spaces (Frost amphitheater, the Farm, Hoover Tower, Windhover, and so on) through experiential modalities where a sense of place comes alive in new and surprising ways. Utilize photo documentation, poetry making, and other arts practices alongside generative contemplation, psycho-geography, and phenomenological encounters to broaden and deepen your lived experience of the Stanford world, your personal and scholarly place in it, and how you might construct your life beyond Stanford.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "LEC",
                "notes": null,
                "classId": "30457",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223897",
        "number": "WELLNESS 81",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "99",
        "title": "Kinesthetic Delight: Movement and Meditation (LIFE 99, TAPS 99)",
        "description": "The words meditation and mindfulness often conjure images of people sitting quietly in peaceful contemplation. However, as contemplatives and scholars from various fields have argued, though the brain resides in the cranium, the mind functions throughout the body. Students in this class will playfully explore embodied and dynamic forms of meditation and mindfulness through movement in an effort to integrate the mind and body. Examples of modalities include Lisa Nelson's Tuning Scores, Barbara Dilley's Contemplative Dance Practices, and other movement practices including qigong, laughter yoga, and psychogeography. Students will work in teams to develop their own movement-meditation scores inspired by these practices.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "224758",
        "number": "WELLNESS 99",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "102A",
        "title": "Body Mapping: Tracing the Embodied Experiences of Your Life (LIFE 102A)",
        "description": "Body Maps in various forms have been used for thousands of years by people searching for a better understanding of their bodies and their place in the world. This weekend intensive combines self-reflection, artistic expression, and an anthropological lens in order to help you develop a visual ethnographic 'map' of your life. In its basic form, Body Mapping involves drawing one's body outline onto a large paper or canvas and then working with paint, charcoal, markers, pictures, symbols, and words to visually chart the texture, terrain and topography of our embodied experiences. Body Mapping is a pathway to both understanding and sharing our lived stories.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224975",
        "number": "WELLNESS 102A",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "105",
        "title": "Meeting the Moment: Inner Resources for Hard Times (LIFE 105)",
        "description": "In the face of social, economic, environmental, and public health upheavals, many of us are experiencing an unprecedented degree of uncertainty, isolation, and stress affecting academic and day-to-day life. Challenging times ask us, in a voice louder than usual, to identify sources of strength and develop practices that sustain and even liberate. In this experiential, project-oriented class: Explore practices to find true ground and enact positive change for self and community; Cultivate natural capacities of presence, courage, and compassion; Develop resources to share with one another and the entire Stanford community.",
        "repeatable": "true",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30089",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "Enroll under the LIFE prefix.",
                "classId": "25368",
                "currentClassSize": "0",
                "maxClassSize": "0",
                "schedules": [
                    {
                        "startTime": "11:30:00 AM",
                        "endTime": "1:20:00 PM",
                        "location": "Thornton 110",
                        "instructors": [
                            {
                                "name": "Willihnganz, J.",
                                "sunet": "jonahw"
                            },
                            {
                                "name": "Floro, M.",
                                "sunet": "mfloro"
                            },
                            {
                                "name": "Preuninger, C.",
                                "sunet": "cpreunin"
                            }
                        ],
                        "startTimestamp": 41400.0,
                        "endTimestamp": 48000.0,
                        "days": "Thursday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "To sign up for the waitlist, register under LIFE 105.",
                "classId": "27428",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Willihnganz, J.",
                                "sunet": "jonahw"
                            },
                            {
                                "name": "Preuninger, C.",
                                "sunet": "cpreunin"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Friday"
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "222956",
        "number": "WELLNESS 105",
        "units": [
            1,
            2
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "106A",
        "title": "Spiritual Wellbeing and Religious Encounter: Reflecting On Our Personal Spiritual Journeys (LEAD 106A)",
        "description": "Engage in meaningful spiritual dialogue and religious encounter with one another, fostering a conversation across differences. Explore ways to nurture meaning and purpose in daily life through experiential learning activities. You will have the opportunity to focus inwards on your own spirituality and write your spiritual autobiography. It is not expected that you will be an adherant of or have expertise in religious practices and traditions or background in religious scholarship. You will gain skills and knowledge enabling you to wrestle with life's ultimate religious and spiritual questions through readings, facilitated discussions, and breakout sessions. All sessions will be held over dinner as communal meals are ways of community building between the students. Dinner is provided.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "223122",
        "number": "WELLNESS 106A",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "106B",
        "title": "Spiritual Wellbeing and Religious Encounter: Creating Community (LEAD 106B)",
        "description": "Engage in meaningful spiritual dialogue and religious encounter with one another, fostering a conversation across differences. Explore ways to nurture meaning and purpose in daily life through experiential learning activities. Expand your religious literacy by visiting spiritual gatherings across campus. It is not expected that you will be an adherent of or have expertise in religious practices and traditions or background in religious scholarship. You will gain skills and knowledge enabling you to wrestle with life's ultimate religious and spiritual questions through readings, facilitated discussions, and breakout sessions. All sessions will be held over dinner as communal meals are ways of community building between the students. Dinner is provided.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224977",
        "number": "WELLNESS 106B",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "107",
        "title": "Behavior Design: Tiny Habits for Health and Happiness (EDUC 302)",
        "description": "Enrich your life with more humor and happiness, guided by BJ Fogg, Director of Stanford's Behavior Design Lab. This course covers how human behavior really works, the Tiny Habits method, the myths of motivation, and a systematic way to design your life for good. Hands-on projects and empirical research come together to illuminate the principles of Behavior Design. Apply material to your own behavior change journey and learn how to coach others.",
        "repeatable": "false",
        "grading": "Letter (ABCD/NP)",
        "unitsMin": "2",
        "unitsMax": "3",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "*If you want to take the class for 3 units, you MUST enroll under EDUC*. If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.",
                "classId": "27768",
                "currentClassSize": "0",
                "maxClassSize": "25",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "3:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fogg, B.",
                                "sunet": "bjfogg"
                            },
                            {
                                "name": "Crane, S.",
                                "sunet": "stevoc"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 55200.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224959",
        "number": "WELLNESS 107",
        "units": [
            2,
            3
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "108",
        "title": "Leadership from Within: Meditation, Creativity, and Connection (LEAD 108)",
        "description": "This interdisciplinary and practice-based course develops foundational life skills that enable students to realize their potential in school, work, and life in the 21st century. Research over the last few decades has shown that one's ability to thrive is highly correlated with growing and developing as a person: emotionally, socially, cognitively, and psychophysically. This course fosters inner growth through a specific form of evidence-based meditation called Transcendental Meditation, shown to enhance awareness, creativity, resilience, and balance. Students will also develop key communication, relationship building, and collaboration skills. The course features recent research on holistic human development, neuroscience of performance, and integrative leadership. Its design is based on a training program utilized by thousands of leaders of larger established organizations, venture backed startups, NGO's, and government agencies. This integrative approach to leadership development can reduce stress and lead to emotional balance, mental clarity, and increased effectiveness in life pursuits.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31008",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "2:30:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Littlefield 103",
                        "instructors": [],
                        "startTimestamp": 52200.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225572",
        "number": "WELLNESS 108",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "110",
        "title": "The Science of Motivation and Procrastination",
        "description": "Examine the factors that increase motivation and decrease procrastination from a scientific point of view.  Investigate research and models of motivation and procrastination in task engagement arising from the fields of psychology, behavioral economics, and cognitive neuroscience. Cultivate and apply cognitive, behavioral, and social tools that enhance motivation and decrease procrastination while supporting balanced and healthy achievement.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "29760",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215847",
        "number": "WELLNESS 110",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "111",
        "title": "Exploring Happiness",
        "description": "Explores how research-based happiness theory and principles are applied to enhance daily and life satisfaction. Positions happiness as a cornerstone construct of personal wellness, purpose, and fulfillment. Investigates the science of happiness through lecture, guided practice, dialogue, and course material in order to enhance understanding and implementation.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "210742",
        "number": "WELLNESS 111",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "112",
        "title": "Overcoming Imposter Syndrome and Building Confidence",
        "description": "Examine the science and societal implications of &quot;imposter syndrome&quot; and its counterpart, confidence. Utilize the lenses of social science, psychology, mindfulness, and neurobiology to explore your own relationship with imposter syndrome and to build confidence. Investigate the systemic impact of imposter syndrome and confidence in academia, the workforce, and other cultural spaces. Topics include: race, class, and gender; behavior change; neuroplasticity; body language and mindset; the psychology of stress; risk-taking; metacognition; and the physiology of confidence. By the end of this course students will be able to recognize imposter syndrome and utilize confidence-building strategies in their own lives.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "30186",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222200",
        "number": "WELLNESS 112",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "113",
        "title": "Stress Less, Sleep Better",
        "description": "Effectively manage stress and practice positive sleep strategies to enhance clarity, focus, and energy. Presents tools for assessing perceived stress and sleep quality, findings in the science of stress management, current research in sleep studies, and cognitive-behavioral theories and interventions (CBT-i) demonstrated to reduce stress and certain insomnias, while enhancing sleep quality.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "29759",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215844",
        "number": "WELLNESS 113",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "114",
        "title": "Emotional Intelligence: Enhancing Your Effectiveness and Balance",
        "description": "Examine the science and practice of emotional intelligence and how it increases effectiveness and balance. Utilize leading frameworks and tools for enhancing emotional and social intelligence, including the understanding, managing, perceiving, and use of emotions. Blends lecture with experiential learning to develop theoretical and practical knowledge resulting in enhanced intra- and interpersonal skills.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "218616",
        "number": "WELLNESS 114",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "115",
        "title": "Why Decisions are Difficult: Making Wise Choices from Love to Lunch",
        "description": "Examine why making decisions can be difficult and how making wiser decisions enhances satisfaction, happiness, and life success. Investigate practical decision-making frameworks and skills while building awareness around common decision-making fallacies and pitfalls. Develop skills in topic areas ranging from mindfulness, emotional intelligence, cognitive reframing, self-compassion, empathy, gratitude, and courage. Focus on making wiser decisions, big and small, short-term and long-term.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "215626",
        "number": "WELLNESS 115",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "116",
        "title": "Resilience: How to Bounce Back",
        "description": "Examine the science and practice of resilience. Investigate the emerging field of resilience studies and learn the frameworks and skills that allow people to bounce back more quickly and effectively from life challenges. Topics include mindset and cognitive appraisal, emotional and affect management, central nervous system and vagal system regulation, and perspectives on creating resilient social systems. Harness insights in service rising above life adversity and thriving, even in the midst of tough times.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "215851",
        "number": "WELLNESS 116",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "117",
        "title": "Changing For Good: Behavior Change Science & Practice",
        "description": "Change behaviors using evidence-based techniques. Addresses the roles of habit cycles, procrastination mitigation, productivity enhancement, motivational factors, self-compassion, and addiction and addictive processes (both substances and non-substance related) in changing behaviors from maladaptive to adaptive patterns. Drawing from current findings in the neuroscience and psychology of behavior change and habit formation, utilize motivational interviewing, cognitive reframing, peer coaching, and mindfulness meditation models and intervention strategies.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "29859",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "217857",
        "number": "WELLNESS 117",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "118",
        "title": "Sexual and Emotional Intimacy Skills",
        "description": "Learn to cultivate and sustain emotional, physical, and sexual intimacy in relationships. Course takes a sex-positive approach. In addition to scholarly readings on science-based perspectives, the course includes individual, paired, and group exercises in and out of class. Didactic components address the art and science of intimacy through a sociological lens, addressing embodiment, the nuances of consent, needs and boundaries, empathy, safer sex and safer heart conversations, flirting, attunement, escalation and de-escalation, fantasies, pornography, pleasure, selecting partners, repairing relationships, and breaking up.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course is taught by Dr. Alison Ash (Fogarty). Class meets two Saturdays, February 4 and 11, from 10:30am-6:30pm. Asynchronous components will be assigned before, between, and after the in-person classes.  This class has a $35 course fee.",
                "classId": "27768",
                "currentClassSize": "0",
                "maxClassSize": "35",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course is taught by Dr. Alison Ash (Fogarty). Class meets two Saturdays, October 14 and 21, from 10:30am-6:30pm. Asynchronous components will be assigned before, between, and after the in-person classes.",
                "classId": "29514",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "6:30:00 PM",
                        "location": "Littlefield 107",
                        "instructors": [
                            {
                                "name": "Fogarty, A.",
                                "sunet": "afogarty"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 66600.0,
                        "days": "Saturday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222094",
        "number": "WELLNESS 118",
        "units": [
            1,
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "119",
        "title": "Cultivating Healthy Romantic Relationships",
        "description": "Explore the factors that support healthy romantic relationships from psychological, sociological, historical, and cultural perspectives. Investigate the questions, What is a healthy romantic relationship and how do I know if my relationship is healthy? Study the structures of healthy romantic relationships through learning about attraction, attachment, attunement, individuation, cultural scripts, gender roles, and considerations of non-monogamous and non-heteronormative relationships.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "218984",
        "number": "WELLNESS 119",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "120",
        "title": "Violence Intervention and Prevention: Cultivating Sexual Citizenship in Fraternities & Sororities",
        "description": "This course will introduce initiated fraternity and sorority members to the Sexual Citizenship Framework as well as fundamental skills and practices to support creating positive change. Students will be provided opportunities, guidance, and resources to design and implement their own projects to advance a culture of sexual citizenship in their chapters and broader fraternity and sorority communities. This course is limited to initiated fraternity and sorority members only. A permission code is required to register.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "225707",
        "number": "WELLNESS 120",
        "units": [
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "120",
        "title": "Violence Intervention and Prevention: Cultivating Sexual Citizenship in Fraternities & Sororities (LEAD 120)",
        "description": "This course will introduce initiated fraternity and sorority members to the Sexual Citizenship Framework as well as fundamental skills and practices to support creating positive change. Students will be provided opportunities, guidance, and resources to design and implement their own projects to advance a culture of sexual citizenship in their chapters and broader fraternity and sorority communities. This course is limited to initiated fraternity and sorority members only. A permission code is required to register.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "33185",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31860",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Ghaffari, G.",
                                "sunet": "gpoon1"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225573",
        "number": "WELLNESS 120",
        "units": [
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "122",
        "title": "Work With Purpose: Design Your Career",
        "description": "Presents meaningful work as an essential component for life-long wellbeing. Discusses decision making, navigating change, mindfulness, self-compassion, and resilience as these topics relate to your career journey. Blends lecture, discussion, individual and group coaching, and small and large group interactions. Learning activities enhance theoretical knowledge and guide career-related decisions.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "213867",
        "number": "WELLNESS 122",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "123",
        "title": "Living on Purpose (LEAD 103)",
        "description": "Explore the art and science of purpose-finding as it relates to living a more flourishing life at Stanford and beyond. Investigate the contemplative, psychological, social, and communal factors that deepen meaning-making, support authenticity, and encourage living more purposefully. Drawing from disciplines as diverse as art, storytelling, design, and positive psychology, create and utilize tools that promote wellbeing. Highly interactive course employs creative expression, group and individual activities, discussions, lectures, and mini-field trips to reflect on fundamental human questions in pragmatic ways.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "208036",
        "number": "WELLNESS 123",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "125",
        "title": "Live Better Longer: Enhancing Healthspan for Longer Lifespan",
        "description": "Explore ideas and practices that extend healthspan, the number of years we live free of disease or disability. Translate scientific research around current healthspan theories and understand social behaviors and available technologies that support rather than degrade human health. Apply course material to enhance one's own ability to adapt and self-manage in the face of adversity for improved performance and health.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "221206",
        "number": "WELLNESS 125",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "127",
        "title": "Driving Your Metabolism",
        "description": "Examine the main factors impacting metabolic rate including stress, sleep, movement, and nutrition. Review the science behind the continual need for nourishment from these factors and how they work together synergistically down to the level of gene expression. Practically apply principles of metabolism to one's unique physiology and lifestyle for optimal wellbeing",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.",
                "classId": "25163",
                "currentClassSize": "0",
                "maxClassSize": "40",
                "schedules": [
                    {
                        "startTime": "6:30:00 PM",
                        "endTime": "8:45:00 PM",
                        "location": "160-B40",
                        "instructors": [
                            {
                                "name": "Wilson, C.",
                                "sunet": "cfw"
                            }
                        ],
                        "startTimestamp": 66600.0,
                        "endTimestamp": 74700.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221602",
        "number": "WELLNESS 127",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "128",
        "title": "WILD WONDER: Deep Nature Connection Practices for Cultivating Wellbeing",
        "description": "Discover a deeper relationship with yourself and the Earth through nature-based contemplative practices that cultivate wonder for this beautiful, diverse world. This experiential course explores how nature connection practices can support wellbeing and flourishing. Develop a more meaningful relationship with the Stanford campus by visiting different locations each week, including the O'Donahue Family Stanford Educational Farm, the Cactus Garden, the Papua New Guinea Sculpture Garden, the Cantor Arts gardens, Windhover, and Frenchman's Park. Drawing on perspectives from Transformative Learning, Indigenous Knowledge, and Contemplative Science, course activities will include place-based mindfulness exercise, walking meditation, Council sharing, journaling, and creative expression. This class includes one mandatory daylong Saturday session: November 4th from 10am-6pm.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "The first meeting of this class is during WEEK 2 of the quarter (NOT week 1). If you are on the waitlist, show up to the first class as you will likely get in. There is a mandatory Saturday session for this class, November 4th from 10 am - 6 pm.",
                "classId": "31330",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "Thornton 211",
                        "instructors": [
                            {
                                "name": "Sol, K.",
                                "sunet": "kwiatt"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 64200.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225615",
        "number": "WELLNESS 128",
        "units": [
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "130",
        "title": "Meditation",
        "description": "Introduces diverse forms of meditation practice in both theory (contemplative neuroscience, phenomenological traditions) and practice. Practices in guided imagery, compassion, loving kindness, positive emotion, mindfulness and mantra meditation will be offered to enhance stress management and well-being. While meditation practices emerge from religious traditions, all practice and instruction will be secular.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "The first meeting of this class is during WEEK 2 of the quarter (NOT week 1). If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.  This class has a $35 course fee.",
                "classId": "25982",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Meyer Tapia, S.",
                                "sunet": "skmeyer1"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "The first meeting of this class is during WEEK 2 of the quarter (NOT week 1). If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.  This class has a $35 course fee.",
                "classId": "27761",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Meyer Tapia, S.",
                                "sunet": "skmeyer1"
                            },
                            {
                                "name": "Schisler, R.",
                                "sunet": "rebschis"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "The first meeting of this class is during WEEK 2 of the quarter (NOT week 1). If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.  This class has a $35 course fee.",
                "classId": "24731",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "10:30:00 AM",
                        "endTime": "11:50:00 AM",
                        "location": "McMurtry Art Building 350",
                        "instructors": [
                            {
                                "name": "Meyer Tapia, S.",
                                "sunet": "skmeyer1"
                            }
                        ],
                        "startTimestamp": 37800.0,
                        "endTimestamp": 42600.0,
                        "days": "Tuesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215098",
        "number": "WELLNESS 130",
        "units": [
            1
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "130A",
        "title": "Meditation",
        "description": "Introduces diverse forms of meditation practice in both theory (contemplative neuroscience, phenomenological traditions) and practice. Practices in guided imagery, compassion, loving kindness, positive emotion, mindfulness and mantra meditation will be offered to enhance stress management and well-being. While meditation practices emerge from religious traditions, all practice and instruction will be secular.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "2",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30537",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30387",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "225056",
        "number": "WELLNESS 130A",
        "units": [
            2
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "131",
        "title": "Compassion Meditation",
        "description": "Compassion meditation is an ancient, much studied practice of cultivating care for all beings, including ourselves. This course introduces the various dimensions of compassion and mindfulness meditation, emphasizing experiential learning of practices to increase awareness, shift negative thought patterns, increase self-compassion, relate more skillfully with difficult others, and connect to common humanity. Students will explore the rigorous current research on compassion and discuss how compassion translates to action.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "29285",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "211817",
        "number": "WELLNESS 131",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "132",
        "title": "Breathwork for Wellbeing",
        "description": "Discover the power of the breath as a gateway to reach a meditative state of mind. Combine meditative practice with activities that inspire connection and purpose through community building and mindful leadership. Learn through breathwork, meditation, lecture, class discussion, experiential learning, and yoga. Cornerstone of the course is evidence-based SKY Meditation technique that utilizes the breath to quiet the mind, supporting a deep experience of meditation and a practical approach to happiness. Course requirements include attendance at a mini-retreat (see &quot;notes&quot; section). Also note: Wellness 132 was previously offered as MED 130.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course includes a mandatory mini-retreat October 13 (6-9pm), October 14 (10a-1pm), and October 15 (10a-2p). Attendance at this retreat is REQUIRED to receive credit for the course. Wednesday classes will be held September 27, October 4,11,18,25, and November 1,8, 15. If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter. *Class meets in LK 205/206 and ALWAY M112, please check the syllabus to confirm room assignment.",
                "classId": "29532",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": "School of Medicine Room",
                        "instructors": [
                            {
                                "name": "Tang, J.",
                                "sunet": "jtang73"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 62400.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222095",
        "number": "WELLNESS 132",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "133",
        "title": "Meditation Retreat: Weekend Campus Intensive",
        "description": "Introduces diverse forms of meditation practice in both theory (contemplative neuroscience, phenomenological traditions) and practice. Selected practices in focused attention, mindfulness, guided imagery, compassion, loving kindness, positive emotion, and/or mantra meditation will be offered to enhance focused attention, insight, stress management, and well-being. Takes place in a weekend immersion format (on campus), which allows more immersive exploration of the topic space. While meditation practices emerge from religious traditions, all practice and instruction will be secular.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "This class has a $35 course fee.",
                "classId": "29650",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "WKS",
                "notes": "Meets Sat (12/2) and Sun (12/3) from 9:30am to 4pm with an hour lunch break each day. Please bring your lunch or make arrangements to eat nearby. If you are on the waitlist, contact the instructor before the close of course enrollment, as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.  This class has a $35 course fee.",
                "classId": "26127",
                "currentClassSize": "0",
                "maxClassSize": "30",
                "schedules": [
                    {
                        "startTime": "9:30:00 AM",
                        "endTime": "4:00:00 PM",
                        "location": "McCullough 126",
                        "instructors": [
                            {
                                "name": "DiPerna, D.",
                                "sunet": "ddiperna"
                            }
                        ],
                        "startTimestamp": 34200.0,
                        "endTimestamp": 57600.0,
                        "days": "Sunday Saturday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218849",
        "number": "WELLNESS 133",
        "units": [
            1
        ],
        "totalSections": 2
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "135",
        "title": "Mindful Self-Compassion, Strength, and Courage",
        "description": "Investigate how harsh self-criticism adversely impacts well-being, strength, and performance. In contrast, explore how mindful self-compassion (MSC) enhances emotional well-being, increases resilience and strength in coping with life challenges, and supports positive personal relationships. Using the scientifically validated MSC method (Neff &amp; Germer), learn how to better pursue goals and commitments (academic, personal/social development, community service, and/or activism) with greater inner-peace, confidence, and courage.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "218993",
        "number": "WELLNESS 135",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "136",
        "title": "Meditation and the Brain: Practicing the Science and Art of Contemplation",
        "description": "Investigate the power of meditation for training the mind and changing the brain, specifically in focusing attention, enhancing awareness, and generating compassion. Going beyond meditation as a tool for simply reducing stress, this course grounds the theory and practice of meditation in a neuroscientific understanding of how meditation changes brain structures and functioning in service of increasing overall cognitive performance and psychological wellbeing. Learn how to apply specific frameworks and tools for effectively practicing meditation in daily life.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [],
        "gers": [],
        "objectID": "219417",
        "number": "WELLNESS 136",
        "units": [
            1,
            2
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "138",
        "title": "Mindfulness and Stress Management",
        "description": "Effectively manage stress through mindfulness meditation strategies (sitting and movement-based) that positively impact the brain-body system to enhance clarity, focus, and energy. Examine tools for assessing perceived stress and mindfulness, current findings in the science of stress management and meditation, and cognitive-behavioral theories and interventions demonstrated to reduce stress and enhance well-being. Course is based on the mindfulness-based stress reduction (MBSR) curriculum.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "217830",
        "number": "WELLNESS 138",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "140",
        "title": "WELLNESS THROUGH QUEERNESS",
        "description": "Explore the intersection of queerness, sexuality and wellbeing. Learn skills and practices to associate queerness with thriving and flourishing. This course integrates empirical psychological and neuroscientific research, community history, and health psychoeducation to provide frameworks for exploration. An interactive structure supports the reflection and development of your relationship with self, community, and queerness.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class will be held in Kingscote 140. The first meeting of this class is during WEEK 2 of the quarter (NOT Week 1). If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.  This class has a $35 course fee.",
                "classId": "27233",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "1:30:00 PM",
                        "endTime": "2:50:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Floro, M.",
                                "sunet": "mfloro"
                            }
                        ],
                        "startTimestamp": 48600.0,
                        "endTimestamp": 53400.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223297",
        "number": "WELLNESS 140",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "141",
        "title": "Flourishing While BIPOC: Reclaiming our Ways of Wellness",
        "description": "This class will offer important life skills centering the needs, experiences and challenges of BIPOC students. Skills/topics covered may include communication and relationship skills, interviewing for jobs, self- and community-care, and cooking/meal planning. These topics will all be addressed through the lens of the particular needs and experiences of BIPOC students. Impact of systemic racism &amp; historical trauma will be integrated into the curriculum as well as connection with ancestors/community, cultural pride, and skills for resilience. In connection with this class, students will be offered opportunities and guidance/financial support to design their own projects to enhance the long-term flourishing of BIPOC students on campus.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "30314",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224063",
        "number": "WELLNESS 141",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "142",
        "title": "The Art of Grief",
        "description": "Learn the fundamentals of grief education. Explore artistic and cultural expressions of grief and psychological meaning-making after loss. Utilize readings from psychology, engage in class discussions, and explore a range of creative modalities across various cultures for grieving. Guest lectures from campus grief response leaders such as the Office for Religious and Spiritual Life, Well-Being, and Counseling and Psychological Services will assist in providing students with skills and knowledge for the expression and understanding of grief, both on individual and societal levels.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.",
                "classId": "29545",
                "currentClassSize": "0",
                "maxClassSize": "28",
                "schedules": [
                    {
                        "startTime": "4:30:00 PM",
                        "endTime": "5:50:00 PM",
                        "location": "Hewlett Teaching Center 102",
                        "instructors": [
                            {
                                "name": "Hsu, H.",
                                "sunet": "helenhsu"
                            }
                        ],
                        "startTimestamp": 59400.0,
                        "endTimestamp": 64200.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224535",
        "number": "WELLNESS 142",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "150",
        "title": "Introduction to Nutrition",
        "description": "Optimize nutrition for health and performance based on established and emerging research. Discern between popular trends and scientific understandings of healthy nutrition and nutritional habits. Topics include evidence-based analysis of macronutrients, fad diets, sugar addiction, low-calorie sweeteners, caloric restriction, disease prevention, and general nutrition with an emphasis on translating research into implementable, day-to-day dietary practices.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "29415",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "206912",
        "number": "WELLNESS 150",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "152",
        "title": "Mindfulness and Food",
        "description": "What is it like to savor life and build on a positive relationship with food? Explore how mindfulness practice and intuitive eating principles can bring awareness to factors that influence mind-body health and well-being. This experiential class covers topics ranging from inner and outer wisdom, self-assessment of hunger and satiety, critical thinking about food-related media messages, stress, and transitions as they influence eating habits. The art and science of mindful eating emphasizes translating theory and research into lifestyle practices.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "29444",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215850",
        "number": "WELLNESS 152",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "156",
        "title": "Science and History of Traditional Chinese Medicine",
        "description": "Traditional Chinese medicine (TCM) is a unique system for the diagnosis and treatment of disease, as well as for the cultivation of life-long health and well-being. This course introduces basic TCM theories, practices, and treatment methods including acupuncture, Taichi, herbal medicine, and dietary adjustment etc.  We will introduce the historical background and evolution of TCM. We will discuss the scientific exploration of TCM and how modern science shapes our understanding of East-West integrative health.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224905",
        "number": "WELLNESS 156",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "158",
        "title": "Lasting Letters and the Art of Deep Listening",
        "description": "This course is an interactive course focused on developing listening skills essential to health care providers.  Integrating &quot;See One, Do One, Teach One&quot; with practices from the arts and humanities, students will develop tools physicians find useful in daily practice including talking with patients and colleagues and interviewing skills.Students will complete the class with an enhanced sense of what it means to listen, the unique role that letters of lasting import play in the healing process, and ways in which both enhance one's daily and professional practice in the healing arts. Frish Brandt is a Letter Midwife working primarily in Palliative Care and hospice. Since 2015 she has written a wide range of letters with over 300 people.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224908",
        "number": "WELLNESS 158",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "160",
        "title": "Wellbeing Technology, Design, and Leadership",
        "description": "Wellbeing technologies come with tremendous potential and innate challenges. At their best these technologies can help humans heal, grow, and expand their minds. When used out of integrity, privacy can be breached, anxiety and hypervigilance increased, and humans reduced to data. The technology we build is a reflection of our personal capacity; we must develop as people while we design. This class includes sector briefings, mini design sprints, guest speakers and awareness-building activities, all with the intention for students to develop self-awareness, strengthen emerging leadership, and imagine transformative technology worth building.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "218619",
        "number": "WELLNESS 160",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "162",
        "title": "Digital Wellbeing: Healthy Relationships with Technology",
        "description": "We live in a brave new world where technology is integrated into almost every aspect of daily living, which has benefits and drawbacks. A creative approach to designing a mindful, healthy integration of technology with lifestyle can influence flourishing and well-being, as well as provide an avenue for creative self-expression, reflection, community sharing and collaboration. Explore how technology provides opportunities to optimize health, performance, relationships, and purpose. Review current research exploring how to effectively integrate social media, digital media, augmented and virtual reality, messaging, privacy, and personal/professional identity and branding in a way that supports overall life design and values. Design, experiment with, and implement a personalized plan for optimizing your day-to-day technology use with an intention for increasing connection, joy, and flourishing.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "30178",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222115",
        "number": "WELLNESS 162",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "163",
        "title": "Meditation and Technology",
        "description": "Challenge the traditional definition of meditation while examining and using the latest meditation technologies that amplify attention and awareness. Learn how these technologies can be integrated into existing practices or help support new meditators. Explore the range of tools, such as brain, heart, and breath sensing/feedback devices, and find what works best in one&iquest;s own practice. Move past traditional boundaries of meditation and experiment with new ways that wearables, apps, and other tech can support meditation practice both in formal sitting practice and day-to-day living in a hyper-connected world.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "218620",
        "number": "WELLNESS 163",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "164",
        "title": "Designing Wellbeing",
        "description": "Design processes and technologies that support wellbeing and human connection. Learn about research-based models of human flourishing, explore existing technologies, and interact with innovators and thought leaders in the field of transformative design and technology. Utilize empathy-driven discovery methods that deepen understanding of existing wellbeing problems and, in interdisciplinary project teams, generate and pitch concepts for next-generation tech solutions. Personal and interpersonal development is essential for designing transformative technologies and this viewpoint is foundational for this design journey.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "218988",
        "number": "WELLNESS 164",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "170",
        "title": "Laughter & Play for Wellbeing (LIFE 170, TAPS 170W)",
        "description": "Learn about and practice laughter yoga, combined with theater exercises. Laughter yoga (distinct from traditional movement-based yoga) is a modality that integrates laughter exercises with yogic breathing. Explore the growing field of research on laughter yoga and its positive effects on wellbeing and other health outcomes. Examine the various dimensions of laughter yoga as a form of cardiovascular and aerobic exercise, mindfulness, and play. Use theater exercises to leverage the power of performative, healing laughter and to cultivate embodied awareness, creativity, resilience, and joy. Readings and exercises will draw from the work of pioneers in the fields of laughter wellness and socially engaged theater, such as Madan Kataria and Augusto Boal.",
        "repeatable": "false",
        "grading": "Letter or Credit/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "29993",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [
            "WAY-CE"
        ],
        "objectID": "222194",
        "number": "WELLNESS 170",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "171",
        "title": "Laugh to Relax",
        "description": "Learn about and practice laughter yoga, a unique and playful modality that integrates laughter exercises with yogic breathing (this practice is distinct from traditional movement-based yoga). Explore the growing field of research on laughter yoga and its positive effects on wellbeing and other health outcomes. Examine the various dimensions of laughter yoga as a form of fitness, mindfulness, and play. Use a variety of meditation exercises to leverage the power of performative, healing laughter and to cultivate embodied awareness, creativity, resilience, and joy.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "30452",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "223874",
        "number": "WELLNESS 171",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "183",
        "title": "Financial Wellness for a Healthy, Long Life",
        "description": "This course will ground you in the knowledge, skills, and habits you need to identify and achieve your financial goals. We will infuse behavior science and psychology into our exploration of personal finance concepts (e.g., credit, debt, saving, and investing) to build your financial capability in the areas of managing money, planning ahead, making choices, and getting help. By the end of the quarter, you will have a personalized toolkit to create and refine actionable plans for increasing your financial well-being now and throughout your healthy, long life.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "The first meeting of this class is during WEEK 2 of the quarter (NOT Week 1). If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter. The university's Mind Over Money program covers all student course fees for this class.",
                "classId": "29546",
                "currentClassSize": "0",
                "maxClassSize": "60",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:20:00 PM",
                        "location": "Thornton 110",
                        "instructors": [
                            {
                                "name": "Amarillas, A.",
                                "sunet": "angelara"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 58800.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "221092",
        "number": "WELLNESS 183",
        "units": [
            1
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "191",
        "title": "Peer Education on Comprehensive Sexual Health",
        "description": "Presented by the Sexual Health Peer Resource Center (SHPRC) and the Weiland Health Initiative, this class is open to all interested in sex and sexual health and required of students planning to become counselors at the SHPRC. Course addresses sexual and reproductive anatomy, sexually transmitted infections, contraceptive methods, menstruation, pregnancy, abortion, gender identity, sexual orientation, sexual assault and abuse, consent and communication, societal stigmas and pressure, kink, toys, and pleasure. Students are equipped to make responsible decisions about their own sexual interactions and to advise others appropriately. Course includes lecture series feupdateaturing guest experts, in-person instruction, and discussion. Discussion, role-play, and peer-education outreach project support application of knowledge and development of counseling skills.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class meets in Kingscote 140 on Wednesdays from 3:30-5:30. If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.",
                "classId": "27769",
                "currentClassSize": "0",
                "maxClassSize": "22",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Floro, M.",
                                "sunet": "mfloro"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.",
                "classId": "26589",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:30:00 PM",
                        "endTime": "5:20:00 PM",
                        "location": null,
                        "instructors": [
                            {
                                "name": "Floro, M.",
                                "sunet": "mfloro"
                            }
                        ],
                        "startTimestamp": 55800.0,
                        "endTimestamp": 62400.0,
                        "days": "Wednesday"
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class meets in Kingscote 140 on Thursdays from 3-4:50pm. If you are on the waitlist, show up to the first class as you will likely get in. Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.",
                "classId": "25360",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "3:00:00 PM",
                        "endTime": "4:50:00 PM",
                        "location": "200-030",
                        "instructors": [
                            {
                                "name": "Floro, M.",
                                "sunet": "mfloro"
                            }
                        ],
                        "startTimestamp": 54000.0,
                        "endTimestamp": 60600.0,
                        "days": "Thursday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "222096",
        "number": "WELLNESS 191",
        "units": [
            1,
            2
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "192",
        "title": "Peer Support: Creating Spaces for Healing and Growth (LEAD 121)",
        "description": "Social support is an integral part of the human experience and a core pillar of human well-being. Explore ways you can be an effective source of support for your peers, using models, skills, and practices rooted in positive psychology, leadership studies and peer coaching. Conceived as a two part process, going inward and engaging outward, you will examine your well-being so you can offer support to others. Through coaching your peers you will help them discover their values, develop meaningful goals, and take steps towards building the life they want. Develop the skills, knowledge, and mindsets needed to be present with your peers when they struggle, feel stuck, and need your support. Cultivate the confidence and abilities needed to be a community leader, well-being champion, and role model for balanced, whole-hearted living at Stanford and beyond. Highly interactive course employs creative expression, group, pair,  and individual work, discussions, lectures, and self-guided reflections to support your own well-being and build your capacity to help others enhance theirs.",
        "repeatable": "false",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "30316",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224064",
        "number": "WELLNESS 192",
        "units": [
            1,
            2
        ],
        "totalSections": 1
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "198",
        "title": "Directed Reading and Individual Studies - Wellness",
        "description": "Translate theoretical knowledge and acquired skills into actionable wellness projects that enhance an aspect of wellness within the Stanford community. Students work in collaborative groups or individually under the mentorship of the course instructor(s) to design, deliver, and evaluate a wellness initiative at Stanford.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "INS",
                "notes": "This class has a $10 course fee.",
                "classId": "29761",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "INS",
                "notes": "This class has a $10 course fee.",
                "classId": "29445",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "02",
                "component": "INS",
                "notes": "This course needs instructor permission. Students need to contact the instructor to set-up an individual studies project, schedule, and obtain a permission code.  This class has a $10 course fee.",
                "classId": "25162",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Meyer Tapia, S.",
                                "sunet": "skmeyer1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "02",
                "component": "INS",
                "notes": "This course needs instructor permission. Students need to contact the instructor to set-up an individual studies project, schedule, and obtain a permission code.  This class has a $10 course fee.",
                "classId": "26517",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Meyer Tapia, S.",
                                "sunet": "skmeyer1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "03",
                "component": "INS",
                "notes": "The first meeting of this class is during WEEK 2 of the quarter (NOT week 1).  Also, if this course is full, you may be interested in other similar WELLNESS classes offered this quarter.  This class has a $10 course fee.",
                "classId": "26473",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Meyer Tapia, S.",
                                "sunet": "skmeyer1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "03",
                "component": "INS",
                "notes": "This course needs instructor permission. Students need to contact the instructor to set-up an individual studies project, schedule, and obtain a permission code.  This class has a $10 course fee.",
                "classId": "26001",
                "currentClassSize": "0",
                "maxClassSize": "50",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fogg, B.",
                                "sunet": "bjfogg"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "03",
                "component": "INS",
                "notes": "This course needs instructor permission. Students need to contact the instructor to set-up an individual studies project, schedule, and obtain a permission code.  This class has a $10 course fee.",
                "classId": "27590",
                "currentClassSize": "0",
                "maxClassSize": "24",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fogg, B.",
                                "sunet": "bjfogg"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "04",
                "component": "INS",
                "notes": "This class has a $10 course fee.",
                "classId": "27234",
                "currentClassSize": "0",
                "maxClassSize": "16",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fogg, B.",
                                "sunet": "bjfogg"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "215867",
        "number": "WELLNESS 198",
        "units": [
            1,
            2
        ],
        "totalSections": 8
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "199",
        "title": "Selected Topics: Wellness",
        "description": "Exploration of a topic (to be determined) not covered by the standard curriculum but of interest to faculty and students in a particular quarter. May be repeated with change of content. For more information regarding specific course titles and topics, please refer to the notes of each course section.",
        "repeatable": "true",
        "grading": "Satisfactory/No Credit",
        "unitsMin": "1",
        "unitsMax": "2",
        "sections": [
            {
                "term": "2023-2024 Autumn",
                "termId": "1242",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This course needs instructor permission. Students need to contact the instructor to obtain a permission code.",
                "classId": "25194",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Meyer Tapia, S.",
                                "sunet": "skmeyer1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "26782",
                "currentClassSize": "0",
                "maxClassSize": "999",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Meyer Tapia, S.",
                                "sunet": "skmeyer1"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            },
            {
                "term": "2023-2024 Spring",
                "termId": "1246",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": "This class has a $35 course fee.",
                "classId": "26474",
                "currentClassSize": "0",
                "maxClassSize": "15",
                "schedules": [
                    {
                        "startTime": null,
                        "endTime": null,
                        "location": null,
                        "instructors": [
                            {
                                "name": "Fogg, B.",
                                "sunet": "bjfogg"
                            }
                        ],
                        "startTimestamp": 0,
                        "endTimestamp": 0,
                        "days": null
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "218772",
        "number": "WELLNESS 199",
        "units": [
            1,
            2
        ],
        "totalSections": 3
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "256",
        "title": "Lasting Letters and the Art of Deep Listening",
        "description": "This course is an interactive course focused on developing listening skills essential to health care providers.  Integrating &quot;See One, Do One, Teach One&quot; with practices from the arts and humanities, students will develop tools physicians find useful in daily practice including talking with patients and colleagues and interviewing skills. Students will complete the class with an enhanced sense of what it means to listen, the unique role that letters of lasting import play in the healing process, and ways in which both enhance one's daily and professional practice in the healing arts. Frish Brandt is a Letter Midwife working primarily in Palliative Care and hospice. Since 2015 she has written a wide range of letters with over 300 people.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [],
        "gers": [],
        "objectID": "224886",
        "number": "WELLNESS 256",
        "units": [
            1
        ]
    },
    {
        "year": "2023-2024",
        "subject": "WELLNESS",
        "code": "256",
        "title": "Lasting Letters and the Art of Deep Listening (MED 256)",
        "description": "This course is an interactive course focused on developing listening skills essential to health care providers. Integrating 'See One, Do One, Teach One' with practices from the arts and humanities, students will develop tools physicians find useful in daily practice including talking with patients and colleagues and interviewing skills. Students will complete the class with an enhanced sense of what it means to listen, the unique role that letters of lasting import play in the healing process, and ways in which both enhance one's daily and professional practice in the healing arts. Frish Brandt is a Letter Midwife working primarily in Palliative Care and hospice. Since 2015 she has written a wide range of letters with over 300 people.",
        "repeatable": "false",
        "grading": "Medical Option (Med-Ltr-CR/NC)",
        "unitsMin": "1",
        "unitsMax": "1",
        "sections": [
            {
                "term": "2023-2024 Winter",
                "termId": "1244",
                "sectionNumber": "01",
                "component": "SEM",
                "notes": null,
                "classId": "31492",
                "currentClassSize": "0",
                "maxClassSize": "18",
                "schedules": [
                    {
                        "startTime": "12:30:00 PM",
                        "endTime": "1:20:00 PM",
                        "location": "Li Ka Shing Center, rms205/206",
                        "instructors": [
                            {
                                "name": "Lin, B.",
                                "sunet": "bylin"
                            },
                            {
                                "name": "Brandt, F.",
                                "sunet": "frish"
                            }
                        ],
                        "startTimestamp": 45000.0,
                        "endTimestamp": 48000.0,
                        "days": "Wednesday"
                    }
                ]
            }
        ],
        "gers": [],
        "objectID": "224858",
        "number": "WELLNESS 256",
        "units": [
            1
        ],
        "totalSections": 1
    }
]